{"url":"https://www.work180.com.au/blog/2015/07/6-tips-for-succeeding-in-male-dominated-industries","title":" 6 tips for succeeding in male dominated industries","author":"WORK180","body":"\n\t\t\t\t\t<p>Reposted from <a href=\"http://www.steelheels.com.au/6-tips-for-succeeding-in-male-dominated-industries-plus-the-power-of-mentoring/\" target=\"_blank\">Steel Heels&#x2019; blog</a> with Sharon&#x2019;s permission.</p>\n\n<p>&#xA0;</p>\n\n<p>Are you a female currently working in a male dominated industry who is looking for ways to get ahead or stand out from the crowd? We know it can be tough and we know our readers are seeking articles on mentoring and advice on how to succeed in the workplace so we thought we&#x2019;d go straight to the top to get the best advice.</p>\n\n<p>Sharon Warburton has been smashing glass ceilings in the two sectors with the lowest female participation rates (construction &amp; mining) for more than 20 years.&#xA0; She is currently a CFO, a strategist, a Non-Executive Director and a Not ForProfit Director.&#xA0; She contributes her successes to hard work, cross cultural experience, great mentors and a powerful sponsor.&#xA0; She mentors many and is the founder of the online mentoring site www.steelheels.com.au (@Steel__Heels).</p>\n\n<p>Sharon says there are 6 things everyone woman should strive for to become successful in their industry, and she has made them all C words to make them easy to remember. She says:</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. Confidence</strong></p>\n\n<p>Firstly, and in my opinion most importantly, Confidence.</p>\n\n<p>We have to focus on increasing the self-confidence of women in the workplace. The literature says young girls graduate from high school full of confidence. Give them a few years of working in a male dominated environment and my experience is most of that self-confidence has evaporated. I encourage you, regardless of your role, to support the creation of mentors for women from the first day they enter the organisation.</p>\n\n<p>If a mentor does nothing other than halt the evaporation of self-confidence then I believe you will see more women emerge through the ranks. I mentor a number of both men and women. Generally those women have issues with confidence. They are wary of setting goals high and question themselves at every turn. The males on the other hand are brimming confidence and want to formulate strategies to make their big dreams a reality.</p>\n\n<p>Generally those women have issues with confidence. They are wary of setting goals high and question themselves at every turn.</p>\n\n<p>I suspect many of you are familiar with the case studies that suggest that if a male can do 10 % of a job description they&#x2019;ll apply, whereas if a woman can&#x2019;t do at least 90 percent they won&#x2019;t. Imagine if all the women who do this had the support of a mentor to help give them that confidence boost they need to &#x2018;have a go&#x2019;&#x2026;.</p>\n\n<p>You might be wondering what Steel Heels is all about and why I have created such a community. This is my personal commitment to increasing the self-confidence of working women. I encourage you to check out www.steelheels.com.au if you have not already done so.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Courage</strong></p>\n\n<p>My second tip is be courageous. To quote Sheryl Sandberg:</p>\n\n<p>&#x201C;Have the courage to lean in and take a seat at the table.&#x201D;</p>\n\n<p>All very well, but what does this really mean? Well it means you need to have the courage to take risks and have a go. And the courage to speak up and be heard. My view is that when it comes to their careers, women are risk averse and in male dominated industries where it&#x2019;s likely there are no female role models, this issue is magnified. Take it from a Chartered Accountant turned Strategist&#x2026; take on a role outside of your area of technical expertise or comfort zone and if you need to, be the ground breaker. So what if you think you can&#x2019;t do 90% &#x2013; back yourself to learn the rest on the job. I had the courage to take risks, and I encourage you to do the same, particularly early on in your career.</p>\n\n<p>Courage is most important when something is not right. If you&#x2019;re stuck in a toxic or negative work environment it takes courage to get out. But the sooner you find this courage, the sooner you&#x2019;ll find a place in a more positive, engaging environment. That is where I was when I was in the UAE. I made the move to make change and haven&#x2019;t looked back since.</p>\n\n<p>A mentor recently rang me in an anxious state because she was being asked to falsify an environmental report. I didn&#x2019;t tell her what to do, she knew what she had to do about it but she needed support to find the courage to do so. Mentoring is invaluable in helping women dig deep to find the courage needed in tough situations.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Commitment</strong></p>\n\n<p>Like buying a puppy you are either in or out. There is no such thing as in between. If I gave up the first time a male colleague berated me or made me feel unwelcome, I would not be speaking to you today. On the face of it, I have shown I was thick skinned when often I have felt totally vulnerable. I&#x2019;ve had to remind myself not to sweat the small stuff and to remained focus on the broader goal.</p>\n\n<p>But commitment is not just about being resilient and giving it a go. It&#x2019;s also about committing to making our industries and workplaces better. About chipping away at the behaviours and practices, which are less than ideal. Rome was not built in a day and the crusty old builders and miners aren&#x2019;t going to change their entrenched behaviours or workplace cultures overnight, but we have come a long way and can continue to celebrate further improvements.</p>\n\n<p>But commitment is not just about being resilient and giving it a go. It&#x2019;s also about committing to making our industries and workplaces better. About chipping away at the behaviours and practices, which are less than ideal.</p>\n\n<p>Having a mentor when you are in this environment is invaluable. They can encourage you to take the time to adjust, not to lose sight of your long term plan and goals and not to throw in the towel when change in not happening at the pace you perhaps first think it should.</p>\n\n<p>I am watching (and supporting where I can) an amazing example of this at the moment. I met a lady who did it tough in her community for many years. She then decided to join up to a VTEC program with an aim to getting a job on the mines. And she succeeded. Now she is trying to make the transition from operator to supervisor and finding it hard. But she is not giving up. She is showing great commitment by reaching out for support and having another crack at moving to the next level. And she is grateful for people who are taking time out of busy schedules to offer support and encouragement. Imagine if all the women in our workplace felt they had this level of support to continue to commit when their short term outlook is hard.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. &#x2018;Can do&#x2019; attitude</strong></p>\n\n<p>When you focus on the positive, opportunities will reveal themselves. As I said before women question themselves at every turn. Their first response is often &#x201C;I can&#x2019;t&#x201D; &#x201C;I don&#x2019;t&#x201D; . We need to adjust this negative mindset and our vocabulary. To view new challenges, roles or volunteering as an opportunities to expand our experiences.</p>\n\n<p>Mentors influence positive mindsets. They can encourage their mentees to give themselves licence to try new things. And to be the person who volunteers to give something new a go. It would have been so easy for me to say no when I was contacted about the FMG Non Executive Director role some 2 years ago now. It was not great timing &#x2013; my daughter was only 3. My plan had been to wait until she was well settled in junior school before I began my transition to board roles.</p>\n\n<p>My experience is that opportunities rarely, if ever, arise when you want them too. My attitude is to believe you &#x2018;can do&#x2019; them then focus on working out the how. I accepted the FMG role in addition to my Exec role at BM and I have continued to maintain a very healthy &#x2018;work / life balance&#x2019;. Because I believed I could.</p>\n\n<p>Shifting mindset and encouraging positivity are areas I often hear myself talking to mentees about. And it is amazing to share in their energy when they get into top gear. The positivity is infectious and for this reason alone I encourage all the leaders in this room today to do some mentoring.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5. Communication</strong></p>\n\n<p>A problem shared is a problem solved&#x2026;..</p>\n\n<p>Far too often I hear young women have resigned from the business. In addition to HR undertaking exit interviews I attempt to seek out these ladies and have a chat. More often than not they have been bottling up a raft of issues&#x2026;.. keeping them all to themselves. Then one day they wake up and determine it is just all too hard. So they go and find another job (usually in some project management firm in a desk based role) and resign.</p>\n\n<p>Upon resigning they open up and tell me what has been bothering them. It&#x2019;s rare that any of the concerns they raise couldn&#x2019;t have been fixed earlier but often it&#x2019;s a case of too little too late. I find it frustrating that still we find a culture in today&#x2019;s male dominated industries where young women feel they have no-one to talk to.</p>\n\n<p>I mentioned earlier than I support the identification of a mentor for women from day one of their careers. This would help encourage more open communication and enable us as leaders to address the concerns of today. To the women here today I encourage you to find someone in your organisation you can talk to about your concerns, fears and frustrations. If you can&#x2019;t identify someone within your organisation then find someone externally.</p>\n\n<p>To leaders focus on creating an environment where any member of your team, regardless of seniority, feel they can approach you. We hear about &#x2018;open door policies&#x2019; all the time but do we actually do it or just talk about it?</p>\n\n<p>You don&#x2019;t want me to start on the gender pay gap, but I will say this. There are so many things that employers, especially in WA, should be doing to eliminate this gap. However females need to take the lead too by finding their voice (and again some courage) to say what you are worth and asking for that pay rise. Negotiate hard and if you are feeling nervous, get support from your mentor.</p>\n\n<p>There are so many things that employers, especially in WA, should be doing to eliminate this [gender pay] gap. However females need to take the lead too by finding their voice (and again some courage) to say what you are worth and asking for that pay rise.</p>\n\n<p>I appreciate that speaking up is not always easy in a room full of male builders or miners. But mentors can provide tips on how to speak up, how to not be afraid to ask questions and to share what has worked best for them. I often take internal mentees with me to some meetings so they can see how I lean in. For one of my more introverted female mentees support in this area has been invaluable and she has found her voice and is kicking goals as a result.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>6. Creativity</strong></p>\n\n<p>My final tip is be creative. Invest in yourself and make your own luck. As I have already said it is very likely in today&#x2019;s male dominated industries that you won&#x2019;t have female role models in the jobs you aspire to do in the short to medium term. But I always viewed this as an opportunity. And there remains lots of great opportunities for talented driven women.</p>\n\n<p>I encourage my mentees to identify roles that interest them within their organisations and to pursue them. And if nothing appeals, to create a role. Many years ago I was offered a role in another company not long after joining Multiplex. I joined Multiplex in an accounting role and I was bored with accounting. So I met with my boss and said I wanted to move out of accounting, saw an area of opportunity and put a role description on the table for what I wanted to do.</p>\n\n<p>Essentially I created a new role supporting the Deputy CEO. I called it General Manager &#x2013; Operations Support, Mergers &amp; Acquisitions. Notwithstanding that I had a fallback position of an interesting role with another company I was committed to the business so I took the risk, adopted some creative thinking and put forward what I really wanted. The rest is history &#x2013; that was the start of a successful career in strategy.</p>\n\n<p>So there are my six tips &#x2013; confidence, courage, commitment, &#x2018;can do&#x2019;, communication and creativity.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>About Sharon Warburton</strong></p>\n\n<p>Graduating as an Accountant, Sharon Warburton was the first person in her extended family to complete university. From early in her career she has thrived in cross-cultural leadership roles in multinational corporates despite feeling like, and more often than not, being one of the only females. Sharon has been smashing glass ceilings for many years now. Today, Sharon works for a leading global construction company as Executive Director Strategy and Finance.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/07","associated_company":"work180"}