{"url":"https://www.work180.com.au/blog/2018/07/7-signs-its-time-to-look-for-a-new-job","title":" 7 Signs It's Time To Look for a New Job","author":"WORK180","body":"\n\t\t\t\t\t<p>What was it you wanted to be when you grew up? And now that you have grown up, has that dream changed at all?</p><p>Whether you are in the career you had always hoped for, or you see your current position as a stepping stone to other things, there can often come a point where you realise it&#x2019;s time for a change.</p><p>If you&#x2019;re not content in your current position, rest assured that you&#x2019;re not alone. <u><a data-cke-saved-href=\"https://www.convergeinternational.com.au/docs/default-source/research/a-future-that-works-2016-snapshot-of-the-australian-workplace\" href=\"https://www.convergeinternational.com.au/docs/default-source/research/a-future-that-works-2016-snapshot-of-the-australian-workplace\">72% of Australians surveyed in 2016</a></u> said that they search for meaning and purpose through their work. It&#x2019;s something we all deal with, yet we ignore it far too often. That needs to change.</p><p>And don&#x2019;t feel strange if you&#x2019;re succeeding in a high-flying and lucrative role but still find that these signs resonate with you. Money isn&#x2019;t everything. At the end of the day, your health and happiness come first, and no salary is worth being miserable.</p><p>So if any of the following points sound familiar to you, then it&#x2019;s time to reevaluate your situation and start looking for a position that will make you happier.</p><h2>1. No Room for Growth</h2><p>The classic sign that it&#x2019;s time for a change of career is stagnation. Whether there are no positions above yours that are likely to become available in the foreseeable future, or you simply don&#x2019;t fancy the jobs above yours, it can be tremendously dissatisfying to feel like there is nowhere to progress within your role.</p><p>In other cases, you may be hoping for that chance to move up the ladder, but others keep getting promoted past you. This can be frustrating, demoralizing, and generally discouraging, none of which are conducive to a happy working environment.</p><p>Despite <u><a data-cke-saved-href=\"https://www.huffingtonpost.com.au/2016/03/22/hate-my-job_n_9519688.html\" href=\"https://www.huffingtonpost.com.au/2016/03/22/hate-my-job_n_9519688.html\">under half of Australians being happy with their jobs</a></u>, only a small percentage of them are making an active effort to look elsewhere. Being overly pessimistic is a common problem, but you can buck that trend.</p><p>Start looking for similar jobs elsewhere that provide opportunities for advancement. Alternatively, think about how your skill-set could be applied elsewhere. Could you provide consultancy services for your industry?</p><p>Perhaps you could even establish your own business, where you set your own standards for progression, and make use of the skills you are most keen to develop.</p><h2>2. Boredom</h2><p>However much you may have enjoyed your job to begin with, it can easily become monotonous, especially when you excel at what you do. Don&#x2019;t be fooled into thinking that boredom at work is acceptable; of course, <u><a data-cke-saved-href=\"https://www2.staffingindustry.com/row/Editorial/Daily-News/Australia-Employees-spend-an-average-of-six-hours-a-week-bored-at-work-study-finds-45175\" href=\"https://www2.staffingindustry.com/row/Editorial/Daily-News/Australia-Employees-spend-an-average-of-six-hours-a-week-bored-at-work-study-finds-45175\">it&#x2019;s bound to happen once in a while</a></u>, but if every day is an unbearable grind, then it&#x2019;s definitely time for a change.</p><p>You&#x2019;re clearly someone who enjoys a challenge, so why not try something completely new and different? This could even be done in your spare time if you are the sort of driven individual who likes to make the most of every waking hour.</p><p>Why not set up a website and begin creating content around something you are truly passionate about? Not only can you then monetize your efforts and move towards generating a stable income from your new venture, but you will be expending your energy on something that has worth and meaning to you.</p><p>If setting up a website sounds like too much hassle, you can always buy an existing website or online business that&#x2019;s already up-and-running through online marketplaces like <u><a data-cke-saved-href=\"https://exchange.shopify.com/\" href=\"https://exchange.shopify.com/\">Exchange</a></u> or <u><a data-cke-saved-href=\"https://marcoschwartz.com/buying-profitable-website-empire-flippers/\" href=\"https://marcoschwartz.com/buying-profitable-website-empire-flippers/\">Empire Flippers</a></u>.</p><h2>3. Unhappiness</h2><p>All too often, unhappiness at work is simply brushed off as stress, as if it were normal and acceptable to feel that way. Well, it&#x2019;s not. If the thought of work the next morning fills you with dread, or you reach the end of each day feeling more strung out than the day before, then something has to give.</p><p>Not only does it feel awful to be unhappy at work, but<u><a data-cke-saved-href=\"http://www.news.com.au/finance/work/at-work/australias-deadly-workplace-crisis/news-story/cbca12299b34930b22c7b69f7583b576\" href=\"http://www.news.com.au/finance/work/at-work/australias-deadly-workplace-crisis/news-story/cbca12299b34930b22c7b69f7583b576\"> it can severely impact your overall health and wellbeing</a></u>. The more emotional stress you are under, the harder it is for your body to recover from fatigue, repair injuries, and even fight off infections.</p><p>Plus, low mood even impacts your productivity, creating a vicious circle in which you become less able to fulfill your job role due to the stress and unhappiness caused by that same role.</p><p>Stop to examine exactly what makes you feel that way at work. Then consider what would make you happy. Perhaps it&#x2019;s time to explore a career in another industry or start working with different people.</p><h2>4. Impact on your Personal Life</h2><p>The natural progression from boredom and unhappiness is that it begins to bleed through to your personal life. Not only can it be <u><a data-cke-saved-href=\"http://aib.edu.au/blog/balance-wellbeing/work-life-balance-is-important/?\" href=\"http://aib.edu.au/blog/balance-wellbeing/work-life-balance-is-important/?\">harmful to your health</a></u>, but it can also cause you to be less patient with friends and family.</p><p>Alternatively, even if loved ones are understanding, or you keep your feelings in check, you can find yourself drifting apart from the people you care about simply due to the demands of your job.</p><p>It might be your crazy schedule, or just that you feel too run-down between shifts to be sociable. Whatever the case, you should take a step back and consider your options.</p><p>Speak to your friends about it, and see if any of them are in a similar position. This could be your chance to try out that business venture you chatted about in high school. Even if you don&#x2019;t decide to go for it, the very act of planning and discussing such a project can be extremely therapeutic.</p><h2>5. No Sense of Value</h2><p>You deserve to feel appreciated at work, whether that comes in the form of advancement in your career, or simply positive feedback. There&#x2019;s nothing more discouraging than working diligently only to be continuously presented with the next batch of tasks, with no word of thanks in-between.</p><p>Alternatively, you may find that you receive no constructive feedback on your work, whether positive or otherwise. This can hamper your potential for development, and make you feel like you&#x2019;re just treading water.</p><p><u><a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/12/career-transition\" href=\"https://www.dccjobs.com/blog/2017/12/career-transition\">Starting a new career</a></u> is a great way to reassert yourself as a successful and driven individual with positive aspirations for the future. This can be done within a new employment framework, or even as a solo endeavor.</p><h2>6. Loss of Passion for the Company</h2><p>Company values can change with time, or may simply not be clear when you are first recruited. If you are starting to feel like you no longer share the vision and values of your employer, then you will soon begin to struggle to give your role 100 percent.</p><p>Turn this feeling into something positive and consider how you could apply it to a new career. For example, you might fit in perfectly as a recruiter or a career development advisor, helping ambitious employment candidates find the right path for them.</p><p>Your own experiences will enable you to provide invaluable advice not only on the skills and qualities they may require, but also the things they should find out about potential employers in order to ensure the company is a good fit for them.</p><h2>7. Your Aspirations Lie Elsewhere</h2><p>The final sign is maybe the most obvious, but also the hardest to simply give in to. If you have a dream to do something completely different, and that dream keeps nagging at you even when you are relatively satisfied in your work, then you have to at least give it some thought.</p><p>This applies <u><a data-cke-saved-href=\"http://www.abc.net.au/news/2017-08-06/changing-careers-in-your-40s-and-50s-people-share-stories/8766584\" href=\"http://www.abc.net.au/news/2017-08-06/changing-careers-in-your-40s-and-50s-people-share-stories/8766584\">no matter how old you are</a></u> or what your circumstances may be. You might have a harder journey than others, but you can still get where you want to go.</p><p>Now, you&#x2019;re a smart, sensible, hard-working person, so you already know you won&#x2019;t do something as rash as throwing in the towel without a plan. However, those same qualities are exactly what you need to succeed at such a daring venture.</p><p>So set aside some time to <u><a data-cke-saved-href=\"https://www.business.gov.au/info/plan-and-start/develop-your-business-plans/writing-a-business-plan/how-to-write-a-business-plan\" href=\"https://www.business.gov.au/info/plan-and-start/develop-your-business-plans/writing-a-business-plan/how-to-write-a-business-plan\">draft a business plan</a></u>, and explore the viability of your passion project. You might just surprise yourself.<br></p><p><em><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c17ca569-8d95-4075-a5bc-09f9e30b7bff.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c17ca569-8d95-4075-a5bc-09f9e30b7bff.jpeg\" style=\"margin: 10px;\"></em><br></p><p><em>Credit: <u><a data-cke-saved-href=\"https://pixabay.com/en/joy-freedom-release-happy-2483926/\" href=\"https://pixabay.com/en/joy-freedom-release-happy-2483926/\">Pixabay</a></u></em></p><p>Always remember, you&#x2019;re working to live, not living to work, and it is important to pursue your passions wherever possible. While the dream job may not always be immediately available, if you are unhappy where you are, it&#x2019;s time to start thinking about a change.</p><p>You can also use this opportunity to consider undergoing training in a field you are interested in, or even laying the groundwork for your own business. Some of the initial preparations can be done alongside your existing career, so you don&#x2019;t need to jump in the deep end without being sure how to stay afloat.</p><p>Finally, if you are unhappy at work, it&#x2019;s often worth talking it through with <u><a data-cke-saved-href=\"https://www.australia.gov.au/information-and-services/jobs-and-workplace\" href=\"https://www.australia.gov.au/information-and-services/jobs-and-workplace\">HR</a></u> or your superiors so everyone is on the same page. You never know, they may be able to suggest a suitable adjustment to your job role, or discuss training and career development which may suit your needs.</p><p><strong>Whatever you decide to do, if you are pursuing your own best interests, you will be giving yourself the best possible chance of success. While positivity and determination can&#x2019;t work miracles, they can definitely fortify you against the challenges ahead and help you excel within your chosen field.</strong></p><hr><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5ea68bef-ced2-43b1-a256-c68d6faf15ef.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5ea68bef-ced2-43b1-a256-c68d6faf15ef.jpeg\" style=\"font-size: 16px; float: right; margin: 10px; width: 100px; height: 100px;\"></strong><h4><strong>About</strong><strong> the Author</strong><br></h4><p>Victoria Greene is a writer and brand consultant who writes for Victoria Ecommerce. Here, she dedicates her content to those looking to build their careers on their own terms.&#xA0;</p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["job seeking tips","Career Development"],"upload_date":"2018/07","associated_companies":["work180"]}