{"url":"https://www.work180.com.au/blog/2016/03/7-steps-to-building-courage-for-personal-and-professional-success","title":" 7 Steps to Building Courage for Personal and Professional Success","author":"WORK180","body":"\n\t\t\t\t\t<p>Fear is an emotion that often gets a bad rap.&#xA0; The truth is that without it, sabre tooth tigers would have eaten our cave dwelling ancestors long ago. &#xA0;While we no longer face daily threats to our physical survival, the culture we live in thrives on fear mongering, which often makes us feel and act as though we do. &#xA0;And so the challenge we face in today&#x2019;s modern world is to discern between the fears that are serving us and those that are holding us back.</p>\n\n<p>That takes courage.&#xA0;</p>\n\n<p>Of course being courageous isn&#x2019;t about pretending that bad things don&#x2019;t happen or that real risks are all in our head. It <em>is</em> about choosing to lay our vulnerability on the line for something greater than our pride; risking failure and rejection in order to pursue our greatest aspirations and create more truthful and meaningful lives.</p>\n\n<p>It begins by getting clear about what it is that you <em>most</em> want &#x2013; in your work or business, relationships and life &#x2013; and then identifying fears that may inadvertently be holding you back from having it.&#xA0;&#xA0; Here are seven steps to get you started and into action on a daily basis. After all, courage is a habit &#x2013; the more often you practice it, the stronger it gets.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. GET CLEAR ABOUT WHAT YOU REALLY WANT</strong></p>\n\n<p>Michelangelo once said, The greater danger for most of us lies not in setting our aim too high and falling short; but in setting our aim too low, and achieving our mark.&#x201D; However most of us are too afraid to dream big because as soon as we do, it creates a large crevasse between where we presently are and where we&#x2019;d like to be.&#xA0;</p>\n\n<p>So beginning where you are, identify an area(s) of your life in which you feel a clear level of dissatisfaction or unhappiness. What would you need to do differently in order to feel a deep sense of purpose and satisfaction? Don&#x2019;t get stuck on the external stuff like &#x201C;I want a top job, big house, or gorgeous girl/guy by my side.&#x201D; &#xA0;Rather focus on the feeling that you think these things would give you, i.e., &#x201C;I want a job that is both challenging and rewarding. I want a relationship with a self-assured person who I love hanging out with.&#x201D;&#xA0; Get the drill?</p>\n\n<p>Unless you get clear about what you really want &#x2013; in your career, relationships, health and wellbeing, and life &#x2013; you&#x2019;ll have little chance of actually getting it. Dare to dream big.</p>\n\n<p><em>ACTION: </em><em>Write down a specific goal you would like to achieve in the next 6-12 months. If you want to use a different time frame, go right ahead! All that matters is that your goal inspires you deeply (even if it also scares you!)</em></p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. IDENTIFY YOUR DEEPEST FEAR</strong></p>\n\n<p>Fear is not a &#x2018;bad&#x2019; thing. Far from it! Rather, it&#x2019;s a question of whether or not your fears are actually serving you (protecting you from REAL threats to your wellbeing) or if they are holding you back and keeping you stuck, tip toeing through life and living, as Thoreau described, a &#x201C;life of quiet desperation.&#x201D; So what is it that you are afraid might happen if you begin taking action in the direction of your goals and dreams? That you will be humiliated, that you&#x2019;ll go broke, be rejected or &#x2018;found out&#x2019; as inadequate? Whatever your fear, own it. Unless you own your fears, they will own you. The only way to conquer our fear is to look it right in the eye and then step forward in its presence.</p>\n\n<p><em>ACTION: Write down what you are afraid might happen if you take action toward your goal. </em></p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. BE HONEST ABOUT THE COST OF INACTION.&#xA0;</strong></p>\n\n<p>Don&#x2019;t kid yourself, inaction and choosing to do nothing, is costly.&#xA0; Research has identified a psychological phenomenon whereby we human beings tend toward discounting the cost of our choices, even when it&#x2019;s obvious they are not benefiting us. The reason why? Reality isn&#x2019;t pretty. The result? We tell ourselves that everything&#x2019;s hunky dory when really, it&#x2019;s anything but, and all the while life sails along in a direction that&#x2019;s taking us far from the life we&#x2019;d truly love to live. The very act of acknowledging that we are stuck or unhappy is an act of courage all its own, but getting present to the steep price you are paying for letting fear and doubt run your life (or even part of it!) is absolutely crucial to re-creating it the way you want it to be. Only when you have done so can you find the guts to put your fears in their rightful place and be able to rise above them and into action toward whatever tugs at your heart.</p>\n\n<p><em>ACTION: </em><em>Write down how you will feel about yourself if you do nothing. Remember, if nothing changes, nothing changes!</em></p>\n\n<p>&#xA0;</p>\n\n<p><strong>4.&#xA0;&#xA0;&#xA0;&#xA0; BREAK YOUR BIG VISION INTO SMALL STEPS</strong></p>\n\n<p>To paraphrase Martin Luther King, Jr., you don&#x2019;t have to see the whole staircase, just the first step. So when it comes to doing something that leaves a wide cavernous gap between where you are now and where you ultimately want to be, don&#x2019;t think that you need to know how to bridge it before you take the first step forward.</p>\n\n<p>What matters most is knowing the direction in which you want to head, even if you aren&#x2019;t clear on a specific end-point destination. Once you know the direction, then think about what you would like to be doing 12 months from now that would move you toward it. Then think about what you&#x2019;d be doing six months from now. Then two &#xA0;months from now. Then two weeks from now. Then tomorrow.&#xA0; Then today.</p>\n\n<p><em>ACTION: </em><em>Write down ten things you can do in the next seven days to move you into action. Repeat weekly!</em></p>\n\n<p>&#xA0;</p>\n\n<p><strong>5. CREATE ACCOUNTABILITY</strong></p>\n\n<p>Enlist a support team, hire a coach, recruit an accountability partner or join a group of like-minded people. Just make sure you have people around you who are committed to you, &#xA0;and are willing to get on your case if you start to veer off the rails and slip&#xA0; into excuse-laden procrastination.</p>\n\n<p><em>ACTION: </em><em>Ask at least one person to hold you to account for the 10 things you wrote down above, and set up a weekly call-in with them to keep you on track.</em></p>\n\n<p>&#xA0;</p>\n\n<p><strong>6. WALK WITH GIANTS</strong></p>\n\n<p>The people you surround yourself with have a huge impact on how you see yourself, your challenges and the world.&#xA0; If you want to live a bigger life, you need to surround yourself with people who &#x2018;think big&#x2019; and will encourage you to do the same.&#xA0; Accordingly, you&#x2019;ll want to avoid any people in your life who may discourage your actions and step on your dreams.&#xA0; While they are really just afraid that you will leave them behind, as you start out, you should steer clear of people who will fuel anxiety and feed self-doubt. &#xA0;Never let anyone diminish you or your dreams.</p>\n\n<p><em>ACTION: Research networks, associations and communities of like-minded people whom you could join for education, collaboration, and encouragement.</em>&#xA0;&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>7. TRAIN THE BRAVE DAILY</strong></p>\n\n<p>Courage is like a muscle. The more you act with it, the stronger it becomes. Likewise, every time you take action in the presence of your fear, you dilute its power and amplify your own.</p>\n\n<p>But let&#x2019;s face it, creating change in your life is a little like getting a 747 off the ground&#x2026; it takes a lot of energy up front to build forward momentum and get you airborne. Expecting that it&#x2019;s going to be easy from the get go can set you up for disappointment. Instead of expecting to see immediate results, focus instead on the fact that you are simply in action and every day, doing one thing that takes you out of your comfort zone, and moving in the direction that inspires you.</p>\n\n<p>Achieving anything worthwhile takes both courage and sheer hard work.&#xA0; But as you start taking action, you will discover that you are capable of more than you thought you were, and you will see whole new realms of possibility open for you. It begins with a single act of courage. Followed by another. Then another.</p>\n\n<p>Every significant endeavor that has ever happened throughout history has been the accumulation of thousands of smaller braver steps.</p>\n\n<p>&#xA0;</p>\n\n<p>Margie<em>&#xA0;</em>is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.&#x200B;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/03","associated_company":"work180"}