{"url":"https://www.work180.com.au/blog/2016/03/australian-leaders-share-their-commitment-to-advancing-the-rate-of-gender-parity","title":" Australian leaders share their commitment to advancing the rate of gender parity","author":"WORK180","body":"\n\t\t\t\t\t<p>DCC Jobs have collaborated with clients and industry leaders across Australia to commit to providing solutions to specific challenges which are stalling gender parity.</p>\n\n<p>DCC Jobs, a social enterprise helping women pursue rewarding careers, particularly in sectors with high gender inequality rates launched the #PledgeforParity campaign leading up to 2016 International Women&#x2019;s Day and will continue to share the pledges following March 8th.</p>\n\n<p>&#x201C;We believe there&#x2019;s a need for more tangible results from Australian organisations and while we certainly have a lot to celebrate, the conversation does not stop after an IWD event,&#x201D; said Valeria Ignatieva, DCC co-founder.</p>\n\n<p>Progress towards gender parity has slowed in many places. In 2014, The World Economic Forum predicted that it would take until 2095 to achieve global gender parity. In 2015, they estimated that a slowdown in progress meant the gender gap wouldn&apos;t close entirely until 2133. As Mark Hand (MD, ANZ Corporate &amp; Commercial Banking &amp; Chair of ANZ&#x2019;s Australia Diversity Council) pointed out in his pledge, &#x201C;Waiting 117 years for gender parity is out of the question*.&#x201D;</p>\n\n<p>&#x201C;Despite the lack of global progress, we&#x2019;re seeing many Australian organisations place a strong focus on gender equality within their workplaces,&#x201D; said Gemma Lloyd, DCC-co-founder.</p>\n\n<p>DCC Jobs themselves have pledged to challenge organisations by creating an exclusive platform to promote Australia&#x2019;s leading employers for women. The DCC jobs board is Australia&#x2019;s only jobs board requiring employers to be pre-qualified before advertising to ensure they support women&#x2019;s careers.&#xA0;</p>\n\n<p>Other pledges cover challenges such as closing the gender pay gap, enabling flexibility, increasing the numbers of women in leadership, addressing violence against women along with the need to focus on inclusion for everyone.</p>\n\n<p>Leaders from <a href=\"/clients/accenture\">Accenture</a>, <a href=\"/clients/nab\">NAB</a>, ANZ, REA Group, EY, DAWN, Super Retail Group, McCullough Robertson, Queensland Male Champions of Change, Digital Careers, IBM, <a href=\"/steel-heels\">Steel Heels</a> and Diversity Council Australia have supported the campaign-&#xA0;view the pledges <a href=\"http://2016-international-womens-day-number-pledgeforparity\">here.</a></p>\n\n<p>* Global Gender Gap Report 2015, World Economic Forum</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/03","associated_company":"work180"}