{"url":"https://www.work180.com.au/blog/2015/07/avoid-these-3-mistakes-when-writing-a-job-ad","title":" Avoid these 3 mistakes when writing a job ad","author":"WORK180","body":"\n\t\t\t\t\t<p>&#xA0;</p>\n\n<p>There is a popular saying- &#x201C;Hire people who are smarter than you&#x201D;. Yet when you look at your latest job ad, does it make you feel like you have created a perfect ad to attract the top talent? Will it make someone spill their coffee and think &#x201C;I have got to go for this job, never mind the 7 year bonus coming up next month?&#x201D;</p>\n\n<p>Maybe not to that extreme, but you understand my point.</p>\n\n<p>Since launching Diverse City Careers, we have done a number of surveys and tests around optimising job ads- here are the top 3 mistakes we often see.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Not selling your Employer Brand</strong></p>\n\n<p>A top candidate will rarely read an entire job description. Candidates told us they scan the ad for certain criteria before investing additional time. Several of our clients are looking to hire what I like to call the &#x201C;elusive unicorn&#x201D;- eg a woman with 15 years technical experience for a senior management role, and other, very specific pre-requisites.</p>\n\n<p>So when you look at your job ad through the unicorn&#x2019;s eyes, it will have to pretty special in order to first even attract her attention, let alone entice her to apply.</p>\n\n<p>Spend more effort on highlighting why she would want to work with your company- understand what motivates those who you are trying to attract and highlight these key motivations. This could be flexibility, career progression opportunities, mentorship, etc.</p>\n\n<p>We performed some tests at DCC- taking two almost identical job ads and &#x2018;flipping&#x2019; one of them upside down- adding the &#x2018;why work here&#x2019; section at the top and removing some unnecessary words. The modified job ad received more than double the applications of its unpopular twin.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Not marketing each job description to a specific audience</strong></p>\n\n<p>Because we primarily deal with female applicants, language used in job ads posted on the DCC website is very important.</p>\n\n<p>We understand it&#x2019;s difficult to create different ads when you are posting to multiple sites via an ATS. However to get the most ROI for your ad spend, we strongly recommend a custom approach when you are hoping to add more female candidates to your pipeline. This is doubly important if you are recruiting for an industry that&#x2019;s underrepresented by women.</p>\n\n<p>An example I often use is the following description for the same skill set:</p>\n\n<p>&#x201C;Aggressively grow a new market territory&#x201D; or &#x201C;Build relationships and expand the business interstate&#x201D;</p>\n\n<p>Which one would appeal more to a female?</p>\n\n<p>There&#x2019;s lots of research on this topic- we suggest investing time to tailor job ads to be more gender neutral and are happy to help our clients optimise their ads.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Not evolving to cater to the social revolution</strong></p>\n\n<p>We all know that a picture says a 1000 words, yet job ads remain in the same, boring, text heavy format for over 20 years. Information overload is worse than ever, and the way we promote job ads needs to change.</p>\n\n<p>We&#x2019;ve been trialling visually attractive ads to promote jobs advertised on the DCC site. The results speak for themselves- for example, when promoted on social media as an image vs a text link, one ad received more views than the rest of the client&#x2019;s jobs combined!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/07","associated_company":"work180"}