{"url":"https://www.work180.com.au/blog/2016/06/bank-of-queensland-becomes-the-first-bank-in-australia-to-be-an-endorsed-employer-for-women-by-dcc-jobs","title":" Bank of Queensland becomes the first bank in Australia to be an Endorsed Employer for Women by DCC Jobs","author":"WORK180","body":"\n\t\t\t\t\t<p>Bank of Queensland (BOQ) is the first bank in Australia to be an endorsed employer of women by DCC Jobs.</p>\n\n<p>Founded by Gemma Lloyd and Valeria Ignatieva, DCC Jobs is a social enterprise specialising in helping women find rewarding jobs in non-traditional industries through their unique jobs board. Before a company can advertise jobs on DCC&#x2019;s job board, they are screened to ensure they provide a supportive environment for women. Female candidates visiting DCC&#x2019;s job board are looking for progressive companies leading the way on supportive workplace practices.</p>\n\n<blockquote>\n<p>&#x201C;The BOQ company values align perfectly with DCC&#x2019;s ethos of &#x2018;We believe in a better way of working&#x2019; and we&#x2019;re delighted to welcome them on board,&#x201D; said Ms Ignatieva.</p>\n</blockquote>\n\n<p>BOQ Managing Director and CEO Jon Sutton said, &#x201C;when running a company, the amount of revenue generated is only one indicator of performance. Other elements such as the customer experience, the role the business plays in the wider community and the opportunities it provides to its employees are all equally important, and a balanced combination of all these ingredients is what&apos;s really needed for success.&#x201D;</p>\n\n<p>Jon is a dedicated gender diversity advocate both within BOQ and the industry as a member of the <a href=\"https://www.humanrights.gov.au/our-work/sex-discrimination/projects/male-champions-change\" target=\"_blank\">Male Champions of Change Group</a>.</p>\n\n<blockquote>\n<p>&#x201C;Women have long been under-represented in many industries and - at the risk of acknowledging the elephant in the room - the financial sector is not immune to this criticism,&#x201D; continued Mr Sutton.</p>\n</blockquote>\n\n<p>According to the Workplace Gender Equality Agency&#x2019;s latest reports, women represent just 24.1% of key management personnel, and only 6.5% are occupying CEO roles across Financial and Insurance services.</p>\n\n<p>BOQ have tackled a number of issues and have delivered impressive results- the number of women in leadership rose from 27% to 32% in just five months and the company has publically committed to 50% women in leadership roles by 2020. The bank is also trialling flexibility in some of the most unusual areas of the business such as the call centre.</p>\n\n<blockquote>\n<p>&#x201C;We are proud to extend flexibility into a traditionally non-flexible role at BOQ &#x2013; the call centres. For years, this has been put into the &#x201C;too hard basket&#x201D; at BOQ, but it goes to show that when an organisation makes the commitment for this to happen and empowers leaders to explore the &#x201C;what if&#x201D;, that positive change can happen. The program is designed to improve the work-life balance of call centre staff, both women and men. With a pilot launching soon, I look forward to sharing our successes (and learnings too) in the coming months&#x201D; said Mr Sutton.</p>\n</blockquote>\n\n<blockquote>\n<p>DCC Jobs Founder Ms Lloyd said &#x201C;we are very impressed with the initiatives within BOQ and the high level of female participation in areas such as technology, where women already make up 50%.&#x201D;</p>\n</blockquote>\n\n<blockquote>\n<p>&#x201C;While flexible working is only one small component of the overall employee experience, BOQ have taken a flexible approach to all other areas of the business, proving clear career progression paths and support for their staff. This flexibility to create an environment where people genuinely love coming to work is exactly what drives employee engagement and of course profitability&#x201D; said Ms Lloyd.</p>\n</blockquote>\n\n<p><a href=\"/clients/bank-of-queensland\">BOQ</a> joins other DCC Jobs endorsed employers such as <a href=\"/clients/accenture\">Accenture</a>, Dropbox, <a href=\"/clients/Minterellison\">Minter Ellison</a>, <a href=\"/clients/AECOM\">AECOM</a>, Aurizon, <a href=\"/clients/origin-energy\">Origin Energy</a>, Curtin University and AustralianSuper.</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/06","associated_company":"work180"}