{"url":"https://www.work180.com.au/blog/2016/06/bravery-vs-bravado-what-type-of-leader-are-you","title":" Bravery vs Bravado – what type of leader are you?","author":"WORK180","body":"\n\t\t\t\t\t<p>Simon Sinek has a fantastic quote from his article Failure Is An Option;</p>\n\n<blockquote>\n<p>&#x201C;to operate based on conviction and belief requires an acceptance that your actions could get you fired. This is different from pig-headed bravado, and it is different from putting the company at risk&#x201D;.</p>\n</blockquote>\n\n<p>Instinct in the workplace is a funny thing. &#xA0;Some people are naturally able to give 100 per cent all the time, irrespective of their position within a company and irrespective of the company they are working for. &#xA0;They have an intrinsic ability to put the best of themselves forward &#x2013; sometimes knowing full well that this won&#x2019;t be rewarded in the short term. &#xA0;What it does show though, to their teams and colleagues, is the difference between bravery in business and bravado.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>A Leader With Bravado</strong></p>\n\n<p>There&#x2019;s an omnipresent culture of business bluster and bravado lurking around at present. &#xA0;It&#x2019;s a game of pretence, and false promises. &#xA0;It&#x2019;s the mindset of &#x2018;<em>I will give enough to look like I am performing above expectations whilst secretly cruising my way to the next week &#x2013; or role&#x2019;</em>. &#xA0;Many leaders are only showing the tip of the business performance iceberg, being content to sit on one&#x2019;s hands while nodding furiously and giving every indication of leading change.</p>\n\n<p>It&#x2019;s &#x2018;fake it till you make it&#x2019;, not engaging wholly or giving completely &#x2014; despite having the ability to do so. The sad part is that often more effort is expended on being the equivalent of a business iceberg than giving one&#x2019;s all. &#xA0;This &#x2018;bravado&#x2019; style of business can be employed by entire corporations and even translate down to the smallest action.</p>\n\n<p>It can be a matter of constantly not speaking up, or refusing to take an active role in the professional development of those coming through the ranks. It can be refusing to disclose one&#x2019;s own actions out of sheer ego. It can be acting &#x2018;for the good of the company&#x2019; by staying quiet when the status quo is not ethically correct.</p>\n\n<p>It can be an unwillingness to keep learning, being too busy to take on new experiences, knowledge or new ways of doing things. &#xA0;It&#x2019;s about making excuses, taking beta position, meeting targets rather than exceeding them, facing inward, being closed off. &#xA0;These are leaders that operate with bravado. &#xA0;They are unwilling to shine and unwilling to change. &#xA0;If that is how bravado looks, then what is bravery?</p>\n\n<p>&#xA0;</p>\n\n<p><strong>A Brave Leader</strong></p>\n\n<p>Brave leadership is about;</p>\n\n<ul>\n\t<li>\n\t<p>Stepping not necessarily always outside the square but along the edges of the business square</p>\n\t</li>\n\t<li>\n\t<p>Getting out of the shallowness of surface leadership</p>\n\t</li>\n\t<li>\n\t<p>Questioning your own position</p>\n\t</li>\n\t<li>\n\t<p>Taking on leadership</p>\n\t</li>\n\t<li>\n\t<p>Constantly learning</p>\n\t</li>\n\t<li>\n\t<p>Posing new sets of challenges for oneself in terms of professional standards and goals</p>\n\t</li>\n</ul>\n\n<p>Brave leaders strive to be change-makers and to improve the way things are done within the company, the sector, the industry, or even the community. They have the courage to:</p>\n\n<ul>\n\t<li>\n\t<p>Stand in our own spotlight</p>\n\t</li>\n\t<li>\n\t<p>Use our voices</p>\n\t</li>\n\t<li>\n\t<p>Ask for help</p>\n\t</li>\n\t<li>\n\t<p>Be vulnerable</p>\n\t</li>\n\t<li>\n\t<p>Be different</p>\n\t</li>\n\t<li>\n\t<p>Challenge the status quo &#x2013; because this is how change happens</p>\n\t</li>\n</ul>\n\n<p>Brave leadership is about all of us leaning in and being brave to embrace diversity and driving the change that is required. Bravery is reaching out to fellow leaders and those who are willing to shape policy and procedure, and giving 100 per cent to drive business forward in an ethical and productive way.</p>\n\n<p>For corporates in particular it is about coming back to the authentic, and to the transparent. It is in many ways taking the lead from entrepreneurial models, where &#x2018;bravery&#x2019; is key to driving sales. The ability to lead by example is absolutely critical to success in a market that is cynical and sick of inflated salaries &#x2014; and inflated egos.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Become A Leader Worth Following</strong></p>\n\n<p>Being a change maker is a risky business. &#xA0;It takes bravery 100 per cent, all day and every day. It takes a level of self-belief to challenge the traditional or the &#x2018;it&#x2019;s always been like that&#x2019;. &#xA0;It takes an inner confidence and conviction to be a non-conformist, to have a view contradictory to the expected. But leaders need to have the courageous conversations that drive change, that create action, that create momentum.</p>\n\n<p>We have to be willing to fail &#x2013; because this is bravery.</p>\n\n<p>We have to be willing to share what we know &#x2013; because this is bravery.</p>\n\n<p>We have to step in to the spotlight &#x2013; because this is bravery.</p>\n\n<p>We have to ask for help &#x2013; because this is bravery.</p>\n\n<p>We have to try different ways of doing and working &#x2013; because this is bravery.</p>\n\n<p>We have to embrace diversity and all the difference of opinion it brings &#x2013; because this is bravery.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>What Standard Are You Expecting?</strong></p>\n\n<p>I am often reminded of Lieutenant General David Morrison&#x2019;s now famous and often-quoted line about behavioural standards &#x2018;The standard you walk past in the standard you accept&#x201D;. As leaders, as men and women of worth, we have to be brave &#x2013; because if we don&#x2019;t, who will? &#xA0;This is what it means to be a leader, and this is what we have to do every day, in every way, with every decision we make, large or small.</p>\n\n<p>It&#x2019;s a standard that means you are making a choice to be a brave leader, a leader that is standing up for their belief and vision and one that is committed to the journey, inclusive of the highs and the lows, that lie ahead.</p>\n\n<p>Drive change, because you are brave enough to do it.</p>\n\n<p>As Dr Seuss says, &quot;<em>why fit in when you were born to stand out?&quot;</em></p>\n\n<p>&#xA0;</p>\n\n<p>This article was originally posted on <a href=\"https://leadersinheels.com/\" target=\"_blank\">Leaders in Heels</a>. &#xA0;View it <a href=\"https://leadersinheels.com/career/bravery-vs-bravado-type-leader/?c=713700e9fc9c\" target=\"_blank\">here</a>.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/06","associated_company":"work180"}