{"url":"https://www.work180.com.au/blog/2015/08/ever-feel-like-a-fraud-how-to-beat-imposter-syndrome","title":" Ever feel like a fraud? How to beat Imposter Syndrome","author":"WORK180","body":"\n\t\t\t\t\t<p>Re published with permission.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;&#x201C;Today I feel much like I did when I came to Harvard Yard as a freshman in 1999,&#x201D; said Natalie Portman at <a href=\"https://www.youtube.com/watch?v=jDaZu_KEMCY&amp;feature=youtu.be\">Harvard University</a> recently. &#x201C;I felt like there had been some mistake, that I wasn&#x2019;t smart enough to be in this company, and that every time I opened my mouth I would have to prove that I wasn&#x2019;t just a dumb actress.&#x201D;</p>\n\n<p>Apart from serial narcissists, no one is immune to self-doubt or the fear of failure that fuels it. Likewise both men and women can suffer from what psychologists have dubbed the <em>Imposter Syndrome</em>, the phenomena we fear being uncovered as a fraud, unworthy of our success.&#xA0; But whether we&#x2019;re just more open about it than the fellas, it seems women struggle with it far more than men.</p>\n\n<p>The reason is simple: we women have refined self-criticism to an art form.&#xA0; We second-guess ourselves more, back ourselves less and are far more inclined to attribute our successes to a lucky break or helping hand over our brains, brawn or grit compared to men. All of which makes us feel less deserving of success (including power and admiration) and more anxious as we await everyone to wizen up to the fact that we aren&#x2019;t as smart or talented or deserving or experienced or<em> (fill in the blank</em>) as they had thought.</p>\n\n<p>I&#x2019;ve felt that way myself many times. Most often when I&#x2019;m about to do something where I risk being &#x2018;uncovered.&#x2019;&#xA0; Like giving a speech.&#xA0; &#x201C;This is it,&#x201D; cries Debbie Downer in my head. &#x201C;The charade&#x2019;s over. They&#x2019;re about to see you aren&#x2019;t so clever after all.&#x201D; &#xA0;Of course I&#x2019;ve learnt to get on with it anyway, despite my doubts, aware that if I let them run the show I&#x2019;d still be living with my parents.</p>\n\n<p>At the core of Imposter Syndrome lies a deep fear of our own worthiness. To counter it many women set the bar &#x2018;super-woman&#x2019; high. So high that it&#x2019;s near impossible to get over, even with a cape (During her first year at Harvard Portman enrolled in neurobiology and advanced Hebrew literature.) &#xA0;Which is why, conquering Impostor Syndrome requires accepting that we don&#x2019;t have to attain perfection or Da Vinci like mastery to be worthy of admiration, promotion, power, love, or for that matter, anything we really want in life.&#xA0;&#xA0;</p>\n\n<p>This isn&#x2019;t about lowering the bar, selling out on ourselves or settling for mediocrity. It&#x2019;s about resetting it to a realistic (i.e. human) level that doesn&#x2019;t leave us on the merry-go-round of forever striving, never arriving, and constantly feeling like we&#x2019;re aren&#x2019;t measuring up. It requires ditching capes, owning our value and embracing our perfectly imperfect selves.</p>\n\n<p>Most women have a lot of room to move when it comes to being kinder to ourselves &#x2013; faster to forgive our failings, slower to talk ourselves down, more accepting of praise.&#xA0; I mean, just imagine if you celebrated your small daily wins half as often as you beat yourself up when you drop one of the many balls you juggle each day?</p>\n\n<p>And imagine instead of focusing on everything you haven&#x2019;t done, you slowed down long enough to acknowledge all that you have?</p>\n\n<p>You&#x2019;d soon realize that you deserve every bit of your good fortune and success&#x2026; and then some.</p>\n\n<p>Likewise, most women I know (this ball-dropping one included) are all too practiced at comparing our weaknesses with others&#x2019; strengths. All of which only fuels any nagging sense of inadequacy and incompetence. &#xA0;We say to ourselves, &#x201C;If only I had the creative flair of Zoe,&#x201D; or &#x201C;If only I was as organized as Jane.&#x201D; All the while Zoe and Jane are thinking, &#x201C;If only I was as (<em>insert your strength</em>) as you!&#x201D;&#xA0;</p>\n\n<p>Comparing our insides with others outsides generally leaves us feeling &#x2018;less than&#x2019; in some way. While others may appear to be spinning their plates with grace, cheerfulness and manicured nails, chances are they&#x2019;re working just as hard to hold it all - work, kids, love, life - together as you.&#xA0; Perhaps not in just the same way as you, but in their <em>own</em> way, with their <em>own</em> set of pressures, problems and insecurities.</p>\n\n<p>We&#x2019;re instinctively wired to avoid situations where we risk falling short or losing face.&#xA0; But, as I wrote in my latest book <a href=\"http://www.trainthebrave.com/\">Brave</a>, the only way to conquer our deep fear of being unworthy is to step right through the heart of it, lay our vulnerability on the line and risk outright exposure.&#xA0; And while there&#x2019;s no guarantee you&#x2019;ll always succeed, you are guaranteed to build strengths, hone talents and come to know just how capable, deserving and &#x201C;more than&#x201D; worthy you truly are. &#xA0;In the process you&#x2019;ll discover than the only impostor you&#x2019;ve ever had to worry about is that fearful voice inside your head.</p>\n\n<p>&#xA0;</p>\n\n<p>Margie is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/08","associated_company":"work180"}