{"url":"https://www.work180.com.au/blog/2016/06/five-survival-tips-for-mums-returning-to-work","title":" Five Survival Tips for Mums Returning to Work","author":"WORK180","body":"\n\t\t\t\t\t<p>Returning to work after a brief holiday can be daunting for most of us, and often not a welcome transition. Throw in the emotional and physical rollercoaster of having a baby and taking months off work, which equals a tough time indeed! It&#x2019;s no wonder returning to work, no matter what job you perform will be one of the most difficult adjustment periods of your career.</p><blockquote><p>&#x200B;<em>Almost every new mother we speak to at DCC Jobs shares stories of feeling inadequate, lost, and full of guilt at &#x201C;abandoning&#x201D; her baby.</em></p></blockquote><p>One of the most helpful pieces of advice we&#x2019;ve heard is &#x201C;Trust me, it feels the worst at the start and gets better over time.&#x201D; The anxiety, feelings of displacement are all natural and we hope that the following five things can help you deal with this transition more smoothly.</p><p><br></p><h4><strong>1. Know your rights</strong></h4><p>All of a sudden, aspects of your job such as generous parental leave, a flexible work schedule, and the ability to work from home mean so much more after having a baby. Make sure to discuss options with your employer and understand that you are well within your rights to negotiate flexibility.</p><p>Australian employees returning from parental leave are legally entitled to return to the same job they held prior to going on leave. If that job no longer exists, they are entitled to return to a position that is similar in pay and status. For more information, visit&#xA0;<a data-cke-saved-href=\"http://www.fairwork.gov.au/\" href=\"http://www.fairwork.gov.au/\" target=\"_blank\">www.fairwork.gov.au</a>.</p><p><br></p><h4><strong>2. Drop the guilt at work</strong></h4><p>Accept that babies get sick, a lot. The trips to the doctor will lessen over time, but often not until the child starts primary school. Don&#x2019;t feel guilty at missing meetings or whole days at work- this is all part of life and your employer should be understanding of this. The reality is, not everyone has support networks in place and all new parents go through this.</p><p><br></p><h4><strong>3. Drop the guilt at home, part 1.</strong></h4><p>Where to start&#x2026;you will feel guilty at the sudden increase of dust and general mess in the house. You will also feel bad about the decrease in made from scratch, organic, gluten and dairy free three course dinners. Relax, this is no longer a priority and you will drive yourself mad if you insist that it is. The challenge of just surviving is more than enough pressure and again, there is a light at the end of the tunnel.</p><p><br></p><h4><strong>4. Drop the guilt at home part 2.</strong></h4><p>Oh isn&#x2019;t it terrible that you&#x2019;ve gone back to work after a few short months, your baby is in day care/with relatives and you are no longer breastfeeding around the clock?</p><p>No, it is not. If you&#x2019;ve decided to return to work, for whichever reason, then please do not beat yourself up constantly. One of the reasons you&#x2019;re doing this is for your family&#x2019;s future, and it is important to recognise this. There is no perfect, one-size-fits-all solution to parenting, and the best you could do for yourself and your family, is to focus on the positives, no matter how small.</p><p><br></p><h4><strong>5. Look after yourself</strong></h4><p>While this may sound crazy to you, try to reframe your thinking to see that looking after yourself will in turn make you a more patient parent, a happier spouse and a more productive employee. With the added stress and workload at home, make sure you discuss the equal division of housework with your partner especially if you&#x2019;re both working. Be strict with yourself about scheduling time out to unwind- whether it&#x2019;s going to a yoga class during your lunchbreak, or asking for help from family and friends and using that time to do anything you find relaxing. If you can afford it, consider outsourcing some of your chores to &#x201C;buy&#x201D; yourself some time.<br>&#x200B;</p><blockquote><p><em>At DCC, we believe in a better way of working and approve&#xA0;employers who agree with our ethos and support women&#x2019;s careers. They understand there&#x2019;s more to life than the 9-5 grind and are looking for women to join their teams, because they value and appreciate a diverse workforce.</em></p></blockquote><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About WORK180</strong></span></h5><p>WORK180 is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers. Set up your <strong>Job Alert</strong><a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\" target=\"_blank\"> here.</a>&#xA0;</p>\n\t\t\t\t","tags":["Career Development","job seeking tips","parental leave","flexible working arrangements"],"upload_date":"2016/06","associated_company":"work180"}