{"url":"https://www.work180.com.au/blog/2015/03/gender-diversity-quotas-vs-targets","title":" Gender Diversity: Quotas vs Targets","author":"WORK180","body":"\n\t\t\t\t\t<p>In the world of diversity and inclusion, particularly when it comes to gender diversity, the debate over quotas vs targets is a hot one. It tends to polarise the protagonists with no-one feeling ambivalent about it. Mostly, the debate is emotionally-based with fear and flawed logic running rife.</p><p>Just to be clear, my definitions of targets and quotas are: Targets are aspirational goals that aren&#x2019;t required to be achieved. Quotas, on the other hand, are mandated outcomes, that is they must be achieved.</p><p>Many people are opposed to quotas since they fear that it will be seen as tokenistic, that less capable people will be selected/promoted or the recruitment process will lack transparency. It might be as simple as they fear that they themselves will miss out on being recruited or promoted.</p><p>Others take a one-size fits all approach and point to the impossibility of achieving a quota given existing ratios (eg. If 27% of a workgroup is female, going for 50:50 will be impossible without removing capable men or over staffing with women). Others will point to the fact that some traditionally male-dominated areas won&#x2019;t be able to make quota because they&#x2019;re so far behind. In each case the logic is flawed.</p><p><br></p><p><strong><em>Where are we now?</em></strong></p><p>Many organisations have set themselves targets and report publicly against these targets in their Annual Reports. This provides a level of transparency and can demonstrate progress towards goals. Its helpful, but is it enough? Even the Australian Workplace Gender Equality Agency (WGEA) does not support quotas over targets. WGEA says it &#x201C;&#x2026;does not believe quotas are the silver bullet to deal with this issue. Regulation of this nature often leads to a &#x201C;tick a box&#x201D; mentality which does not promote the necessary cultural and structural change to ensure sustainable improvement.&#x201D;</p><p>There is no doubt that this is a multi-layered problem. But equally, there is not a silver bullet anywhere &#x2013; it needs a multi-layered solution. The pace of change is frustrated by a multitude of different factors and hence it becomes &#x201C;easy&#x201D; to obfuscate, to avoid and to make excuses.</p><p><br></p><p><strong><em>Unconscious bias</em></strong></p><p>Anyone who knows about unconscious bias knows that its impossible to have 100% pure, merit-based selection. Our unconscious biases will always ensure there is some subjectivity in any decision. It is because the bias is unconscious that we&#x2019;re unaware of the subjectivity! Therefore, an argument against quotas because one should use &#x201C;merit-based&#x201D; selection is flawed in the first instance. But, through the application of a quota you are ensuring a level of diversity that might not otherwise be possible.</p><p><br></p><p><strong><em>Making quotas work</em></strong></p><p>Introducing quotas that are considered and specific to the areas they apply (as opposed to blunt measures) will make them fit for purpose. These &#x201C;smart quotas&#x201D; will help to achieve two things. Firstly, they can ensure that under-represented groups (eg. women) will be adequately represented in candidate pools, on recruitment panels and in short-lists. This creates hope for women that they will be considered, will have a legitimate chance and also ensures that the final decision will be as &#x201C;merit-based&#x201D; as possible.</p><p>Secondly, quotas should be appropriate to each specific area in which they&#x2019;re applied. In aviation where only around 3% of pilots are women there&#x2019;s no point setting a quota for recruitment that&#x2019;s not actually possible to fill. However, having an appropriate quota will ensure that i) women pilots are encouraged to apply, ii) the pace of change will increase, and iii) young women who are considering flying as a career will see a pathway. Of course, a pilot&#x2019;s licence and appropriate flying experience will still be used in decision making.</p><p>Quotas have their place and targets have their place. The Male Champions of Change, for instance, have taken what they call their &#x201C;panel pledge&#x201D; and some won&#x2019;t appear at conferences or on panels if women aren&#x2019;t also represented on the panel. This is a quota by any other name.</p><p><br></p><p><strong><em>Its time to up the ante</em></strong></p><p>However, if we want to really start making a difference and genuinely speeding up the pace of change, quotas have to be used. We&#x2019;ve tried targets and the pace is still too slow. Along with efforts to educate, communicate, change culture and stereotypes, quotas <strong>and</strong> targets are a must. Its around 100 years since legislation was passed giving women the right to vote (or suffrage) we can&#x2019;t still be debating the merits of diversity in another 100 years.</p><p><br></p><p>Matt is one our Contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>.</p><p><br></p><h4><strong><span style=\"color:#A97FB1\">About WORK180</span></strong></h4><p>WORK180 is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/03","associated_company":"work180"}