{"url":"https://www.work180.com.au/blog/2016/06/how-do-we-determine-if-companies-can-advertise-with-dcc-jobs","title":" How do we determine if companies can advertise with DCC Jobs","author":"WORK180","body":"\n\t\t\t\t\t<p>By Gemma Lloyd</p>\n\n<p>As a co-founder of DCC Jobs, it was very important to me that we started the business with two main objectives in mind. The first objective is to help companies which are under-represented by women to diversify their workforces, and the second objective is to provide women with access to jobs at companies where they can thrive, feel included and supported. When women apply for a job via DCC Jobs, they trust it&#x2019;s with a supportive employer and are applying directly to the company as we don&#x2019;t allow recruiters to advertise with DCC Jobs.</p>\n\n<p>My passion for these objectives comes from having spent 9 years in ICT, an industry where only about 30% of the workforce are women. Throughout my career, I worked for some awesome companies and well, to be blunt, some &#x201C;boys&#x2019; clubs&#x201D; too.</p>\n\n<p>That&#x2019;s where the concept for the DCC job board originated, to screen organisations before they advertise based on their policies and culture around supporting women.</p>\n\n<p>So, how do we decide whether a company can advertise with us and if they are supportive of women&#x2019;s careers? We recognised very early on that (whilst formal policy is important) a commitment to diversity and inclusion is more than having a policy in place such as an HR checkbox stating that the company allows flexible working. We also recognised that we need to be very pragmatic with the criteria; for example, the mining industry is very different to legal and cannot be compared &#x2018;like for like&#x2019;. Smaller companies or start-ups may not have particular policies in place, but this doesn&#x2019;t mean they&#x2019;re not a great place to work. DCC Jobs fully support the efforts of the Workplace Gender Equality Agency (WGEA) and therefore any organisations that hold the EOCGE citation are automatically able to advertise with DCC Jobs.</p>\n\n<p>&#xA0;</p>\n\n<p>Below is a high level snapshot of some of the DCC Jobs criteria (not in any particular order):</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. A solid commitment from the Executive and Senior Management</strong></p>\n\n<p>For organisations to be able to take a serious approach to supporting diversity, the C-level needs to drive this from the top down. It&#x2019;s disappointing for me every time I meet with a HR team and they say things like: &#x201C;Gemma, I really don&#x2019;t know what to do. Many of our teams want to diversify, but our CEO just doesn&#x2019;t &#x2018;get-it&#x2019; or care. Even after we&#x2019;ve provided them with countless studies and research around how diverse organisations perform better in every way.&#x201D;</p>\n\n<p>On a more positive note, many organisations approach us and are transparent about the fact they&#x2019;re at the beginning of their journey yet demonstrate a comprehensive action plan and buy-in from the top. It&#x2019;s most satisfying to watch these companies come on board and to hear about their progress.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Gender neutral parental leave policies</strong></p>\n\n<p>Many DCC clients are working on implementing gender neutral parental policies. Gender neutral policies are important because until we make it OK for men to be the primary carer/share caring responsibilities at home, women will never be able have equal careers to men. Some are also revisiting the old guidelines of the primary carer needing to be employed for a minimum of 12 months prior to being eligible for paid parental leave. The best thing about the DCC community is that our clients are happy to share their experiences with each other, and care about their industries improving overall.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Pay equity</strong></p>\n\n<p>With the pay gap in Australia between men and women currently sitting at around 17.9%, and a predicted 100 years before pay equity is reached, organisations have a responsibility to ensure they are closing this. Salesforce recently spent $13 million globally ensuring there is pay parity between the men and women within their organisation. When hiring women, AECOM compare their salary expectations to what their male peers at the company are receiving. For example, if the company believed a senior engineer was worth $100,000 but a female applicant demanded a $90,000 salary because she had been underpaid in her past role, they will offer her $100,000.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Staff tenure</strong></p>\n\n<p>A big giveaway as to whether a company is a great place to work is how long their staff are staying with the business. We love hearing stories of women who have been in a company for 10 or even 20 years and progressed up the career ladder, and were supported every step of the way.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Flexibility</strong></p>\n\n<p>Support of flexible working practices is much more than a policy checkbox stating that the organisation allows it. So often, whilst flexibility may be supported overall, the decision about whether an employee can work flexibly comes down to the line manager. We like to see that flexibility is embraced by everyone, whether you&#x2019;re a man or woman- it&#x2019;s not just about mums. I&#x2019;m a good example of this- throughout my career I&#x2019;ve always valued the ability to work flexibly and I don&#x2019;t have kids. I&#x2019;m a morning person, so I prefer to start work at 6.30am and I am SO much more productive working from home than in a busy office (where my extroverted nature comes out and all I want to do is talk to my colleagues).</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5. Women in leadership</strong></p>\n\n<p>Having women in leadership roles encourages women internally to raise their hands and step up to challenge themselves along with attracting women externally. Bank of Queensland is an excellent example of this- the number of women in leadership at BOQ rose from 27% to 32% in just five months and with so many female role models, the business has the highest level of female participation in the technology area, where women already make up 50%.</p>\n\n<p>As individuals, we&#x2019;re all attracted to different ways of working- some people love to be thrown in the deep end in a start-up environment, and some prefer to come into the office, perform their job, go home and focus on other interests. Once a candidate applies for a job via DCC Jobs, we encourage them to interview their hiring manager just as much as being interviewed themselves, because after all, life is too short to be stuck somewhere where you don&#x2019;t feel like you belong!</p>\n\n<p>&#xA0;</p>\n\n<p>To view why companies advertising with us are great places to work, you can visit our <a href=\"/clients\">Endorsed Companies</a> page or <a href=\"/job-search\">search for jobs.</a></p>\n\n<p>&#xA0;</p>\n\n<p>If you work for a great company, and would like to attract talented women, you can email dcc@diversecitycareers to discuss ways we can support you.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/06","associated_company":"work180"}