{"url":"https://www.work180.com.au/blog/2015/12/how-to-be-decisive-amidst-uncertainty","title":" How To Be Decisive Amidst Uncertainty","author":"WORK180","body":"\n\t\t\t\t\t<p>Lee Iacocca, former president of Ford and Chrysler, once said, &#x2018;The one word that makes a good manager&#x2014;decisiveness&#x2019;. But let&#x2019;s face it, being decisive is far easier said than done as we grapple with multiple options, a lack of full information, increasing ambiguity, and a future that is anything but predictable. &#xA0;There&#x2019;s just no way of knowing your decision is the right one or that any risk will pay off. &#xA0;&#xA0;Waiting a little longer until you&#x2019;re more certain can seem like the smartest, and safest, thing to do.</p>\n\n<p>But is it?</p>\n\n<p>It&#x2019;s a general rule in psychology that for people to make the decision to change something it has to hurt more now than it hurts to change it. But what if right now you aren&#x2019;t hurting very much, with no pressing &#x2018;pain point&#x2019;? Then think about the pain you might feel down the track if you stick with the status quo, decide nothing and do nothing. What pain might you feel then? What pain might your unwillingness to make a decision cause those around you? It may be more than you want to acknowledge. &#xA0;</p>\n\n<p>Being decisive amidst uncertainty and ambiguity is something many struggle with.&#xA0; We all want to make decisions today based on a tomorrow we can predict with a reasonable degree of certainty. You wouldn&#x2019;t be human if you didn&#x2019;t have a part of you that wanted to know what your life, business or industry would look like one, five or ten years from now. But if you&#x2019;re waiting for certainty before you commit to a plan of action, you can spend your life on hold and put your career or business at risk. I know myself that I&#x2019;d have missed out on my most rewarding opportunities had I waited until I was 100% sure before I jumped in.&#xA0;</p>\n\n<p>The world we live in today is in a rapid state of change with no slow-down in sight. Markets are changing. Consumer habits are changing. Global markets are changing. The top 10 jobs today didn&#x2019;t exist 10 years ago. Nor did a dozen new countries. Nor did Uber or Twitter or, for that matter, the ability to incite an uprising through social media.</p>\n\n<p>While being decisive doesn&#x2019;t guarantee success, it always precedes it.&#xA0; Every leader will tell you that, had they known what lay ahead they&#x2019;d have done things differently (as would most investors in early 2008).&#xA0; But that&#x2019;s life for all of us. Life&#x2019;s unpredictability makes decision-making harder. Just because making a decision can bring greater uncertainty into your life or business is not a good reason not to make it.</p>\n\n<p>Giving up having to make a perfect decision can spare you an inordinate amount of stress.&#xA0;&#xA0; Better to approach decisions with the mindset that embraces life&#x2019;s inherent unpredictability and acknowledges the valuable learning we gain from simply being in action.</p>\n\n<p><em>Should you stay in your job or look for a new one? </em></p>\n\n<p><em>Expand your business or stick to the main game? </em></p>\n\n<p><em>Continue in your secure job or small (but exciting) start up? </em></p>\n\n<p><em>Invest in new technology that may be superseded before it arrives or hold off a bit longer?&#xA0; </em></p>\n\n<p><em>Take the job across country </em></p>\n\n<p>I can&#x2019;t know. &#xA0;But if you a) do your homework, b) be honest about the costs of inaction, and c) tune into your intuition then you will know what to do, even if it scares you a little.&#xA0;</p>\n\n<p>It&#x2019;s why making decisions amid uncertainty is an act of courage. It demands having faith in yourself that however your future unfolds, you&#x2019;ll handle it, thereby easing your fear of the unknown and inviting you to be more proactive in shaping it.</p>\n\n<p>Rather than trying to predict the future, or &#x2014; even more futile&#x2014;worrying how you&#x2019;ll handle it if it doesn&#x2019;t unfold to plan, focus on making the best decisions you can right now, with what you know now. If the future doesn&#x2019;t unfold as predicted, or plans just go awry, you can adjust accordingly. But making no decision for fear of making a wrong one is usually far riskier than just making a call. As Jewish philosopher Maimonides wrote in the eleventh century, &#x2018;The risk of a wrong decision is preferable to the terror of indecision&#x2019;.</p>\n\n<p><strong>It may sound counterintuitive, but avoiding change because the future is uncertain doesn&#x2019;t make you more secure; it makes you less so.</strong> Trying to avoid uncertainty by sticking your head in the sand can leave you living permanently on hold and missing out as the world marches steadily on around you.</p>\n\n<p>In 2007 Microsoft CEO Steve Ballmer said, &#x201C;There&#x2019;s no chance the iPhone is going to get any significant market share. No chance.&#x201D; Needless to say, from corporate leaders to economists, most have proven pretty lousy at knowing what the world will look like 2 years from now much less ten. What is certain though is that those who embrace uncertainty as part and parcel of life will be those best positioned to seize the opportunities our uncertain future will inevitably present.</p>\n\n<p>As I wrote in <a href=\"http://amzn.to/1BT9DpV\">Brave</a>, life rewards action not indecision. The best way to build decisiveness is to start where you are with the next decision you face.&#xA0; So go on, be bold and make a call on your future. The most dangerous decision of all is not to make one.</p>\n\n<p>&#xA0;</p>\n\n<p>Margie is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/12","associated_company":"work180"}