{"url":"https://www.work180.com.au/blog/2015/11/how-i-built-up-my-confidence-through-personal-branding","title":" How I built up my confidence through Personal Branding","author":"WORK180","body":"\n\t\t\t\t\t<p>Last night I spoke at Griffith University&#x2019;s &#x201C;Leadership Engaging Diversity&#x201D; event on Women and Confidence. I had such a great evening and wanted to share one of the stories I told.</p>\n\n<p>Through years of working in an industry under-represented by females, I&#x2019;ve encountered many situations where people (men and women) have made assumptions about me based on my gender and age. There&#x2019;s been times where I&#x2019;ve had my confidence shut down at work, forcing me to choose between becoming disheartened and overcoming the challenges to grow stronger.</p>\n\n<p>Actioning the latter was not easy and in this post I&#x2019;d like to share why this was a turning point in my life and how developing my Personal Brand helped me become confident and fast-track my career.</p>\n\n<p>I also know that I&#x2019;m definitely not alone in this- through my work at <a href=\"http://www.diversecitycareers.com/\">DCC</a> , I&#x2019;m speaking to women across a range of industries every day, from graduate through to Senior Executive level, and many have experienced similar challenges.</p>\n\n<p>Going back a number of years, I landed a position at an IT&amp;T company as an Account Manager for Enterprise and Government clients. I&#x2019;ll never forget starting that role confident and ready to take on the world, but it wasn&#x2019;t long before that confidence was completely shut down. It had nothing to do with my ability or competency in the role because I was performing at a high standard; it was all about how I was treated by my peers.</p>\n\n<p>All of my colleagues were middle-aged males and whilst they were my peers, they would ask me to get them stationary, coffees and take their notes. Essentially I was treated as their assistant.</p>\n\n<p>It wasn&#x2019;t until one day in a meeting where there were about 12 of us, all men and myself, and I was asked to take the minutes for the meeting. Something inside of me made me push back and I politely said &#x201C;I&#x2019;ve got a lot I&#x2019;d like to contribute to the meeting, would you mind if someone else takes the minutes?&#x201D;</p>\n\n<p>Guess what&#x2026;</p>\n\n<p>It was completely fine! Another male raised his hand straight away and said, &#x201C;No worries at all Gemma, I&#x2019;d be happy to take the minutes&#x201D;.</p>\n\n<p>That was a defining moment for me. I realised that these men weren&#x2019;t acting like that towards me because they didn&#x2019;t value me, their actions were completely unconscious. I knew at that point to be successful I had to start valuing myself more, being confident, speaking up and pushing back when appropriate. I didn&#x2019;t realise it at the time, but I was about to start cultivating my Personal Brand.</p>\n\n<p>So what is a Personal Brand? A Personal Brand is who you are and how others, whether that be managers, clients, colleagues or subordinates, perceive you. When I started developing my Personal Brand, I went through an initial process of mapping out my values and beliefs, and defining where I wanted to take my career.</p>\n\n<p>There are many components of developing a Personal Brand, some of which include:</p>\n\n<ul>\n\t<li>\n\t<p>Knowing your worth and your values</p>\n\t</li>\n\t<li>\n\t<p>Developing an online presence- via channels such as LinkedIn, Twitter and internal company social networks</p>\n\t</li>\n\t<li>\n\t<p>Networking, volunteering and joining relevant Industry Associations</p>\n\t</li>\n\t<li>\n\t<p>Associating with other strong brands</p>\n\t</li>\n</ul>\n\n<p>Developing confidence and Personal Branding are critical to career success and both are among the top 10 topics that are often requested by the DCC community.</p>\n\n<p>To help with this, we have developed a free workbook and guide to help you identify and develop your brand. If you are interested in a copy of the workbook, please click here.</p>\n\n<p>&#x201C;Personal Branding for your career success&#x201D; is also the topic for DCC&#x2019;s first &#x201C;Better Ways of Working&#x201D; Meetups in Brisbane on the 2nd December and Melbourne on the 9th December.</p>\n\n<p>These meetups are aimed to connect women who are at any stage of their career to share experiences, success stories and ways we can support each other. In December I&#x2019;ll be sharing my practical tips on developing a great Personal Brand and workshopping some ideas with the group.</p>\n\n<p>Here&#x2019;s a little something that really resonates with me:</p>\n\n<blockquote>\n<p><em>&#x201C;Any time you sincerely want to make a change, the first thing you should do is raise your standards. What really changed my life is the change I demanded of myself. I wrote down all the things I would no longer accept in my life. All the things I would no longer tolerate. And all the things I aspired to becoming.&#x201D;</em> Anthony Robbins.</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/11","associated_company":"work180"}