{"url":"https://www.work180.com.au/blog/2016/03/how-to-network-like-a-pro","title":" How to network like a pro!","author":"WORK180","body":"\n\t\t\t\t\t<p><span style=\"color:rgb(30, 30, 30)\">For so many of us, going to networking events and meeting new business connections can be difficult. This is particularly true if you find yourself attending an event on your own- when you don&#x2019;t have the safety net of a friend or colleague to talk to.</span></p><p><span style=\"color:rgb(30, 30, 30)\">Networking however, is an important necessity if you want to fast-track your career and be exposed to opportunities. It was through networking that by the age of 26, I was able to gain board positions on two not-for-profits, as well as experience significant growth within my own business&#xA0;WORK180.</span></p><p><span style=\"color:rgb(30, 30, 30)\">So how do we network meaningfully? Networking isn&#x2019;t about going to an event and speaking to as many people as possible- it&#x2019;s about meeting a few people, and building deep, meaningful connections.</span></p><p><span style=\"color:rgb(30, 30, 30)\">I often get asked the same questions about how to approach networking and its benefits, here are a few below:</span></p><p><strong><span style=\"color:rgb(30, 30, 30)\">1) What are your top tips and tricks to networking?</span></strong></p><p><span style=\"color:rgb(30, 30, 30)\"><strong>At a work lunch </strong></span></p><p><span style=\"color:rgb(30, 30, 30)\">Work lunches are a great place to get business done. Taking people out of the corporate office environment can assist with making people feel more relaxed and forthcoming with ideas or feedback.</span></p><ul><li><p><span style=\"color:rgb(30, 30, 30)\">If you can, strategically choose where you want to sit, so that&#x2019;s it&#x2019;s next to or opposite the person you want to interact with the most.</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Try not to order food that is too messy!</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Come prepared with some interesting topics or questions to keep conversation flowing.</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Alcohol is typically a no-no if you&#x2019;re discussing an important topic, but gauge what the boss is doing, if they have a glass of wine, then it&#x2019;s fine to have one too.</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Treat the restaurant as an extension of your office. While this is more relaxed, resist the temptation to bring out any inappropriate stories.</span></p></li></ul><p><span style=\"color:rgb(30, 30, 30)\"><span style=\"color:rgb(30, 30, 30)\"><strong>At a conference</strong></span></span></p><p><span style=\"color:rgb(30, 30, 30)\"><span style=\"color:rgb(30, 30, 30)\">Networking at a conference is great! There&#x2019;s a very high chance that you&#x2019;ll share common interests with the attendees, so conversation should be fairly easy and free flowing.</span></span></p><ul><li><p><span style=\"color:rgb(30, 30, 30)\">Research who else is attending the conference and know some key people you want to connect with. Have some pre-prepared questions/discussion points. It&#x2019;s also helpful to try and connect with people prior to the conference and book times to meet with them.</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Arrive early and scope everything out so you have time to meet people and aren&#x2019;t rushing around.</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Have an elevator pitch prepared- this should be about 30 seconds long and highlight your background and why you&#x2019;re attending the conference.</span></p></li></ul><p><strong><span style=\"color:rgb(30, 30, 30)\">2) What advice do you have for people that are just not good at it? It&apos;s not that they aren&apos;t interested, they just genuinely seem to get it wrong even when they try.</span></strong></p><ul><li><p><span style=\"color:rgb(30, 30, 30)\">&#xA0;Networking is a skill, just like playing an instrument. No-one is born being able to play&#xA0;Mozart&#xA0;on the&#xA0;piano, it comes with practice. The best advice for anyone who wants to improve their networking skills is to go to as many networking events&#xA0;as you can. The more you attend, the easier&#xA0;it gets and the more confident you become.&#xA0;To be a hit at any networking event, the best thing you can do is show genuine interest in the people you meet and ask them questions</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Go to networking events where you are truly passionate about the topic. Practice a short elevator pitch before you attend. The elevator pitch is designed to give someone a quick overview of who you are and why you&#x2019;re attending.</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Do some research about the other attendees via LinkedIn. This will help you understand what common ground you may share and begin conversations. Is there anyone there you particularly want to talk to?</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Also, try going to networking events where there&apos;s an activity everyone can participate in. Activities work as great ice-breakers and help alleviate any of that initial&#xA0;awkwardness.</span></p></li></ul><p><strong><span style=\"color:rgb(30, 30, 30)\">&#xA0;3) Are there any behaviours to specifically avoid that you&apos;ve seen in action, and why should you avoid them?</span></strong></p><ul><li><p><span style=\"color:rgb(30, 30, 30)\">&#xA0;A big networking no-no is to attend with the intention of selling something- nobody wants to go somewhere to meet new people only to be sold to!&#xA0;Go to a networking event with the attitude of learning something new and how you could possibly help the other people you meet.</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">&#xA0;Also, leave your phone in your bag! There&#x2019;s nothing worse than talking with someone and having them check their phone mid-conversation. Even if it&#x2019;s unintentional, it&#x2019;s can be interpreted as a sign that you&#x2019;re not interested in what the other person is saying</span></p></li></ul><p><strong><span style=\"color:rgb(30, 30, 30)\">&#xA0;To summarise:</span></strong></p><ul><li><p><span style=\"color:rgb(30, 30, 30)\">&#xA0;Always go to networking prepared and with an objective in mind, whether that be someone you want to meet or something you want to learn- make the most of the opportunity!</span></p></li><li><p><span style=\"color:rgb(30, 30, 30)\">Focus on building meaningful relationships. It&#x2019;s not about meeting as many people as possible and having a purse full of business cards, it&#x2019;s about building real mutually beneficial connections. Many times I have built a strong meaningful connection with one person at a networking event, which led to new business and a friendship.</span>&#x200B;</p></li></ul><blockquote><p><strong>Practice makes perfect</strong></p><p>Join our next round of meetups and take the opportunity to meet and network with like-minded people.&#xA0; Read more <a data-cke-saved-href=\"https://www.work180.com.au/events\" href=\"https://www.work180.com.au/events\">here</a>.&#xA0;</p></blockquote><hr><h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3><p>WORK180 (previously DCC Jobs) is a jobs board with a difference. We pre-screen employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients\" href=\"https://www.work180.com.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/dashboard/candidate\" href=\"https://www.work180.com.au/dashboard/candidate\">one click</a>&#xA0;now.&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/03","associated_company":"work180"}