{"url":"https://www.work180.com.au/blog/2015/06/how-to-have-it-all-time-management-secrets-from-six-figure-moms","title":" How to Have it All: Time Management Secrets from Six-Figure Moms","author":"WORK180","body":"\n\t\t\t\t\t<p><em>Having it all.</em></p><p><em>Juggling career and family.</em></p><p><em>Work/life balance.</em><br></p><p>These phrases likely conjure images of career women rather than men. Society&#x2019;s obsession with whether or not woman can &#x201C;have it all&#x201D; implies that the answer is &#x201C;no.&#x201D; After all, if we believed women could have it all, we wouldn&#x2019;t keep raising the question.</p><p>But the idea that women can&#x2019;t have it all doesn&#x2019;t reflect reality, author and time management expert Laura Vanderkam (&#x201C;168 Hours,&#x201D; &#x201C;What The Most Successful People Do&#x201D;) discovered through years of giving talks at companies and requesting weekly time logs from the workers. Her conclusion was that the lives of career women, even when they had small children, were not all that bad.</p><blockquote><p>A lot of misconceptions about our time come from surveys in which researchers called people and asked them how much time they spent on everything from work to sleep to housework that week. Vanderkam knew that actual time logs, in which people record their activities as they go through the week, show different, more accurate, results.</p></blockquote><p>She decided to gather data for what she dubbed the Mosaic Project, in which she requested time diaries from women who earn more than $100,000 a year (only 4% of employed women) and have at least one child under the age of 18 living at home.</p><p>Her engrossing and eminently helpful book, out Tuesday, called &#x201C;I Know How She Does It,&#x201D; analyzes and draws tips from 1,001 days in the lives of 143 such women. (She also received dozens more logs that weren&#x2019;t complete enough to include in her quantitative analysis but from which she gleaned qualitative tips.)</p><p>&#x201C;I wanted to look at this through the lens of a group that there are these particularly entrenched narratives about &#x2014; that it&#x2019;s impossible for women to have big careers and a family, that something&#x2019;s got to give there. We assume that if she&#x2019;s got the big career, she&#x2019;s got zero family life, and if she manages to spend time with her children, then she has nothing else whatsoever going on,&#x201D; says Vanderkam. &#x201C;So I decided to see what happens when you actually look at time log data, and the answer from my research is that a lot of these narratives have some holes in them.&#x201D;</p><p>Don&#x2019;t let a rotten economy spoil your goals. Use the career and money advice in The Millennial Game Plan to get and stay ahead for good.</p><blockquote><p>Here are some common myths about career women&#x2019;s lives, what the time logs actually showed, and how you can better manage the tiles of your own weekly mosaic.<br></p></blockquote><h3><strong>Myth: Having It All Means Working Long Weeks</strong></h3><p>Surprise: the average workweek for an employed worker has actually fallen from 42.4 hours per week in 1950 to 34.5 hours in August 2014, according to the St. Louis Fed.</p><p>But what about high-powered professionals in fields like medicine, law, consulting, tech and finance? John Robinson and Geoffrey Godbey&#x2019;s 1997 book, &#x201C;Time for Life&#x201D; analyzed time diary data and found that people who thought they worked 50-59 hours a week were off by about 9-10 hours. Those who estimated they worked 60-74 hours a week overestimated by 14-15 hours, and so on. Those who claimed to slave away for 75+ overshot by 25 hours or more. In 2011, the authors updated their study with more recent data, but their findings held.</p><p>&#x201C;I&#x2019;m not denying that some people who are working 80 hours weeks, but those are the people talking about their 100-hour weeks,&#x201D; says Vanderkam. &#x201C;People haven&#x2019;t really added it up. I&#x2019;ve done long weeks, where I worked every single day and into the night, and the total comes out in the low sixties.&#x201D;</p><h4><strong>What the Time Logs Showed</strong></h4><p>The six-figure-earning moms in the Mosaic Project worked, on average, 44 hours a week. Thirty-six percent worked fewer than 40 hours a week, and only 6% exceeded 60 hours. None worked more than 70 hours a week.</p><p>So, these career women were not working a ton more than the average working mother, who works between 34 and 38 hours a week, according to the American Time Use Survey. However, Vanderkam notes, the average working mother earns less than $40,000 a year.</p><p>&#x201C;It seems like there are quite substantial returns for those extra hours on the margins,&#x201D; says Vanderkam. &#x201C;That&#x2019;s not to say that someone with a 35-hour job, just by working 10 extra hours, would suddenly start earning six figures, but the category of jobs you&#x2019;re willing to consider &#x2014; often those big jobs are not as around-the-clock as you might expect.&#x201D;<br></p><h4><strong>How to Better Manage Your Work Time</strong></h4><p>Think in 168 hours, not 24. Some Mosaic Project participants, particularly consultants, worked long hours Monday to Wednesday, but then had more, and more focused, family time Thursday to Sunday. For instance, one was out of town Monday to Thursday afternoon and sometimes worked from home Friday. In her hotel the first half of the week, she caught up on &#x201C;me&#x201D; time so she was more present with her children on weekends.</p><p>&#x201C;A lot of things are not going to fit at the same time every day,&#x201D; Vanderkam says. &#x201C;Making a choice to consciously work really late two nights a week and get yourself home earlier on the other nights could mean you&#x2019;ll have more time with your family than the situation where you&#x2019;re leaving work earlier every day than you really felt like you should, but you&#x2019;re only getting home for 20 minutes before your kids go to bed.&#x201D;</p><p>Another strategy she advocates is to ask for forgiveness but not for permission &#x2014; at least when it comes to moving your work tiles around. For instance, if you&#x2019;re not at your desk, no one will know if you&#x2019;re with a client or at your child&#x2019;s school play. &#x201C;Everyone thinks it&#x2019;s fine to not be on a phone call for two hours because you&#x2019;re on a plane,&#x201D; says Vanderkam, &#x201C;so maybe it&#x2019;s okay to not be on a phone call for two hours because you&#x2019;re volunteering at your kid&#x2019;s school.&#x201D; Make up the time in a way where no one will know the difference.</p><p>Asking for permission requires a negotiation, she says, and in the process you may give up pay, prestige or your upward trajectory, even though you&#x2019;re not working fewer hours. You&#x2019;re just working different hours in different places.</p><p>Also, don&#x2019;t go part-time unless you need to drop all the way to, say, 50% time. For doctors or lawyers who have less flexibility because they have to meet patients or have billable-hours quotas, negotiating a part-time schedule can be helpful. But for other jobs, it can do more harm than good. &#x201C;Trust me,&#x201D; says Vanderkam. &#x201C;You could work an 80% schedule, but other people are working 80% of the time and slacking the other 20% and not saying anything about it.&#x201D;<br></p><h3><strong>Myth: If You Have a Big Job, You&#x2019;ll Never See Your Kids</strong></h3><p>If you work 40 hours a week and sleep eight hours a night, that leaves 72 hours for other things, such as family, says Vanderkam. Even if you work 50 hours a week, you&#x2019;ll see your family in the remaining 62 hours.</p><h4><strong>What the Time Logs Showed</strong></h4><p>&#x201C;Women were often surprised when they kept track of their time to see how much they were around their families, and partly it&#x2019;s because they don&#x2019;t think about the morning hours,&#x201D; says Vanderkam. &#x201C;Little children are often up at the crack of dawn. If you&#x2019;re not leaving for work till 8, you&#x2019;ve got two hours together. Two hours in the morning counts just as much as 4-6 pm.&#x201D;</p><p>One respondent said, after seeing how much time she&#x2019;d spent with her family, &#x201C;I used to have guilt. I don&#x2019;t have guilt anymore.&#x201D; Someone gone from 8am to 6pm Monday through Friday can spend an hour before work and two hours after work with her kids, plus ten hours each weekend day. That totals 35 hours a week. If you pick up your kids at 5, then you&#x2019;ll hit 40 hours. As Vanderkam writes, &#x201C;People who spend 40 hours per week at their jobs don&#x2019;t lament that they &#x2018;never&#x2019; see their workplaces.&#x201D;</p><h4><strong>How to Better Manage Your Home Time</strong></h4><p>Be mindful of small bits of time. One woman with a terrible commute who had to drop her kids at school had to leave by 7:10am. But she&#x2019;d always get her children ready by 7am and play with them for 10 minutes. &#x201C;Here she is, about to soldier through this terrible commute with her kids in tow,&#x201D; says Vanderkam. &#x201C;She could be just hating the world, but she&#x2019;s consciously chosen to play with her kids for 10 minutes. Ten minutes isn&#x2019;t much, but it&#x2019;s not nothing either.&#x201D; Her foresight allowed her and her children to start the day with levity instead of stress.</p><p>Also, find adequate child care. Looking at it as an expense misses the bigger picture. &#x201C;It&#x2019;s like saying, I don&#x2019;t want to go to college, because the tuition is high. You don&#x2019;t just look at the tuition, you look at the payoff over decades. If you stay in the workforce, most likely, over time, your income will rise, and your childcare costs will fall, so this isn&#x2019;t a calculation to make from a single point in time,&#x201D; she says. Noting that economist Syliva Ann Hewlett has found that women who take three or more years out of the workforce lose 37% of their earning power, Vanderkam says that &#x201C;puts the cost of paying for a full-time nanny for six years into perspective.&#x201D;</p><p>In addition, don&#x2019;t try to hire as few hours as you can get away with. &#x201C;The problem with that is that it&#x2019;s just an invitation for making your life more harried than it should be,&#x201D; she says. Even if you have a full-time nanny, have family or more than one trusted sitter nearby.</p><h3><strong>Myth: Career Women Get No Sleep</strong></h3><p>Vanderkam points to a number of books and polls that talk about working women&#x2019;s lack of sleep. One said, &#x201C;These women talked about sleep the way a hungry person talks about food.&#x201D;</p><h4><strong>What the Time Logs Showed</strong></h4><p>The six-figure mothers in the Mosaic Project averaged 55 hours of sleep a week, which is eight hours five nights a week, and seven hours on the two remaining.</p><blockquote><p>Ninety percent of participants got the seven to nine recommended hours of sleep a night. Just 3.7% of the 1,001 nights in the time logs showed fewer than six hours of sleep.</p></blockquote><h4><strong>How to Better Manage Your Personal Time</strong></h4><p>&#x201C;Sleep is a biological function, not a sign of how important you are,&#x201D; says Vanderkam. &#x201C;People will get an adequate amount of sleep one way or another &#x2014; whether by falling asleep in a movie or while putting the kids to bed at night.&#x201D;</p><p>If you know you have to wake up by a specific time in the morning, count backwards to see what time you need to go to bed to get an adequate amount of sleep and stick to it. Don&#x2019;t stay up another hour to clean the house. Put yourself in what Vanderkam calls the &#x201C;Good Enough Camp&#x201D; of housework. After seeing that time logs showed that people with elaborate cleaning rituals spent the most time on household tasks, she concluded &#x201C;housework expands to fill the available space.&#x201D; Also, get your &#x201C;me&#x201D; time in during other parts of the week or day to help ensure you go to bed on time. If you try to gain that extra hour by going to bed an hour later, &#x201C;you are going to lose it in terms of not being able to focus and not being at your best the next day,&#x201D; she says.</p><blockquote><p>So, if you feel you don&#x2019;t have enough time for everything, go to bed at the proper hour. That investment in yourself will give you more focus and productivity at work the next day, which, in turn, will allow you to be more present with your family &#x2014; and through this combination of career, family and personal care, you&#x2019;ll have enough, if not all.</p></blockquote><p><br></p><p><em>Laura Shin is the author of the Forbes eBook,</em> <a data-cke-saved-href=\"http://www.forbes.com/ebooks/the-millennial-game-plan-career-and-money-secrets-to-succeed-in-todays-world/\" href=\"http://www.forbes.com/ebooks/the-millennial-game-plan-career-and-money-secrets-to-succeed-in-todays-world/\" target=\"_blank\">The Millennial Game Plan: Career And Money Secrets For Today&#x2019;s World</a>.</p><p><span style=\"font-size: 16px;\">This article was originally published on&#xA0;</span><a data-cke-saved-href=\"http://forbes/\" href=\"http://forbes/\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">Forbes</a><span style=\"font-size: 16px;\">.</span><br></p><p><span style=\"font-size: 16px;\"></span><br></p><h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/06","associated_company":"work180"}