{"url":"https://www.work180.com.au/blog/2015/03/international-womens-day-is-over-what-now","title":" International Women's Day is over - what now?","author":"WORK180","body":"\n\t\t\t\t\t<p>By Valeria Ignatieva</p>\n\n<p>&#xA0;</p>\n\n<p>With lots of events in March to celebrate International Women&#x2019;s Day, one that stood out to me was the &#x2018;Women in Transport&#x2019; event, hosted by Laing O&#x2019;Rouke to celebrate and discuss gender equality in the transport and construction industries.</p>\n\n<p>Having revolved exclusively in the IT world for the past 8 years, it was a great opportunity to learn about the challenges women face in another, traditionally male dominated field.</p>\n\n<p>Women in Transport is an informal initiative driven by women in the transport industry, and is well supported by men; there was almost an even split with 140 guests attending on the night.</p>\n\n<p>Raquel Rubalcaba, Senior Project Manager and a member of the Laing O&#x2019;Rourke Diversity Council shared some of the latest, confronting statistics- the one that stuck with me was that the <a href=\"https://agenda.weforum.org/2015/03/gender-gap-calculator-2015/?utm_content=buffer091e2&amp;utm_medium=social&amp;utm_source=facebook.com&amp;utm_campaign=buffer\" target=\"_blank\">gender pay gap </a>is higher now, than when I was a baby back in 1984.</p>\n\n<p>&#xA0;</p>\n\n<p>Stephen Pascal, Rail Sector Lead - Australia Hub at Laing O&apos;Rourke spoke about the initiatives that the company has recently implemented- the most impressive to me was the <strong>industry leading</strong>, parental leave <a href=\"http://bit.ly/1GbO6GR\" target=\"_blank\">initiative</a>:</p>\n\n<ul>\n\t<li>Primary carers &#x2013; after 12 months&#x2019; continuous employment &#x2013; are now entitled to 26 weeks of paid leave and will have access to flexible working arrangements, as well as return-to-work coaching and keep-in-touch programs. This is a massive increase from the prior arrangement of six weeks of paid leave, provide upon two years&#x2019; continuous service.</li>\n\t<li>Secondary carers &#x2013; after 12 months&#x2019; ongoing employment &#x2013; are now entitled to four weeks of parental leave under the new scheme.</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<p>A panel discussion followed, and I appreciated the frank and personal reasons behind the panelists&apos; passion for a balanced workplace.</p>\n\n<p>Steve Rowe, Laing O&#x2019;Rouke General Manager Human Capital spoke about the emotional reasons- the fact that he has daughters and hopes that they will not have to go through the difficulties his sisters and mother did.</p>\n\n<p>Matt Lee, Qantas&#x2019; former COO, touched on the commercial sense to support diversity-research has shown, over and over, how heterogeneous organisations are more competitive and profitable.</p>\n\n<p>Anissa Levey, Deputy Director General, Planning and Programs, TfNSW spoke about her interesting path to her current role and the need for women to become better advocates for themselves.</p>\n\n<p>Nicole Waterman, Laing O&#x2019;Rourke Regional Principal Engineer spoke about what it felt like to often be the only woman in the room and some strategies to develop confidence.</p>\n\n<p>The panel also touched on some practical strategies of how male champions can provide more support- one that stood out to me was the need to nurture those team members who are &#x2018;quiet in the corner&#x2019; by including them in discussions and actively seeking their input. This brought back the memories of my earlier days, being present in a boardroom full of senior, male execs and feeling too scared to contribute. Now, I cannot be quietened with duct tape :)</p>\n\n<p>Unconscious bias was another area explored, and the panellists shared some unique training methods to help organisations lift the lid on this issue, which is so much more widespread than I&#x2019;d initially realised.</p>\n\n<p>Overall, it was wonderful to spend an evening with like-minded people who are actively trying to make a difference and post IWD, Laing O&#x2019;Rouke will continue to run these events and facilitate the discussions.</p>\n\n<p>My question to you is, what will you do to help gender equality?</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2015/03","associated_company":"work180"}