{"url":"https://www.work180.com.au/blog/2015/06/one-simple-tip-to-stay-focused-dot-dot-dot","title":" One simple tip to stay focused...","author":"WORK180","body":"\n\t\t\t\t\t<p>By Gemma Lloyd</p>\n\n<p>&#xA0;</p>\n\n<p>I heard a great analogy once, it went something like:</p>\n\n<blockquote>\n<p>&#xA0;&#x201C;Focus is like sunlight shining down onto earth, it&#x2019;s dispersed and keeps everything nice and warm. If you concentrate that light through a magnifying glass and hold it up against the black of a newspaper, it will burn straight through. Concentrate the light even more, it can turn into a lethal laser and destroy everything in its path.&#x201D; &#x2013; Unknown</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p>In essence, if you spread your focus across lots of things at once, you may do okay, but you won&#x2019;t achieve a great result in anything. Whereas if you direct 100% of your focus towards one thing, you will yield the best and most effective result possible.&#xA0;</p>\n\n<p>It&#x2019;s often said that women are great multitaskers, but the reality is it&#x2019;s not physically possible to effectively&#xA0; multitask. When people multitask, they&#x2019;re actually switching between tasks which means concentration goes from one thing to another.</p>\n\n<p>For example, have you ever been on a conference call while responding to email at the same time? I certainly have &#x2013; thinking I can kill two birds with one stone, only to realise coming off the call that I&#x2019;ve missed half of what was said, or that email I sent had important information missing.</p>\n\n<p>Keeping focus is hard, especially with the constant distraction of emails, text messages and social media notifications. However, there are techniques that can be used to help stay focused. A few years ago I learnt the <a href=\"http://pomodorotechnique.com/\" target=\"_blank\">Pomodoro Technique</a>.</p>\n\n<p>The Pomodoro (derived from the Italian word Pomordori meaning tomato) Technique involves setting a timer for 25 minutes and concentrating on achieving a predefined outcome for that time. Then you take a break for 3-5 minutes and set the timer again to concentrate on something else. The idea is that during the 25 minutes, you don&#x2019;t succumb to any distractions and only focus on the task at hand. It really works and I encourage everyone to give it a go!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2015/06","associated_company":"work180"}