{"url":"https://www.work180.com.au/blog/2015/05/origin-energy-leading-the-way-in-gender-diversity-across-the-energy-industry-in-australia","title":" Origin Energy leading the way in gender diversity across the Energy industry in Australia","author":"WORK180","body":"\n\t\t\t\t\t<p>This article&#xA0;originally appeared in&#xA0;the <a href=\"http://www.brisbanetimes.com.au/business/energy-companies-miss-out-on-millions-because-they-lack-diversity-ey-index-20150503-1my0s6.html\">Brisbane times</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Energy&#xA0;companies are failing to take action on gender diversity, an index measuring their progress shows, and&#xA0;Origin Energy is&#xA0;the only Australian company to be ranked as pulling its weight among the top 20&#xA0;companies rated globally.</p>\n\n<p>EY&apos;s Women in Power and Utilities Index 2015, which is in its second year, ranks the largest 200 global utilities by revenue and investigates the number of men and women on the board of directors as well as in senior management teams.</p>\n\n<p>The report said having more women on corporate boards led&#xA0;to a better-performing business.</p>\n\n<p>It measured an average return on equity (ROE) of 8.5 per cent for the global top 20 utilities that were gender diverse. They outperformed the lower 20, whose average ROE was just 7 per cent.</p>\n\n<p>EY Oceania power and utilities transactions leader&#xA0;Julie Hood&#xA0;said given the asset-heavy nature of the industry, a 1.5 per cent ROE difference translated&#xA0;into a profit gap worth millions of&#xA0;dollars.</p>\n\n<p>&quot;It&apos;s pretty simple;&#xA0;companies that are high achievers when it comes to diversity are making millions more in profit,&quot; she said.</p>\n\n<p>A&#xA0;Centre for Gender Economics and Innovation&#xA0;and&#xA0;Infinitas&#xA0;Asset Management <a href=\"http://www.smh.com.au/business/workplace-relations/more-women-equals-more-profits-so-why-are-we-still-lacking-diversity-on-boards-20150424-1mrram.html\">index&#xA0;released in April also&#xA0;found a correlation between diversity and performance</a>.</p>\n\n<p>It found&#xA0;companies with&#xA0;gender-diverse boards&#xA0;performed an average of 2 per cent better per year&#xA0;than ASX 200 companies, and more than 7 per cent better per year&#xA0;than&#xA0;companies&#xA0;with no women on their boards.</p>\n\n<p>Apart from Origin being the Australian company to make the top 20 globally, EY&apos;s index report found that in the past year the number of women in senior positions across the companies ranked had dropped.</p>\n\n<p>In 2015, there were 300 women serving on the boards of the top 200 global utilities. This represents 14 per cent of the total board members. That&#xA0;was down from 15 per cent a year earlier.</p>\n\n<p>Twenty-four of these women were board executives, representing 5 per cent of total board executives (up from 4 per cent a year earlier).</p>\n\n<p>Globally, the number of female non-executive directors was 17 per cent (dropping from 18 per cent a year earlier).</p>\n\n<p>The report said even a small drop in the number of women at the top had a big impact.</p>\n\n<p>&quot;All it takes is for a few utilities to lose one senior woman and fail to replace her with another woman, and the sector is in a net negative position,&quot; the report said.</p>\n\n<p>The EY index assigns weights to women in executive positions. Executive board members get the highest weighting, followed by senior management team, non-executive board member/independent director, business unit leader and audit.</p>\n\n<p>At the top of the list was South Africa&apos;s Eskom, followed by Duke Energy (US) and Sempra Energy (US), GDF Suez (France).</p>\n\n<p>Australia&apos;s Origin Energy ranked equal fifth with the US-based&#xA0;Ameren Corporation.</p>\n\n<p>The report said in order to go from 14 per cent female board members to 40 per cent &#x2013;&#xA0;assuming the same total number of board members&#xA0;&#x2013;&#xA0;553 more women must be appointed to board positions.</p>\n\n<p>And for every 5 per cent increase in the number of female board executives (currently at 5 per cent), another 24 women need to be appointed chief executive&#xA0;or as board executives</p>\n\n<p>&quot;There is no definitive conclusion on what number constitutes gender parity on boards, but there are a diverse range of factors suggesting it is between 30 per cent . . .&#xA0; [and] 40 per cent,&quot; the report said.</p>\n\n<p>An Origin spokesman&#xA0;said the company had set targets to increase gender diversity across the company and was making progress.</p>\n\n<p>In its latest sustainability report,&#xA0;Origin said as of June&#xA0;30 last year,&#xA0;40 per cent of Origin&apos;s employees were female, and 11&#xA0;per cent of the executive management team and 27 per cent of senior roles were filled by women.</p>\n\n<p>The EY index also ranked progress by&#xA0;region.&#xA0;Africa topped the list for the highest percentage of female power and utility board executives,&#xA0;double the proportion of the next strongest-performing region,&#xA0;Europe.</p>\n\n<p>North America was in third place with only 5 per cent female board executives, reflecting the typical corporate board structure in the US where the chief executive&#xA0;was often the only person to hold a position on the board as well as an operational position in the company.</p>\n\n<p>The Asia-Pacific was one of the worst performers. The percentage of female board executives was 3 per cent and in Latin America and the Caribbean that number fell to zero.</p>\n\n<p>In terms of women on senior management teams, the US and Canada took the top spot (18 per cent) followed by Latin America and the Caribbean (17 per cent) and&#xA0;Europe and the Asia-Pacific region (broadly on par at 11 per cent and 10 per cent, respectively). Africa and the Middle East have the lowest proportion of women in senior management teams at 7 per cent.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/05","associated_company":"work180"}