{"url":"https://www.work180.com.au/blog/2017/08/qinetiq-boosts-paid-parental-leave-conditions-and-scraps-qualifying-period-for-primary-care-givers","title":" QinetiQ Boosts Paid Parental Leave Conditions and Scraps Qualifying Period for Primary Care-Givers","author":"WORK180","body":"\n\t\t\t\t\t<p><em>Pictured above </em><em>is</em><em> Sarah and her beautiful family- Sarah is the Marketing &amp; Communications Manager at QinetiQ</em></p><p>QinetiQ today announced a progressive new parental leave scheme that provides up to 16 weeks paid parental leave for primary care-givers and up to 3 weeks for non-primary caregivers. The new scheme also includes six weeks paid leave with no minimum qualifying period.</p><p>QinetiQ Australia Managing Director Greg Barsby said the new scheme is just one of a number of initiatives being led by QinetiQ&#x2019;s Diversity &amp; Inclusion Committee to support families and increase female participation in the workforce.</p><p>Mr Barsby said: &#x201C;We are committed to providing a workplace which actively supports new parents and encourages more women to pursue careers in the defence industry.&#x201D;</p><p>&#x201C;As a Workplace Gender Equality Agency Pay Equity Ambassador I am committed to championing initiatives that increase equity and inclusion in the workplace.&#x201D;</p><p>Under the new scheme, primary care-givers are entitled to a minimum of six weeks paid parental leave with no qualifying period, up to a maximum of 16 weeks&#x2019; paid parental leave following three years or more of completed service.</p><p>The scheme also includes:</p><ul><li>Five additional paid leave days to support the transition of new parents back into the workforce, that can be used within the first 12 months of returning to work</li><li>Up to three weeks paid leave for non-primary care-givers</li><li>Keeping in touch days and supported return to work plans.</li></ul><p>QinetiQ have also recently became an Endorsed Employer for Women through WORK180. WORK180 is Australia&#x2019;s only jobs platform which pre-screens employers to ensure they support women&#x2019;s careers prior to advertising.</p><p>WORK180 Director, Community Engagement Valeria Ignatieva said QinetiQ&#x2019;s removal of the minimum service period was something she has not come across previously in the defence sector.</p><p>Ms Ignatieva said: &#x201C;We aren&#x2019;t aware of any other defence businesses without minimum qualifying periods for paid parental leave. In fact, this is a very rare occurrence across any industry, with the average being a 12 month qualifying period.&#x201D;</p><p>&#x201C;Providing paid parental leave with no qualifying period is a positive step for industry and will go a long way in supporting gender equality.&#x201D;</p><p>QinetiQ Australia General Manager People &amp; Capability Jessica Ciccozzi said that the team are constantly reviewing the market and consulting with employees to ensure the company continues to tackle inequalities and build a more flexible and inclusive workplace.</p><p>Ms Ciccozzi said: &#x201C;We are proud to be providing a leading and progressive policy within defence industry and I hope this will help to encourage more women to consider careers in this sector.&#x201D;</p><p>QinetiQ Australia was named Defence Teaming Centre&#x2019;s Employer of Choice in 2016, and was recently acknowledged as a finalist in the Australian HR Awards Employer of Choice category.&#xA0;</p><hr><h4><strong>About QinetiQ</strong></h4><p>Qinetiq is an Endorsed Employer for Women. Qinetiq is&#xA0;also a FTSE250 company with over 6,000 employees worldwide; their scientists and engineers solve some of the world&#x2019;s most challenging problems.</p><p><a data-cke-saved-href=\"http://www.dccjobs.com/job-search?client=qinetiq\" href=\"http://www.dccjobs.com/job-search?client=qinetiq\">View jobs and apply to join QinetiQ </a><a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=qinetiq\" href=\"https://www.dccjobs.com/job-search?client=qinetiq\">here</a><a data-cke-saved-href=\"http://www.dccjobs.com/job-search?client=qinetiq\" href=\"http://www.dccjobs.com/job-search?client=qinetiq\">.</a><br><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["DCC News","gender equality"],"upload_date":"2017/08","associated_company":"work180"}