{"url":"https://www.work180.com.au/blog/2018/07/%20Removing-road-blocks-for-womens-careers-transport","title":" Removing road blocks for women's careers in transport ","author":"WORK180","body":"\n\t\t\t\t\t<p><span style=\"font-size: 1.6rem;\">The Transport&#xA0;cluster &#x2013;wide&#xA0;Women in&#xA0;IT Reference&#xA0;Group was established in 2017 with a small group of passionate female leaders across the cluster. Transport for NSW led the first&#xA0;inauguration&#xA0;Women in IT forum November last year. This event is held twice a year and includes representatives from across the Transport cluster.</span></p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/57a8d542-f01e-499c-aa03-d5b94d55ea76.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/57a8d542-f01e-499c-aa03-d5b94d55ea76.jpeg\" style=\"font-size: 16px; margin: 10px; float: right;\"><p>The RMS Women in IT Action Group promotes and supports women who work in Information Technology and related technology roles. The group works to improve workplace culture, enhance workplace diversity and promote inclusive practice and recently hosted the Women in IT Forum at the end of May.</p><p>Over 100 men and women from across the Transport cluster attended the Women in IT event. The forum was hosted by the RMS IT branch, with the theme &#x2018;Male Champions of Change&#x2019;.&#xA0;<br><br><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e209d1f6-9fe3-4358-a94b-27099cd96f84.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e209d1f6-9fe3-4358-a94b-27099cd96f84.jpeg\" style=\"float: right; margin: 10px;\">The day kicked off with Cassandra Heilbronn from Minter Ellison providing some practical tips and techniques for women to increase their influence in a male-dominated world. Cassandra focused on better understanding your position in the workplace and how to make influence work for you. In order to do that, she had the delegates think back to a time where they felt as they had no influence in a work situation.</p><p>From this, she went through what she calls the 5 Criteria for influence:</p><ul><li>Strategy: What is yours?&#xA0; Do you treat work like an event, where everything is about bumping out one task before you go onto the next, or do you have a game strategy where you are exploring the full playing field and using the rules to meet expectations.</li><li>Thinking: Do you think like an employee or like a Director?&#xA0; By thinking like an employee you are doing what you are supposed to be doing and not using your strategy to think about the bigger game plan.</li><li>Branding: What are you known for in the business?&#xA0; By concentrating on presence in meetings, social media usage and appearance it all ties back to the overall work strategy.</li><li>Behaviour: What is your immediate response to an unplanned situation?&#xA0; This is your behaviour.&#xA0; Work out your SWOT and use that information as a pre-curer to your response.&#xA0;</li><li>Conduct: Has your behaviour become a continued act that it now forms part of your ongoing conduct?&#xA0; For example, apologising frequently and without reason can lead to a perception that you always acquiesce.&#xA0;</li></ul><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ba33de17-b88b-4d41-a962-5c803af3d0af.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ba33de17-b88b-4d41-a962-5c803af3d0af.png\" style=\"float: right; margin: 10px;\">After discussing those, Cassandra took the delegates back to the first question, and asked them to consider what they would do differently applying the criteria for influence.&#xA0; Her parting tip was that before any discussion, negotiation or conversation takes place where you need to achieve what you are setting out to do, picture your key person of influence, take the field and execute your strategy like they would!</p><p>The next presenter, Kathryn Morgan, Senior Digital Officer in RMS provided a thought provoking presentation on going beyond the theory of design thinking, to putting into practice. By sharing case studies and the what not to dos, Kathryn showed how leveraging the philosophies of Human Centred Design can create business value and services that are underpinned by a fantastic user experience.&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/deb83c18-1a34-49b8-9267-d6eeae507476.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/deb83c18-1a34-49b8-9267-d6eeae507476.png\" style=\"float: right; margin: 10px;\"></p><p>The day also provided a great networking opportunity in making everyone&#x2019;s &quot;Three Wishes&#x201D; come true. The focus was not only on career, but looking at the Life Wheel holistically to achieve a fulfilling and balanced life. The Life Wheel includes seven focus areas - Physical/health, personal and social, work and career, family, spiritual, financial and mind/intellect. During the exercise attendees wrote down three wishes related to any of the key focus areas of the life wheel. Once everyone had written down their wishes we all went around the room and where we believed we could assist, nominated ourselves to help make someone&apos;s wish come true. The aim is to realise and leverage our collective power in the room to support and assist one another. Following on from this activity - with a core theme around meditation/yoga and overall wellbeing we are setting up wellness sessions across the cluster as just one of the initiatives.<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/052b67f9-3d1d-4ed3-850b-c5e815d95433.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/052b67f9-3d1d-4ed3-850b-c5e815d95433.png\" style=\"margin: 10px; float: right;\"></p><p>A highlight of the event was a panel discussion on &#x201C;Men Championing Gender Equality&#x201D;. Panelists included Rodd Staples, Secretary TfNSW, Angus Mitchell Executive Director Maritime, Matt Fuller, Executive Director Business Services and Rob Putter, Chief Information Officer. The panelists shared the challenges on diversity they have faced within their own workplaces and the strategies they were taking to overcome them. They also discussed how they were embracing work life balance and championing gender equality within their own home life.&#xA0;</p><p>May Lam, Director Technology Business Management, said, &#x201C;I&#x2019;d like to thank everyone involved in making this event a success. RMS IT is committed to supporting women in IT develop their careers and events like these not only provide a great networking opportunity but also translate into real progress in ensuring gender equality in the workplace&#x201D;.&#xA0;</p><p>Roads and Maritime Services is committed to diversity and inclusion and supports 6 Regional Diversity and Inclusion Forum Committees that drive change in their local areas.&#xA0;</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About RMS IT&#xA0;<a data-cke-saved-href=\"http://www.work180.com.au/clients/rms\" href=\"http://www.work180.com.au/clients/rms\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/06bfaae7-c80a-4a44-85df-59752033da72.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/06bfaae7-c80a-4a44-85df-59752033da72.png\" style=\"float: right; margin: 10px;\"></a></strong></h4><p>NSW Government, Roads and Maritime (RMS) IT is an Endorsed Employer for Women.&#xA0;RMS offers many benefits including;</p><ul><li>14 weeks paid maternity, adoption and surrogacy leave</li><li>Only 10 Months minimum tenure to be eligible for paid parental leave</li><li>Staying Connected - parental leave program</li><li>Flexible Working</li><li>Discounted Fitness Passport &#x2013; access to over 400+ gyms/pools</li></ul><p>+ much more on their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/rms\" href=\"https://www.work180.com.au/clients/rms\">Best Employer page</a>&#xA0;and&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=rms\" href=\"https://www.work180.com.au/job-search?client=rms\">apply for jobs</a>&#xA0;with RMS.</p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2018/07","associated_companies":["work180"]}