{"url":"https://www.work180.com.au/blog/2016/01/setting-yourself-up-for-success-in-2016","title":" Setting yourself up for Success in 2016","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;On the first of January, most of us go into the New Year with some sort of &#x2018;resolution&#x2019; or new set of goals. There&#x2019;s a lot of (what I call) &#x2018;anti-resolutionists&#x2019; out there that say &#x201C;if you have a goal, why don&#x2019;t you just start any other day of the year?&#x201D; Fair point, but having a set date to begin something new is a great idea as it helps people to actually START.</p>\n\n<p>Whilst most of us believe that setting a goal is the easy part, this should be carefully considered as it&#x2019;s critical to ensure we achieve our desired outcome. Below are some key tips to setting goals and &#xA0;practical ideas to ensure we achieve them.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Set goals that are important to you</strong></p>\n\n<p>This may sound obvious, but it&#x2019;s surprisingly common for people to set goals based on what they believe is socially expected. Setting goals you are not really passionate about is a sure recipe for failure. When you think about what you&#x2019;d like to achieve, dig deep into what really matters to you, your values and motivations.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Keep them SMART</strong></p>\n\n<ul>\n\t<li>Specific</li>\n\t<li>Measurable</li>\n\t<li>Achievable</li>\n\t<li>Results-focused</li>\n\t<li>Time-bound</li>\n</ul>\n\n<p>Examples of some SMART goals would go something like:</p>\n\n<p><em>&#x201C;Within 3 months, I want to increase sales revenue by 15% by providing more value and a higher quality service to our top 10 accounts.&#x201D;</em></p>\n\n<p><em>&#x201C;By the end of the year, I want to have joined the committee for a Not-for-profit network within my industry. I will do this by building connections, volunteering and going to industry association events&#x201D;.</em></p>\n\n<p>&#xA0;</p>\n\n<p><strong>Plan like you would a holiday</strong></p>\n\n<p>Planning an overseas trip starts with setting dates, lengths of time at each destination, where you&#x2019;ll be staying, how you&#x2019;ll get there, budget etc. To ensure you achieve a desired goal, treat it as you would a holiday. Having an action plan, ensuring you have milestones to hit, dates and details on how you&#x2019;ll get there, will drastically increase your chances of success.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Find a buddy</strong></p>\n\n<p>Having someone keep you accountable can be a highly effective way of staying on track. Don&#x2019;t ever feel like you&#x2019;re bothering someone by asking them to do this. Nine times out of ten, friends, colleagues or managers are more than happy to help. You can also offer to reciprocate to keep them on track with their goals too.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Make it easy</strong></p>\n\n<p>I&#x2019;ve heard Tony Robins tell a great story once about a man who wanted to get into shape. He really struggled getting out of bed in the morning to exercise, so he knew he had to make it as easy as possible for him to start and make exercising a habit. This man ended up sleeping in his gym clothes! Sounds funny I know, but by doing that, he just had to roll out of bed in the morning and go for a run. Eventually he formed a habit and no longer had to wear his gym clothes to bed.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>There&#x2019;s an app for that</strong></p>\n\n<p>There are some great apps out there to assist us with setting and achieving goals. Some of my favourites are &#xA0;Coach.me, Way of life and Habit maker.</p>\n\n<p>&#xA0;</p>\n\n<p>These are just a few tips of many to help us make 2016 our best year yet and ensure we reach our full potential!&#xA0;DCC&apos;s first networking event for 2016 will be held on the 27th January in Brisbane. We&#x2019;ll focus on successful goal setting and dig deeper into the points above to help set yourself up for success. Register now for a great evening of networking with likeminded women and pragmatic tips for reaching your goals!</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/01","associated_company":"work180"}