{"url":"https://www.work180.com.au/blog/2015/09/seven-hurdles-women-need-to-overcome-to-take-a-seat-at-the-table","title":" Seven hurdles women need to overcome to take a seat at the table","author":"WORK180","body":"\n\t\t\t\t\t<p>Women make great leaders. We are good listeners, naturally perceptive, highly compassionate and outstanding bridge builders.&#xA0; Needless to say, women who reach the highest levels of power have proven themselves time and time again at being incredibly effective at influencing change and delivering results.&#xA0; However we also know that there are still far too few women sitting at the most senior decision making tables and that until there are more, not only will our organizations &#x2013; public, private and not-for-profit - fail to benefit from the value women bring to the decision making process, but so too will the communities those organizations impact around the world.</p>\n\n<p>I recently had the honor of speaking at a women&#x2019;s leadership summit in Shanghai where I got to meet many talented women from around the globe. Smart women. Hard-working women.&#xA0; Women aspiring to do more, be more and lead more. Women who also sometimes doubt whether they can.</p>\n\n<p>There are still many external hurdles we women have to scale to climb higher our careers, and contribute the full quota of gender diversity to the top level decisions. &#xA0;However I truly believe that the biggest hurdles we face lies inside our own heads &#x2013; our fears of failing, our aversion to risk and our tendency to underestimate out ability to handle it. Scaling these hurdles isn&#x2019;t easy. It takes courage to question the beliefs that have guided our choices and limited our horizons, challenge the status quo in our world, and dare to become more not less.&#xA0;Below are seven acts of courage for career women.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. Lead from within&#xA0;</strong></p>\n\n<p>All leadership begins from within and extends outward. Likewise, no one will see you as a leader until you see yourself as one. &#xA0;Nor will people&#xA0;fully value your skill, expertise, time and potential, unless you do. &#xA0;&#xA0;The truth is that no one on this planet has the same combination of talent, skill, passion, and personal and professional experience as you do. That means, that there are things you can do that no one else can&#x2026;. Not quite the same as you. Don&#x2019;t sell yourself short by second-guessing the value you bring or doubting your ability to lead yourself and others to greater heights of success.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. &#xA0;Embrace bold ambitions</strong></p>\n\n<p>We have to think bigger before we can be bigger. Too often though we set our sights too low, aiming only for what we think we have a good chance at achieving, rather than what really lights us up. Experience has shown me that we aspire toward ambitions where we have some innate talent to achieve. While unleashing your ambition (imagination and passion) from the fears that tether it can be daunting, it can also set you on a path toward whole new possibilities and opportunities you had never imagined.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. &#xA0;Dare to rock the boat &#xA0;</strong></p>\n\n<p>Women are great at nurturing relationships but we&#x2019;re often loathe saying anything that might jeopardize them. However, when you withhold your opinion and tip-toe around sensitive issues, you limit your value.&#xA0; Don&#x2019;t let your fear of rocking the boat; keep you from challenging the consensus thinking. Some boats are in desperate need of rocking.</p>\n\n<p>Playing it safe in your conversations deprives you and everyone else of the full value you bring. So don&#x2019;t let your desire to be liked, keep you from putting forth opinions that needs to be heard. When all you do is try to fit in, &#x2018;people-please&#x2019; and keep the peace, you negate the difference your difference can make.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4.&#xA0; Advocate for yourself</strong></p>\n\n<p>Sure doing a great job is vital, but if decision makers aren&#x2019;t aware of what you&#x2019;ve done, what you&#x2019;re capable of doing, and what you&#x2019;d really like to do in the future, then you may well miss out on opportunities that get laid at the feet of those who aren&#x2019;t shy in promoting their value in the right way and time.&#xA0; So lay false humility aside.&#xA0; Advocating for yourself isn&#x2019;t about proving superiority or stroking a needy ego; it&#x2019;s about letting the people who can help you add more value, do just that. After all, the more people who know what you want, the more who can help you get it.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5.&#xA0; Make audacious requests (Yes, &#x201C;Nice girls&#x201D; do ask!)</strong></p>\n\n<p>People aren&#x2019;t mind readers and expecting your boss (or your husband or business partner) to know what you want will prove both futile and frustrating. &#xA0;If there&#x2019;s something you want, you&#x2019;ve got to be willing to ask for it. While doing so doesn&#x2019;t guarantee you will get it, not asking generally guarantees you won&#x2019;t. &#xA0;Worst case scenario is that you&#x2019;re no worse off than before you asked but at least now you know where things stand.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>6. Stand up for yourself </strong></p>\n\n<p>Over the years many women have complained to me that they feel undervalued, overlooked, or undermined (and not just by men.) Most of the time when I&#x2019;ve enquired what they&#x2019;ve done to address the situation they confide that they have done nothing.&#xA0; But here&#x2019;s the deal: if you want to be taken seriously, respected widely and valued fully, you have to be willing to stand up for yourself, teach people how you expect to be treated and refuse to cower to those who seek to intimidate you.</p>\n\n<p>It&#x2019;s a general rule of life that you &#x2018;Get what you tolerate.&#x2019; &#xA0;Unfortunately though, many women tolerate behavior and circumstances that many men never would. &#xA0;If you tolerate someone over-stepping your boundaries, making snide remarks or over-looking you for opportunities, you can likely expect more of the same. While you may not have done anything to warrant such behavior, by not making a very clear stand for what you will, and will not tolerate, you become complicit in your own misery.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>7. Don&#x2019;t play too safe &#xA0;</strong></p>\n\n<p>While researching <a href=\"http://www.stopplayingsafe.com/\">Stop Playing Safe</a>, Maria Eitel, CEO of Nike Foundation shared with me that, &#x201C;Coming from a position of fear, of not succeeding, losing your job or not being admired handicaps the potential of your career. I&#x2019;ve never let fear of losing my job keep me from doing something I knew was the right thing to do.&#x201D;&#xA0; Taking actions that put you at risk of failure, criticism, rejection, and even of losing your job, can be scary and emotionally uncomfortable. Yet, you cannot take on bigger challenges, grow your skills and confidence, or expand your leadership influence unless you&#x2019;re willing to take such risks. &#xA0;And while losing your job may seem very dire, the courage it takes to put yourself in that position can actually earn you untold respect both within and outside your company.</p>\n\n<p>The world is hungry for more women to step up to the leadership plate and dare to do more, be more and give more. Only when we stop cowering to our fear and start owning the power that resides within each of us to affect change, can the millions of women currently living with little hope of education or opportunity ever exercise theirs.&#xA0; So you see, it&#x2019;s not just our responsibility as women to become more courageous in how we live and lead; it&#x2019;s our obligation.</p>\n\n<p>&#xA0;</p>\n\n<p>Margie is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/09","associated_company":"work180"}