{"url":"https://www.work180.com.au/blog/2016/02/tgm-and-dcc-create-superhero-daughter-day-to-celebrate-tech-careers-for-female-students","title":" TGM and DCC create Superhero Daughter Day to celebrate tech careers for female students","author":"WORK180","body":"\n\t\t\t\t\t<p>Tech Girls Movement (TGM) and Diverse City Careers (DCC) have teamed up to deliver an event celebrating ICT as a career of choice for young female students. The event aligns with International Women&#x2019;s Day and students from year 1-7 are invited along with their carers to have fun with peers, meet inspiring female role models in IT and hear from one of Microsoft&apos;s star tech girls.</p><p>The girls will learn about careers in the industry, participate in creative games, share lunch, and create their own Superhero. The event coincides with the launch of TGM&#x2019;s second edition of the <a data-cke-saved-href=\"http://www.techgirlsmovement.org/news/2016/2/22/announcing-tech-girls-are-superheroes-2-a-new-adventure-book-to-inspire-girls-into-stem-techgirls\" href=\"http://www.techgirlsmovement.org/news/2016/2/22/announcing-tech-girls-are-superheroes-2-a-new-adventure-book-to-inspire-girls-into-stem-techgirls\">Tech Girls are Superheroes book</a>.</p><p>The illustrated book and associated activities encourage girls to develop and grow strong technology, business and social capabilities and a belief that they can change the world for the better.</p><p>DCC co-founders, Gemma Lloyd and Valeria Ignatieva, also one of the featured &#x2018;tech superheroes&#x2019; in the book, are excited about bringing this event to Brisbane for the first time.</p><p>&#x201C;We are thankful for Microsoft&#x2019;s support of this event,&#x201D; said Ms Lloyd. &#x201C;With women making up less than 30% of the IT workforce, creating a pipeline of women in ICT is a crucial initiative, and many of our clients have a strong focus in this area, which is great to see.&#x201D;&#xA0;</p><p>Both cofounders have spent over 8 years working in ICT before establishing DCC, a social enterprise which helps women enter industry sectors with traditionally low female participation and pursue rewarding careers. Clients in the tech sector include Accenture, Dropbox, EMC, IBM and ThoughtWorks.</p><p>&#x201C;There is ample evidence that diversity breeds creativity. To inject innovation into our IT industry we need greater gender equality.&#x201D; Said Dr Beekhuyzen, founder of TGM.&#xA0;</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3804a35a-2077-42a6-9d8c-d1a5012cc68b.png\">&#x200B;</p><p>Since the release of the first Tech Girls are Superheroes book, over 20,000 copies have been distributed through the help of sponsors and partners. &#x201C;We&#x2019;re excited about the launch of the second book,&#x201D; Said Dr Beekhuyzen. &#x201C;A big thank you to Google, who are supporting the distribution of over 9,500 books to every primary school in Australia.&#x201D;</p><p>&#x201C;The Tech Girl Movement is one of only a few organisations in Australia focused on primary school children and girls in particular, encouraging them to look at IT as fun and rewarding career. We&#x2019;re very pleased to support such a great initiative and look forward to helping more girls become tech superheroes,&#x201D; said Valeria Ignatieva.</p><p>Tickets to the event are free- please&#xA0;click here&#xA0;for more details.</p><p><br></p><p><strong>About Tech Girls Movement</strong></p><p>Founded by Dr Jenine Beekhuyzen in 2014, the Tech Girls Movement, is a non-profit organisation promoting positive female information technology role models to encourage and raise awareness of technology careers options for girls. TGM provides free resources to empower school girls to build technology to change the world and to encourage them to enter and succeed in STEM oriented careers.</p><p>Tech Girls Are Superheroes is an innovative campaign based on more than a decade of research. The campaign presents real life female role models (IT professionals, researchers and students) as superhero characters who have written a short fiction story about how they change the world with technology.</p><p><br></p><p><strong>About Diversity City Careers</strong></p><p>Founded in February 2015 by Gemma Lloyd and Valeria Ignatieva, DCC is a social enterprise helping women pursue rewarding careers, particularly in sectors with high gender inequality rates. Since its conception, DCC has grown rapidly and is now regarded as one of Australia&#x2019;s leading authorities on gender diversity. The DCC jobs board is Australia&#x2019;s only exclusive jobs board, meaning employers must be pre-qualified before advertising to ensure they support women&#x2019;s careers. DCC produces a number of resources on topics such as personal branding, negotiation skills and other areas of professional development.</p><p>The organisation also hosts educational events and campaigns in order to raise awareness around gender inequality in Australia. DCC cofounders regularly participate in advocacy events on gender diversity and run community meet-ups and corporate panel sessions along with in-company training.&#xA0;DCC supports a number of industry NFP groups along with donating all proceeds from paid events to its sister charities.</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/02","associated_company":"work180"}