{"url":"https://www.work180.com.au/blog/2015/12/the-importance-of-women-in-sport","title":" The Importance of Women in Sport“Those who say women are not strong enough… Get stuffed!”","author":"WORK180","body":"\n\t\t\t\t\t<h1 style=\"text-align:left\">&#x201C;Those who say women are not strong enough&#x2026; Get stuffed!&#x201D;</h1><p><br></p><p>These words spoken by Michelle Payne, wer plastered over social media, retweeted and favourited by hundreds after she became the first ever female jockey to win the Melbourne Cup (in 155 years). On a horse with 100-1 odds, Michelle Payne became famous overnight and the darling of the Australian racing world, her story replayed over countless channels. As one of just four female riders to ever ride in the Melbourne Cup, her position reflects that of the position of many women in sport, under-represented and under-paid.</p><p>The women&#x2019;s soccer team, the Matlidas, recently pulled out of their US tour after a pay war between the players&#x2019; union and the W-league. It came to light the Matildas&#x2019; wages did not meet the Australian minimum wage standards and many of the players could not find alternative employment due to playing and training schedules. When the pay of female soccer players is compared to their male counterparts the difference is stark.</p><p>For example;</p><ul><li><p>The US women&#x2019;s national team won $US2 million for winning the Women&#x2019;s World Cup. The US men were knocked out in the first round yet took home $US8 million.</p></li><li><p>The total prize pool for the Women&#x2019;s World Cup: $US15 million; the Men&#x2019;s: $US576 million.&#xA0;</p></li></ul><p>The problem lies in the market size for each competition. The total revenue for the Women&#x2019;s World Cup was just $US17 million compared to $US529 million for the men&#x2019;s competition.&#xA0; The difference is due to interest of fans and sponsors in women&#x2019;s versus men&#x2019;s soccer. Why is the women&#x2019;s tournament far less supported? It would be rash to suggest that men&#x2019;s soccer is more interesting or better quality, this is simply not true.</p><p>Society accepts that men&#x2019;s sports are dominant and therefore more interesting which mean men&#x2019;s sports receive more funding, better sponsorship deals, more coverage and greater ticket sale revenue. From cycling to tennis few sports, if any, have equal pay or even prize money for men and women competitors.</p><p>Horse racing is one of the few sports that is not discriminated on sex, men and women ride alongside each other in the same race for the same prize money. But the lack of women jockeys in the top races and some of the comments by Michelle Payne reveal a deeply held belief that women are simply not as capable as men to be jockeys or even sportswomen.</p><p>In Australia, famous for its sport, women feature in just 7% of sports programming which has declined from 11% a decade ago. The gender gap is not only present, it is increasing. This problem not only impacts the women in sport, but fails to represent competitive women who win and who lead in the media and to the general population.</p><p>As boys grow up, they watch their idols and role models in sport competing and winning and many go on to play sport and are encouraged to. Girls do not. They are rarely given female role models who are not afraid to be competitive, confident and strong leaders.</p><p>There is a vicious circle between the demand for women&#x2019;s sports, revenue and salaries. Lack of demand and low television coverage means lower revenues from marketing and sponsorship and lower salaries. As a result, the ability of the teams both financially and skill/training wise is lower and so the womens&apos; teams cannot compete in tours so receive less coverage.</p><p>In addition, the media coverage <a data-cke-saved-href=\"http://www.sportsmanagementresources.com/library/media-coverage-womens-sports\" href=\"http://www.sportsmanagementresources.com/library/media-coverage-womens-sports\" target=\"_blank\">differs greatly </a>between the genders. Male athletes are idolised for their skill and strength whereas female athletes are more likely to be judged on their appearance or personal life. This double standard devalues the achievements of women and reinforces gender stereotypes and discrimination of women.</p><p>The recent UFC (Ultimate Fighting Championship) bout between Ronda Rousey and Holly Holm in Melbourne <a data-cke-saved-href=\"http://www.economist.com/blogs/gametheory/2015/11/mixed-martial-arts?fsrc=scn/tw/te/bl/ed/mixedmartialartsarousingdefeat\" href=\"http://www.economist.com/blogs/gametheory/2015/11/mixed-martial-arts?fsrc=scn/tw/te/bl/ed/mixedmartialartsarousingdefeat\" target=\"_blank\">bucked this trend</a> and hopefully points towards greater gender equality in sport and sport broadcasting. On a fight card that featured twenty-two men, the top billing starred two women. In the past two years, female competitors are more likely to headline and fight than men. The equality goes further: the female athletes fight the same number of rounds, under the same rules and paid the same percentage of revenues as their male counterparts. Although arguments can be made that the UFC is not as gender equal as it claims and little of the revenue ends up in the fighters&#x2019; pockets, the massive media coverage of the fight may boost interest, fans and thus go some way to improve the current gender imbalance.</p><p>The sporting world bears many parallels to that of businesses and industry. Whilst there are initiatives to increase the number of women on executive boards and in positions of leadership and responsibility, few exist in sport and those that do are not that successful. Having more women on sporting boards, as with any executive boards, is likely to <a data-cke-saved-href=\"http://www.canberratimes.com.au/act-news/more-women-on-sports-boards-would-reduce-corruption-doping-says-researcher-20150825-gj74ct.html\" href=\"http://www.canberratimes.com.au/act-news/more-women-on-sports-boards-would-reduce-corruption-doping-says-researcher-20150825-gj74ct.html\" target=\"_blank\">lead to less cheating and corruption</a>. This is not because women are more ethical. It is because women tend to bring diversity to a board and the greater the diversity (in terms of not just gender but culture and backgrounds also), the greater the mix of ideas and opinions. A panel that is diverse will not settle for the status quo and will not be afraid to ask questions and question practices. Corporate boards have been shown to perform better with more female members not only being more innovative but showing higher share prices and a lower risk of bankruptcy.</p><p>Sport and sporting coverage teaches women and girls who grow up with sporting role models valuable lessons that can be transferred to life, especially in the work place.</p><p>The first lesson is that it is ok to fail. Society teaches women that in a competitive work place you cannot fail and therefore you should not try. However sport, even the primary school message of &#x2018;it&#x2019;s the taking part that counts&#x2019;, teaches women that you should enjoy healthy competition and learn from losses and gain from wins.</p><p>Sport can influence body confidence. Not just in health terms, and the benefits gained from participating in sport, but an ability to understand the parts of the body that make you strong and give you an advantage in a particular sport.&#xA0;</p><p>In order to achieve your goals you need to work hard for it. Through tough training of elite athletes to a bi-weekly trip to the gym, hard work is required to gain success. This is mirrored in the work place, and women who engage in sport realise and believe that success in their goals is ultimately in their control.</p><p>Finally, <a data-cke-saved-href=\"http://www.theguardian.com/women-in-leadership/2015/jun/25/what-competitive-sport-taught-me-about-business-success\" href=\"http://www.theguardian.com/women-in-leadership/2015/jun/25/what-competitive-sport-taught-me-about-business-success\" target=\"_blank\">sport teaches teamwork,</a> not the teamwork where everyone gets along all the time, no work gets done and no-one is afraid to speak up. The teamwork that comes from questioning people&#x2019;s opinions, an awareness of your own weaknesses and appreciating others&#x2019; strengths and the ability to not only compromise but have tough conversations. Many women are afraid of being the &#x2018;bitch&#x2019; however in most, if not all, team working situations, someone has to put themselves out there to get work done. In sport, it is impossible to avoid this in order to succeed.</p><p>In Australia, a country that without a doubt loves sport, we need to work to get more women involved in sport and the media coverage to not only increase but focus on the sporting achievements rather than objectify women and judge them on their appearance. We need role models for young girls and women alike, like we need role models in many industries, to encourage participation as the benefits from sport, go so much further than the simple but important health benefits.</p><p>Want to read more about women in sports? Check out this <a data-cke-saved-href=\"https://www.diversecitycareers.com/news/celebrating-australia-s-transformation-for-women-in-sport/21043/\" href=\"https://www.diversecitycareers.com/news/celebrating-australia-s-transformation-for-women-in-sport/21043/\">article</a>.</p><hr><span style=\"color:#A97FB1\"><strong></strong></span><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2015/12","associated_company":"work180"}