{"url":"https://www.work180.com.au/blog/2015/08/the-formula-for-a-great-place-to-work","title":" The Formula for a Great Place to Work","author":"WORK180","body":"\n\t\t\t\t\t<p>Written by Lauren Jackson.</p>\n\n<p>&#xA0;</p>\n\n<p>Before you read on, I&#x2019;d like to clarify a few things:</p>\n\n<ol>\n\t<li>\n\t<p>I didn&#x2019;t write this to earn extra kudos as work (although that can never hurt ;-))</p>\n\t</li>\n\t<li>\n\t<p>The intent of this article isn&#x2019;t to shamelessly promote DCC Jobs. However, I do need to speak about DCC Jobs to give context to what I want to say.</p>\n\t</li>\n\t<li>\n\t<p>Opinions are my own</p>\n\t</li>\n</ol>\n\n<p>As some of you already know, I recently became the Community Engagement Manager at DCC Jobs. DCC Jobs is Australia&#x2019;s only job site that screens companies to be able to advertise with us, based on their policies and culture around supporting women. This has given me the opportunity to understand how different companies operate, how they keep staff engaged and what makes somewhere a great place to work.</p>\n\n<p>Through speaking to a variety of outstanding companies, we&#x2019;ve become aware of some the wonderful things they do too keep employees happy at work. These have included initiatives such as:</p>\n\n<ul>\n\t<li>\n\t<p>allowing flexibility of work hours and location</p>\n\t</li>\n\t<li>\n\t<p>great parental leave policies for both male and female employees</p>\n\t</li>\n\t<li>\n\t<p>strong employee training and development programs</p>\n\t</li>\n\t<li>\n\t<p>onsite office benefits such as games rooms, company chefs and we&#x2019;ve even come across yoga classes!</p>\n\t</li>\n</ul>\n\n<p>But what&#x2019;s become apparent is that whether an organisation has some, none, or all of these things, what makes somewhere a great place to work comes down to one core thing.</p>\n\n<p>That one thing is inclusivity.</p>\n\n<p>We&#x2019;ve discovered that the genuinely happy employees all share a common feeling- of being included. Included in the company&#x2019;s mission, part of a team all working towards the same goal. Inclusivity makes people feel valued, and when people feel valued, they are happier.</p>\n\n<p>At DCC Jobs, I work from home. We&#x2019;re a start-up, so we don&#x2019;t have some of the benefits that larger organisations have; such as flashy offices or company chefs (luckily for my waistline :)). However, I have never been happier at work! Reflecting on why, it&#x2019;s because I am passionate about what we&#x2019;re trying to achieve and I feel included in the company&#x2019;s mission. I feel valued and part of a tribe that&#x2019;s all striving to reach the same goal.</p>\n\n<p>I&#x2019;d also like to point out that we have come across several companies with thousands of employees, who have successfully managed to scale the culture and keep the inclusive environments, so this does not apply to just smaller businesses.</p>\n\n<p>One of the DCC Jobs cofounders once refers to one of her previous employers as a &#x2018;disengagement factory&#x2019;. People go in excited, ready for their new big role and come out deflated and uncaring. When I questioned about what she thought the reason for this was, she said that no-one felt valued. That everyone was &#x2018;just a number&#x2019; or a cog in a machine that could easily be replaced.</p>\n\n<p>An organisation is only as good as its employees and we all know that happier employees are more productive and work harder. So why wouldn&#x2019;t an organisation do its very best to create a great culture where people are happy to come to work?</p>\n\n<p>Smart organisations realise the investment to ensure an inclusive environment, hiring people that believe in their mission and implementing incentives to ensure employees are as happy as possible, is one that will definitely pay off.</p>\n\n<h5>&#xA0;</h5>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/08","associated_company":"work180"}