{"url":"https://www.work180.com.au/blog/2015/03/the-most-important-meeting","title":" The Most Important Meeting","author":"WORK180","body":"\n\t\t\t\t\t<p>Think of your weekly schedule- work, personal, family commitments, volunteer work, study, etc...</p>\n\n<p>What do you usually cancel, reschedule, postpone till later that day and never get done?</p>\n\n<p>For me, it used to be personal commitments, in favour of anything work related. I was working for a great company that allowed flexibility and evaluated performance on outcomes rather than time spent chained to the desk, yet I still strictly scheduled anything personal after the 9-5 workday was done.</p>\n\n<p>This was a couple of years ago and I felt like I was spinning my wheels trying to get everything done.</p>\n\n<p>Today, life is busier than ever; mum to a teen, clients across Australia that I consult to on marketing strategies, a new &#x201C;baby&#x201D; called <a href=\"http://www.diversecitycareers.com/\" target=\"_blank\">Diverse City Careers</a>, working with the amazing, inspiring team on the <a href=\"http://www.fitt.org.au/Aboutus/ManagementCommittee.aspx\" target=\"_blank\">FITT</a> committee, all of whom volunteer a decent chunk of their spare time on top of demanding careers. Not to mention my personal, fitness related goals and sporting commitments.</p>\n\n<p>Yet, I have managed to find more time than ever before to schedule regular workout sessions and other, &#x201C;me&#x201D; times. Rain, hail or shine, you will find me at my most important meeting- at the gym, at least four times per week and that is one that never gets shifted, no matter what. Somehow my work has not been negatively affected, but rather enhanced, as I have never experienced this much energy and focus to get through what are normally 70+ hour work weeks.</p>\n\n<p>A massive thanks goes to my coach Tony Calabro from <a href=\"http://www.mymelbournepersonaltrainer.com.au/\" target=\"_blank\">Signature Strength &amp; Health</a>, who completely changed the way I exercise and proved that four hours a week combined with clean eating is more than enough to drop almost 10% in body fat and two dress sizes.</p>\n\n<p>There are 168 hours that are at our disposal every week, and the &#x201C;ROI&#x201D; on four hours out of those 168 can in fact help create more opportunities to achieve more financial freedom, clarity and focus, on top of countless health benefits.</p>\n\n<p>It helps to think twice before making the old excuse of being too busy to look after yourself!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/03","associated_company":"work180"}