{"url":"https://www.work180.com.au/blog/2016/02/why-supporting-women-in-your-organisation-can-help-you-attract-better-male-talent-too","title":" Why supporting women in your organisation can help you attract better male talent too","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;Back in February 2015, I co-founded the&#xA0;Diverse City Careers&#xA0;(DCC) job site. DCC is no ordinary job site- in fact, we&#x2019;re Australia&#x2019;s only job site that pre-screens organisations based on their policies and culture around supporting women.</p>\n\n<p>After spending 8 years in IT, an industry under-represented by females, I experienced challenges within the workplace that aren&#x2019;t uncommon in most male dominated environments. It was these experiences that sparked the passion inside me around diversity, and in particular, the importance of supporting women in similar roles.</p>\n\n<p>It amazes me, how many leaders and organisations still don&#x2019;t &#x201C;get&#x201D; why we need to be focussing on male and female equality.</p>\n\n<p><strong><em>I&#x2019;ve spoken to many HR individuals who were in despair, telling me they don&#x2019;t understand why their male CEO doesn&#x2019;t care about diversity.</em></strong></p>\n\n<p>They&#x2019;d tried everything from appealing to the CEO&#x2019;s social/emotional side, to giving hard facts around how organisations that are more gender diverse have increased productivity, profitability and lower staff turnover.</p>\n\n<p>Unfortunately, there are some people who will never care, no matter what evidence you provide them with. There&#x2019;s no changing this.</p>\n\n<p>In saying all of this, there is a very silver lining. Through DCC, I have met a tremendous amount of men who are incredibly passionate about diversity. They genuinely want to see and support females become successful in their careers, receive equal pay and get leadership positions.</p>\n\n<p>During a discussion with a large engineering firm recently, the male I spoke with was very open with me.</p>\n\n<p><strong><em>He told me that his organisation was &#x201C;terrible&#x201D; at supporting women, so much so that he is looking for work with another engineering company.</em></strong></p>\n\n<p>This man has a daughter who is also studying engineering and he doesn&#x2019;t want her to have to deal with what the other women at his firm put up with.</p>\n\n<p>Another male within IT also told me a couple of months ago, that he was leaving to go to a new company because it supported diversity and has a very collaborative culture.</p>\n\n<p><strong><em>This senior executive knew that he could drive greater results within a team, if it wasn&#x2019;t just made up of 30 year old, white males.</em></strong></p>\n\n<p>These are two of many similar conversations I&#x2019;ve had with males in the last year on this topic. It&#x2019;s wonderful to see (but not surprising) that highly skilled, talented men don&#x2019;t want to work in archaic, unsupportive cultures.</p>\n\n<p><strong><em>If your company isn&#x2019;t a great place to work for a female, it&#x2019;s likely that it&#x2019;s not a great place to work for a male either.</em></strong></p>\n\n<p>The reality is, that whilst women right now are looking specifically for organisations that will support them throughout the lifecycle of their careers, it won&#x2019;t be long until the highly talented, forward thinking males follow them to the same organisations.</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/02","associated_company":"work180"}