{"url":"https://www.work180.com.au/blog/2015/08/working-mums-stop-feeling-guilty","title":" Working Mums: Stop Feeling Guilty","author":"WORK180","body":"\n\t\t\t\t\t<p>Dear fellow working mum,</p><p>I just want to let you know that you are doing a great job and that your kids, noisy and messy as they are, will turn out just fine despite the hours you spent away from them.</p><p><strong>Truly.</strong></p><p>Even the latest research has validated what most mothers eventually come to realize&#xA0; - that having a career doesn&#x2019;t hurt your kids, but actually helps them build life skills. (A recent study found that daughters of working mums earn on average 7% more than daughters of stay at home mums.)</p><p>Of course you probably don&#x2019;t always feel like you&#x2019;re doing a good job.&#xA0; If you&#x2019;re like a lot of working mums I know you probably often feel like you&#x2019;re coming up short when it comes to <em>doing</em> enough, <em>giving</em> enough and <em>being</em> enough for your kids. Not to mention your boss, your partner, your aging parents and friends&#x2026;.much less yourself!</p><p>I was warned about mothers&#x2019; guilt while expecting my first child (now 17).&#xA0; However, having grown up with a hearty dose of &#x2018;Catholic guilt,&#x2019; I figured it couldn&#x2019;t be that bad.&#xA0; And then I became a mother, and over the course of five years I had four children (yes, very blessed, slightly crazy) in between stop-starting graduate studies toward a second career.&#xA0; Needless to say, it was during that time I became much more acquainted with mothers&#x2019; guilt. It was my constant companion until the day I realized that I had children to enrich my life, not enslave my conscience and feel permanently inadequate.</p><blockquote><p>Below are five key ways to embrace your short-falls as a mother (we all have them), and refocus your preciously finite energy on what truly matters: ensuring that your kids know they&#x2019;re loved and loveable, no matter what &#x2013; and that while you may not always make every concert or game, by pursuing goals that inspire you, &#xA0;you are teaching them invaluable lessons about what it takes to one day pursue their own.</p></blockquote><p><br></p><p><strong>#1:&#xA0; Accept trade-offs as inevitable</strong></p><p>When you choose to combine motherhood and career in any way, shape or form, there will always be trade-offs, sacrifices and compromises. What is crucial to your happiness &#x2013; as well as your ability to stave off guilt &#x2013; is reconciling those trade-offs by being crystal clear about why you are making them in the first place.</p><p>Creating a list of the reasons you work &#x2013; money, satisfaction, sanity &#x2013; can provide a helpful reminder when your work keeps you from attending a concert or compels you to outsource the organization of your daughters 5th birthday party.</p><p><br></p><p><strong>#2: Don&#x2019;t &#x201C;should&#x201D; on yourself</strong></p><p>Mothers&#x2019; guilt was not always a mother&#x2019;s lot.&#xA0; Mothers in Victorian England banished children to nursemaids before sending them off to boarding school at age five so they could continue to their high-tea social lives. Likewise, I cannot recall my own parents ever coming to a netball game or reading me bedtime stories. Truth be told, I never gave it a second thought &#x2013; until I found myself feeling guilt-ridden when unable to attend one of my children&#x2019;s games or too tired to read a bedtime story. Why? Because I had unwittingly taken on board a mother-load of &#x2018;good-parent&#x2019; <em>shoulds</em> that my own mother never did.</p><p>Our <em>shoulds</em> are a melting pot of social expectations, family pressures, and often unspoken &#x2018;rules&#x2019; we often buy into without even realizing it.&#xA0; The &#x2018;<em>shoulds&#x2019; </em>for good parenting have skyrocketed in recent decades with the rise of &#x201C;parenting police&#x201D; and idealized imagery of what a perfect parent looks like. (i.e. not one who forgets to send in a flower for teacher appreciation day as I did three consecutive years in a row forcing my kids to grab a weed-flower from the lawn outside their school. )</p><blockquote><p>Of course I enjoy being involved in my children&#x2019;s activities and in their lives. But I also know that they don&#x2019;t need me cheering at every game, creating scrapbooks for every milestone, or welcoming them home from school with fresh baked muffins in order to feel loved and to grow into secure and well-rounded adults.</p></blockquote><p>And while they are central in my life, my world does not revolve around them. Nor, do I believe, would it serve them any better if it did. So when I find myself using the word <em>should</em>, I replace it with <em>could</em> &#x2013; and add an alternative option. &#xA0;Doing so takes the judgment out, and allows me give myself permission to do what actually works best &#x2013; less the guilt. E.g. I could spend the weekend making hand-crafted costumes for Halloween, or I could just pick them up at Target.</p><p><br></p><p><strong>#3:&#xA0; Lower your bar to &#x2018;good enough&#x2019;</strong></p><p>Here&#x2019;s the truth: you do not have to be a perfect mum to be a great mum. However you wouldn&#x2019;t know it if you only ever read magazine articles about celebrity mums looking gorgeous as they pick up toddler from day care.</p><p>Over the last two decades, the bar on what it means to be a &#x2018;great parent&#x2019; has been gradually moving up, and up, and up.&#xA0; In fact it&#x2019;s got so damn high most women find themselves forever falling short.&#xA0;&#xA0; Accepting that for the most part, good enough is good enough, takes enormous pressure off of us to be the idealized photo-shopped image of the &#x2018;perfect&#x2019; mother.</p><p>Giving up the elusive quest to be a super-mother who does everything &#x2018;just right&#x2019; is the only way we can ever have a chance to enjoy the journey of child rearing, without being anxious, guilt-ridden and exhausted. After all, it&#x2019;s <em>who</em> we are for our children &#x2013; happy, good-humored, and a role model for the values we believe in &#x2013; that ultimately impacts them more than how closely we, our homes, or our meals resemble the pages of <em>Home Beautiful.</em></p><p><br></p><p><strong>#4:&#xA0; Refuse to buy into guilt mongers</strong></p><p>While some women thrive on critiquing other women&#x2019;s parenting proficiency, the best mothers I&#x2019;ve met have no need to throw stones at how others parent their children. They&#x2019;re simply more interested in doing the best they can for their own. So while you can&#x2019;t always avoid the righteous parenting police, you can choose to see their self-inflating opinions &#x2013; on everything from disposable diapers to disciplinary tactics &#x2013; for what they are: an easy way to justify their own choices and conceal doubt about their own parenting skills.</p><blockquote><p>The fact is, there is no one &#x2018;right way&#x2019; when it comes to raising children.</p></blockquote><p>Just as we all differ in our personalities, preferences and circumstances, the choices that make us feel whole, healthy and happy differ as well. To those who love to critique and judge, and to all those who&#x2019;ve felt the sting of a judgmental remarks or scornful glance, I say &#x201C;to each their own.&#x201D; The vast majority of working mothers I encounter work incredibly hard to be the best parent they can, and that deserves encouragement, not criticism.</p><p>Likewise, be careful you don&#x2019;t allow your very clever children to blackmail you with guilt.&#xA0; They know they have an amazing ability to pull on your heartstrings, which is why they can be masters of guilt manipulation if you let them.&#xA0; Refuse to play the game! Tell them you love them and that you are doing your best to support them (which often includes not doing for them what they can do for themselves), but that you have other commitments, interests and responsibilities besides them. &#xA0;And when you drop the odd ball (as you will), tell them you&#x2019;re just giving them an opportunity to grow more resourceful and resilient. &#xA0;Because, after all, you are.</p><p><br></p><p><strong>#5: Don&#x2019;t dilute your presence with distraction</strong></p><p>Ten minutes of your full attention is worth more to a child than hours of time spent with multi-tasking and distracted.&#xA0; Ultimately the greatest gift we have for our children is being full present to them. And while unplugging and &#x2018;turning off&#x2019; from work and other distractions can be easier said than done, it&#x2019;s important to be intentional about being fully present to your children whenever you are with them. You may be a great multi-tasker but you can&#x2019;t ever give quality focus to two things at once.</p><p>In the big scheme of life, doing what allows you, <em>your</em> children and <em>your</em> family to stay happy, good humored and connected is ultimately all that matters. &#xA0;Which is why it&#x2019;s time to lower the bar to a scalable height, get off your own back, and reclaim your right to enjoy those beautiful young people you&#x2019;ve been charged with raising into resilient, kind, brave and wonderfully imperfect adults. Just like you.&#xA0;</p><p><br></p><p><a data-cke-saved-href=\"https://www.dccjobs.com/consultants/margie-warrell\" target=\"_blank\" href=\"https://www.dccjobs.com/consultants/margie-warrell\">Margie</a> is one of our contributors, read about them all<a data-cke-saved-href=\"https://www.dccjobs.com/contributors\" target=\"_blank\" href=\"https://www.dccjobs.com/contributors\"> </a><a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a><a data-cke-saved-href=\"https://www.dccjobs.com/career-advice/become-a-contributor\" href=\"https://www.dccjobs.com/career-advice/become-a-contributor\">.</a></p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About WORK180</strong></span></h5><p>WORK180 is a <a data-cke-saved-href=\"http://dcc.staging.volcanic.net.au/job-search\" href=\"http://dcc.staging.volcanic.net.au/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"http://dcc.staging.volcanic.net.au/clients\" href=\"http://dcc.staging.volcanic.net.au/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/08","associated_company":"work180"}