{"url":"https://www.work180.com.au/blog/2018/07/10-mistakes-you-should-avoid-when-writing-to-selection-criteria","title":"10 Mistakes you Should Avoid When Writing to Selection Criteria","author":"WORK180","body":"\n\t\t\t\t\t<p>There are plenty of traps people can fall into writing responses to selection criteria. Here are ten common mistakes I&#x2019;ve noticed when reviewing applications.<br>\n&#xA0;</p>\n\n<p><strong>1. Use recent and relevant examples</strong></p>\n\n<p>While this is not always possible, for most responses select examples that have taken place in the last twelve months and are related to the role or job you are applying for. If you are applying for a policy role, pick examples that fit this context. If you are applying for a finance or human resources role, pick examples from these contexts. If you don&#x2019;t have such examples, then pick ones that show transferable skills. For example project management is a generic skill set which can be used in a wide range of contexts.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Use examples that match the level of authority</strong></p>\n\n<p>Work is organised in a hierarchy. The more senior the role, the more authority it carries. The higher up in an organisation you are, the more responsibility and accountability you have, and your work is more complex. This means you need to understand where in a hierarchy you are wishing to enter and pitch your examples to match this.</p>\n\n<p>Even if you have past experience at a more senior level, it may well be wise to ignore this experience when applying for a more junior level.</p>\n\n<p>If you are pitching for a promotion then your examples need to reflect the level of seniority of this new role.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Only include material that is relevant</strong></p>\n\n<p>It is tempting to include as much material as possible. This temptation can be driven by the assumption that more is better. In most cases this assumption is false, particularly if there is a word limit on criterion responses. Stick to the subject matter of the criterion. If it&#x2019;s about relationships, don&#x2019;t talk about how you manage your workload unless it has a direct bearing on your example.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Write about the criterion that is provided</strong></p>\n\n<p>Many government departments now use capability frameworks as criteria. Some departments use only the capability (e.g. Shapes strategic thinking), some use the capability with all the components in the framework (e.g. Shapes strategic thinking: Inspires a sense of purpose and direction; focuses strategically, harnesses information and opportunities, shows judgment, intelligence and commonsense), and some use the capability and some but not all of the components (e.g. Shapes strategic thinking: harnesses information and opportunities, shows judgment, intelligence and commonsense). When the last option is used, stick to what is provided. Do not add in other components or include responses to other components.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5. Capability components do not need separate responses</strong></p>\n\n<p>This is related to the previous point. Where a capability and components are provided you do not have to treat the components (often dot-pointed) as separate parts of the criterion. Most departments will advise applicants of this, however it can be easy to miss. Take the criterion as a whole and provide examples that touch on the components. You may only need one or two examples to cover all the points.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>6. Focus on what the criterion is about</strong></p>\n\n<p>Responses to criteria can easily go off track by starting the opening sentence with a reference to a skill set that is not part of the criterion. Apart from risking irrelevance, you are opening the opportunity for your reader to immediately think &#x2018;irrelevant&#x2019; and discard your application. When a recruiter has a large pile of applications they are unlikely to devote much time to deciphering your responses once they sense you are off-target in your response.</p>\n\n<p>To stay on track start your first sentence using the language of the criterion. If it&#x2019;s about solving problems, then start by saying something like &#x2018;I have demonstrated my problem solving skills in my roles as xxx, yyy and zzz.&#x2019;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>7. Distinguish between levels</strong></p>\n\n<p>If there are several jobs at different levels on offer that you wish to apply for, make sure you understand the differences between them. Even if the job description for an APS 3 looks much the same as for an APS 4, there will be minor, but important, differences in the wording of the criteria and responsibilities that you need to notice. While much of your application may well be the same, you may need to make some adjustments to cater for these subtle differences in expectations. If there were no differences, there would be no justification for paying them differently, so read the job description carefully for the word changes.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>8. Change abstract nouns into verbs</strong></p>\n\n<p>Responses to criteria need to be written in strong, direct language that puts you centre stage as the main actor. One aspect of writing responses that makes for a wordy, abstract response is to use abstract nouns where a verb would work better. What signals this are: using words ending in &#x2018;ion&#x2019;; using phrases with &#x2018;the&#x2019;. For example: &#x2018;During the meeting the negotiations went well. All stakeholders reached an agreement about the project and a decision was made to appoint a new project leader.&#x2019; Notice that we also don&#x2019;t know who is doing what. An alternative way of putting this is: &#x2018;During the meeting I negotiated an agreement with all stakeholders to appoint a new project leader.&#x2019;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>9. Use past rather than present tense</strong></p>\n\n<p>When describing what you do it is tempting to write in the present tense as though you are describing what you do now and all the time. Past tense works better to convey that you have demonstrated a skill. Let&#x2019;s suppose you are talking about how you work with team colleagues. You could say: &#x2018;I prioritise my tasks based on what is important for the team. When working with others I maintain high standards of performance and I proactively help others when work loads are high.&#x2019; Compare this with: &#x2018;Each day I prioritise my tasks based on what is important for the team. During three years working with this team I have maintained high standards of performance and have proactively helped others when work loads are high. This help has ensured that the team consistently met targets.&#x2019; This second version refers to a consistent set of behaviour over time, rather than what you might expect from me today.</p>\n\n<p>My experience has taught me to prioritise my tasks based on the importance and urgency of the work. When working with others and providing leadership, I encourage a high level of performance from team members and of myself, and I work proactively in a participative manner so that we all achieve our goals.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>10. Avoid sounding like you need close supervision</strong></p>\n\n<p>While it may not be your intention, using certain words and phrases create an impression that you rely on others to tell you what to do. These days most people are expected to complete their work with minimal supervision. Words and phrases like &#x2018;was required to&#x2019; and &#x2018;had to&#x2019; can create this impression. Plus, they use up more words than is necessary. An example is: &#x2018;As a financial adviser I was required to work with clients to create a financial plan. To do this I had acted in a professional manner and had to ask them questions about their views on investments and I had to find out what their goals were.&#x2019; Such writing leaves begging the question of whether you actually did any of these actions. A stronger way of putting this is: &#x2018;As a financial advisor a key role was working with clients to create a financial plan, something I completed with a diverse range of people ranging from high-income to average wage earners. To complete these plans I asked a range of questions, in a professional manner, concerning clients&#x2019; views on investments and their long-term goals.&#x2019;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Want to learn more?</strong> Read this article by Ann Villiers<a href=\"https://www.dccjobs.com/blog/2017/09/how-to-write-and-talk-to-selection-criteria-the-response-structure\" target=\"_blank\"> &quot;How to Write &amp; Talk to Selection Criteria: The Response Structure&quot;.&#xA0;</a></p>\n\n<hr>\n<h5 style=\"font-family: Lato, sans-serif;\"><strong>About the author</strong></h5>\n\n<p>Dr Ann Villiers,&#xA0;learning guide, professional speaker&#xA0;and&#xA0;author, is Australia&apos;s only&#xA0;Mental Nutritionist&#xAE; specialising in mind and language practices that help people build flexible thinking, confident speaking and quality connections with people. Visit&#xA0;<a href=\"http://www.mentalnutrition.com\" target=\"_blank\">www.mentalnutrition.com</a>&#xA0;to learn more about Mental Nutrition. Visit&#xA0;<a href=\"http://www.selectioncriteria.com.au\" target=\"_blank\">www.selectioncriteria.com.au&#xA0;</a>for free resources unlocking the mysteries of public service jobs.</p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/07","associated_companies":["work180"]}