{"url":"https://www.work180.com.au/blog/2018/11/10-pieces-of-advice-from-the-women-of-pwc","title":"10 pieces of advice from the Women of PwC","author":"Pwc","body":"\n\t\t\t\t\t<section><div><p>We asked some of the incredible women trailblazing in all areas of our work:&#xA0;<strong>What advice would you offer your younger self and young women of today?<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/90bb3260-276a-4519-8c43-9ff31cec6274.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/90bb3260-276a-4519-8c43-9ff31cec6274.jpeg\" style=\"float: right; margin: 10px;\"></strong><br><br>1. &quot;I would tell myself to have a go at everything you can, as every experience is a learning - even the bad ones! I&apos;d tell myself not to let impostor syndrome (a feeling that you don&apos;t belong in the room and that you are accidentally there due to no doing of your own) to stop you from putting up your hand and sharing your thoughts. I&apos;d also remind myself that how you feel about a situation is a choice, one that you are in control of (most of the time!). And finally - I&apos;d remind myself to have a good laugh at myself a bit more. A good sense of humour and an ability to laugh at yourself is a critical part of being successful in professional services!&quot; - Kim Challenor, Partner in Assurance.<br><br>2. &quot;Embrace your super power and wear your cape with pride. Your career will be one crazy adventure, but keep having fun and laugh often. Always stand tall, be strong and enjoy the ride.&quot; - Alice Peterson, Manager in Consulting.&#xA0;<br><br>3. &quot;Don&apos;t wait for change to happen. Be brave and empower yourself to be the change you want to see.&quot; - Carly Scudamore-Smith, Director in Financial Advisory.&#xA0;<br><br>4. &quot;It&apos;s important to be yourself. Don&apos;t try and change to fit an ideal that you think is accepted. In reality, it&apos;s your difference and uniqueness that make you stand out and add value at work.&quot; - Olympia Newman, Manager in Technology Consulting.&#xA0;<br><br>5. &quot;Get into healthy habits early and set regular life goals in your mind, body and career - balancing what is important to you, setting your boundaries and reviewing your plan every few months. Think about your network and who is going to give you the energy and drive to move forward with your various goals? Get used to making mistakes and find a way to move on quickly. Most of all, have fun! We spend a lot of time at work - keep things in perspective.&quot; - Gabi Donovan, Human Capital Team Lead in Financial Advisory.&#xA0;<br><br>6. &quot;Dream big - you can make a bigger impact, do more and go further than your dreams can imagine. Always strive for excellence, be true to yourself and act with integrity, be kind to others, stay humble, grounded and celebrate your achievements.&quot; - Kathryn Smith, Executive Assistance in Assurance.&#xA0;<br><br>7. &quot;Don&apos;t take life too seriously, enjoy a good laugh as often as you an. With the right kind of coaching and determination you can accomplish anything!&quot; - Georgina Richters, Director in PwC&apos;s Indigenous Consulting (PIC).&#xA0;<br><br>8. &quot;The best advice I would offer is say yes to every opportunity that comes your way. Even if it takes you out of your comfort zone, you never know who you&apos;ll meet or what doors will be opened by taking a change.&quot; - Mandy Ruhle, Resource Planner in Assurance.&#xA0;<br><br>9. &quot;Be yourself! I always had a perception that to be an effective leader and successful in Professional Services you had to be loud, very competitive and aggressive in deliver. However, I&apos;ve realised there are few female leaders who take a more &apos;care&apos; and soft approach to leadership, which is something I resonate with and hope to be.&quot; - Christina Lopez, Senior Consultant in Assurance.&#xA0;<br><br>10. &quot;Never be afraid in taking a step forward because you have nothing to lose and all it will do is shape and influence you as a person. Never doubt yourself as a woman because that is an asset that works towards your strength and brings so much value to all firms.&quot; - Dilani Gunawardena, Trainee in Assurance.&#xA0;</p><hr><h4><strong>About PwC&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/28d5a133-a116-45f8-aa65-f9534f88cfeb.png\" style=\"float: right; margin: 10px; width: 150px; height: 120px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/28d5a133-a116-45f8-aa65-f9534f88cfeb.png\"></strong></h4><p>With 83% of the team using some form of flexible working and 0% pay gap on like-for-like roles, it&#x2019;s not hard to see why PwC has a reputation as a great employer. To see what else is on offer, visit their employer page and then set up a job alert so you don&#x2019;t miss an opportunity. <a data-cke-saved-href=\"http://https://www.work180.com.au/clients/pwc\" href=\"http://https://www.work180.com.au/clients/pwc\">Learn more here.</a><br></p><p><br></p><hr><p><br></p><div><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div></div></section>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/11"}