{"url":"https://www.work180.com.au/blog/2016/04/10-tips-for-dealing-with-work-and-parental-leave","title":"10 tips for dealing with work and parental leave","author":"WORK180","body":"\n\t\t\t\t\t<p><em></em>As a self-professed Science Mum of three kids, I am often asked how I managed work and maternity leave, particularly by parents about to embark on a similar journey. So I thought that it might make a good topic for a blog post and start of a discussion. Here, I want to tackle things you can do as individuals for managing work and maternity/paternity leave &#x2013; both for the person going on leave (e.g. mum or dad), and their colleagues &#x2013; assuming that the person going on leave wants to maintain their academic career post-leave, including PhD students. There are other pieces for another day on what institutions should do to support those going on parental leave, and tips for coming back from leave. I refer to maternity leave but this can equally be paternity leave &#x2013; or any leave when you are taking a big chunk of time largely away from work to pursue other things in life. First, though, I&#x2019;ll preface my tips with a little about my background.</p><p>I am writing predominantly from my own experience. Briefly, I have three children (born 2009, 2011 and 2013). I took about 8 months maternity leave with each, and returned to work part-time (3-4 days a week). All three were born while I was a postdoc on fellowships, the first two in the UK and the third in Australia, with good paid maternity leave provisions, and which allowed me to return to work part-time and extend my contract pro rata. For the first baby, our family was on the other side of the world, so we had little week-by-week support, and my husband was in a very demanding full-time job; while I was on maternity leave with my second we moved back to Australia, where we both work part-time and have a lot of family help and support, which makes a huge difference. I am a conservation scientist, and my work is desk based, including modelling and analysis, plus the usual academic roles of paper and grant writing, reviewing, editing and supervising students, but no teaching at the time. So the type of work I do wasn&#x2019;t much affected by working part-time or being on leave.</p><p>For each maternity leave, I had a different &#x2018;model&#x2019; for managing work on maternity leave. With my first two, I didn&#x2019;t think much about what I wanted to do and where to set limits. In my first maternity leave, that manifested as a glorious 8 months away from work, within minimal but enjoyable contact with my colleagues (after all it is nice to talk to grown-ups), such as a few meetings with my PhD student, reading the odd draft of something, and participating in a fun workshop with my baby in tow. With my second baby, I said yes to several things with no strategy or thought, which resulted in trying to meet some difficult deadlines at bad times, feeling like I was working too much, and consequently feeling resentful. With my third baby, I made a much more conscious effort to manage work. I decided that I would do nothing for the first few months, then have semi-regular meetings with my PhD students in the second half of my maternity leave (baby in tow), and that I would also submit a grant that I started before maternity leave that was due while on leave &#x2013; the proposal required regular small efforts to pull together because I had done most of the thinking and planning with my colleagues beforehand.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/59050e2b-6e12-4204-9c1d-ebd2f65a5473.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/59050e2b-6e12-4204-9c1d-ebd2f65a5473.jpeg\"></p><p style=\"text-align:center\">Emily is a self-professed Science Mum with three children</p><p><br></p><h4><strong>Tips for a parent going on leave:<br></strong><br></h4><p><strong>1</strong><strong style=\"font-size: 16px;\">.&#xA0; &#xA0; &#xA0;Only l</strong><strong>isten to what makes sense<br></strong>My number 1 tip to new parents (or any parents) is to ignore most of the advice that people routinely and endlessly give you, particularly the non-evidence based garbage (which is almost all of it). Ignore most of it, pick out the things that make sense, and work out what works for you. Any tips I write here are things that worked for me &#x2013; they might not work for you, and that is fine too. Below is just a list of things I found useful to think about.<br><br></p><p><strong>2.&#xA0;&#xA0;&#xA0;&#xA0; Try to manage your own expectations for your leave</strong>. <br>Think about what work you might like to do while you&#x2019;re on leave, which may well be none. Adapt to how you&#x2019;re feeling (particularly because babies change all the time), but not because other people put pressure on you (see guilt, below). Start thinking about this as soon as you are pregnant (or even beforehand), because deadlines you agree to might loom many months later with bad timing (see thing to avoid, below). Consider any constraints such as things you might need to do (e.g. supervise existing postgraduate students), and deadlines for things you&#x2019;d like to do in the future (e.g. grants with annual submission cycles). Your decision about what to do can change &#x2013; you might find you can&#x2019;t cope with any work at all, or that you can&#x2019;t cope without engaging with work. Fun things can include seminars, conferences or workshops where you can wander in and out and with no pressure to participate or contribute, and meetings to keep in touch with students and collaborators (in person or on the phone &#x2013; can be done while pushing a pram). These types of activities are nice for staying in touch with people, as much as the research. See some suggestions for things to avoid below.<br><br></p><p><strong><em></em>3.&#xA0;&#xA0;&#xA0;&#xA0; Communicate.<em><br></em></strong>With my third maternity leave, what I felt I got right was communicating to everyone my intentions about what I would do, which I failed to do with the first two babies. This is really important &#x2013; whether it is telling people not to get in touch with you at all about work while you&#x2019;re away, setting an out-of-office saying you&#x2019;re out of contact until the end of the year, keeping your supervisor in the loop if you are not coping with workloads, or otherwise. I told people that I would like to receive emails, might read them, but may not respond, and set and out-of-office saying I was on leave and might eventually reply. Let people know what you want to do and how you want them to manage your absence, especially your postgraduate students, so they don&#x2019;t freak out. This can also change &#x2013; you might decide the last thing you want to do is read another email about staff meetings and teaching &#x2013; just let people know. This is largely about managing other people&#x2019;s expectations of you while you&#x2019;re on leave.<br><br></p><p><strong>4.&#xA0;&#xA0;&#xA0;&#xA0; Find out all your entitlements (and your partner&#x2019;s) and insist on them.<em><br></em></strong>Such as paid maternity/paternity leave, right to return to work part-time, extending your contract to account for these (I had terrible time with contract extensions around my first two kids and had to really fight for my rights), teaching and research support while you&#x2019;re on leave, and keeping in touch days (these are available in the UK and are great &#x2013; you can work for up to 10 days while on leave and take those days off when you return to work. I did this informally as well even when they weren&#x2019;t formally available). <br></p><blockquote><p><em>Remember, our mothers and grandmothers fought for these rights, along with unions and many men &#x2013; honour their efforts by taking up your rights. </em><br></p></blockquote><p>Get all the details in your contract straight so you can enjoy your leave. These things can take a while, so you get started early. If the policies aren&#x2019;t in place or available, ask about them &#x2013; you never know your luck &#x2013; and speak with your union. My second postdoctoral fellowship didn&#x2019;t have a policy for dealing with part-time work &#x2013; I asked about it and they wrote one. Similarly, a grant I applied for didn&#x2019;t account properly for part-time work and breaks for maternity leave, so I wrote to the granting body and they revised the guidelines accordingly. Ask your friends and influential people to help you change things that aren&#x2019;t right. You can find out what policies are in place before you apply for work by visiting the <a data-cke-saved-href=\"https://www.work180.com.au/clients/\" href=\"https://www.work180.com.au/clients/\">Best Employer page.&#xA0;</a><br><br></p><p><strong>5.&#xA0;&#xA0;&#xA0;&#xA0; Suggestion for things to avoid:</strong></p><ul><li>Don&#x2019;t say yes to anything you don&#x2019;t like or don&#x2019;t want to do &#x2013; you&#x2019;ll inevitably avoid doing it and leave it to the last minute, and run up against a deadline (see below). And don&#x2019;t feel guilty (also see below) about saying no &#x2013; you are on leave and can do whatever you like &#x2013; it is your right. One way of deciding to undertake any work is whether it will benefit your track record. If the answer is even &#x2018;maybe&#x2019;, think seriously about saying no.<br><br></li><li>Avoid deadlines, or especially short ones. The work that caused me the most trouble while on maternity leave had hard deadlines, such as paper reviews, thesis reviews and presentations at conferences or symposia. They inevitably came when the baby/child/children were going through a horror patch and not sleeping, or were sick, or I was sick. Anyway, unless you have a long run-up to the deadline and can manage it, avoid anything with a hard deadline.<br><br></li><li>Avoid things that require sustained effort and a lot of intellectual heavy lifting. Remember, you will be tired, oh so tired, even if your baby sleeps like a dream. It is very hard to think clearly and concentrate when you are tired. Don&#x2019;t rely on babies napping to get lots of work done. I hear there are mythical babies who have long daytime sleeps or are happy to lie there and play on their own (not mine!), but don&#x2019;t count on it.</li></ul><p><br></p><p><strong>6.&#xA0;&#xA0;&#xA0;&#xA0; Don&#x2019;t feel guilty.&#xA0;<em><br></em></strong>Or at least, try not to. Guilt plagues all mothers, and probably fathers. Guilt about not contributing to running the school/kindergarten fete, not doing reading in class etc. The list is endless. Don&#x2019;t feel guilty about not working, saying no to things, and taking time off during maternity leave &#x2013; it is leave after all! And also don&#x2019;t feel guilty about doing some work, going back to work or not doing the washing etc. It&#x2019;s all fine, and you are doing a good job.</p><p><br></p><h4><strong>Things you can do when your colleague is going on maternity leave:<br></strong><br></h4><p><strong>7.&#xA0;&#xA0;&#xA0;&#xA0; Ask your colleague going on maternity leave what they want you to do</strong> <strong>in terms of communication</strong>&#xA0;.<br>Do they want to be included in emails on projects (but with no pressure to reply), invited to things, or to be left alone while they are on leave? Have a frank conversation about it, and allow them to change their mind (see above). I had colleagues who continued to invite me to things and it was great &#x2013; I both accepted and rejected invitations to workshops and conferences with no sense of pressure, and enjoyed the ones I went to.<br><br></p><p><em></em><strong>8.&#xA0;&#xA0;&#xA0;&#xA0; Do little things that make a big difference</strong>. <em><br></em>I will be eternally grateful for the colleagues who got papers and grants over the line while I was on maternity leave (you know who you are!). This included co-authors getting a paper that was 95% done to submission, others doing the revisions needed to get a submitted paper accepted, and doing the onerous things on grants such as budgets and formatting so I could concentrate on writing the proposal. And actually, on a selfish level, such activities benefit you &#x2013; the paper will come out earlier, the grant is more likely to succeed, than if you didn&#x2019;t help.<br><br></p><p><strong>9.&#xA0;&#xA0;&#xA0;&#xA0; Fight for their rights.</strong> <br>I was having all manner of problems getting my contract sorted out before my second maternity leave (it dragged on for months); my supervisor wrote to the Powers That Be and helped sort it out for me &#x2013; it was a great weight off my mind &#x2013; again, eternally grateful.<br><br></p><p><strong>10.&#xA0;<em>&#xA0;</em> Provide local support. <br></strong>If you&#x2019;re organising a conference, provide a parents&#x2019; room (and if you&#x2019;re a parent going to a conference with your baby/kid, ask for one), where participants can take kids to play/feed/change while watching a broadcast of the conference so they don&#x2019;t miss out. Several mums from my lab were going to a conference together so we asked: the conference organisers provided an amazing space, with toys and books brought in by local science mums and dads. If you see a parent trying to have a meeting with a cranky baby, or just looking really tired, take the baby for a walk. And tell the mums and dads they are doing a great job &#x2013; sometimes you really need it.</p><p><em style=\"font-size: 16px;\">This article was originally published on&#xA0;<a data-cke-saved-href=\"https://womeninscienceaust.org/\" href=\"https://womeninscienceaust.org/\" target=\"_blank\">Women in Science AUSTRALIA</a>.</em><br></p><hr><span style=\"color:#A97FB1\"><strong></strong></span><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/04","associated_company":"work180"}