{"url":"https://www.work180.com.au/blog/2016/12/12-days-of-fit-mas","title":"12 Days of Fit-mas","author":"WORK180","body":"\n\t\t\t\t\t<p>It&#x2019;s impossible not to notice the hustle and bustle rising as we approach the Christmas season, with everyone feeling the pressure of completing their work projects, buying gifts and preparing for their (ideally relaxing) break.</p><p>The problem is, for most people, that busy feeling remains in their blood even once they commence their break and as they ride through Christmas and New Year&#x2019;s. They feel exhausted, rushed and completely out of balance.</p><p>The other challenge is maintaining a healthy diet, exercise and self-care regime, usually resulting in guilt and a crash-detox in January.</p><p>Even though everyone wants to feel healthy and balanced over this time, they always use the excuse of not having enough time. And don&#x2019;t worry &#x2013; I get ya! I&#x2019;m flat out as well leading up to the festive season. However, overcoming my own battle with chronic fatigue syndrome, and seeing firsthand the effects of not maintaining balance in your body and life, I know how important it is to take that time for you.</p><p>So how do you maintain a healthy balance over this Christmas season, while still keeping up with your commitments?</p><p>Well, we&#x2019;re going to do 12 Days of Christmas a bit different&#x2026; I&#x2019;ve put together a simple and convenient challenge you can do starting today, or on any 12 days leading up to Christmas, that will help you feel fit, healthy and balanced over the Christmas break, i.e., to have a &#x201C;Fit-mas&#x201D;!</p><p>How it works is every day you have 1 simple thing to do each day for 12 days (most of them taking less than 5 minutes) that will help strengthen and maintain your health and well-being.</p><p>So here are my 12 days of Fit-mas.</p><p><br></p><p><strong>DAY 1: Breathe</strong></p><p>We breathe all day every day, so why not do it in a way that actually de-stresses and balances your body?! By taking deep-belly breaths into your belly, you&#x2019;re reducing stress hormones and activating the parasympathetic nervous system (that state of relaxation and focus, where your body can function optimally). It also makes you feel incredibly relaxed.</p><p>On Day 1, allocate just 2 or 3 minutes to take 20 slow deep breaths into your belly at any time of the day and then reflect on how your mind and body feel. (Note: If you feel tired afterwards, that could be a sign your body is running on adrenalin &#x2013; because the breathing reduces adrenalin &#x2013; so this will benefit you even more!)</p><p><br></p><p><strong>Day 2: Be grateful</strong></p><p>As a corporate wellness consultant and speaker, I&#x2019;m always asked by busy employees how to feel more positive about their busy, demanding life. Many of them are exhausted, anxious and disengaged. My number 1 tip for enhancing positivity instantly is being grateful. With our linear brains, we can only focus on 1 thing at a time. So if we redirect our focus to thinking about what we&#x2019;re grateful for, that immediately shifts our perspective to feel happier and more satisfied.</p><p>On Day 2, allocate 5 minutes to write down 3 things you&#x2019;re grateful for, along with WHY you&#x2019;re grateful. That is, how does this make you feel? For example, if you&#x2019;re grateful for a person, why? How have they made you feel that was so memorable or special? And if you&#x2019;re grateful for where you live, why? Has it made you feel safe or are you near a beach or nature, which means you get to breathe in fresh air, etc&#x2026; You get the idea.</p><p><br></p><p><strong>Day 3: Feel</strong></p><p>We are so caught up in our minds, over-thinking and over-analysing so much of our lives. In this process, our bodies get left behind and many of us have lost the mind-body-soul connection that allows us to truly feel what&#x2019;s going on in our bodies and what our bodies need to be healthy and thrive. By taking time to feel rather than think, we&#x2019;re giving ourselves the opportunity to better understand what our bodies need, while at the same time, taking a break from the constant mental chatter up in our minds that drives a lot of people crazy!</p><p>On Day 3, allocate 5 to 10 minutes (or more if you can) to lie down, relax and do a body scan, feeling deeply into your body from your toes up to your head. Spend a few deep breaths at each part of your body as you scan your way up, simply asking yourself, what I do feel here? There is no right or wrong, good or bad; this is purely an exercise to re-introduce you to the feelings of your body. And remember if your mind wanders, you haven&#x2019;t failed this task. There is no failing, only experimenting. If your mind wanders, just redirect your focus back to your breath and body each time.</p><p><br></p><p><strong>Day 4: Nourish</strong></p><p>Even though you&#x2019;re bound to be enjoying lavish dinners and drinks during the Christmas season, it&#x2019;s important to maintain some balance in your diet. Balance doesn&#x2019;t have to mean avoid all sugar and alcohol (because let&#x2019;s face it, half of you would stop reading this if I told you to do that! J). Balance does however mean that you do things in moderation and ensure you drink lots of water and eat plenty of fruit and veg throughout the next few weeks (and that doesn&#x2019;t include the pineapple in your pina colada!). This will ensure you&#x2019;re still getting the nutrients required to detoxify those extra chemicals out of your system, while also giving you energy to handle the demands of the busy period.</p><p>On Day 4, ensure you&#x2019;re drinking plenty of water (around 2L depending on activity levels and body type) and also add in at least 5 serves of vegetables and 2 of fruit. Keep it simple if you&#x2019;re not a fan of cooking by grabbing a smoothie or juice, or buying a salad with plenty of veg for lunch.</p><p><br></p><p><strong>Day 5: Dialogue</strong></p><p>The mind is a funny thing&#x2026; particularly when it reaches the status of monkey mind and makes us do things we know we shouldn&#x2019;t. That&#x2019;s because there is a direct link between what you say to yourself, how you feel and then how you behave. The mind will take what you tell it as TRUTH and then guide you in that direction through your actions. It does this for our safety. By linking everything to PAIN or PLEASURE, the mind can protect us from danger and move us towards safety. For example, if you say to yourself &#x201C;I NEED to eat chocolate to make me feel better&#x201D;, you&#x2019;ll feel deprived if you say no and you&#x2019;ll probably end up eating the chocolate. If you say &#x201C;I&#x2019;m just not that smart&#x201D; or &#x201C;I&#x2019;m just not pretty&#x201D;; you&#x2019;ll feel upset with low confidence and you&#x2019;ll likely avoid putting yourself out there (relationships, parties, work promotions etc) where people could potentially judge you.</p><p>On Day 5, allocate 10 minutes to start becoming familiar with your current dialogue in one area of your health or life you want to change. For example, food, work, exercise, relationships, or stress. Write down what you currently say to yourself, and then re-phrase those sentences to be more positive to motivate you to a better state of mind. For example, instead of &#x201C;I NEED chocolate to feel good&#x201D;; you might say &#x201C;I CHOOSE to eat healthy, light foods because I WANT to feel healthy and fit, and I&#x2019;m HAPPY to leave the chocolate because I prefer to feel happy about what I&#x2019;ve eaten&#x201D;. This puts the control back in your court and allows your mind to realise that this healthy habit is actually what you want.</p><p>Write out your new dialogue and say it out loud, ideally for the next 21 days to turn this new belief into a habit.</p><p><br></p><p><strong>Day 6: Thank you</strong></p><p>When someone recognises and rewards something you&#x2019;ve done, how do you feel? Proud? Valued? &#xA0;Imagine if you could spark that feeling in someone else today! Well, you can. By saying thank you and recognising the good work of others, that person will feel valued, respected and loved. And you get to feel awesome for making that person&#x2019;s day better!</p><p>On Day 6, allocate 5 minutes (or longer if you want to do this in more detail) to write someone a thank you letter for something they&#x2019;ve done or said for you or a loved one. Let them know how that improved your life so they can really get a sense for how valued their good deed is. Now I&#x2019;m realistic, so if you don&#x2019;t want to hand write a letter, an email will do. Just make sure it&#x2019;s a bit more genuine and heart-felt than &#x201C;Hey mate, thanks for that. See ya.&#x201D; J Then reflect on how good it feels, particularly when they say thanks for the thank you!</p><p><br></p><p><strong>Day 7: Chew</strong></p><p>We always eat in such a rush. Some people eat while driving, others while working at their desk, others while running out of the house or getting their kids ready. However, when you eat too fast, you not only increase the chance of not digesting your food properly and then feeling more bloated, you also end up EATING MORE. That&#x2019;s because when you eat quickly, your body produces less of a hormone called leptin which is needed to signal to your brain that your satisfied. The key therefore is eating slower and more mindfully.</p><p>On Day 7, focus on eating more mindfully by chewing each mouthful slowly and being grateful for every mouthful. I want you to focus less on the number of chews, and more on the gratitude for the food in your mouth and the enjoyment of each mouthful. That in itself will slow down your chewing. Then notice if you feel differently about the food or your appetite. There&#x2019;s no right or wrong, just notice.</p><p><br></p><p><strong>Day 8: Love</strong></p><p>&#x201C;What&#x2019;s the meaning of life?&#x201D; That&#x2019;s a hard one for anyone to answer and it certainly brings up debate. But if you ask me, I think one of the most important reasons we&#x2019;re here is to love; love others and ourselves. Because ultimately, being in love and sharing love and feeling loved brings more joy than most other things on this planet. Sometimes we can take the ones we love for granted because we get caught up with so many other things we&#x2019;re doing. So your task is&#x2026;.</p><p>On Day 8, say &#x201C;I love you&#x201D; to 5 people. That could be a partner, child, sibling, parent, friend, grandparent, or anyone you feel called to say it to. For some of you, this may be hard because maybe you haven&#x2019;t said &#x201C;I love you&#x201D; to anyone let alone 5 people for a long time. So if that&#x2019;s you, first TRY your hardest to do it. But if you can&#x2019;t get 5, instead get a pen and paper and reflect on the people in your life you love and feel loved by, finding a way to at least tell them that you appreciate them. (Hint: one of the 5 can be yourself! I once heard a quote that you&#x2019;re not compassionate or kind unless you can give kindness and love to yourself, not just others! I couldn&#x2019;t agree more.)</p><p><br></p><p><strong>Day 9: Move</strong></p><p>There&#x2019;s a reason everyone tells you to exercise. Its critical for the health and strength of your body, such as maintaining a healthy metabolism, detoxification, circulation and energy. But it also helps to release cortisol; one of your stress hormones, leaving you more relaxed and balanced (and ensuring you don&#x2019;t let out all that anger on your loved ones).</p><p>On Day 9, allocate as much time as you want to moving your body in a way that&#x2019;s fun and convenient for you. You may exercise all the time, in which case, you can simply keep doing what you&#x2019;re doing. But if you don&#x2019;t have a regular exercise routine, then take time today to do at least one type of movement. This could be a gentle walk or a run at lunchtime, going to the gym, playing a sport, or even dancing in your living room.</p><p>Confession Time: when I don&#x2019;t have time to get out for my exercise, I put on some loud music in the evening and dance around the house for ten minutes. I tell you, I sweat more doing that than when I go to the gym! ;-)</p><p><br></p><p><strong>Day 10: Play</strong></p><p>I find it so disappointing that MOST clients I&#x2019;ve spoken to say they don&#x2019;t do anything FUN in their life anymore. Maybe it&#x2019;s because of a new job, or family commitments, or something else, but when you don&#x2019;t have FUN in your life, you lose passion and motivation for life. This DIRECTLY impacts your well-being.</p><p>On Day 10, allocate time to doing something FUN, anything at all that puts a smile on your face and brings you joy. For me, it&apos;s playing music, or going to the beach, or visiting a caf&#xE9; and enjoying a delicious tea or healthy dessert. You can do this by yourself or with someone else. As long as afterward, you&#x2019;re smiling from ear to ear and can say with hand-on-heart that you had so much fun!</p><p><br></p><p><strong>Day 11: Earth</strong></p><p>One of the most wonderfully relaxing and energising activities is being close to nature. Some scientists are big advocates for &#x201C;earthing&#x201D; or &#x201C;grounding&#x201D;, which means connecting your bare skin with the earth&#x2019;s surface (e.g., sand or grass). The idea is that connecting with the earth passes negative electrons from the earth to your body, which can neutralise positive electrons and toxins, reducing inflammation and fatigue. They have equipment that shows the reduction in your electrical activity level when being connected with the ground &#x2013; you can learn more here in an interview with Dr Stephen Sinatra. There isn&#x2019;t a lot of evidence around this topic other than case studies and a few studies because it hasn&#x2019;t received much funding to be fully looked into. Either way, when I personally spend time in nature, sitting on the grass or walking barefoot along the sand, I feel my body relax and feel more balanced instantly, lifting my mood for the day. It was one of my tools to re-energise my body when overcoming chronic fatigue syndrome, and something I do now to maintain balance in my body.</p><p>On Day 11, allocate 20 minutes (or more if you have time) to connect your body to the Earth. This could be walking along the sand barefoot (which I do a few mornings a week before work &#x2013; amazing to see the sun-rise), sitting on the grass outside your work at lunch time, with your bare feet or hands connecting with the grass, or playing in your backyard with the kids during the day or evening. Notice how you feel after taking deep breaths of fresh air and being close to nature.</p><p><br></p><p><strong>Day 12: Gift&#xA0;</strong></p><p>Well done for getting to day 12 of this challenge! Take a moment to reflect on how you feel. Just like you said thank you and rewarded your friend on Day 6, it&#x2019;s important to say thank you and reward yourself for doing something amazing for you.</p><p>On Day 12, give yourself a gift. It can be absolutely anything at all that makes you happy. It could be a Christmas present you already had your eye on to get for yourself; it might be a facial or massage; it may be going out to coffee or dinner with your fave friend; or it might even be the gift of time: allocating some well-deserved me-time to have a bath, watch your favourite movie or go to your favourite yoga class you just haven&#x2019;t got round to over the last few weeks.</p><p><br></p><p><strong>Next Steps</strong></p><p>Congratulations on doing the 12 days of Christmas. If you&#x2019;ve loved doing any of these tasks, you can keep them up for as long as you like, enhancing your health and well-being over the long term.</p><p>If you want to explore one of these areas in more detail, take advantage of my Christmas offer, with 20% off private health consultations and meditation / yoga classes. To find out more or to book, email rosanna@recipeforhealth.com.au. Offer ends 14th Dec.</p><p><br></p><p>If you want to see your workplace energised and motivated in the New Year, ask us how to get involved in our Enable2017 events: a holistic mix of well-being, resilience, culture and performance to get the team performing at their peak throughout the new year. Email&#xA0;<a data-cke-saved-href=\"mailto:rosanna@recipeforhealth.com.au\" href=\"mailto:rosanna@recipeforhealth.com.au\">rosanna@recipeforhealth.com.au</a>&#xA0;and we will send you the itinerary and details.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p><p>Originally posted on&#xA0;<a data-cke-saved-href=\"http://recipeforhealth.com.au/2016/11/24/12-days-of-fit-mas/\" href=\"http://recipeforhealth.com.au/2016/11/24/12-days-of-fit-mas/\">Recipe for Health</a>.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/12","associated_company":"work180"}