{"url":"https://www.work180.com.au/blog/2018/04/3-baby-steps-to-create-a-great-workplace-for-yourself","title":"3 Baby Steps to Create a Great Workplace for Yourself","author":"WORK180","body":"\n\t\t\t\t\t<p>Do you love your job? Do you like the way you work? Do you have the ability to manage your work and life commitments?</p><p>If you answered yes to that, I celebrate you and the actions you have taken to get there. You and I both know that all of the pieces of the puzzle of lifethe pieces in our life puzzle didn&#x2019;t just fall into place magically. You made decisions and you took actions, maybe even faceding a few risks along the way.</p><blockquote><p><em>But if you are like most people and answered no, then I would like to challenge you to make a change. </em></p></blockquote><p>Not the &#x2018;I&#x2019;m going on a diet so I will only eat cabbage for six weeks&#x2019; type of change.</p><p>I&#x2019;m talking about taking &#x2018;small non-threatening baby steps every day&#x2019; kind of change that will have you looking back in six months and wondering how on earth you did what you are doing now?!</p><p><br></p><h4><strong>Step 1. Identify what you desire to do?</strong></h4><p>Have a think about, and then write down exactly what you want from your paid work. Be really specific here.&#xA0; What needs to change might be really small or really big. Your wish list might include something like:</p><ul><li>A 9 day fortnight so I can spend one day a fortnight honing my writing skills for the book I&#x2019;ve always wanted to write</li><li>Start work at 9.30am instead of 9am so that I can take my kids to school</li><li>Have a workplace mentor / sponsor so that I can progress my career</li><li>Be paid the same as my male colleagues or be paid what I am worth</li></ul><p>This is not meant to be your perfect life list, just keep the focus on work.</p><p><br></p><h4><strong>Step 2. </strong><strong>Identify</strong><strong> &lt;who&gt; offers it?</strong></h4><p>These days most people start job hunting by using a generalist job listing site. If you are lucky, you may find a job listing in your field that has a line hidden somewhere in the job description about it being a great place to work.</p><p>There are thousands of organisations out there &#x2013; big, small and in-between. Finding the time to research all of them&#x2026; really, who has time for that!&#xA0;</p><blockquote><p><em>I propose that we turn the process upside down and start by finding companies that have put in the time, resources and commitment because they want to attract YOU &#x2013; the top talent.</em></p></blockquote><p>There are employers who really do walk their talk, and they are being certified independently so that you can trust that they do what they say they do.</p><p>So now that you know what it is you are looking for in a workplace and an employer (from step 1), you can narrow down your search list using this table:</p><p><br></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"><tbody><tr><td style=\"width:300px;\"><h4><strong>Requirement</strong></h4></td><td style=\"width:300px;\"><h4><strong>Endorsed By</strong></h4></td></tr><tr><td style=\"width:300px;\"><p>Flexible Work Arrangements</p></td><td style=\"width:300px;\"><p><a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">Flex Able</a><a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\"> Certified Employers</a></p></td></tr><tr><td style=\"width:300px;\"><p>Supportive of Women</p></td><td style=\"width:300px;\"><p><a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">WORK180 Endorsed Employer</a><a data-cke-saved-href=\"https://www.dccjobs.com/clients/\" href=\"https://www.dccjobs.com/clients/\">s</a></p></td></tr><tr><td style=\"width:300px;\"><p>Pay Equality</p></td><td style=\"width:300px;\"><p><a data-cke-saved-href=\"https://www.wgea.gov.au/pay-equity-leadership/meet-our-pay-equity-ambassadors\" href=\"https://www.wgea.gov.au/pay-equity-leadership/meet-our-pay-equity-ambassadors\">Equal Pay Ambassadors</a></p></td></tr><tr><td style=\"width:300px;\"><p>Employers of Choice for Women</p></td><td style=\"width:300px;\"><p><a data-cke-saved-href=\"https://www.wgea.gov.au/employer-choice-gender-equality/current-eocge-citation-holders\" href=\"https://www.wgea.gov.au/employer-choice-gender-equality/current-eocge-citation-holders\">WGEA&#xA0; Employer of Choice for Gender Equality (EOCGE) Citation holders</a></p></td></tr></tbody></table><p><br>Click on a company logo on the <a data-cke-saved-href=\"https://www.dccjobs.com/clients/\" href=\"https://www.dccjobs.com/clients/\">Best Employer page</a> to identify the support WORK180&apos;s Endorsed Employers for Women offer. Each employer has given their answers to a list of criteria to help you find a workplace with the support you are looking for.&#xA0;</p><p><br></p><h4><strong>Step 3. Write down what you have to offer</strong></h4><p>Yes, that means your resume!</p><p>Everyone needs one, and most people have an outdated, non-current version. I&#x2019;m not sure there is a person on the planet who loves resume writing (okay maybe &#x2026;. We know <a data-cke-saved-href=\"http://www.dccjobs.com/what-women-want/support-network/professional-service-providers/career-swag\" href=\"http://www.dccjobs.com/what-women-want/support-network/professional-service-providers/career-swag\">Amanda from Career Swag</a> does :))</p><p>Think of your resume as your golden ticket to get yourself in front of a potential employer. Every resume will be different and every resume needs to be just as polished as you are.</p><p>I challenge you to dust off your resume, or open your resume file on your computer and spend 15 minutes every week adding something new or updating something on it. Chunk this down into small pieces and expect it to take a couple of months to be polished.</p><p>For most people, talking about themselves is tough. But talking about how great you are and your key achievements is &#x2018;off the charts&#x2019; tough for most people.</p><blockquote><p><em>By breaking this task down into small pieces it can reduce the level of fear that &#x2018;doing my resume&#x2019; brings up in people</em>.</p></blockquote><p>Instead of spending the next six months complaining being frustrated about&#xA0;what isn&#x2019;t working so well with your job work, invest the next six months in making small, incremental changes that will add up to something amazing at the end.</p><p><br></p><h4><strong>Bonus tip - Download a free resume template</strong></h4><p>WORK180&#xA0;is here to help you on this journey -<a data-cke-saved-href=\"https://www.facebook.com/groups/dccwomensnetwork/files/\" href=\"https://www.facebook.com/groups/dccwomensnetwork/files/\"> if you are looking for a resume template you can download one from WORK180&#x2019;s Facebook Group</a>. There are plenty of documents uploaded in the<a data-cke-saved-href=\"https://www.facebook.com/groups/dccwomensnetwork/files/\" href=\"https://www.facebook.com/groups/dccwomensnetwork/files/\"> &#x2018;Files&#x2019; section</a> of the group and you might find a lot of useful info there including how to develop your personal brand! Please also feel free to ask the group any career-related questions- we are all in it together!</p><p><br></p><hr><h3><strong>About the author&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/93df967a-d2b9-481e-9f4c-b87c45078a2e.jpeg\" style=\"float: right; margin: 10px; width: 205px; height: 200px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/93df967a-d2b9-481e-9f4c-b87c45078a2e.jpeg\"></strong></h3><p>Christina Smerdon is the Chief Flex Enabler at WORK180. She certifies employers who wish to qualify for the <a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" class=\"\">Flex Able</a><a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\"> Certification.&#xA0;</a>She has a keen interest in driving the flexible work agenda and believe that it is the way of the future.</p><p><br></p><p><br></p><hr><p>&#x200B;</p><p>&#x200B;</p><div><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/04","associated_companies":["work180"]}