{"url":"https://www.work180.com.au/blog/2017/09/3-reasons-why-pyramids-are-a-myth-for-women","title":"3 Reasons Why Pyramids are a Myth for Women","author":"WORK180","body":"\n\t\t\t\t\t<p style=\"text-align:justify\">I&#x2019;m reading &#x2018;<a data-cke-saved-href=\"https://www.newsouthbooks.com.au/books/stop-fixing-women/\" href=\"https://www.newsouthbooks.com.au/books/stop-fixing-women/\" target=\"_blank\">Stop Fixing Women</a>&#x2019; by&#xA0;<a data-cke-saved-href=\"https://www.linkedin.com/in/catherine-fox-6b772216/\" href=\"https://www.linkedin.com/in/catherine-fox-6b772216/\" target=\"_blank\">Catherine Fox.</a>&#xA0;One of the many quotes in the book that resonated with me is from James Sutherland, CEO, Cricket Australia. He says that the talent development pathway for women playing cricket is &#x2018;<em>a bit like the Eiffel Tower, and the men&#x2019;s is like a pyramid</em>.&#x2019; Fox says, &#x2018;<em>this sounds a lot like the pathway for women into senior management jobs in most organisations</em>.&#x2019; I agree wholeheartedly, here&#x2019;s why.</p><p style=\"text-align:justify\"><br></p><h4 style=\"text-align:justify\"><span style=\"color:#a87eb1\"><strong>Getting Stuck on a Platform</strong></span></h4><p style=\"text-align:justify\">The&#xA0;<a data-cke-saved-href=\"http://www.engineering.com/Library/ArticlesPage/tabid/85/ArticleID/62/Eiffel-Tower.aspx\" href=\"http://www.engineering.com/Library/ArticlesPage/tabid/85/ArticleID/62/Eiffel-Tower.aspx\">Eiffel</a>&#xA0;Tower has three platforms on the way to the top for sightseers to stop, rest and enjoy the view. Women start their career ascent believing it to be their own career pyramid, only to discover, too late, that it&#x2019;s an Eiffel Tower-like system with two or more &#x2018;career platforms&#x2019; where they get stuck. In fact, they don&#x2019;t get stuck, they encounter warden-like barriers, at each platform attempting, successfully as it turns out, to thwart any further rise.</p><p style=\"text-align:center\"><img alt=\"Eiffel Tower AW colours (transp background)\" data-cke-saved-src=\"https://michelleredfern.files.wordpress.com/2017/06/eiffel-tower-aw-colours-transp-background.png?w=300&amp;h=251\" src=\"https://michelleredfern.files.wordpress.com/2017/06/eiffel-tower-aw-colours-transp-background.png?w=300&amp;h=251\" style=\"height:auto; margin-left:auto; margin-right:auto; width:300px\"></p><h4 style=\"text-align:justify\"><span style=\"color:#a87eb1\"><strong>The 3 C&#x2019;s &amp; 3 B&#x2019;s</strong></span></h4><p style=\"text-align:justify\">Why do women get stuck at each of the platforms? &#xA0;What are the barriers the system put in place? &#xA0;Expectations about the role women fulfil are typically the culprits. I call these the&#xA0;<strong>3 C&#x2019;s</strong>&#xA0;&#x2013; cooking, cleaning &amp; caring. In other words,&#xA0;<a data-cke-saved-href=\"https://www.wgea.gov.au/learn/womens-work-mens-work\" href=\"https://www.wgea.gov.au/learn/womens-work-mens-work\">&#x2018;women&#x2019;s work</a>.&#x2019; &#xA0;There are three other examples I encounter regularly in my gender diversity consulting practice, which I am now calling the&#xA0;<strong>3 B&#x2019;s</strong>;</p><ol><li><p>Th<strong>e Double Bind:&#xA0;</strong>some women I worked with recently spoke about feedback they receive like &#x2018;<em>how about you dial down the ambition.</em>&#x2019; Women who demonstrate ambition and assertive behaviours are viewed as pushy and unlikable. Women who have collaborative and relational interpersonal skills are viewed as feminine, likeable but ineffective leaders and not candidates for advancement.</p></li><li><p><strong>Benevolent Bias</strong>: the assumption that women will not (or should not) disrupt their lives and families to take on stretch roles. Women are excluded by managers from talent development programs or roles that require longer hours, frequent travel or global mobility. Women say to me, &#x2018;<em>let&#xA0;ME&#xA0;make that choice, I don&#x2019;t want my manager/organisation making decisions for by assuming my circumstances and mindset.</em>&#x2019;</p></li><li><p><strong>The Old Boys Club</strong>: Men have access to informal business networks from the outset of their careers. Sports events, golf days, the early morning lycra-clad bike riding group and drinks at the pub after work are all examples of the informal networks that benefit men, because this is where business gets done. These are networks that women are typically excluded from and where the prevailing belief about leadership of male, Anglo-Celtic, middle-aged and A-type personality is consistently reinforced.</p></li></ol><p><br></p><h4 style=\"text-align:justify\"><span style=\"color:#a87eb1\"><strong>3 Ways to Act</strong></span></h4><p style=\"text-align:justify\">If you are a Board Chair, CEO or executive leader reading this article and have a niggle of recognition about one or more of these factors, then it&#x2019;s time to act. Here are three things you can do, right now:</p><ol><li><p><strong>Get Informed</strong>: Ask yourself, what are the current numbers of women at all levels in my organisation? Where do the career &#x2018;platforms/plateaus&#x2019; emerge for women? What is it like to work here for women? You may not be leading the organisation you think you are!</p></li><li><p><strong>Get Serious</strong>: Examine and refine your organisations gender policies. Set targets to achieve gender balance. Be transparent with your people about the current state for women in your organisation and why it needs to change for the better.</p></li><li><p><strong>Get Done</strong>: the saying done is better than perfect has never been truer. Make all your leaders accountable for gender diversity.&#xA0;<strong><em>Now</em></strong>. Allocate resources to diagnose, design and deliver your gender diversity plan.&#xA0;<strong><em>Now</em></strong>. Be an active champion and executive sponsor.&#xA0;<strong><em>Now</em></strong>.</p></li></ol><p><br></p><h4 style=\"text-align:justify\"><span style=\"color:#a87eb1\"><strong>Designing for&#xA0;</strong><strong>Diversity</strong></span></h4><p style=\"text-align:justify\">There is enough research and more reasons than we have had hot dinners about why organisations of all sizes and sectors should pursue a gender balanced workplace. However, taking those first steps to act is sometimes easier said than done. I work with organisations to help them get started, by diagnosing, designing and delivering an enduring and sustainable gender diversity strategy. &#xA0;By using Design Thinking&#x2019;s&#xA0;<a data-cke-saved-href=\"http://www.designingforgrowthbook.com/\" href=\"http://www.designingforgrowthbook.com/\">D4G</a>&#xA0;model, a simple 4 step process for solving problems, I assist organisations to create gender equal organisations with great cultures and even better performance outcomes.</p><p style=\"text-align:justify\">If you would like to transform your organisation from one that resembles the Eiffel Tower to one that looks, feels and behaves like a career pyramid for&#xA0;all&#xA0;your people, not just some, then act now.</p><p style=\"text-align:justify\"><br></p><h4><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with <a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a> now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/09","associated_companies":["work180"]}