{"url":"https://www.work180.com.au/blog/2015/09/3-simple-ways-to-impress-a-retail-hiring-manager","title":"3 Simple Ways to Impress a Retail Hiring Manager","author":"WORK180","body":"\n\t\t\t\t\t<p>Thank you to everyone who&#x2019;d sent in ideas for our next article- this week&#x2019;s topic was suggested by Michelle Larsen from Melbourne. More ideas welcome- please send to dcc@diversecitycareers.com</p>\n\n<p>As we recently welcomed out first retail client (and our favorite clothing brand!) Cue Clothing, we thought it would be a great opportunity to share some tips specific to the retail industry.</p>\n\n<p>Besides putting effort into your resume, here are the top three things that retail hiring managers look for:</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Impeccable first impressions</strong></p>\n\n<p>As with any role, it&#x2019;s crucial to present yourself well, however it&#x2019;s even more important in a customer facing role. Customer service is the top priority for retailers and if you can demonstrate this at your first interaction, you will be off to a great start. Common courtesy, friendliness and cheerful attitude goes a long way.</p>\n\n<p>Pay careful attention to your interview outfit and wear something that reflects the style of the shop- make it easy for the manager to imagine you blending into the team. Even better, if you are truly passionate about the brand, wear something from the latest collection if interviewing with a fashion retailer.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Do your research</strong></p>\n\n<p>If it&#x2019;s a familiar brand, practice some of the things you may say in the interview to indicate your personal passion for the brand. If you don&#x2019;t know the retailer well, consider going into the store prior to the interview and explore it as a customer, while looking for potential improvements you&#x2019;d make if employed there. In addition, you can highlight your experience at a similar store or focus on other qualities that are universally important such as customer service and sales success.</p>\n\n<p>This will put you in a great position of being confident and able to ask and answer questions, impressing the interviewer with your interest in the business.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Polish your online presence</strong></p>\n\n<p>A personal brand is important and can help you stand out when searching for a managerial role in the retail industry. Decide what you&#x2019;d like to be known for and work towards that goal through every interaction you have online and in person. Building up your networks online will make it easier to become a thought leader in a topic of your choice.</p>\n\n<p>You are probably thinking &#x201C;easier said than done!!&#x201D; and you are not alone-that is the common perception of developing your personal brand. If you find the thought daunting or are already working on a personal brand, you might be interested in our upcoming free webinar with DCC cofounder Gemma Lloyd, where she&#x2019;ll outline some simple tips to get you started.</p>\n\n<p>Register here for the webinar and don&#x2019;t forget to check out the retail jobs on DCC!</p>\n\n<p>&#xA0;</p>\n\n<p>Happy job hunting!</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2015/09","associated_company":"work180"}