{"url":"https://www.work180.com.au/blog/2016/07/3-things-all-women-in-it-must-know","title":"3 things all women in IT must know","author":"WORK180","body":"\n\t\t\t\t\t<p>If someone asked you to think of a typical person working in IT, what would you picture?1&#xA0;Some of us might envision the hooded, jean wearing &#x2018;bro&#x2019; of Silicon Valley. Others the nerdy, introverted male who lives off of energy drinks and fast food.</p>\n\n<p>Well, it&#x2019;s time we all started to envision something else. It&#x2019;s no secret that while the IT industry is currently under-represented by females with only 30% making up the entire workforce in Australia, the culture is changing.</p>\n\n<p>If you&#x2019;re a woman in IT, it&#x2019;s time to realise that the industry is a brilliant place for us to thrive and there are few things that support this. Below are 3 that all women in IT must know:</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. WHO CARES IF YOU CAN&#x2019;T CODE.</strong></p>\n\n<p>Times are changing, no longer are forward thinking organisations looking at technical ability alone to promote staff. Many are focussing on the importance of softer skills as these are crucial for leading high performance teams. To lead a team effectively and deliver outstanding results, you need to be able to motivate them, coordinate them and articulate the vision to drive passion within the team. Being able to write code isn&#x2019;t as important as focussing the team and after all, the team is there to do the technical work. So don&#x2019;t be afraid to go for that promotion!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2. BE PICKY WHO YOU WORK FOR.</strong></h4>\n\n<p>Never before has there been a better time for women in IT to &#x2018;cherry pick&#x2019; their employer. It&#x2019;s a key strategic initiative for many great organisations to diversify their workforce as they realise the value that men and women working together brings. Organisations such as&#xA0;<a href=\"http://www.diversecitycareers.com/thoughtworks\">ThoughtWorks</a>,&#xA0;PwC, and&#xA0;EMC&#xA0;have a fantastic company culture in place that supports women and encourages them to fulfil their potential. If you&#x2019;re working for an archaic, hierarchical &#x2018;boys club&#x2019;, time to move on and leave those companies for the ones that deserve you.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3. IT IS THE PERFECT INDUSTRY IF YOU WANT TO START A FAMILY.</strong></h4>\n\n<p>What is the one thing that has enabled mothers (and fathers for that matter) to be able to work flexibly or from home? IT.</p>\n\n<p>The top IT companies realise that embracing technology to allow flexible working arrangements will allow them to attract and retain top talent. There are still many companies out there that shun the thought of allowing someone to work from home (of course people only want to do this so they can watch TV all day, right?).</p>\n\n<p>But for most organisations actually keeping up with the times, they realise that parents can be the most productive people out there, particularly when working from home. The popular saying &#x201C;If you want something done, ask a busy mum&#x201D; is true for a reason. Mothers (and fathers) are great at prioritising and dealing with multiple dramas!</p>\n\n<p>&#xA0;</p>\n\n<p>So as a woman in IT, it&#x2019;s time to ask yourself if the company you work for shares the above values that many now have. Is your employer supportive and encouraging of your career? Will they support you to move up the career ladder or if you want to start a family?</p>\n\n<p>At DCC Jobs, we only advertise organisations that are truly committed to supporting women&#x2019;s careers.&#xA0;<a href=\"/job-search\">Click here</a>&#xA0;to view and apply for available tech jobs with DCC Jobs endorsed employers.</p>\n\n<p>Remember, don&#x2019;t settle for anything less than a supportive culture!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","gender equality"],"upload_date":"2016/07","associated_company":"work180"}