{"url":"https://www.work180.com.au/blog/2016/02/3-ways-to-deal-with-working-mother-guilt","title":"3 Ways to deal with working mother guilt","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published on <a data-cke-saved-href=\"http://www.thebusinesswomanmedia.com/3-ways-to-deal-with-working-mother-guilt/?utm_campaign=coschedule&amp;utm_source=facebook_page&amp;utm_medium=The%20Business%20Woman&amp;utm_content=3%20ways%20to%20deal%20with%20working%20mother%20guilt\" href=\"http://www.thebusinesswomanmedia.com/3-ways-to-deal-with-working-mother-guilt/?utm_campaign=coschedule&amp;utm_source=facebook_page&amp;utm_medium=The%20Business%20Woman&amp;utm_content=3%20ways%20to%20deal%20with%20working%20mother%20guilt\">The Business Woman Media </a>website.</p><p>Most working mothers I know &#x2014; myself included &#x2014; are in a constant battle with ourselves. We tend to question ourselves often and feel guilty about not being the &#x2018;perfect parent&#x2019;. This is a struggle that gets worse when you return to work after having a baby, and never seems to get easier. Not every day is a perfect scenario of domestic bliss &#x2014; clean house, well behaved children and a relaxed atmosphere. Let&#x2019;s face it, that world doesn&#x2019;t exist&#x2026; so we need to learn how to balance everything without constantly beating ourselves up.</p><blockquote><p><em>I&#x2019;m a single parent to a teenage boy and have felt these emotions a lot, especially when launching a new business with a business partner and running another business on my own. Here are three strategies that work for me.</em></p></blockquote><p><br></p><h4><strong>1. Focus on the good stuff</strong></h4><p>We mothers always find something to feel bad about, and if you let yourself fall into the trap of negative thinking, it can spiral on and on. Instead, focus on the good things. When you catch yourself reminiscing about your failure to include all the food groups in today&#x2019;s lunchbox or that time you screamed at the kids, stop yourself and re-frame your thinking.</p><p>Find the positives in every day, and think about the great things you do for the family, such as the nice dinner you are planning to cook tonight, bedtime stories you will read, or the trip to the zoo last weekend. You could also start each day with a &#x2018;gratitude list&#x2019;. All those little things count and make for a happy home.</p><p><br></p><h4><strong>2. Create opportunities for connection</strong></h4><p>Today&#x2019;s culture is centred on busyness and we are inundated with social media notifications and work emails. It&#x2019;s no wonder that quality &#x2018;family time&#x2019; often suffers from these distractions.</p><p>It&#x2019;s important to remind yourself to be present during each interaction with your children. I often drift off while my teenager is taking me through a play by play recollection of his latest video game, but make an effort to listen as it&#x2019;s important to him. There&#x2019;s nothing worse than speaking to someone while they furiously type on their phone.</p><p>You can also create rituals for quality time. For example, we like to walk to our gym sessions instead of driving. This might take longer, but creates an opportunity to talk about all kinds of things as we enjoy the fresh air. There are no distractions, and sometimes all the kids need is your undivided attention.</p><p><br></p><h4><strong>3. Treat yourself</strong></h4><p>Last but not least, this is very important for everyone&#x2019;s sake. I have a close friend who absolutely never treats herself, rather buys things for her three children and her husband, always leaving herself out. I wish she could see how much she deserves to treat herself once in a while!</p><p>So don&#x2019;t feel bad for booking that massage, or going shopping and not coming back with something for everyone, because a happy mother equals happy family.</p><p><br></p><h5><em><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f12c9ee0-7f17-4c66-a3b8-eafcc032cf02.jpeg\" style=\"float: right; margin: 10px; width: 200px; height: 200px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f12c9ee0-7f17-4c66-a3b8-eafcc032cf02.jpeg\">About Valeria</strong></em></h5><p><em>Valeria is the&#xA0;co-founder of DCC Jobs - a niche job site helping women pursue rewarding careers, across any industry. DCC Jobs does not advertise anonymous recruiters&#x2019; jobs and pre-screens employers who wish to post jobs to ensure they are committed to supporting women&#x2019;s careers. Together with Gemma Lloyd,&#xA0;Valeria launched the company after being frustrated with the lack of options for women to easily find employers who are truly focused on creating ideal workplaces.</em></p><p><br></p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p><span style=\"font-size: 16px;\">DCC Jobs is a&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">jobs board&#xA0;</a><span style=\"font-size: 16px;\">with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">essential tool</a><span style=\"font-size: 16px;\">&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">1 click</a><span style=\"font-size: 16px;\">&#xA0;now.&#xA0;</span>&#x200B;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/02","associated_company":"work180"}