{"url":"https://www.work180.com.au/blog/2015/05/4-reasons-to-stop-feeling-guilty-about-leaving-your-job","title":"4 reasons to stop feeling guilty about leaving your job","author":"WORK180","body":"\n\t\t\t\t\t<p>This article originally published at <a href=\"https://www.themuse.com/advice/4-reasons-you-should-stop-feeling-guilty-about-leaving-your-job\">The Muse</a></p>\n\n<p>&#xA0;</p>\n\n<p>Well, look at you. You&apos;ve done it. After months of quietly exploring new, better career opportunities, you&apos;ve landed a job that makes you giddy just thinking about. You&apos;ve even mustered up the courage to tell your current employer. And just at that moment when you should be on Cloud 9?</p>\n\n<p>It happens.</p>\n\n<p>The guilt comes rolling into the station. You begin to question the decision. You feel awful that you&apos;re leaving your team, at a moment when no one could possibly live without you. You wonder if you should just duck into your cubicle for the next two weeks, to avoid having to face people with this bombshell news of yours.</p>\n\n<p>Stop that. Yes, of course, guilt is a natural feeling that many people feel when leaving an employer, especially if the company&apos;s been super great to you, and the team&apos;s truly going to feel the burn short-term.</p>\n\n<p>But, assuming you <a href=\"https://www.themuse.com/advice/operation-resignation-6-steps-to-ensure-a-graceful-departure\" target=\"_blank\">manage your departure gracefully</a>, you absolutely shouldn&apos;t feel guilty, and here&apos;s why.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. Professionals are expected to develop and grow</strong></p>\n\n<p>Your colleagues are not unlike you. They aspire to grow, develop, and in many cases, also climb into positions with new challenges and responsibilities. This is human nature, and it&apos;s expected. Even if your peers or supervisors act pouty or irritated when you announce you&apos;re leaving, realize that this is probably just them thinking about the pain in the rear your departure may create for them short-term (or wishing that they were you right about now).</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. If the tables were turned, the company probably wouldn&apos;t feel guilty</strong></p>\n\n<p>Think about it. If your employer were facing budget cuts or layoffs, and your job was going to be among those impacted, do you think that your managers or the HR director would spend endless hours wringing their hands with guilt before they alerted you of the layoff? Probably not. Sure, on a personal level they may feel badly. We&apos;re all human, after all. But they&apos;d surely realize that this is business, and in business, difficult decisions sometimes need to be made.</p>\n\n<p>Now, apply this to your own decision, and realize that most employers understand that you, too, are making difficult choices to further your own business &#x2014; the business of your career.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. If you stay out of guilt, you do no one any favors</strong></p>\n\n<p>I&apos;ve actually coached a few clients who&apos;ve turned down great offers because they just couldn&apos;t get the nerve up to face their employer and resign. (&quot;They&apos;ll dieeee without me.&quot;) And in at least two of these instances, guess what happened? The person who stayed became more and more resentful or non-productive in her role, and the employer was negatively impacted. Even if you know your company is going to gripe and moan when you quit, if you&apos;re only staying out of guilt, you&apos;re doing both them and you a disservice.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Guilt will disrupt the joy of your last two weeks</strong></p>\n\n<p>Have you enjoyed your time at the company you&apos;re leaving? Have you met at least a couple of colleagues or clients that you really like being around? Well then stop the moping and make the most out of your final days at the old job. Lift that load off of your shoulders and enjoy the hours you have remaining with these comrades. Because guess what? It might not be easy to carve out time to see them once you start that new gig.</p>\n\n<p>Even when you&apos;re downright ecstatic about your pending transition, quitting a job can be emotionally tough. Feel the emotions, absolutely. Just don&apos;t let guilt sneak in and steal the moment. You&apos;ve got basking to do.</p>\n\n<h4>&#xA0;</h4>\n\n<h4><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2015/05","associated_company":"work180"}