{"url":"https://www.work180.com.au/blog/2017/03/4-tips-to-make-your-resume-exceptional","title":"4 Tips to Make Your Resume Exceptional","author":"WORK180","body":"\n\t\t\t\t\t<p>Having a persuasive resume is something that concerns every applicant. The largest question generally is how to achieve a balance between individuality and conforming with expectation.</p>\n\n<p>Ultimately the most important element of your resume is clarity and focus. It has been proven that hiring managers look at a resume piece for an average of&#xA0;<a href=\"http://money.usnews.com/money/blogs/outside-voices-careers/articles/2016-03-07/heres-exactly-what-hiring-managers-look-for-in-a-resume\" target=\"_blank\">6-8 seconds</a>&#xA0;before making a decision of whether or not to proceed with an applicant. That brief amount of time is all you have to make a stellar impression.</p>\n\n<p>Of course you also want to have an excellent cover letter and to follow up any job interview with a<a href=\"https://www.tinyprints.com/ideas/how-to-write-a-thank-you-letter/\" target=\"_blank\">&#xA0;formal thank you letter</a>. But before getting to those writing pieces, it&#x2019;s imperative to demonstrate your qualifications in such a way as to imply that you are the ideal applicant.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Follow these 4 tips in order to make an excellent impression.</strong></p>\n\n<h4><strong>1. Make it a &#x201C;greatest hits&#x201D; document.</strong></h4>\n\n<p>Consider your reader &#x2014; remember that it is more important recognize your specific qualifications than it is to try to fit in everything that you have ever accomplished. A resume piece wants to be clean and concise. While the 1 page rule is no longer standard, Google HR recommends 1 page for every decade of work.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2. &#xA0;Tell a consistent story</strong></h4>\n\n<p>Though your route to a current career path may be circuitous, make sure that your resume has a specific narrative in mind and follows that narrative all the way through.</p>\n\n<p>For example, if you have worked in a number of start-ups, your ability to launch companies from the ground up as well as your leadership and multitasking acumen might be aspects of your career to emphasize. Tell the story they want to hear and keep it consistent. If this story does not include your time working as a bartender, do not put that on your resume.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3. Quantify as much as possible.&#xA0;</strong></h4>\n\n<p>There are two compelling reasons to make sure you are using as many metrics as possible on your resume piece.&#xA0;</p>\n\n<p>a) Numbers are a wonderful way to be able to demonstrate concrete accomplishments. It boils down to the writing rule of &#x201C;show, don&#x2019;t tell.&#x201D;&#xA0;</p>\n\n<p>Do not say, for example:&#xA0;</p>\n\n<p>Used sales acumen to increased business over tenure.</p>\n\n<p>When you might say:</p>\n\n<p>Increased sales in New York State by 14% by delivering over $350k in new business.</p>\n\n<p>b) Numbers are proven to draw the eye. Again this reaches back to the question of how much time someone will spend looking at your resume. If you have concrete numbers it will pull focus to the places that you want hiring managers to spend that crucial amount of time.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>4. Brag about yourself</strong></h4>\n\n<p>It seems simplistic, but in many cases, resumes tend not to give details that are very important in assessing a proper level of career accomplishment. Resume writers just do not consider some of their most impressive actions to be relevant. Here are three ways to do this most effectively:</p>\n\n<p>a) Outline the largest strengths of the company you used to (or currently) work for in the primary bullet of your professional experience listing. The fact that you feel you may have little to do with this is not important. Say, for example, that you performed data collection for a pharmaceutical company you might include:</p>\n\n<p>Spearheaded data assessment for the largest specialty pharmaceutical company in the U.S. with over $1B in total sales.</p>\n\n<p>Your role in that $1B might seem small, but this bullet tells a story about the level of work you are used to. Do not downplay this.</p>\n\n<p>b) If you have worked with an elite company or personality (even tangentially) that a majority of your hiring managers will have heard of, find a way to mention this.</p>\n\n<p>c) If you have worked with a large-scale budget, talk about this into your resume. Obviously, budgets vary. Pick the largest budget with which you ever worked and mention this.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Some other tips: </strong></p>\n\n<p>Add Keywords:&#xA0;Scour the listing that outlines the position for which you are applying and prepare a few places in your resume to work in keywords from that listing.</p>\n\n<p>Proofread Carefully:&#xA0;Nothing is a worse resume killer than a typo. Work backwards (from the bottom up) to improve your ability to catch mistakes and get someone you trust to look the piece over. Fresh eyes are always better than yours.</p>\n\n<p>Follow these simple steps and you will certainly see improvement in the efficacy of your resume. While there are many ways to tell your story, the most important thing to remember is to be clear and concise &#x2014; there isn&#x2019;t a second to spare.</p>\n\n<p>&#xA0;</p>\n\n<p>Sarah is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2017/03","associated_company":"work180"}