{"url":"https://www.work180.com.au/blog/2018/11/4-tips-to-balance-study-and-full-time-work","title":"4 tips to balance study and full time work","author":"WORK180","body":"\n\t\t\t\t\t<p>When I joined Optus three years ago, I started as a Mailroom Assistant. Today, I am a Team Coordinator in our networks department. My role involves scheduling meetings, raising purchase orders, booking travel requests and all other administrative duties. I enjoy my role because I can use my skills and knowledge to do various tasks, especially organizing and helping others.&#xA0;</p><p>In addition to working at Optus full time, I&#x2019;m also currently studying at Macquarie University to obtain a Bachelor of Commerce degree with a Major in Human Resources and Minor in Business Information Systems. I&#x2019;ve chosen Human Resources because I&#x2019;ve always been very passionate about understanding the workforce and what the importance of human resource management is. My minor in Business Information Systems is also because I&#x2019;m passionate about learning new systems that will be beneficial to the business.&#xA0;&#xA0;</p><h4>Why I have chosen to study and work full time</h4><p>When I was in my last year of high school, I kept hearing about people who couldn&#x2019;t find jobs in their field. As such, I figured I&#x2019;d try a different approach; land a full-time job and study part time so that I could get on-the-job experience along with tertiary education in my field. So far it&#x2019;s worked out well!</p><h4>How I manage it all</h4><p>Along my journey so far, a lot of people have told me that it&#x2019;s &#x2018;impossible&#x2019; to study and work full time. However, I have met so many people at university who are on the same boat as me. It&#x2019;s not impossible, it&#x2019;s all about your dedication towards your goals.&#xA0;</p><p>I currently do two units every semester and my classes are usually in the evening which makes it easier for me to attend after work. I plan out my weeks and months in advance to manage studying on the weekends. Also, I couldn&#x2019;t have managed it without my family&#x2019;s support; they&#x2019;re very supportive of my career and education priorities.&#xA0; &#xA0;</p><h4>How Optus has supported me</h4><p>The best thing about working at Optus is having flexible working hours. For example, last semester I had a class starting at 4pm, meaning I would start early and finish early.</p><p>Having supportive managers and colleagues has also been a great benefit. All my managers are very supportive and understand the difficultly of working and studying part time and have supported me in many ways. They always check on me to see how I am going with everything and they give me guidance when needed.</p><h4>Tips for other people studying</h4><p>1. Planning is your best friend.</p><p>Planning is the biggest tool for balancing studying and full-time work. I use an online calendar to put in study times, when to start assessments, when things are due and any social plans I make with friends/family. With a schedule so tight, having everything in the calendar helps to avoid being double booked!</p><p>2. Have a consistent routine.</p><p>Make a routine and stick to it! Consistency is key; the more you do it, the more you&#x2019;ll get used to it. The first few months of studying and working were hard for me as I struggled to find the right balance between them and how to prioritize my time. However, once I started to follow my routine; I managed to get into a groove and study when I planned to.&#xA0;</p><p>3. Know your limits.</p><p>Don&#x2019;t try to do more than what you can do. I once tried to do three units instead of two in a semester and that certainly impacted my health. I had to withdraw from one of the units to get myself back on track. After that, I realised it&#x2019;s a marathon, not a sprint!&#xA0;</p><p>4. Don&#x2019;t lose sight of your end goal.</p><p>There will be times when everything seems just&#xA0;<em>too hard</em>. But, if you remember the end goal, reassure yourself of your purpose and you will get through it. On the tougher days, I remind myself of what I&#x2019;ve dreamt of becoming and why I&#x2019;m doing this to get through the day.&#xA0;</p><p>With a plan in place, a consistent approach, knowing your limits, and keeping your eye on the prize, studying and working is absolutely achievable.&#xA0;</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About Optus&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" style=\"float: right; margin: 10px; width: 300px; height: 60px;\"></a></strong></h4><p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p><p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p><p>Browse jobs with Optus and apply&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=optus\" href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["optus","Career Development","job seeking tips"],"upload_date":"2018/11","associated_company":"work180"}