{"url":"https://www.work180.com.au/blog/2017/05/4-tips-to-accelerate-your-career-and-get-promoted-after-graduation","title":"4 Tips to Accelerate Your Career and Get Promoted After Graduation","author":"WORK180","body":"\n\t\t\t\t\t<p>Natalie Lioulios&#x2019;&#xA0;original career ambition was to become an Architect, however her direction changed. This led her to study Civil Engineering and Science and gave Natalie exposure to Geology. Natalie subsequently secured a role at BHP&#xA0;which saw her enjoying the best of both worlds. More recently, Natalie was promoted to an Analysis &amp; Improvement role at Olympic Dam mine- the largest known single deposit of uranium in the world. We spoke with Natalie about the challenges she faced and the steps she took to navigate such an impressive career straight out of university. Here are her top tips:</p><p><br></p><h4><strong>1. Keep Your Options Open</strong></h4><p>&#x201C;In my last years of high school, I did some work experience at an architecture firm, and was really intrigued about the design aspects,&#x201D; said Natalie. &#x201C;I wondered if civil engineering was an option for me. I also happened to be very good at maths, so thought I may as well go for it. However, when I enrolled in Civil and Structional Engineering, I found that because I hadn&#x2019;t done specialist maths, I couldn&#x2019;t enrol into a single degree.&#x201D;</p><p>A double degree didn&#x2019;t require specialist maths so Natalie chose to add Bachelor of Science to her degree. &#x201C;However, as soon as I did my first subject in Physics, I decided it wasn&#x2019;t for me and pulled out. I tried Geology as my major for my Bachelor of Science, and fell in love, especially with the chemistry aspect.&#x201D;</p><p>Prior to Natalie&#x2019;s graduation, she had the opportunity to meet with several mining companies, who were on a big recruitment drive, promoting their vocational placements. &#x201C;BHP&#xA0;stood out to me from the rest because of their structured, practical programs,&#x201D; explained Natalie. &#x201C;In addition to other mining companies, I also had the choice to do a placement at an engineering firm.&#x201D; However, this program consisted of &#x201C;sitting next to someone to learn the ropes&#x201D; in addition to very low pay. Needless to say, Natalie selected to apply with BHP.</p><p>Not long after applying, Natalie received an offer for a vocational role as a Geotechnical Engineer- which was perfect for her, combing both civil engineering and geology.&#xA0;</p><p>Natalie&#x2019;s first experience of working with BHP as a Vacation Student was great. &#x201C;I was keen to get some practical experience, and was excited to join the team working on the Olympic Dam mine. Staying at the accommodation camp in Roxby Downs with around 20 other students was fantastic- we had a pool and a gym, not to mention no cooking or cleaning!&#x201D;</p><p><br></p><h4><strong>2. Build Rapport and Earn Respect</strong></h4><p>After spending three months in a vocational role, BHP offered Natalie a Graduate Position.</p><p>&#x201C;To know I had a job a year before graduation filled me with a sense of security,&#x201D; recalled Natalie. Her advice to other graduates is to ensure to have something in writing to confirm your role, as many companies can draw out the process and be quite non-committal.</p><p>Natalie&#x2019;s first year as a Graduate with BHP was spent learning about underground operations. &#x201C;This was the best experience- I learnt so much! We were taught everything from using the front end loaders, drill rigs to tunnelling, through to working with explosives,&#x201D; recalled Natalie.</p><p>According to Natalie, starting at the grassroots level is crucial in order to have a successful career in mining. &#x201C;I cannot stress enough how important it is to have a solid understanding of operations and building rapport with everyone underground- having a positive attitude will earn you respect from the operators and shift bosses.&#x201D;</p><p><br></p><h4><strong>3.&#xA0;Never be Afraid to Ask for Help</strong></h4><p>The first few months at a brand new job can be tough, and that&#x2019;s perfectly normal.</p><p>When Natalie was a Vacation Student, she was working with the mine&#x2019;s technical team, who were responsible for creating the mine and supporting the workings underground. She was given two projects to work on, assisting the geotechnical team find the root cause of a number of issues with ground stability. &#x201C;Back then, I remember feeling a bit overwhelmed as I didn&#x2019;t know where to start on the projects,&#x201D; recalled Natalie. &#x201C;However, I quickly realised it&#x2019;s just a case of reaching out for help- go and talk to someone, and if they can&#x2019;t help, they will introduce you to someone who can.&#x201D;</p><p>Natalie admits to still feeling overwhelmed every now and them, but for her, it&#x2019;s not so daunting anymore because she knows there is plenty of supportive people around. &#x201C;I found BHP&#xA0;to be very seasoned with vacation students- they know you are nervous and how to make you feel welcome,&#x201D; said Natalie.</p><p>Natalie&#x2019;s second rotation as a Graduate saw her working on the surface, where she was part of a team who evaluated the mine&#x2019;s productivity and looked for ways to improve efficiency and fix any bottlenecks. The rotation which followed this was Natalie&#x2019;s toughest challenge yet. &#x201C;As a Shift Boss, I was responsible for running a crew of 15. Being responsible for everyone&#x2019;s safety on top of production, it was certainly challenging, however again, I had a lot of support,&#x201D; said Natalie.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7cc504c0-8556-484e-852d-ae6ae567be34.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7cc504c0-8556-484e-852d-ae6ae567be34.jpeg\"></p><h4><strong>4.&#xA0;Attitude is Everything</strong></h4><p style=\"text-align:center\"><br></p><p>During her second rotation as a Shift Boss on the Graduate program, Natalie was one of two women in the crew, and we discussed how she managed situations which can arise when working in a non-traditional environment, especially as a young woman. &#x201C;Even though I realise this is an issue for some people, the perception of mining not being for women baffles me- I never had that perception&#x201D; said Natalie. &#x201C;I always felt included, so I didn&#x2019;t get that feeling. I expect to be treated the same as anyone else, and that&#x2019;s exactly the way our team is.&#x201D;</p><p>Natalie&#x2019;s advice to other people in the industry is to have the right attitude. &#x201C;I am very conscious of having positive engagement from all departments and people I work with. I try very hard to understand their situation and what their requirements are before I suggest any changes. I emphasise what I require and why it would be an improvement. In doing so, my relationship with the people I work with is strong.&#x201D;</p><p>It really comes down to the simple things- for example, Natalie is the person who says hi to people she walks past in the corridor and is always smiling. &#x201C;I&apos;m action orientated and strive for outcomes &#x2013; I hate dragging things on. I think this helps me be great at my job,&#x201D; she added.</p><p>&#x201C;No workplace is ever perfect 100% of the time and when faced with a tough situation, I have also had to learn to develop a thick skin and not take things to heart.&#x201D;</p><p>Such a positive attitude along with excellence at her job saw Natalie receive a permanent job offer just after three rotations (Normally graduates would go through at least five rotations.)</p><p>Natalie accepted the role of Production Engineer Analysis and Improvement six months before finishing the Graduate Program. We have no doubt that Natalie has an extremely positive future ahead of her, and thank her for taking the time to share her story.</p><p>BHP Billiton are working hard to create a truly inclusive environment, where everyone can be themselves at work. To learn more about working with BHP Billiton and to view available roles at BHP Billiton, <a data-cke-saved-href=\"https://www.dccjobs.com/clients/bhp\" href=\"https://www.dccjobs.com/clients/bhp\">please click here.</a></p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/05","associated_company":"work180"}