{"url":"https://www.work180.com.au/blog/2018/05/5-career-tips-from-talent-acquisition","title":"5 Career Tips to Get You Back on Track ","author":"WORK180","body":"\n\t\t\t\t\t<p>Are you where you thought your career would be at this point in your life? Do you love your team but are no longer challenged? Are you wondering if you can transfer your skills towards a different career path?</p>\n\n<p>Hi there! I&#x2019;m Linda from the Talent Acquisition team&#xA0; at <a href=\"https://www.work180.com.au/clients/optus\">Optus</a>, and I&#x2019;d love to share some tips on how to give you a fresh perspective on your career. When it comes to careers at <a href=\"https://www.work180.com.au/clients/optus\">Optus</a>, we get excited about the future &#x2013; opportunities are endless. We believe in inspiring our people to take control of their career, raise their hand when they see an opportunity, and continuously take on new challenges.</p>\n\n<p>But don&#x2019;t worry &#x2013; it&#x2019;s normal at various points in your career to feel a bit &#x2026;bland. If you&#x2019;re ready to get the spring back in your step, check out these five tips:</p>\n\n<h3><strong>1. Redo your resume</strong></h3>\n\n<p>Through regularly updating your achievements and responsibilities, you are reminded how far you have come and what value you have added to your team and the organisation thus giving you some perspective on what you enjoyed most and what your strengths are.</p>\n\n<p>This is also a great opportunity for you to showcase where you have gone above and beyond your role and can be a great discussion point come your next performance and pay review! Cha-Ching!</p>\n\n<h3><strong>2. </strong><strong>Cross functional</strong><strong> projects</strong></h3>\n\n<p>Many people in the workforce can get complacent withbusiness as usual, unlikely to look up and smell the roses, so to speak. If you are seriously looking at taking control of your &#x201C;work fun&#x201D;, take some initiative. Look for projects you can get involved in, let your manager know that you are keen to take on more so they can help to get you involved in side projects that can utilize your strengths, while giving you the exposure with other business units.</p>\n\n<h3><strong>3. Secondments</strong></h3>\n\n<p>Untapped and underutilized! Secondments are the best way for you to sit in the hot spot of a role you are keen to get some hands-on experience in without jeopardising what you were originally hired for. If you are doing any further studies, or are curious to see how far your current skills can be transferred &#x2013; take that curiosity to the next level. Talk to the manager and let them know you are enthusiastic to take the leap of faith into the unknown!</p>\n\n<h3><strong>4. Increase your personal brand</strong></h3>\n\n<p>People talk about &#x201C;personal brand&#x201D; all the time &#x2013; what is it? How do I increase my personal brand without seemingly looking like I&#x2019;m tooting my own trumpet?</p>\n\n<p>Besides offering to work on cross functional projects, showcasing your capabilities across different business units and increasing your profile that way, a sure fire way to increase your own personal brand is upping your service. This is in your internal and external customer, stakeholder, and manager interactions. Letting your personal values shine through in your professional life will permeate and leave a lasting impression.</p>\n\n<h3><strong>5. Exercise</strong></h3>\n\n<p>Take advantage of the employee benefits your workplace offers. Here at <a href=\"https://www.work180.com.au/clients/optus\">Optus</a>, we&#x2019;re lucky to have an onsite gym and a large campus (did you know walking around the outskirts of our campus once clocks up to 1500 steps?). Getting outside for a walk will clear your mind, plus, you&#x2019;ll feed off the endorphins that rush through you. Your mind, heart, family and outlook on work and life will thank you for it!</p>\n\n<p>&#xA0;</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>Bonus tip - Download a free resume template and Personal Brand Guide</strong></h4>\n\n<p>WORK180&#xA0;is here to help you on this journey -<a href=\"https://www.facebook.com/groups/dccwomensnetwork/files/\">&#xA0;if you are looking for a resume template or a personal brand guide you can download one from WORK180&#x2019;s Facebook Group</a>. There are plenty of documents uploaded in the<a href=\"https://www.facebook.com/groups/dccwomensnetwork/files/\">&#xA0;&#x2018;Files&#x2019; section</a>&#xA0;of the group and you might find a lot of useful info there including how to develop your personal brand! Please also feel free to ask the group any career-related questions- we are all in it together!</p>\n\n<hr>\n<h4><strong>About Optus&#xA0;<a href=\"https://www.work180.com.au/clients/optus\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" style=\"float: right; margin: 10px; width: 300px; height: 60px;\"></a></strong></h4>\n\n<p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p>\n\n<p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page <a href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p>\n\n<p>Browse jobs with Optus and apply <a href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p>\n\n<hr>\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3>\n\n<p>WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/05","associated_companies":["work180"]}