{"url":"https://www.work180.com.au/blog/2017/07/5-easy-tips-for-bliss-and-balance-in-your-day","title":"5 Easy Tips for Bliss and Balance in Your Day","author":"WORK180","body":"\n\t\t\t\t\t<p>Working in the corporate wellness space and having intimate conversations with so many employees on a daily basis, I&#x2019;ve come to realise how stressed, anxious and &#x2018;out of control&#x2019; most people feel these days.</p><p>Because of their conflicting priorities (and a need to appear like everything is under control together all the time &#x2013; which is an entirely separate conversation!) they go through their days feeling completely out of balance.</p><p>Here are my&#xA0;<span style=\"color:inherit !important\">tops tips for adding more balance into your life (while still getting everything done!)</span></p><p><br></p><p><strong>1)&#xA0;</strong><strong>Just breathe</strong></p><p>It sounds simple, but science has demonstrated that the fastest proven way to reduce stress hormones in the body and bring calm back to your mind is &#x2018;diaphragmatically breathing&#x2019;. This means taking a few slow, deep breaths into the belly (which shifts your diaphragm) until you begin to feel more relaxed &#x2013; for most people, this will happen after just 3 or 4 breaths.<br>The best thing about this strategy is that you can do it anywhere and it doesn&#x2019;t take any extra time out of your day, given you need to breathe anyway!</p><p><br></p><p><strong>2)&#xA0;</strong><strong>Say thank you</strong></p><p>A gratitude practice is a ritual more and more successful people are incorporating into their daily routine. One of the reasons it&#x2019;s so effective is due to the way your brain functions.</p><p>The brain thinks linearly &#x2013; i.e., one thought at a time. So if you are focusing on a positive thought (like what you&#x2019;re grateful for) it cannot entertain the worries and anxious thoughts in that moment. Studies show that the more we train our minds to look for the positive and be grateful, the happier we feel over the long term.</p><p>You can do this ritual by writing down just three things you&#x2019;re grateful for each night before you go to bed.</p><p><br></p><p><strong>3)&#xA0;</strong><strong>Allocate &#x201C;me-time&#x201D; every week</strong></p><p>This will help shift the balance from feeling like you&#x2019;re constantly on someone else&#x2019;s schedule and doing things for others, to starting to feel like you&#x2019;re living for&#xA0;<strong>you</strong>&#xA0;again.</p><p>Your &#x201C;me-time&#x201D; could be anything that makes you feel good and is completely for&#xA0;<strong>your</strong>&#xA0;benefit&#x2026;. a yoga class, a massage, a walk along the beach, or simply having a tea and reading a magazine for 20 minutes once a week.</p><p>Now if you&#x2019;re like me five years ago, then you probably don&#x2019;t want to hear this because you&#x2019;re telling yourself you&#x2019;re too busy and don&#x2019;t have time. Let me tell you, you&#xA0;<em>do</em>&#xA0;have time. We all do. It&#x2019;s simply up to you to&#xA0;<em>choose</em>&#xA0;how you prioritise the activities in your life. If your health and happiness is somewhat high on your priority list, then you&#x2019;ll allocate the time to do the things that matter for your health and happiness. I heard a quote that may help you:&#xA0;<em>We don&#x2019;t build the lives we want by saving time; we build the lives we want and then time saves itself.</em></p><p><br></p><p><strong>4)&#xA0;</strong><strong>Chill out (music)</strong></p><p>A dear friend of mine recently got me listening to a &#x2018;Just Chill&#x2019; playlist of mellow chill out music while I drive and while I&#x2019;m working at home &#x2013; very different to the dance / r&#x2019;n&#x2019;b / rock playlists I previously had on. I have noticed such a profound shift in how calm and focused I feel when listening to this music!</p><p>The shift I experienced makes sense. Studies show that the tempo and beat of the music you&#x2019;re listening to directly correlate with the pace of the beating of your heart. So if you need to wind down the intensity and feel calmer in your day, I highly recommend you &#x201C;Just Chill&#x201D; too.</p><p><br></p><p><strong>5)&#xA0;</strong><strong>Get out of your head</strong></p><p>The main reason humans tend to feel so stressed and overwhelmed is because of the constant mental chatter and worries in their minds. The easiest way to slow down these thoughts and become centred and grounded is by getting out of your head and into your body &#x2013; i.e.,&#xA0;<em>feeling,&#xA0;notthinking.</em></p><p>The easiest way I have found to do this is through&#xA0;<strong>yoga</strong>. When I was diagnosed with chronic fatigue syndrome a few years ago after a sequence of nasty viruses, my body was burnt out and lacking any energy. Yoga was the only thing that began to lift my energy and help me regain balance in my body. Since studying and beginning to teach yoga, I&#x2019;ve witnessed countless students regain health in their body and clarity in their mind. The ability to go from &#x2018;chaotic mind&#x2019; to &#x2018;clarity and centeredness&#x2019; in a single class is magical to witness and such a privilege to experience&#x2026;. I dare you to try it :)</p><p><br></p><p><strong>Want to learn more and connect with me in person?</strong></p><p>Join me and dozens of inspiring women at&#xA0;<a data-cke-saved-href=\"http://www.diversecitycareers.com/page/events/dcc-better-ways-of-working-meetups/\" href=\"http://www.diversecitycareers.com/page/events/dcc-better-ways-of-working-meetups/\">DCC&#x2019;s upcoming &#x201C;Wellness at Work&#x201D;</a>&#xA0;event to learn more about how you can reduce stress, increase resilience and feel more balanced in your busy life. The evening workshop will include drinks and nibblies, with tickets just $10 and proceeds going to St Vinnies, it&#x2019;s an event not to be missed!</p><p><a data-cke-saved-href=\"/events\" href=\"/events\">Click here for details on the next Sydney, Melbourne and Brisbane meetup events</a>!</p><p style=\"text-align:center\"><br></p><p>Please&#xA0;<a data-cke-saved-href=\"mailto:rosanna@recipeforhealth.com.au\" href=\"mailto:rosanna@recipeforhealth.com.au\">get in touch</a>&#xA0;if you have any questions, want more details on events, or would like to share your story. I&#x2019;m always happy to connect and learn from you :)</p><p>To feeling blissful and balanced,</p><p>Rose xx</p><p><strong>About Rose Lauria</strong><br>Rose Lauria is a resilience expert and founder of Recipe for Health. Learn more&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/page/partner-network/professional-development-services/recipe-for-health/\" href=\"https://www.diversecitycareers.com/page/partner-network/professional-development-services/recipe-for-health/\">here</a>.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/07","associated_companies":["work180"]}