{"url":"https://www.work180.com.au/blog/2017/11/5-tips-for-professional-development-when-changing-industries","title":"5 Professional Development Tips when Changing Industries","author":"WORK180","body":"\n\t\t\t\t\t<p>How do you successfully transition from one industry and occupation to another entirely new industry and job? A slightly daunting proposition. And one I faced approximately 18 months ago now. The problem was knowing where to start when I didn&#x2019;t know what I didn&#x2019;t know.</p>\n\n<p>I had the idea for Femeconomy &#x2013; to encourage and inform women who make 85% of consumer purchase decisions, to shop brands with female leaders to create gender equality. But setting up a website, developing a marketing plan, creating an engaged community, using social media effectively to reach people, delivering keynote speeches at conferences, understanding the dynamics of the retail industry, public relations, deciphering start up world and managing small business finances and tax were all things I&#x2019;d never had to do in my previous work life.</p>\n\n<p>With two undergraduate degrees and an MBA already, I didn&#x2019;t have the time or inclination to start another degree to transition my career. Here are my top 5 professional development hacks on how I went about rapidly developing skills and experience so that I could be effective in my new &#x2018;job&#x2019; without meeting a single lecturer.</p>\n\n<h3>1. HAVE A PLAN AND START ONLINE</h3>\n\n<p>Any good professional development intervention starts with a needs analysis. My first activity was to identify and document where my skill and experience gaps were, but also to identify my strengths and transferable knowledge. Then I prioritized the list of topic areas and development needs, and started at the top!</p>\n\n<p>I read everything I could online, for hours every evening and at weekends. All about marketing, website content management, social media strategies, small business applications, small business finance, gender equality statistics, start up &#x2018;how to&#x2019; articles, and retail industry news. I devoured hours and hours of online content, in a self imposed literature review. Then I captured and shared insights with my Co-Founder, and translated these to action where valuable.</p>\n\n<h3>2. SECURE A CO-FOUNDER(S) WHO HAS A COMPLEMENTARY SKILLSET AND EXPERIENCE TO YOURS AND ASK THEM TO SHARE WHAT THEY KNOW</h3>\n\n<p>I was persuasive enough to secure a Co-Founder who is a marketing guru. In my previous corporate career, marketing wasn&#x2019;t something I ever touched. Employer branding was the closest I got.</p>\n\n<p>Serendipitously, my Co-Founder Alanna also had an unusually generalist background, where she had worked across many specialist areas of marketing and media. I picked her brains relentlessly and asked all the &#x2018;dumb&#x2019; questions. I rarely question her judgement, but I do always question the methodology so that I understand the context and can learn incrementally as our business develops.&#xA0;</p>\n\n<h3>3. FIND SOMEONE WHO HAS ALREADY DONE IT</h3>\n\n<p>There are always many people who have trodden the same path you are. I sought out those who were further progressed in their start up ventures, and asked them all about their journey. Their lessons learned, what to read, what events would be worthwhile to attend, and who I should meet with next. The start up ecosystem is full of people at various stages in their business journey, who generously begin conversations with &#x201C;How can I help?&#x201D;. This is a wonderful leveler, and generally there is a simple way to help each other, even in the smallest of ways, through sharing knowledge or networks.</p>\n\n<h3>4. ENTER A NEW NETWORK BY LEVERAGING YOUR EXISTING ONE, AND USE SOCIAL MEDIA TO ACCELERATE PROGRESS</h3>\n\n<p>I confess that previously I had only one social media account &#x2013; LinkedIn. And I was selective about who I connected with. I rarely posted content, and used it more as an online contacts list and for professional development, reading others&#x2019; content. Since starting this business, I have discovered the real potential of social media.</p>\n\n<p>Leveraging my existing LinkedIn network through sharing Femeconomy&#x2019;s interviews with female leaders who are CEOs, Board Directors and Business Owners enabled me to discover and connect with second and third degree connections who enjoyed the content, and were also gender equality advocates. Twitter has been invaluable for connecting with like minded individuals and organisations who advocate for gender equality. On Facebook, we have an engaged social community of people who are interested in inclusion and supporting each other, and are having an ongoing learning conversation together.&#xA0;</p>\n\n<h3>5. SEEK OUT RELEVANT FREE OR LOW COST EVENTS</h3>\n\n<p>When starting out, most businesses are on a tight budget, and there is little allocated to professional&#xA0; development. But there are many excellent free or very low cost professional development events on offer, generally because they are either government subsidized or privately sponsored. Sometimes though, it&#x2019;s difficult to know which ones are a quality time spend. For me, taking time out of my business is also a cost, so I want to make sure it&#x2019;s a high return on investment. I rely on referrals from others, and always attend events with a firm understanding of my intent, whether it&#x2019;s to develop my network, learn a new topic, or be inspired/ reenergized. Then I evaluate the outcome against my expectation.</p>\n\n<p>How have you driven your own professional development to change industry or careers?</p>\n\n<p><em>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/5-professional-development-tips-when-changing-industries/\" target=\"_blank\">Femecoonomy.</a></em></p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce943d5d-7fb6-447d-9d6c-c5ebf14c71e1.jpeg\"></p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/11","associated_company":"work180"}