{"url":"https://www.work180.com.au/blog/2016/10/5-slightly-surprising-ways-to-enhance-your-interview-performance","title":"5 slightly surprising ways to enhance your interview performance","author":"WORK180","body":"\n\t\t\t\t\t<p>Ever felt that your interview performance just cost you your dream job?</p><p>This is especially galling when prior to fronting &#x2018;the panel&#x2019;, the planets seemed to be seriously aligned for success.</p><p>You&#x2019;re highly qualified and very experienced in the field. You&#x2019;ve had professional help to craft a killer application including a beautifully presented, sharply targeted resume.</p><p>You&#x2019;ve prepared for the interview by writing and rehearsing answers to questions about your past accomplishments, strengths and weaknesses and why you wanted the job.</p><p>Despite being thoroughly prepared and quietly confident, you came away from the interview feeling you&#x2019;d &#x2018;failed to connect&#x2019;.</p><p>Most often we never know exactly why that coveted job we&#x2019;re so right for doesn&#x2019;t work out. &#xA0;The intuitive sense of disconnection you felt after the interview may or may account for not winning the role.</p><p>However, if you&#x2019;re looking to add oomph to your interview performance these five strategies may help.</p><p><br></p><h4><strong>1. Imagine you&#x2018;re &#x2018;them&#x2019;</strong></h4><p>When you&#x2019;re totally focused on selling yourself as the absolutely best person for the job it&#x2019;s easy and perfectly natural to overlook some key influences on the interviewer&#x2019;s perspective.</p><p>While the interview has heart stopping significance for you it may not be the equivalent highlight of your interviewer&#x2019;s busy schedule. Recruitment is often an endurance event involving a protracted and wearying process.</p><p>Connectedness needs a sizable dollop of empathy.</p><p>Put your self in the shoes of someone with a complex, crowded working day that includes plucking the best person from a pool of potential employees. Imagine asking the same questions to a number of keyed up candidates all keen to make a fabulous first impression. Think about the exacting task of recording their responses fairly and fulsomely while scanning for signs of compatibility and fit.</p><p>Now make their job easier by being the stand out candidate.</p><p><br></p><h4><strong>2. Look back and forward</strong></h4><p>Behavioral interviewing still rules mainstream recruitment. This means you&#x2019;re likely to be asked those &#x2018;easy to prepare for&#x2019; questions about your past performance. Certainly it&#x2019;s vital to have dynamic, credibly supported answers that highlight your achievements and attributes and link them to the role on offer.</p><p>Once you&#x2019;ve demonstrated that you really are that amazingly accomplished person described in your resume, talk about the future.</p><p>Outline what you&#x2019;d like to achieve in your first six months in the role. Give a tactful, savvy account of areas where you see potential to do things differently. Show how you&#x2019;ve researched the company and the broader industry trends to come up with a proactive plan to add exceptional value to role you&#x2019;re seeking.</p><h4><strong>3. Show your cultural awareness</strong></h4><h4 style=\"text-align:center\"><br></h4><p>This is where connection really counts. In a world of increasingly fluid and evolving technical skills and knowledge, showing you fit the company&#x2019;s culture can be more important than your experience or qualifications.</p><p>Get a sense of your target company&#x2019;s culture by looking at their website and social media platforms. Check out the team&#x2019;s LinkedIn profiles and research their community profile in the print and online media.</p><p>In an era of Internet driven transparency, recruitment sites like Glassdoor offer thousands of company performance reviews. Try to talk to someone who works with or for the company or someone who uses their products and services.</p><p>Of course cultural fit cuts both ways. Feeling confident that a company&#x2019;s culture aligns to your values and expectations is as important as demonstrating that you can be trusted to deliver on theirs.&#xA0;</p><p>Lastly on the cultural front, know that your prospective employers will almost certainly check your social media presence. Enough said!</p><p><br></p><h4><strong>4. Ask intriguing questions</strong></h4><p>Make the most of your &#x2019;closing remarks&#x2019; opportunity to ask some memorable questions that build your cultural credentials.</p><p>Spark a conversation with questions about the key personality attributes they&#x2019;re looking for in the role or the changes they&#x2019;d like to see the incoming person make.&#xA0;</p><p>Leave a lasting impression of your lively, confident, clued up self by engaging the interviewer in a genuine, unguarded chat about your shared values and aspirations.</p><p><br></p><h4><strong>5. Stage a dramatic rehearsal</strong></h4><p>Lastly but in fact firstly, treat your interview rehearsal as performance art.</p><p>Find a friend with sufficient theatrical nous to do a mock interview with you as if they are that skeptical, stern faced interviewer we all dread. If they need inspiration, suggest they watch a clip of &#x2018;Gina Hard Faced Bitch&apos;.</p><p>While it&#x2019;s unlikely you&#x2019;ll encounter anyone quite this terrifying in real life, it&#x2019;s useful to practice meeting a challenging interviewer who may also be suffering from recruitment fatigue. Practice fielding tricky questions tossed off by a pokerfaced tyrant who appears unimpressed by your capabilities. Repeat and refine your answers until you&#x2019;ve cracked your friend&#x2019;s stagey &#x2018;so what&#x2019; demeanor with an undeniably brilliant response.</p><p><br></p><p>Jo &#xA0;is one of our contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a> .</p><p><br></p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2016/10","associated_company":"work180"}