{"url":"https://www.work180.com.au/blog/2017/12/5-tips-to-advance-your-career-within-a-single-company","title":"5 Tips to Advance your Career within a Single Company","author":"WORK180","body":"\n\t\t\t\t\t<p>Sheila Mananghaya, a Senior Project Engineer with <a data-cke-saved-href=\"https://www.dccjobs.com/clients/laing-orourke?\" href=\"https://www.dccjobs.com/clients/laing-orourke?\" target=\"_blank\">Laing O&apos;Rourke</a>, has built a very successful career within the firm from the ground up.</p><p><img alt=\"Sheila Mananghaya \" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/999f80c7-efff-43d9-95a0-a9a13b67ca22.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/999f80c7-efff-43d9-95a0-a9a13b67ca22.jpeg\" style=\"float: right; margin: 10px;\">Beginning as a building cadet while still completing her Bachelor of Property and Sustainable Development (Majoring in Construction Management and Quantity Surveying) at Queensland&#x2019;s Bond University, Sheila has worked her way through the ranks to a senior position over the past seven years thanks to hard work, flexibility, dedication and a willingness to be assertive and career-minded.</p><p>We&#x2019;re pleased to share with you an insider&#x2019;s perspective to anyone looking to achieve similar goals.</p><h3><strong>1. Do your research</strong></h3><p>From an early age Sheila was passionate about construction &#x2013; she loved the excitement of planning new works, the expertise needed for its creation and project management and the sense of satisfaction once the job was completed.</p><p>She also knew she wanted a career that was dynamic, varied and satisfied her desire to travel, which meant finding an employer which could tick those boxes.</p><p>&#x201C;I did a lot of research around the companies I wanted to work in and there are a few stand-outs but I wanted to work for a tier-one main contractor,&#x201D; she says. &#x201C;The reason I wanted to work with Laing O&#x2019;Rourke was the international experience opportunities but also the diversity of the sectors and projects they are involved in.&#x201D;</p><p><br></p><h3><strong>2. Embrace the opportunities</strong></h3><p>Following the completion of her two-year graduate program, Sheila started as a Site Engineer and in the next few years, the Queensland native worked on the Brisbane Domestic Terminal upgrade and expansion, the remote Broadmeadow Coal Mine, as well as two years on a cryogenic gas tanks project in Darwin where she was promoted to Project Engineer.</p><p>Sheila&#x2019;s willingness to relocate for projects helped her to gain greater experience. She says it was always part of her game plan to take up as many opportunities as possible, and she relished the opportunity to travel.</p><p>After two years in Darwin she was seconded to Laing O&#x2019;Rourke UK in London to work on the Tottenham Court Road Crossrail Project, and was also accepted into the University of Cambridge to complete her Masters degree.</p><blockquote><p>&#x201C;An master was always a goal,&#x201D; she says. &#x201C;Laing O&#x2019;Rourke nominated me to do my Masters in Construction and Engineering at Cambridge and it was an incredibly valuable experience which has helped me grow both personally and professionally. I learned about other sectors and innovations within them and other techniques and areas such as leadership, networking and finance within the construction industry.&quot;</p></blockquote><p>&#x201C;I completed this while working full time but was given breaks to complete course work over the two years,&#x201D; she says.<br><br></p><h3><strong>3. Know what you want &#x2013; and go for it</strong></h3><p>Sheila says the trick to moving up within a company is identifying opportunities and grabbing them with both hands.</p><p>&#x201C;I think you have to put yourself out there,&#x201D; she says. &#x201C;I believe you need to make your own opportunities. If you hear about a project that interests you then you should put your best foot forward. If they don&#x2019;t know that you are interested, how are they supposed to know that you want to work on the project?!&#x201D;</p><p>Sheila thought her conversation with her manager in Darwin, where she explained that she wanted to move to the UK, would be difficult &#x2013; but she said it couldn&#x2019;t have been more supportive.</p><p><br></p><h3><strong>4. Be good at what you do</strong></h3><p>Being proactive when it comes to opportunities is a great skill to have in your career-progression arsenal, but Sheila says it&#x2019;s also really important to ensure that you are making an impression within the company.</p><blockquote><p>&#x201C;It&#x2019;s all about the effort that has gone into your roles and being able to constantly prove yourself and being able to manage the challenges that people give you and then go from there when opportunities come about,&#x201D; she says.</p></blockquote><p>After her two years in London, she is now a Senior Project Engineer working on Sydney Metro projects and living in Sydney.</p><p><br></p><h3><strong>5. Get the timing right</strong></h3><p>Knowing when to shift from one role to another is not an exact science, but Sheila says moving within one company is a great advantage because managers are acutely aware of your skills. Of course, she says it helps to have an employer that supports your career pattern and is open to having regular conversations about your future.</p><blockquote><p>&#x201C;Laing O&#x2019;Rourke are all about the career progression,&#x201D; she says. &#x201C;They want to know if you have the experience within a sector or if you wanted to expand into a different area they would help you and put in a succession plan to assist with a handover so you can transition to the next project.&#x201D;</p></blockquote><p>She says the variety offered to her is what keeps her motivated &#x2013; and loyal.</p><p>&#x201C;Laing O&#x2019;Rourke provides great opportunities for career progression and multiple opportunities such as different sectors and locations and I think that&#x2019;s the reason why I have stayed for such a long time &#x2013; I know that I can grow within the company. I wouldn&#x2019;t be here if I didn&#x2019;t enjoy it.&#x201D;</p><hr><h4><strong>About Laing O&apos;Rourke</strong></h4><p>Laing O&apos;Rourke is an Endorsed Employer for Women. <span data-entity-hovercard-id=\"urn:li:fs_miniProfile:ACoAABK3y-4BqR3FrxbVGqRtpENOC8yesMjZ3mI\">Their Managing Director Cathal O&apos;Rourke</span><span id=\"ember10370\">&#xA0;is a WGEA Pay Equity Ambassador. Named twice as Australia&#x2019;s Top 10 most innovative businesses, Laing O&#x2019;Rourke offers generous paid parental leave (26 Weeks), competitive pay, flexible work arrangements and career progression working on exciting projects. Building the future pipeline of women in STEM is also a priority. Their &#x201C;Inspiring STEM+&#x201D; is a school program designed to encourage more girls into STEM courses at university and ultimately careers in construction and engineering.</span></p><p>Learn more about the company <a data-cke-saved-href=\"https://www.work180.com.au/clients/laing-orourke\" href=\"https://www.work180.com.au/clients/laing-orourke\">here.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=laing-orourke\" href=\"https://www.work180.com.au/job-search?client=laing-orourke\">Apply for jobs</a> with Laing O&apos;Rourke today.&#xA0;</p><p><img alt=\"Laing O&apos;Rourke\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d1cf6fc0-6ec2-4c9a-aa49-8c31f693c55e.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d1cf6fc0-6ec2-4c9a-aa49-8c31f693c55e.jpeg\" style=\"margin: 10px; width: 300px; height: 137px;\"></p><hr><strong></strong><section><section><h3><strong>About WORK180</strong></h3></section><section><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><div><br></div></section></section>\n\t\t\t\t","tags":["Career Development","Employee Stories","Celebrating Women"],"upload_date":"2017/12","associated_company":"work180"}