{"url":"https://www.work180.com.au/blog/2016/02/5-tips-to-stay-mentally-fit-under-pressure","title":"5 Tips to Stay Mentally Fit Under Pressure","author":"WORK180","body":"\n\t\t\t\t\t<p>This article&#xA0;was originally published on&#xA0;<a href=\"http://www.thebusinesswomanmedia.com/5-tips-to-stay-mentally-fit-under-pressure/\">The Business Woman Media</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Entrepreneur life &#x2013; and any career or business path &#x2014; is a rollercoaster. It&#x2019;s filled with extreme highs and successes, followed by stress and disappointment, then all the way back up to being on top of the world. This of course isn&#x2019;t a healthy way to live, which is why since co-founding Diverse City Careers (DCC), my co-founder and I have focused on practical ways to stay both mentally and physically fit.</p>\n\n<p>Mindfulness and wellness are key components to success, as they regulate the stress we may feel on a day to day basis. Below are some of tips that I&#x2019;ve picked over the years that help me stay focussed, in control and performing at my optimum:</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>1. Don&#x2019;t skip on the 8 hours</strong></h4>\n\n<p>Getting enough sleep is probably one of the most important, yet most challenging things we can do to ensure we have a clear and focussed mind the next day. I&#x2019;ve struggled a lot with sleep- it&#x2019;s hard to lie in bed, filled with adrenalin from an exciting day and unable to switch off. However, recently I was introduced to the mobile application Calm. This app is fantastic &#x2014; it helps with meditation and winding down before bed.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2. Get your heart rate up</strong></h4>\n\n<p>Every morning when I wake up at 4.30am, I do 45 minutes of cardio. This includes either going for a run or doing a cardio box class. I absolutely LOVE boxing. It&#x2019;s an amazing stress relief and allows me to clear my mind for the day ahead.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3. Turn it off</strong></h4>\n\n<p>How many of us are tempted to drop everything and respond straight away every time we hear the beep of our phones or email alert flashing up on our computers? I&#x2019;d say it&#x2019;s 99% of us and I am probably the guiltiest. I recently introduced the concept of &#x201C;screen free Sunday&#x201D; to my week. During a 3 hour period every Sunday, I turn off my phone and laptop and take time out to just reconnect with myself and relax.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>4. Talk to someone</strong></h4>\n\n<p>I&#x2019;m so lucky with DCC to have Valeria Ignatieva as my co-founder. Valeria is not only a business partner, but a best friend and support system. If ever I&#x2019;m feeling pressure, one of the best things I can do is speak to Valeria about those pressures. It&#x2019;s good just to have someone to speak to and help put things into perspective when needed.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>5. Don&#x2019;t be so hard on yourself</strong></h4>\n\n<p>It&#x2019;s important to realise that stress is perfectly normal, particularly if it&#x2019;s because of something you&#x2019;re very passionate about. When you get stressed, sometimes it can be exacerbated by feelings that you&#x2019;re not supposed to be having those emotions and coping better. If you find that you&#x2019;re beating yourself up every time you become stressed, just stop! Take a step back, go for a walk, talk to someone or turn off that phone for 20 minutes and relax.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About Gemma Lloyd</strong></h4>\n\n<p>Gemma Lloyd is the co-founder of DCC Jobs, Board Member of IT Queensland and Committee Member of Females in Technology and Telecommunications (FITT). Gemma is a regular speaker at events focused on women&#x2019;s confidence, personal branding and gender diversity. Such events include DCC&apos;s Better Ways of Working meetups, Women in Digital, XX in Tech, Griffith University&#x2019;s &#x201C;Leadership Engaging Diversity&#x201D; and the keynote at SOPAC 2016.</p>\n\n<p>Together with Valeria Ignatieva, Gemma founded DCC Jobs with the goal of making a difference. DCC Jobs a niche job site helping women pursue rewarding careers, across any industry. DCC does not advertise anonymous recruiters&#x2019; jobs and pre-screens employers who wish to post jobs to ensure they are committed to supporting women&#x2019;s careers.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/02","associated_company":"work180"}