{"url":"https://www.work180.com.au/blog/2017/09/5-ways-to-recover-from-a-redundancy","title":"5 ways to recover from a redundancy","author":"WORK180","body":"\n\t\t\t\t\t<p><em>&quot;No longer required&quot; was all I remember hearing when a former employer announced I was being made redundant. I never thought it would happen to me - that somehow, I was immune.</em></p><p>I went through a range of emotions &#x2013; shame, fear, despair, anger, relief. But I kept reminding myself that as much as I wish I could, I had no control of the situation or its inevitable outcome. We can easily dwell on the past but it is what we do next that matters.</p><p>So if you ever find yourself needing some guidance as you turn to the next chapter in your career, here are five tips to help you get started:</p><p><br></p><ul><li><strong>Harness your emotions</strong></li></ul><p>&#xA0;Rejection hurts. But instead of being bitter, harness your emotions positively to motivate and drive you to become better. There will be tough days but you need to stay focused and take the wins along with the setbacks.</p><p>Do activities that allow you to improve your state of mind. For example, exercise can do wonders on your mental, physical and emotional health. Let others know you are going through a challenging time so that you can rely on friends and family for support or seek professional counsel if required. Volunteering can be very therapeutic too, it is a great opportunity to give back and can often help put things into perspective.</p><p><br></p><ul><li><strong>Do at least one thing a day</strong></li></ul><p>&#xA0;It&#x2019;s important to try to achieve something every day, no matter how trivial it may be. Begin with the end in mind. Set a goal and mark key milestones you want to reach along the way. It could be making that first phone call or submitting a job application, following up a lead or meeting up with people in your network.</p><p>There will be times when you feel you have exhausted all avenues. Keep pushing, be innovative, or do something that is out of your comfort zone. As long as you keep chipping away, it will eventually lead you to success.</p><p><br></p><ul><li><strong>Network, network, network</strong></li></ul><p>&#xA0;During job searches, merit can get you a long way but often it is who you know that will help you get a leg up on the competition.</p><p><a data-cke-saved-href=\"http://www.linkedin.com/\" href=\"http://www.linkedin.com/\" target=\"_blank\">LinkedIn</a>&#xA0;is one of the most useful networking tools available. Connect with influential people in your industry and start a dialog with them. Be authentic and ask for help. Don&#x2019;t be afraid to request a meeting to show them how committed you are and how much you have to offer.</p><p>Attend relevant industry events, conferences and seminars. These avenues offer the perfect opportunities to network with the people you need to know. I attended an interstate networking event that allowed me to grow my network and lead to potential leads.</p><p><br></p><ul><li><strong>Consider your options</strong></li></ul><p>&#xA0;Be flexible - you never know what and where opportunities may lead you when you keep an open mind. I considered moving interstate, or even overseas, as a potential option. Consider contingent work, there are many sites like&#xA0;<a data-cke-saved-href=\"https://www.freelancer.com.au/\" href=\"https://www.freelancer.com.au/\" target=\"_blank\">Freelancer</a>,&#xA0;<a data-cke-saved-href=\"https://www.upwork.com/\" href=\"https://www.upwork.com/\" target=\"_blank\">Upwork</a>&#xA0;and&#xA0;<a data-cke-saved-href=\"https://www.fiverr.com/\" href=\"https://www.fiverr.com/\" target=\"_blank\">Fivver</a>&#xA0;that offer opportunities for you to pick up contract or casual work. Often it&apos;s about getting through that first door and letting it lead to the next thing.</p><p>Share your knowledge as a subject matter expert. Write articles based on your area of expertise and share your experience and knowledge with your growing network. Once you start to build a reputation in the industry, you might find people approaching you for consulting work.</p><p><br></p><ul><li><strong>Pay it forward</strong></li></ul><p>I am a big believer in giving back and helping others. So if anyone ever reaches out to you, do try to help them out to the best of your abilities - it often doesn&apos;t cost a thing. And if you received help from someone, remember to acknowledge them for their kindness and generosity. It&apos;s a small world so remember to never burn any bridges.</p><p><br></p><p>Good things come to those who persist. Be true to yourself and do not be discouraged if you find yourself in such a situation. As the saying goes &#x2013; when one door closes, another opens.</p><p><br></p><p>Stay positive everyone.</p><p><br></p><p>Nathan is one of our contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>.</p><p><br></p><h5><strong>About DCC Jobs</strong></h5><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers. Set up your job alert with <a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a> now.&#xA0;</p>\n\t\t\t\t","tags":["job seeking tips","Career Development"],"upload_date":"2017/09","associated_companies":["work180"]}