{"url":"https://www.work180.com.au/blog/2017/12/50-years-in-it","title":"50 Years in IT – Looking Back and Looking Forwards","author":"WORK180","body":"\n\t\t\t\t\t<p style=\"text-align: center;\"><em><small><span style=\"color:rgb(33, 33, 33)\">Pictured above: Me (Sue Nielsen) with Richard Hatch (star of both Battlestar Galacticas) at Supanova 2009 when I launched my sci fi novel Behind the Sun (I had a terrible crush on him when I was young!).</span></small>&#xA0;</em></p>\n\n<p>Looking back over 50 years of work, I realise that it took me a while to understand why I gravitated towards the technical in every job. The IT related areas I&#x2019;ve worked, taught or researched in are surprisingly diverse. In roughly chronological order &#x2013; linguistic analysis, library systems, instructional technology and multimedia, desktop publishing, videotex and teletext, small business systems, software configuration management, systems analysis and business analysis and most recently, writing science fiction and studying new technologies to help very young Deaf children to learn signing. Overarching all of these has been a real desire to understand how IT affects women.</p>\n\n<p>When I graduated from Auckland University in 1967 I didn&#x2019;t think about a career in IT or anything else for that matter. But I needed to earn a living, I wanted to travel and I knew that the most dangerous thing for me was to be bored. I applied for a job in Sydney and three years later had good experience and a post graduate diploma in librarianship &#x2013; a qualification accepted worldwide and with huge opportunities in the automation of cataloguing, circulation and information retrieval. I travelled overland to London and found lots of contract work which paid for two years of tripping around Europe and North Africa.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ddedc0a2-7487-4b0c-b73a-408e65e15052.jpeg\"></p>\n\n<p style=\"text-align:center\"><em><small>A newspaper picture and article about my group getting trapped by landslides in Nepal in 1971 (a very exciting but fortunately not fatal event in my overland trip)</small></em></p>\n\n<p>Back in Sydney, married and thinking of starting a family, it never occurred to me to give up working. But in the 1970s child care was difficult to find and very expensive and I needed employment that would give me flexibility. So I slid sideways into academia (under the false impression that lecturers got the same holidays as teachers!!).</p>\n\n<blockquote>\n<p>Supported by several female colleagues who felt the same way, we all returned to work shortly after childbirth, fielded the often virulent criticism and practised guerrilla warfare against hostile university administrators. Within five years, the six of us had ten children between us and our department was nicknamed &#x201C;Maternity Studies&#x201D;.</p>\n</blockquote>\n\n<p>After that bracing experience, my move in 1989 from IT in a library science faculty to IT in a male dominated engineering faculty was an enormous cultural shock. So, I became intensely interested in gender and IT. When Liisa von Hellens and I started the WinIT project and gained an ARC Large Grant to study the declining participation of women in IT, our male colleagues were amazed and asked when we intended getting back to our &#x2018;real&#x2019; research. Well, of course, we managed to do both. But that&#x2019;s when I realised what all the diverse areas of my work and research had in common &#x2013; the transforming power of Information Technology and its effect on information. Both of these are really important to women.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3754a5e0-1371-45f6-998b-057f9bb0bc42.jpeg\"></p>\n\n<p style=\"text-align:center\"><em><small>William, my grandson who was born profoundly deaf and my motivation for making that my most recent research area.</small></em></p>\n\n<p>As an immigrant, I have always been fascinated by the power of language. People are meaning makers and meaning is encoded in language (verbal, symbolic and mathematical) and more recently into information systems which freeze meaning into patterns that often disenfranchise women and minorities. One of the greatest things about getting a PhD is being able to tick the genderless &#x2018;Dr&#x2019; box when I fill in forms. Why do we need to know anyone&#x2019;s gender and why is a woman&#x2019;s &#x2018;marital&#x2019; status anybody else&#x2019;s business? We need to change all that.</p>\n\n<blockquote>\n<p>I believe that women have been more affected by technology than men. Contraceptive technologies and the automation of jobs which were previously considered unsuitable for women have opened up vast landscapes of opportunity. I also argue that women are most suited to building innovations in IT because we are the ones who have had to figure out what to do with all these new opportunities &#x2013; what it means to be human in a post-industrial society. We can&#x2019;t go back, and really, who would want to? The big question is &#x2013; where do we go from here?</p>\n</blockquote>\n\n<p>So towards the end of my &#x2018;career&#x2019;, I have become involved in Jenine Beekhuyzen&#x2019;s <a href=\"https://www.dccjobs.com/what-women-want/support-network/charitable-organisations/tech-girls-movement\">Tech Girls Movement,</a> which I think has the best chance of subverting conventional ideas about what women should be doing in IT and indeed what on earth &#x2018;IT&#x2019; means. We believe IT is about imagination, inspiration, finding what you are good at and getting on with it.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/701f4ccf-c6be-4ff7-af4e-1be5e1724f72.jpeg\"></p>\n\n<p style=\"text-align:center\"><em><small>Jenine Beekhuyzen&apos;s PhD graduation with Associate Professor Liisa von Hellens (we were Jenine&apos;s supervisors) Don&apos;t we all look happy :)</small></em></p>\n\n<p>Jenine inspired me to think about what my &#x2018;super power&#x2019; might be, so I have named my post &#x2018;retirement&#x2019; business &#x201C;Serendipity Research&#x201D;. I like the idea of the lucky guess and taking up opportunities as they come along. So I&#x2019;ve never done any long term planning. I like to dive into the deep end and see if I can swim. If you figure out what it is about IT (or anything else) that makes you tick, you won&#x2019;t go wrong.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1110a2ba-6183-4d65-ab9c-74dd6e9fd694.jpeg\"></p>\n\n<p style=\"text-align:center\"><em><small>At the&#xA0;2016 TGAS2 book launch at Google in Sydney.</small></em></p>\n\n<p>Has anything improved in the last 50 years? The most heartening thing for me is to see women supporting each other in greater numbers, instead of treating those of us who choose to pursue passions other than (or as well as) raising children with animosity and suspicion. I have never had a mentor as such (it&#x2019;s a pretty new idea) but I automatically incline towards female colleagues who make up for my weaknesses &#x2013; colleagues who are meticulous, sympathetic, patient, and good at networking &#x2013; you know who you are! I&#x2019;m not sure what I could have achieved without you.<br>\n&#x200B;</p>\n\n<h5><strong>About DCC Jobs</strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an essential<a href=\"https://www.dccjobs.com/clients\"> tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women","Pictured above: Me (Sue Nielsen) with Richard Hatch (star of both Battlestar Galacticas) at Supanova 2009 when I launched my sci fi novel Behind the Sun (I had a terrible crush on him when I was young!).","A newspaper picture and article about my group getting trapped by landslides in Nepal in 1971 (a very exciting but fortunately not fatal event in my overland trip)","William my grandson who was born profoundly deaf and my motivation for making that my most recent research area.","Jenine Beekhuyzen's PhD graduation with Associate Professor Liisa von Hellens (we were Jenine's supervisors) Don't we all look happy :)","At the 2016 TGAS2 book launch at Google in Sydney."],"upload_date":"2017/12","associated_companies":["work180"]}