{"url":"https://www.work180.com.au/blog/2016/11/6-steps-for-transitioning-to-working-flexibly-after-maternity-leave","title":"6 Steps for Transitioning to Working Flexibly After Maternity Leave","author":"WORK180","body":"\n\t\t\t\t\t<p>After working full time for 10 years, Sarah did not find the transition to working part-time after maternity leave easy. Sarah is a Senior Transport Planner at AECOM and her role involves leading multidisciplinary projects. Sarah shared with us the steps she took to overcome the initial feelings of doubt and feeling torn between delivering the kind of results she was used to pre-baby, and being present for her family at the same time.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Step 1: Adjust your expectations</strong></h4>\n\n<p>&#x201C;It&#x2019;s not easy to progress to&#xA0;part time&#xA0;after years of working full time and you need to accept that you just can&#x2019;t do it all,&#x201D; Sarah told us. &#x201C;When I first returned to work, I felt like I was going&#xA0;backwards&#xA0;and I couldn&#x2019;t take on certain responsibilities because I wasn&#x2019;t always in the office.&#x201D; Sarah found herself having to evaluate what she wanted out of her career and&#xA0;realised&#xA0;she could still have the enjoyment of a challenging role, just with a slightly different focus.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Step 2: Find your ideal rhythm, and don&#x2019;t be hard on yourself</strong></h4>\n\n<p>Initially&#xA0;Sarah was working two days a&#xA0;week,&#xA0;but quickly&#xA0;realised&#xA0;that in reality, she was working a lot more. &#x201C;I found I just couldn&#x2019;t get enough done in two days so I was stressed, bringing work home and finding it very difficult as I don&#x2019;t like leaving things unfinished.&#x201D;</p>\n\n<p>Sarah spoke to her manager and together, they agreed to trial working three days per week. &#x201C;I wanted to own the work that I do and made sure to align my needs with the business, taking into consideration my role, responsibility and team&#xA0;requirements.&#x201D; Sarah told us things did not all fall into place overnight and her advice to new&#xA0;mums&#xA0;is to be patient whilst figuring the ideal balance- each situation will be different.</p>\n\n<p>Sarah will be going on her second maternity leave later this year and has decided that when she returns, she will follow the pattern of working three days, as she knows it suits her and the business well.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3c8bd145-e92d-41e8-8626-b327c4efbf1d.jpeg\"></p>\n\n<h4>&#xA0;</h4>\n\n<h4><strong>Step 3: Manage expectations, internally and externally</strong></h4>\n\n<p>We asked Sarah how she manages such an intricate role with so many stakeholders while working flexibly.&#x201D;I was really grateful&#xA0;at&#xA0;the ease and simplicity of this process and how accommodating AECOM was to my flexible working requests, AECOM has also ensured I have the technology available to work remotely as and when required,&#x201D; said Sarah, describing her working style and putting an emphasis on the importance of switching off. &#x201C;My team is great, they understand my situation. My clients are across my availability and are also fine with it. On my days off, I can take care of urgent priorities via email on my phone, and we find that works well for keeping our communications fluid.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Step 4: Actively promote flexible working and gender diversity</strong></h4>\n\n<p>&#x201C;I see flexibility always promoted internally,&#x201D; said Sarah. &#x201C;From letting new starters know it&#x2019;s the &#x2018;norm&#x2019; to reinforcing people&#x2019;s schedules in team meetings, to the HR team communicating flex options, we&#x2019;re constantly talking about it.&#x201D; Sarah&#x2019;s colleagues&#xA0;<a href=\"https://www.diversecitycareers.com/page/about-us/campaigns/aecom-flexibility-works/\">embrace flexibility</a>&#xA0;in a number of ways. &#x201C;Each situation is different and is managed appropriately,&#x201D; said Sarah. &#x201C;For example, one of my team members works around his school-aged children and simply blocks out his diary when he is unavailable, and people choose other&#xA0;timeslots&#xA0;to schedule meetings with him.&#x201D;</p>\n\n<p>Sarah&#x2019;s often approached by others in the company for advice on making it all work. Sarah finds internal forums such as mCircles (AECOM&#x2019;s mentoring program for women) is a great way to raise awareness of flexibility, along with word of mouth between colleagues and peers.</p>\n\n<p>&#x201C;Our Managing Director, Lara Poloni is an inspiration,&#x201D; shared Sarah. &#x201C;There&#x2019;s quite a drive internally to promote gender diversity -both my regional manager and my direct manager are female, and there&#x2019;s a lot of initiatives in place to increase the number of women within AECOM.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Step 5: Never be afraid of asking for what you want</strong></h4>\n\n<p>Coming back from maternity leave was not Sarah&#x2019;s first experience with managing change in her career. Sarah has worked with AECOM for nearly 12 years and shared her experiences with moving continents and exploring different roles. &#x201C;Back in 2010, when AECOM became global, I approached my manager to see what my chances were to get a transfer to the Auckland NZ office from the Birmingham UK office. I made it happen purely by being persistent and asking lots of questions around role global mobility,&#x201D; Sarah told us. Sarah and her husband enjoyed living in NZ so much, they chose to stay and AECOM again was supportive and enabled Sarah to transfer indefinitely.</p>\n\n<p>A few years later, Sarah was offered a&#xA0;six month&#xA0;secondment in Singapore - she thoroughly enjoyed this experience and&#xA0;learnt&#xA0;a lot from working in a different culture and environment. &#x201C;Not long after, my husband was offered a position at Tauranga City Council and I approached my manager about my possible relocation from the Auckland office to the (then very small!) Tauranga office. This was met with a positive response and flexibility over relocation timing.&#x201D;</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9ecee104-5656-41f3-ac54-41b1a2c765c9.jpeg\"></p>\n\n<h4>&#xA0;</h4>\n\n<h4><strong>Step 6: Be patient with yourself</strong></h4>\n\n<p>Sarah found moving to a new country was very similar to coming back from maternity leave. &#x201C;In a way, it also felt like I took a step&#xA0;backwards&#xA0;when it took me a little while to settle in&#x201D; recalled Sarah. Although she was still doing the same job, with the same company, she found that things were done differently in New Zealand compared to the UK.</p>\n\n<p>&#x201C;It&#x2019;s important to have patience when you make a change. Give yourself time and don&#x2019;t worry about not settling in straight&#xA0;away-this&#xA0;is completely normal!&#x201D; concluded Sarah.</p>\n\n<p>&#xA0;</p>\n\n<p>Read more about AECOM and view their jobs <a href=\"/clients/AECOM\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/11","associated_company":"work180"}