{"url":"https://www.work180.com.au/blog/2017/08/6-ways-to-encourage-your-children-to-study","title":"6 Ways to Encourage Your Children to Study","author":"WORK180","body":"\n\t\t\t\t\t<p>Instilling a study habit among your kids could prove to be a challenge, especially with all the distractions that high-tech gadgets can offer them nowadays. Instead of opening books, they&#x2019;d rather turn on the television or log into YouTube or play games from your mobile device. This is not exactly surprising though, given that most adults would also prefer light entertainment than tedious studying.</p>\n\n<p>However, if you want to raise kids who are studious and academic achievers, you have no choice but to ensure that they get into the habit of studying. As most parents would say, it is best to &#x201C;start them young,&#x201D; but how can you successfully do this? Below are six ways on how to encourage your kids to study - and hopefully get them into the habit of studying in the process.</p>\n\n<h4>&#xA0;</h4>\n\n<h4><strong>1. Use the Reward System</strong></h4>\n\n<p>Although some parenting books discourage using a reward or incentive system, it is still a rather effective tactic to get anyone (especially kids) started on a certain task. Basically, it might be safe to say that a reward system works - only if it is coupled with other ways to ensure that your kid keeps up the habit even without it.</p>\n\n<p>To instill a habit of studying, you must encourage a habit of reading first. For example, task your children to read at least one book in a given week (most preferably, a book of their choice), and when they finish it, treat them to an ice cream&#xA0;or any type of prize that can motivate them.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2. Be the Role Model</strong></h4>\n\n<p>Children usually follow your lead. As a parent, it is your responsibility to set a good example for them. So if you express no interest in books, homework&#xA0;and school projects, your kids would most likely be disinterested too.</p>\n\n<p>As much as possible, start with yourself! Show your kids that you too, love books - tell them stories from your favorite novels, show enthusiasm and radiate challenging ideas whenever they need help in homework and school projects.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3. Teach them to Study Smart</strong></h4>\n\n<p>That&#x2019;s the new age motto: Study smart, not hard. So what does that mean? Studying smart is a series of steps for better understanding and retention of the subjects and topics that you&#x2019;ve tackled. It includes making notes or a personal reviewer of the lessons you read, so you don&#x2019;t have to re-open the book again during exam week.</p>\n\n<p>Studying smart could also be in the form of study groups (if it works for you and your child), and using other materials to improve retention such as mobile apps (whenever applicable to the subject), educational videos and songs.</p>\n\n<p>Just to be clear here, you still need to encourage your child to read the book, since there is no substitute to reading. However, along with that, you need to teach them how to make comprehensive notes that can be simply used once quizzes and exams are around the corner.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>4. Make It Fun</strong></h4>\n\n<p>This is part of studying smart. Like most adults, children would most likely lose interest when they are subjected to long hours of reading and studying, so always make it a point to loosen up once in awhile and allow them to take breaks in-between.</p>\n\n<p>As much as possible, you should avoid associating studying with boring. So whenever looking at your children&#x2019;s books, try to tell them stories and anecdotes that they can relate to, challenge them to question things or bring up ideas that are new to them. That way, your children will associate studying with exploration and storytelling, not just a mere requirement that they have to do because of school.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>5. Dedicate A Study/Reading Space</strong></h4>\n\n<p>Of course, your home should be conducive enough for learning. If your child does not have a study area yet, carve out one for them. And to make it more inviting, enjoin them to decorate their study table, wallboard and other materials with you. Establishing a space for studying is also part of their discipline - a crucial element when it comes to building their study habit.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>6. Always Allot a Time for Pure Play</strong></h4>\n\n<p>Your kids might have all the weekends dedicated to pure play (including Friday afternoons), but it does not mean that you should not also incorporate playtime during the weekdays. For example, if your usual study schedule consists of two hours each weekday (with 20 minutes of break), assign a day or days wherein your child only needs to study for an hour. This can be done on Wednesdays or Fridays, and is perfect for only review and follow-up purposes. This should be done to avoid your kids from being burnt out.</p>\n\n<p>Your children might not adopt a study habit overnight, but these little routinary changes can build up towards one. Just make sure that you keep studying time and play schedules consistent each day - and don&#x2019;t forget to fulfill your promise whenever your child deserves a reward!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/08","associated_companies":["work180"]}