{"url":"https://www.work180.com.au/blog/2018/07/a-career-in-security-is-anything-but-a-regular-it-job","title":"A career in security is anything but a regular IT job ","author":"WORK180","body":"\n\t\t\t\t\t<p><em></em>In today&#x2019;s digital world, protecting IT systems, data and even your identity is a burgeoning business &#x2013; and careers for women in this sphere are growing just as fast.</p><p>Fatema Hashmi, a security consulting analyst with Accenture, achieved her position through a combination of an early interest in IT, a &#x2018;women in tech&#x2019; networking event and a little curiosity.<br></p><p>Here, she takes us on a journey through her career path and offers advice to women who may have an interest in IT security, but who may have found it too daunting.&#xA0;<br></p><h3><strong>It&#x2019;s IT, but not as you know it</strong></h3><p>Fatema was always destined for a career in IT, but security wasn&#x2019;t initially on her radar. She completed a Bachelor of Information Technology, Networking and LAN/WAN management at the University of Ballarat and worked in a number of varied roles to &#x201C;get a foot in the door in IT&#x201D;. These included an IT support officer with a healthcare group, a personal banker with a major bank and a service desk operator with a transport company.<br></p><blockquote><p><em>&#x201C;I started as a systems administrator in IT &#x2013; it was not my chosen career,&#x201D; she says. &#x201C;I actually wanted to become a chemical engineer. So I had varied experiences in different companies and all of these helped me choose carefully as to what I did next.&#x201D;</em><br></p></blockquote><p>Fatema enrolled in a Master of Information Systems with the University of Melbourne and decided to take on another subject out of curiosity &#x2013; security consulting. Accidentally, around the same time she attended a &#x2018;women in tech&#x2019; networking and information-gathering event held by Accenture, where she was encouraged by senior Accenture female leaders to apply. She was accepted, and began work as a Security Operations Analyst six months later after she completed her studies.<br></p><p>Fatema admits she was a little unsure at first about her career move, but says the positive vibe and chatter about diversity at Accenture she got from the networking event proved to not be an anomaly.<br></p><blockquote><p><em>&#x201C;I wasn&#x2019;t sure if the whole career change was a good thing or not, but having said that the moment I joined Accenture, whatever they had spoken about in that women in technology networking event was actually quite true in terms of diversity and women,&#x201D; she says.</em><br></p></blockquote><p>&#x201C;I met women from all strata of life &#x2013; single mums, those who had a career break for 18 months, those who had three kids and were juggling childcare as well as work. It is an all-male environment but there are women there doing their own thing. And there are mentors everywhere. It has been an amazing journey so far.&#x201D;<br></p><h3><strong>What is security?</strong></h3><p>Fatema says the security sector is growing immeasurably as our world becomes increasingly digital and the risk of data hacking to corporations becomes even greater.</p><p>&#x201C;It is not just lock and key any more, it is not safe,&#x201D; she says. &#x201C;Our term deposit, bank account details, it is not just black and white. We have a digital footprint of what we do. With our phones today, we have our internet data and location services turned on so we can be tracked anywhere.<br></p><p>&#x201C;Everything is interconnected so it is definitely an expanding field.&#x201D;</p><p>Security also covers a huge variety of roles. During her graduate program she organisations to determine their level of risk from unauthorised access, hacking or the like.</p><p>&#x201C;It involved looking at the day-to-day operations so it&#x2019;s the log feeds and the information that goes out &#x2013; you analyse that and see if there are any patterns,&#x201D; she explains. &#x201C;And if there are any deviations from those patterns then you decide if it is out of the normal range and go back and check with the person, user or website and determine if it was normal activity or unauthorised access.&#x201D;<br></p><p>As part of a team she helped to develop practical changes to make a system safer and at lower risk of harmful hacks.<br></p><p>Her second and current role is a Security Consulting Analyst. Now she is focused on a more niche area of governance and risk assessment, particularly with respect to security plans, risk management plans, standard operating procedures and data management plans.</p><blockquote><p><em>&#x201C;Developing all the processes and making changes is one aspect of the role,&#x201D; she says. &#x201C;The other is how you implement them, how are those changes are documented, are you tracking those documents and ensuring everything is written down.</em><br></p></blockquote><p>&#x201C;So part of my role of the past eight months has been helping the security team with their documentation work and assessing the current documentation and looking at the gaps.&#x201D;<br></p><h3><strong>Security needs a multitude of skills</strong></h3><p>When she started, Fatema had no prior security experience, and she says a lot of the required skills are learned on the job.<br></p><blockquote><p><em>&#x201C;Reading day-to-day reports and analysing data was something I did as part of an operations analyst, but this was something I did without any prior experience in security,&#x201D; she says. &#x201C;I did have prior IT knowledge, but not security knowledge. So you learn and pick up as you go.&#x201D;</em><br></p></blockquote><p>A qualification in IT is valuable to anyone considering a career in security, Fatema says, but this does not need to be a Masters: a TAFE diploma in IT is a great start. She says those with different backgrounds can also have a successful career once they get used to the IT &#x2018;lingo&#x2019;.</p><p><br></p><p>&#x201C;They might find it hard to understand the concepts in the first six months, but once you have the knack of learning and understanding something and then working towards it, security is something that anyone can get their foot into and navigate.&#x201D;</p><p>Being a people-person, Fatema loves the combination of tech work and client liaison in her role. This combination, she says, is why it can be relatively easy for someone with an interest in IT but no experience can do well if they have sound analytical, problem-solving and communication skills.<br></p><h3><strong>Women play a key role in security</strong></h3><p>But the nitty gritty of her role is not the only thing that excites Fatema about working in security. She sees it as a way to effect change, and to protect future generations &#x2013; something she says other women will empathise with.<br></p><p>&#x201C;Today the world is extremely digital &#x2013; Google assistant can make calls and appointments for you,&#x201D; she explains. &#x201C;Privacy right now is so important and kids are growing up. So security for me is a very apt place. It gives me an opportunity to make decisions that will impact change and other people.&#x201D;<br></p><p>Fatema says Accenture is incredibly supportive to women through mentoring, management support and flexible work practices.<br></p><blockquote><p><em>&#x201C;Since I started a lot of female grads have been hired,&#x201D; she says. &#x201C;I have referred a couple of my female friends who I studied with and they got </em><em>in to</em><em> security as well.&#x201D;</em><br></p></blockquote><p>&#x201C;I feel quite empowered when you see all these females at Accenture and they have been promoted in the past year or so and they have been with the business 15 years &#x2013; it really does say something about the company,&#x201D; she says.<br></p><p>&#x201C;You have to put in your hard yards but once you do that, you have all the scope that you need.&#x201D;&#xA0;</p><br><h4 style=\"font-family: Lato, sans-serif;\"><strong><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:9332486\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7b99efaf-524a-47fa-8ac5-545477cf27a8.png\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7b99efaf-524a-47fa-8ac5-545477cf27a8.png\" style=\"float: right; margin: 10px; width: 162px; height: 170px;\"></span></strong></h4><hr><h4><strong><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:9332486\"></span></strong><strong><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:9332486\">About Accenture</span></strong><br></h4><p><strong><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:9332486\"></span></strong><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:9332486\">Accenture is an Endorsed Employer for Women. Accenture </span><span id=\"ember6195\">&#xA0;is ready to discuss how your role may be done flexibly at the interview stage and support programs for girls learning tech. These are just some of the ways they foster women&#x2019;s careers. Read more about them on their<a data-cke-saved-href=\"https://www.work180.com.au/clients/accenture\" href=\"https://www.work180.com.au/clients/accenture\"> Best Employer page.</a></span><br></p><p>Browse jobs with Accenture <a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=accenture\" href=\"https://www.work180.com.au/job-search?client=accenture\">here.&#xA0;</a></p><p><br></p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/07","associated_company":"work180"}