{"url":"https://www.work180.com.au/blog/2017/04/a-different-approach-to-tackling-unconscious-bias","title":"A Different Approach to Tackling Unconscious Bias","author":"WORK180","body":"\n\t\t\t\t\t<p>International Women&#x2019;s Day is an opportunity to recognise and celebrate the contributions made by women at work and outside of work. It&#x2019;s an excellent event for organisations to reaffirm their commitment to gender equality and showcase the achievements made. It is also a great opportunity to educate everyone on ways we can all play a part in accelerating gender equality</p><p>Whilst many organisations focus on hosting breakfast and lunch seminars, panel discussions and speeches,&#xA0;<a data-cke-saved-href=\"http://www.diversecitycareers.com/schneider%20electric\" href=\"http://www.diversecitycareers.com/schneider%20electric\">Schneider Electric</a>&#xA0;took a somewhat different approach.</p><p>&#x201C;During a planning meeting for this year&#x2019;s International Women&#x2019;s Day the idea to take a more creative approach was suggested as a way to increased engagement and participation and ultimately&#xA0;increase awareness of unconscious bias, so we decided to tackle the topic through the lens of satire and humour3&#x201D;&#xA0;explained Gillian Folan &#x2013; Technical Support Engineer and D&amp;I Council Chair.</p><p>Although the focus on Unconscious Bias is nothing new but rather a core aspect of diversity and inclusion, the idea of incorporating satire and humour to an otherwise very serious topic might come across as a surprising strategy.</p><p>&#x201C;It was with great excitement on International Women&#x2019;s Day, that we took this year&#x2019;s theme of &#x2018;Be Bold for Change&#x2019; to a new level by hosting self-appointed, self-help Guru and star of Australia&#x2019;s Got Talent &#x2018;Jan van de Stool&#x2019; (the comedy alter-ego of Queenie van de Zandt, a well-known Australian theatre actress, singer, comedian and writer) to deliver our keynotes address&#x201D;.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/632e095b-989f-4582-a769-74616f7d46bd.png\"></p><p>The word about the event spread quickly and safe to say, the organisers experienced the largest turn out of any International Women&#x2019;s Day event to date.&#xA0;</p><p>Jan van de Stool certainly put on a show, but not without the help of the audience. At one point, the staff were asked to participate in exercises in the form of interpretive dance which had the whole audience bursting with laughter. Most importantly, Jan was able to approach the sensitive subject of Unconscious Bias in a straightforward, humorous and thought provoking way, breaking down the barriers and encouraging conversations around the topic.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7cd5972a-2104-446e-967d-2f58e00636ef.png\">&#x200B;</p><p>Feedback from the staff was equally as enthusiastic.&#xA0;&#x201C;I was really interested to see how the audience would relate to this unconventional approach to an otherwise serious subject. It was great to see the audience participation and the laughter in the room was infectious. Jan van de Stool was skilfully able to turn the conversation about Unconscious Bias into an engaging and fun activity, without removing the seriousness and significance of the topic&#x201D;&#xA0;said Jane Butler - Head of Talent Acquisition ANZ.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p><p><br></p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/04","associated_company":"work180"}