{"url":"https://www.work180.com.au/blog/2018/02/keeping-in-touch-days-parental-leave","title":"A Great Trade Secret — Keeping In Touch Days","author":"WORK180","body":"\n\t\t\t\t\t<hr><p>Have you heard of them? Don&#x2019;t worry, as most women we speak to haven&#x2019;t.</p><p>Keeping in Touch days are seriously an incredible benefit to access. They provide an extra boost to your bank account whilst retaining your networks in the workplace and keeping your toes in the water.</p><p>In a nutshell, these little-known but valuable days allow you to go back to work for a few days (up to 10) and get paid for it whilst on parental leave. They are paid at the employee&#x2019;s usual rate of pay and are designed to assist you to keep in touch and facilitate a return to work.</p><p>So why don&#x2019;t women use these? Most probably find it too hard to organise or think about, and they struggle to have the conversation with their manager.</p><h3><strong>There are some rules, so let&#x2019;s cover these first:</strong></h3><ul><li>The purpose of these days is to facilitate a return to employment.</li><li>Both the employee and employer consent to the employee working for the employer on that day.</li><li>The day is not within 14 days after the birth of the child (if the employee requests) or 42 days (if the employer requests.)</li><li>An employee on unpaid parental leave gets 10 keeping in touch days. This doesn&#x2019;t affect their unpaid parental leave entitlement. Important to note: If an employee takes more than 10 Keeping in Touch days before the end of their Paid Parental Leave period, their Parental Leave Pay will stop.</li><li>An employee on paid parental leave from their employer cannot access this at the same time. You should however speak with your employer about accessing these once your paid parental leave stops.</li><li>If the employee extends their period of unpaid parental leave beyond 12 months, they can take an additional 10 days.</li></ul><p><br></p><blockquote><p><strong>Example: Payment for a Keeping in Touch day to assist with a return to work</strong></p><p><em>Georgia has taken 12 months unpaid leave to look after her newly-adopted son. During this time, her workplace gets a new computer system and everyone needs training in how to use it.</em></p><p><em>To help Georgia&#x2019;s transition back into work after her leave, her manager Alex asks if she&#x2019;d like to come in for a Keeping in Touch day. This means Georgia can do the training with everyone else. Georgia agrees and is paid her normal wage for coming to work.</em></p><p><em>To practise her new skills, she asks Alex if she can come in for a keeping in touch day once a month for six months. Alex agrees.&#xA0;(Source: Fair Work Ombudsman)</em></p></blockquote><p><br>Keeping in Touch days are a fantastic opportunity to refresh your skills, transition back into the workplace, become familiar with new or updated processes, and be involved in&#xA0;forward&#xA0;planning discussions or meetings that may affect your role.</p><h3><strong>There are many ways you can use your Keeping&#xA0;in&#xA0;Touch days.</strong></h3><ul><li>Perhaps your team is having an offsite planning day and you would like to attend.</li><li>You may want to do some training to get your skills updated before returning.</li><li>You may wish to attend a conference.</li><li>You may want to have a regular informal catch-up with your manager or team.</li><li>Or you may just wish to have some time in the office and attend a few meetings.</li></ul><h3><strong>What&#x2019;s not considered a Keeping&#xA0;in&#xA0;Touch day is anything socially related. This includes:</strong></h3><ul><li>Visiting colleagues socially at work.</li><li>Participating in social events, or</li><li>Undertaking other unpaid activities at work, such as accessing emails while on a social visit to the workplace.</li></ul><h3><strong>Now, you don&#x2019;t need to take it all at once. Keeping in Touch days can be worked:</strong></h3><ul><li>As a part day.</li><li>One day at a time.</li><li>A few days at a time, or</li><li>All at once.</li></ul><h3><strong>How to access:</strong></h3><p>You will be paid your normal salary for each Keeping in Touch day or part day. Importantly, you do not need to work a full day for it to be considered. The government is not responsible for making these payments and instead, it is the responsibility of your employer. To&#xA0;utilise&#xA0;these days, contact your employer. We also strongly recommend both you and your employer record the agreed arrangements in place before the keeping in touch activity occurs.</p><p><em><strong>Written by the team at WORK180 partner <a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\" href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\">Circle In.</a></strong></em></p><p><em><strong>For further information, please visit <a data-cke-saved-href=\"https://www.fairwork.gov.au/leave/maternity-and-parental-leave/when-on-parental-leave/keeping-in-touch-days\" href=\"https://www.fairwork.gov.au/leave/maternity-and-parental-leave/when-on-parental-leave/keeping-in-touch-days\">Fair Work Ombudsman</a>.</strong></em></p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p><div><p><br></p></div>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/02","associated_company":"work180"}