{"url":"https://www.work180.com.au/blog/2016/12/a-how-to-guide-on-taking-yourself-out-of-your-comfort-zone","title":"A how-to guide on taking yourself out of your comfort zone","author":"WORK180","body":"\n\t\t\t\t\t<p>Deb Scown is about to move into her third role in three years at Caltex as a National Sales Manager in the B2B team. We spoke to Deb about her journey over the last few years, which saw her take big risks by completely switching industries and throwing herself into the deep end. The end result was refreshing new roles, taking Deb&#x2019;s career to new heights. Here are some tips Deb picked up along the way.</p><p><br></p><h4><strong>Assess what&#x2019;s really important to YOU</strong></h4><p>When Deb was faced with the uncomfortable experience of retrenchment, it caused her to reassess what was really important to her. &#x201C;I loved my job and gave it my all, including putting my kids second at times, feeling guilty both at work and at home. After it happened, my husband really put things into perspective for me,&#x201D; explained Deb. &#x201C;No one would put &#x2018;she was a great manager&#x2019; on your tombstone, he told me.&#x201D; As morbid as that sounded, the message that family is a priority hit home and Deb became determined to find something she really enjoyed doing, with an employer who truly valued her contributions in a flexible work environment.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce7595a2-fd32-4f08-bcd5-1a204f4b68c9.png\"></p><p style=\"text-align:center\"><em>A turn of events in Deb&#x2019;s life caused her to reflect on her most precious experiences with her family.</em></p><p style=\"text-align:center\"><br></p><h4><strong>Forget about &#x2018;relevant&#x2019; experience, and focus on your strengths&#xA0;</strong></h4><p>Deb worked in Supply Chain for her entire career, mostly in FMCG industries, and she began her job hunt by looking for similar roles. &#x201C;When I came across the role at Caltex, the only thing I focused on was the &#x2018;must have fuel industry experience&#x2019; section,&#x201D; said Deb. She was about to dismiss it, although excited about other aspects of the role.</p><p>However, only a few months earlier, Deb attended a talk where she heard about the confronting stats around women hardly putting themselves forward unless meeting all the criteria in a job ad. While generally speaking, men would go for it even if they only ticked a few of the boxes.&#xA0;</p><p>&#x201C;Remembering that eye opening detail was literally the only reason I&#x2019;d hit &#x2018;apply&#x2019; that day,&#x201D; recalled Deb.</p><p><br></p><h4><strong>Enjoy the new experience and ask lots of questions</strong></h4><p>Deb landed the job at Caltex by focusing on her transferrable leadership skills in the interviews.</p><p>Initially based in Queensland, Deb found herself out in the field, looking after fuel terminals along the coastline, discharging ships, working with carriers and leading a great team who love the work they do.</p><p>Deb remembers her first few months as both overwhelming, yet energising. &#x201C;Everything was new again, it was so refreshing and I was like a sponge, taking in everything and asking a lot of questions.&#x201D;&#xA0;</p><p>After about a year and a half in the role, Deb received a call from Caltex&#x2019;s Executive General Manager of Commercial, who had heard about her work and asked if she was interested in considering a new role in Commercial Marketing and based in Sydney.</p><p>&#x201C;We always said we&#x2019;d move for the right opportunity and I did not think I&#x2019;d ever get a chance to do something outside of Supply Chain. According to my husband, it was the most excited he&#x2019;d ever seen me about a job! &#xA0;With his amazing support, we took the big step of moving our family.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/11e17baf-ff9b-4646-920c-0c8a10f262f9.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/11e17baf-ff9b-4646-920c-0c8a10f262f9.png\"></p><p style=\"text-align:center\"><em>Deb at her first role at Caltex with two of her team members at the biggest fuel terminal in Queensland</em></p><p style=\"text-align:center\"><br></p><h4><strong>All the decisions about your career are made without you in room</strong></h4><p>When we asked Deb what contributed to getting the tap on the shoulder for an amazing role of Transformational Officer after such a short stint, she credited delivering results, sponsors and networking.</p><p>&#x201C;Ask me a few years ago and I wouldn&#x2019;t have even known what a sponsor was. A sponsor is very different to a mentor,&#x201D; she explained. &#xA0;&#x201C;A mentor is someone you ask to help you, but a sponsor tends to want to help because they see you in action. You have to be delivering results and getting opportunities to present to them.&#x201D; Deb suggests simply reaching out to people you want to know within the organisation as the first step. &#x201C;The culture at Caltex presented lots of opportunities to do this easily. If I wanted to meet someone or build a relationship, I&#x2019;d ask them for a coffee. &#xA0;Getting to know someone over a coffee allows you to get to know a person not just the role they do in the business. &#xA0;You never know who may be a sponsor, it might be someone you had coffee with two years ago!</p><p>Deb also shared a favourite book of hers on this subject, called &#x2018;Expect to Win&#x2019; by Carla Harris.</p><p><br></p><h4><strong>Create your own networks</strong></h4><p>When Deb first moved to Sydney, she wanted to find a way to meet more of her colleagues, help increase other people&#x2019;s networks and provide an opportunity for her younger colleagues to learn from their peers. &#xA0;So Deb created a networking group called WIFI (Women in the Fuel Industry), which is open to everyone at Caltex. &#x201C;It&#x2019;s all about sharing our journeys and lightbulb moments,&#x201D; said Deb. &#x201C;So far, we&#x2019;ve had four sessions. We base the topics on what everyone would like to hear about. We&#x2019;ve spoken about elevator pitches, how to sell yourself, the role of sponsors and the importance of networking. These sessions received great support from the Caltex Leadership Team.&#x201D;</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7a5be224-0573-44f1-bed4-b502ffd988ec.png\">&#x200B;</p><p style=\"text-align:center\"><em>Deb presenting at one of the WIFI sessions.</em></p><h4><strong>The importance of an open and inclusive culture</strong></h4><p>&#x201C;Caltex is the first company I&#x2019;ve seen walk the talk when it comes to flexibility,&#x201D; pointed out Deb. &#x201C;In the past, I gave it all and sacrificed personal life. With my oldest son, I could never attend any of his school activities. I actually thought that was the case with many working mothers, but when I went to a Mother&#x2019;s Day event with my younger daughter in her first year of &#xA0;school, I saw there were mothers everywhere and felt terrible that my son was all alone during these events and that I had missed that experience with him.&#x201D;</p><p>Now, Deb enjoys working a day a week from home and can arrange her work schedule so that she can attend reading groups and other school activities at her children&#x2019;s school. Her managers at Caltex have always told her that it&#x2019;s about getting the job done not how many hours you spend sitting at your desk.</p><p>She shared an example of when the supportive culture was most evident. &#x201C;I was about to begin an important presentation when I received a call to pick up my son from school who was unwell. My husband was travelling, so I had no choice but to go and get him myself. Someone else covered for me, and there was absolutely no bad vibes about me having to leave abruptly. The company really does provide an environment where there&#x2019;s so much appreciation for people in the business, which encourages staff to go above and beyond,&#x201D; concluded Deb.</p><p><br></p><p>Find out more about Caltex and view their jobs <a data-cke-saved-href=\"/clients/caltex\" href=\"/clients/caltex\">here</a>.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/12","associated_company":"work180"}