{"url":"https://www.work180.com.au/blog/2018/05/a-mothers-day-gift-that-will-be-appreciated-all-year","title":"A Mother’s Day gift that will be appreciated all year  ","author":"WORK180","body":"\n\t\t\t\t\t<p>No, we don&apos;t mean kitchen appliances, perfume, skin care or other products advertised right now as mums&apos; most desired gifts. We are talking about equality &#x2013; starting at home.</p><h3 style=\"font-family: Lato, sans-serif;\"><strong>Are you happy with the current division of household chores?</strong></h3><p>Research shows women do the lion&#x2019;s share of family chores and housework. For many of us, it can feel like we&#x2019;re going around in circles when it comes to dividing these tasks equally. Which is why we created a special checklist for you to fill out with your partner, to help divide and distribute the household tasks.</p><p><br>With Mother&#x2019;s Day celebrated around the country, what better timing to start this conversation? ;)&#xA0;</p><p><br></p><blockquote><p><big>Download your checklist&#xA0;<a data-cke-saved-href=\"https://mailchi.mp/work180/family-chores-checklist\" href=\"https://mailchi.mp/work180/family-chores-checklist\" target=\"_blank\">here</a></big></p></blockquote><h4 style=\"font-family: Lato, sans-serif;\"><br><br><strong>Instructions:</strong></h4><ol><li>Print a copy of the checklist- one for you and one for your partner.</li><li>Cross out the tasks which are irrelevant to your situation.</li><li>&#xA0;Is anything missing? Add to the list at the end.</li><li>In the first column after each task, fill in how often you do the job: always, often, sometimes, or never.</li><li>&#xA0;Then, fill in how often you experience your partner doing the same task in the second column.</li><li>Use the third column if another person does the task, such as another family member.</li></ol><h4 style=\"font-family: Lato, sans-serif;\"><br><strong>Not sure who does what?</strong></h4><p>If you are not sure how often you, your partner or someone else&#xA0;completes&#xA0;a task, you can use a set<br>period, say one week, to record this.<br><br>Choose a&#xA0;coloured&#xA0;pencil each and draw a vertical line next to the chores you complete. After a while, you can add up the lines for each&#xA0;colour.<br><br>This approach also helps if you think you and your partner may have different perceptions of who<br>does what.</p><h4 style=\"font-family: Lato, sans-serif;\"><br><strong>Upon completion: compare your tasks</strong></h4><p>When you have completed the list, compare your results and see if you have a similar idea of how your household chores and childcare responsibilities are distributed.</p><p><br>Some questions you may like to reflect on:</p><ul><li>Do you have different views on how often you or your partner complete a task?</li><li>If your views differ, why do you think that&apos;s so?</li><li>Why does the split of tasks look the way it does?</li><li>Do you think that your overall work is even or unevenly divided between you in terms of the time and energy it takes to perform them?</li><li>Are you satisfied with the division of labour and tasks that appears on the list? Is there something you would like to change?What could you do to distribute the jobs differently?</li><li>What do you think your children learn from the way you distribute responsibilities and perform tasks at home?<br><br></li></ul><h4 style=\"font-family: Lato, sans-serif;\"><strong>Why is this important?</strong><br><br></h4><p>Whilst WORK180 focus on gender equality at work, it is important to remember work and home are&#xA0;linked, and both dependent on each other. We cannot have equality at work if we don&apos;t focus on&#xA0;what happens at home.&#xA0;Australian women&#xA0;<a data-cke-saved-href=\"http://www.abs.gov.au/websitedbs/D3310114.nsf/home/2016+Census+National\" href=\"http://www.abs.gov.au/websitedbs/D3310114.nsf/home/2016+Census+National\" target=\"_blank\">spend between 5 and 14 hours a week</a>&#xA0;doing unpaid domestic housework, with men spending an average of 5 hours a week on housework.&#xA0;We have not yet seen any research exploring the division&#xA0;in non-heterosexual relationships.&#xA0;<br>&#xA0;<br>Housework and its associated mental labour&#xA0;have&#xA0;long-term economic consequences, particularly for women&#x2019;s employment. One avenue to start a&#xA0;conversation about it is by looking at who does what and when at home.<br><br>This checklist was originally part of a larger healthcare initiative in Sweden to encourage families to&#xA0;share the care of children and household responsibilities. They found shared domestic work&#xA0;increased women&apos;s well-being and decreased stress, meaning women were less likely to take sick&#xA0;leave and miss out on participating in the workforce.&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/blog/2018/05/4-tips-to-conquer-delegating-chores-to-your-kids\" href=\"https://www.work180.com.au/blog/2018/05/4-tips-to-conquer-delegating-chores-to-your-kids\" style=\"background-color: rgb(255, 255, 255); color: rgb(115, 207, 236); outline: 0px !important;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/021f5b80-6246-4b77-9294-49128e1e7e0a.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/021f5b80-6246-4b77-9294-49128e1e7e0a.jpeg\" style=\"float: right; margin: 10px; width: 300px; height: 343px;\"></a></p><div><p><br></p><h4><strong>What about single parents?</strong></h4><p>Encouraging children to get involved in chores early on is crucial for their development and has many other associated benefits.</p><p>Couples can ensure children are involved&#xA0;by&#xA0;assessing the checklist and delegating certain tasks, and single parents can use this to encourage children to help.<br><br>WORK180 Co-founder Valeria Ignatieva shared her experiences of raising a son on her own with tips she learned over the years in this article:<br><a data-cke-saved-href=\"https://www.work180.com.au/blog/2018/05/4-tips-to-conquer-delegating-chores-to-your-kids?\" href=\"https://www.work180.com.au/blog/2018/05/4-tips-to-conquer-delegating-chores-to-your-kids?\" target=\"_blank\"><em>How to Conquer Delegating Chores to Your Children</em></a></p><hr><blockquote><p><big>Download your checklist&#xA0;<a data-cke-saved-href=\"https://mailchi.mp/work180/family-chores-checklist\" href=\"https://mailchi.mp/work180/family-chores-checklist\" target=\"_blank\">here</a>&#xA0;</big></p></blockquote><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2018/05","associated_company":"work180"}