{"url":"https://www.work180.com.au/blog/2018/08/a-passion-for-tech-thats-inspiring-girls-worldwide","title":"A passion for tech that's inspiring girls worldwide","author":"Ami Pasricha ","body":"\n\t\t\t\t\t<p>Ami Pasricha chose to study engineering because of her brother. He was in the middle of a degree and suggested she give it a try. Until then, Ami had changed her mind often. She wanted to be a chef, an accountant and for a while, an actress. But the first time she thought seriously about her career was when she enrolled in a Bachelor&#x2019;s degree in Electrical and Computer Systems Engineering.</p><p><br></p><p>That was five years ago. Ami is now a Product Owner with Telstra&#x2019;s Global Enterprise Product Engineering team and is passionate about her role and industry. She&#x2019;s also very happy to be working at Telstra. She says the company&#x2019;s focus on flexibility and professional development has allowed her to seamlessly manage her day-to-day responsibilities.&#xA0;</p><p><br></p><p>It also means she is able to volunteer her time to Robogals Global, a not-for-profit organisation that enlists university students from around the world to conduct robotics workshops for students, particularly girls, in primary and secondary schools. As the organisation&#x2019;s CEO, Ami is spearheading a global initiative to encourage young women into STEM. So far, Robogals has run more than 3500 workshops and is just shy of reaching 75,000 attendees.&#xA0;</p><p><br></p><blockquote><p><em>&#x201C;We inspire, engage and empower young women to pursue engineering and related fields, and I think that&#x2019;s what it all comes down to,&#x201D; says Ami. &#x201C;I had no idea what engineering was about. I was lucky that my brother recommended it, but a lot of people, especially young girls, don&#x2019;t have that opportunity. That&#x2019;s why I am so passionate about what Robogals is trying to achieve.&#x201D;</em></p></blockquote><p><br></p><p>Just like her choice of university study, Ami wasn&#x2019;t sure what to expect from working at Telstra, but she says her role is energising and fulfilling. As a Product Owner, she liaises with customers to understand their problems and determine their tech needs, then works with her team to create solutions.</p><p><br></p><blockquote><p><em>&#x201C;The thing that gets me really excited about engineering and technology, and why I love doing what I&apos;m doing at Telstra, is that it is so versatile and full of real-life applications. It&#x2019;s about the impact that you are having through the technology solution being developed, as opposed to just playing around with some cool tech.&#x201D;&#xA0;</em></p></blockquote><p><br></p><p>It is this passion that Ami wants to foster through Robogals.&#xA0;</p><p><br></p><p>&#x201C;Being part of something that introduces young girls to robotics, coding and other areas of engineering is deeply gratifying. We recently ran a workshop in Melbourne which was to do with binary numbers, something I didn&#x2019;t learn until my first year of uni. But we are able to get girls as young as five years old thinking about this stuff. And they love it. They get so engaged and involved, the little kids especially.&#x201D;</p><p><br></p><p>While Ami recognises that true equality is still a little way off when it comes to women in STEM, she believes that more and more employers are making lasting commitments to gender diversity in the workplace. Telstra is one of many companies that has endorsed a gender diversity policy in their efforts to foster a more inclusive work environment. Their ongoing support has also enabled Ami to devote time and energy to Robogals and to see the organisation reach new heights.<br><br></p><blockquote><p><em style=\"font-size: 1.6rem;\">&#x201C;My team is also very encouraging and are well on their way of reaching 50:50,&#x201D; she says. &#x201C;Robogals is working hard to change the perception of engineering and STEM not only amongst </em><em style=\"font-size: 1.6rem;\">girls,</em><em style=\"font-size: 1.6rem;\"> but also within the community more broadly. If we can create an environment where young women feel encouraged and supported by their parents and teachers to pursue engineering careers, it will bring us one step closer towards achieving a global culture of diversity and inclusion in engineering.&#x201D;</em></p></blockquote><hr><h4><a data-cke-saved-href=\"https://www.work180.com.au/clients/telstra\" href=\"https://www.work180.com.au/clients/telstra\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ecbbbe56-2d0d-4f6b-bd01-61f9e561d88a.png\" style=\"float: right; width: 88px; height: 100px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ecbbbe56-2d0d-4f6b-bd01-61f9e561d88a.png\"></a><strong>About Telstra</strong><br></h4><p>Flexible working, 16 weeks parental leave, leadership development programs and targets to raise the number of women in leadership. When you see all of Telstra&#x2019;s employee benefits, you&#x2019;ll want to be one of them. We highly recommend visiting the <a data-cke-saved-href=\"https://www.work180.com.au/clients/telstra\" href=\"https://www.work180.com.au/clients/telstra\">Telstra Best Employer page</a>, but it&#x2019;s your call.</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/08"}