{"url":"https://www.work180.com.au/blog/2018/11/learn-and-grow-career-at-BP","title":"A place to learn and grow: How Lisa Archbold built a career at BP","author":"WORK180","body":"\n\t\t\t\t\t<p><strong>Qualified Accountant Lisa Archbold has been with BP for 17 years, driving business success from some truly diverse roles. We sat down with her to find out why she&#x2019;s stayed so long and what she&#x2019;s learned as a female leader in her field.</strong>&#xA0;</p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d383aba3-db15-483d-a48a-1957a49fe1c9.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d383aba3-db15-483d-a48a-1957a49fe1c9.jpeg\" style=\"font-size: 16px; float: right;\"><span style=\"font-size: 1.6rem;\">Lisa Archbold is an accountant by trade but is clearly much more than a number-cruncher. In her 17 years with BP, she&#x2019;s had many different roles, more than half of which have been outside of finance. She says that these rich and diverse experiences are a key reason to stay with a company that has enabled her to live and </span>work<span style=\"font-size: 1.6rem;\"> in the UK, Singapore, Brisbane and now her </span>home town<span style=\"font-size: 1.6rem;\"> of Melbourne.&#xA0;&#xA0;</span></p><p><br>It&#x2019;s obvious from our conversation that opportunity and success haven&#x2019;t simply landed in Lisa&#x2019;s lap. There&#x2019;s no hint of arrogance or self-aggrandizement but Lisa is clearly a woman who has continually stepped up and pushed herself to build her reputation and earn opportunities. She applauds the meritocratic nature of BP and is careful to balance the supportive culture she has consistently experienced, with the need to take ownership of your own career success.&#xA0;&#xA0;</p><p>&#x201C;BP rewards delivery. There&#x2019;s something about getting noticed by achieving, which at BP is about a combination of the value you deliver and how you do it. How do you engage people? How do you bring energy? How do you bring fun?&#x201D;</p><p>For Lisa, that ownership and accountability extend to her views on the importance of&#xA0; sponsorship. She speaks positively about BP&#x2019;s efforts to ensure that its people are continually supported through mentors and sponsors. But she&#x2019;s quick to add that the most powerful and rewarding sponsorship &#x201C;comes from having earned it&#x201D;.&#xA0; &#xA0;&#xA0;&#xA0;</p><p>Like so many, Lisa has experienced challenges, and has had to overcome self-limiting fears. She candidly talks about her initial hesitation to step into a GM role in bitumen, due to a fear of being exposed.</p><p>&#x201C;I started by asking myself why I was hesitating, and what gaps I felt I had. Then I developed a plan based on the things I knew I&#x2019;d need to make myself feel comfortable in the job. I knew I was going into a role with a fantastic team of people. So it was about trusting them and being honest. Put your game face on, by all means, but you can be vulnerable. You just need to show it without it becoming an apology.&#x201D; <img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/54735573-4fcc-4cae-805f-b47d7128cb7f.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/54735573-4fcc-4cae-805f-b47d7128cb7f.jpeg\" style=\"float: right;\"></p><div><p>Lisa has now returned to Melbourne and is working as Planning Performance Reporting and Data Analytics Manager for the Australian Fuel Business. She&#x2019;s thoroughly enjoying her role, and particularly the focus on people engagement. She holds BP up as a company where &#x201C;we really do live our values&#x201D;. For Lisa, this means balancing a supportive and caring environment where people can safely and respectfully challenge and bechallenged.</p><p><br></p><p>As we near the end of the interview, we ask Lisa about balancing her incredible career with life at home. She tells a familiar story of juggling decisions and priorities and of &#x201C;mothers&#x2019; guilt&#x201D;. But she says this has been made easier by the supportive environment at BP, and their openness to having development and career conversations.&#xA0; &#xA0;&#xA0;</p><p><br>&#x201C;You need to deliver, of course, but it&#x2019;s normal to reach out for help. And if you ask for help, you tend to get it.&#x201D;</p><p><br></p><p><br></p><p><br></p><hr><h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\"><strong style=\"box-sizing: border-box;\">About BP<a data-cke-saved-href=\"https://www.dccjobs.com/clients/bp\" href=\"https://www.dccjobs.com/clients/bp\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease 0s;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/736b00f0-00a5-4f77-9f72-f5473de00a2a.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/736b00f0-00a5-4f77-9f72-f5473de00a2a.png\" style=\"box-sizing: border-box; border-width: 0px; border-style: initial; vertical-align: middle; max-width: 100%; float: right;\"></a></strong></h4><p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">In addition to being approved to join WORK180, BP has also received the Flex Able Certification - flexible working has been made a priority in the business. Why BP? 42% female staff and goal of reaching 30% female rep in senior roles in the next 2 years. You could take up to 18 weeks paid parental leave at full pay or 36 weeks at half pay. Evaluate BP for yourself - check out their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/bp\" href=\"https://www.work180.com.au/clients/bp\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease 0s;\">best employer page.</a></p><p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\"><span style=\"box-sizing: border-box; font-size: 16px;\">Apply for jobs with BP&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=bp\" href=\"https://www.work180.com.au/job-search?client=bp\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease 0s;\">here.&#xA0;</a></span></p><p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\"><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p></div>\n\t\t\t\t","tags":["career success","achieving","overcome fears","ask for help","be challenged","support","bp","work life balance","development"],"upload_date":"2018/11","associated_company":"work180"}