{"url":"https://www.work180.com.au/blog/2018/11/a-question-of-balance","title":"A question of balance","author":"WORK180","body":"\n\t\t\t\t\t<p>KeyPay&#x2019;s quest to build a more diverse workforce</p><p>When KeyPay approached WORK180, it was to address one of the most common problems faced by tech companies; a heavily skewed gender imbalance in the development team. The four co-founders knew that for the business to thrive, things had to change.</p><p>&#x201C;When we looked at dev compared to the rest of the business, it was overwhelmingly male&#x201D; says Kristian Reynolds. &#x201C;And while that&#x2019;s fine when you&#x2019;re small and only have a handful of developers, as we grow we want to make sure we&#x2019;re building the company we wanted&#x201D;</p><p>But when KeyPay began the process of pre-screening, it soon became clear that many of its HR policies fell short of WORK180&#x2019;s minimum benchmarks. That&#x2019;s not to say the company didn&#x2019;t treat employees well, it&#x2019;s just that arrangements were mostly informal.</p><p>&#x201C;Again it&#x2019;s about size&#x201D; says Kristian. &#x201C;When there were just a few of us, we handled these things on a case by case basis, but that&#x2019;s not possible when you scale&#x201D;.</p><p>So KeyPay got to work. Within just two weeks, the company had drafted and approved a range of new and progressive policies, which formalised arrangements and gave employees the benefits they deserved.</p><p>This included the introduction of six weeks paid parental leave for the primary carer and two weeks for the secondary carer, the continuation of superannuation payments whilst on paid parental leave, an employee assistance program and a domestic and family violence policy.</p><p>&#x201C;We always had a blueprint in mind of how we wanted to build our company. We didn&#x2019;t just want to hire cookie cutter copies of ourselves, we wanted to build a rich and resilient culture. And one of the best ways to do that is through the diversity of people.&#x201D;</p><p>KeyPay currently employs 32 gifted people and services more than 75,000 businesses throughout the world.</p><hr><h4><strong class=\"\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3ff13608-1bc8-49ae-8152-169071295267.png\" style=\"float: right; width: 100px; height: 100px;\" class=\"\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3ff13608-1bc8-49ae-8152-169071295267.png\">About</strong><strong> KeyPay</strong></h4><p>KeyPay is passionate about challenging the traditional way of working, they are a remote-first company with the option to work virtually or at one of their offices in Sydney and Wollongong.&#xA0;Intrigued? <a data-cke-saved-href=\"https://www.work180.com.au/clients/keypay\" href=\"https://www.work180.com.au/clients/keypay\">Read more</a> and join the team.</p><p><br></p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["diversity and inclusion"],"upload_date":"2018/11","associated_companies":["work180"]}