{"url":"https://www.work180.com.au/blog/2018/07/a-returner-program-with-a-difference","title":"A Returner Program with a difference","author":"WORK180","body":"\n\t\t\t\t\t<p>Offering a different type of Returner Program in the Australian market, candidates returning after a career break are offered permanent roles or 12 month contracts at <a data-cke-saved-href=\"https://www.work180.com.au/clients/macquarie-group\" href=\"https://www.work180.com.au/clients/macquarie-group\">Macquarie.</a><br></p><p>Alisha (pictured above) concluded her most recent role as a senior product developer in 2015, leaving her job to spend three years travelling. Upon returning home to Sydney in January 2018, Alisha joined Macquarie&#x2019;s Returner Program as a DevOps Manager in the Cyber Security team.</p><blockquote><p>Alisha said, <em>&#x201C;Coming back into the job market was difficult and at times the challenges could be quite demotivating. I found many organisations wanted someone to start in a role straight away, which allowed little time to transition back into work, and in some cases I felt that my career gap may have been a disadvantage.&#x201D;</em></p></blockquote><p><a data-cke-saved-href=\"https://www.work180.com.au/clients/macquarie-group\" href=\"https://www.work180.com.au/clients/macquarie-group\">Macquarie</a> takes returners into permanent positions or a minimum of a 12 month maximum term contract, unlike most comparable programs in Australia.</p><p>Employees in Macquarie&#x2019;s Returner Program are offered one-on-one coaching for the first 20 weeks of employment, a thorough induction as well as access to support and training to refresh skills and help with professional development.&#xA0; They also receive ongoing training as part of Macquarie&#x2019;s Learning and Development Program.</p><p>Michael McKeown, from Macquarie&#x2019;s technology team, said, &#x201C;The great differentiator about the Macquarie Returner Program is that candidates aren&#x2019;t applying for an internship-style program requiring them to wait to learn if they receive an offer for a permanent position until the end. Candidate feedback has been very positive about that. The roles fit within Macquarie&#x2019;s broader philosophy around flexibility - candidates tell us what they need to make it work for them. This varies but includes flexible hours, working from home and part-time work.&#x201D;</p><p>Alisha currently chooses to work full-time in her role and says she is enjoying being able to take charge of her own work. &#x201C;I definitely appreciate the flexibility we&#x2019;re afforded at Macquarie to get our jobs done. It has a great results-oriented culture,&#x201D; Alisha said.</p><p>Returning to work after three years can be difficult in any role, but in technology, where advancements can happen rapidly, keeping skills up-to-date can be even more challenging.</p><p>While Alisha said that some of the technologies have changed, she spent time during her career break taking advanced cloud certification courses, which she says have helped keep her technical skills up to date.<br></p><blockquote><p> <em>&#x201C;Technically, I didn&#x2019;t find the transition too hard,&#x201D; said Alisha, &#x201C;but I have had support from a mentor on the program who has been great to ask any questions, share any challenges with and bounce ideas off.&#x201D;</em></p></blockquote><p>Alisha says she has transitioned back into work well and doesn&#x2019;t feel like she has been out of the workforce for three years.</p><p>&#x201C;My last role was in the UK for a product-based company working as a Senior Developer. Joining <a data-cke-saved-href=\"https://www.work180.com.au/clients/macquarie-group\" href=\"https://www.work180.com.au/clients/macquarie-group\">Macquarie</a>, I&#x2019;ve moved into a DevOps role which is giving me the opportunity to broaden my experience.</p><blockquote><p><em>&#x201C;I feel as though I have just transitioned from my last role. The Returner Program has helped me ease back into working life and has been a great program overall. The recruitment experience was great and my Macquarie recruiter was very supportive throughout,&#x201D; Alisha concluded.</em></p></blockquote><hr><a data-cke-saved-href=\"https://www.work180.com.au/clients/macquarie-group\" href=\"https://www.work180.com.au/clients/macquarie-group\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ede0105b-0590-49db-95bf-cebfaf2cd218.png\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ede0105b-0590-49db-95bf-cebfaf2cd218.png\" style=\"font-size: 16px; font-weight: 700; float: right; margin: 10px; width: 150px; height: 150px;\"></a><p><strong>About </strong><span style=\"font-size: 16px;\"><strong>Macquarie&#x2019;s Returner Program&#xA0;</strong><br></span>Applications for Macquarie&#x2019;s Returner Program in Australia are always open. They have a number of opportunities in their technology team across Business Analysis, Project and Program Management, Development and Operations (DevOps), Architecture, Security and Infrastructure.&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/job/macquaries-returner-program/\" href=\"https://www.work180.com.au/job/macquaries-returner-program/\">Click here to apply.</a></p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["returning to work","Career Development","job seeking tips"],"upload_date":"2018/07","associated_company":"work180"}