{"url":"https://www.work180.com.au/blog/2016/12/a-veterans-top-tips-for-women-navigating-careers-in-non-traditional-industries","title":"A Veteran’s Top Tips for Women Navigating Careers in Non-Traditional Industries","author":"WORK180","body":"\n\t\t\t\t\t<p>With over 20 years of national construction experience, Kate Drews has held senior leadership roles in a range of Government and industry&#xA0;organisations. Her career began in the Australian Defence Force as an Army Officer and after 10 years, Kate left the Army to pursue a career in consulting. She is currently the Group Director for Buildings and Places for Northern and Western Australian at AECOM.</p>\n\n<p>Kate&#x2019;s journey through different but ultimately male-dominated industries is a great case study on how to develop skills to progress and grow both personally and professionally, learning from mistakes along the way.&#xA0; Here are Kate&#x2019;s top tips for women navigating careers in non-traditional industries, although we think anyone can learn from them!</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/173671fc-9d7d-4627-92b7-44a704c9cb0f.jpeg\"></p>\n\n<p style=\"text-align:center\"><em>A determined young woman, Kate joined the Army at 17</em></p>\n\n<h4><strong>Adapt your Leadership Style&#xA0;</strong></h4>\n\n<p>As Kate progressed through several management roles, she had to change her leadership style from directive to coaching. Kate told us that as she moved up the ladder, she&#xA0;realised&#xA0;she could no longer do everyone&#x2019;s job for them and control every situation. &#x201C;I had to learn to lead through others, by delegation and influence rather than control,&#x201D; said Kate. &#x201C;Leadership style is not rigid and different styles may suit different situations, so it&#x2019;s crucial to adjust yours accordingly.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Invest in Training and Professional Development</strong></h4>\n\n<p>Kate credits the training courses she completed with helping her to develop skills to have robust, honest but caring conversations. &#x201C;Women leaders often struggle to engage in conversations that involve risk, such as upsetting someone,&#x201D; explained Kate. &#x201C;The courses I did&#xA0;allowed&#xA0;me to gain an objective view of myself and take a step back.&#x201D;</p>\n\n<p>Although training takes time and effort, Kate acknowledged that people often underestimate the benefits of engagement in training courses and pointed out that&#xA0;the cost of not doing something is bigger than the cost of doing it.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Raise your Industry Profile</strong></h4>\n\n<p>Kate often gets involved with events such as speaking on panels and at graduation events and groups focussing on women such as the WOW 2015 event in Brisbane.&#xA0;WOW&#xA0;(Women of the World) is a&#xA0;three day&#xA0;festival created by&#xA0;<a href=\"http://wow.southbankcentre.co.uk/\" target=\"_blank\">Southbank Centre London</a>&#xA0;and is now an annual flagship event). &#x201C;Attending and speaking at events means you have the opportunity to meet people both in and outside of your industry, and network with those with similar interests,&#x201D; said Kate. &#x201C;It also allows for the opportunity to give back to the industry and inspire the next generation of women.&#x201D;</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4c7782e2-fe10-4593-8287-920d9641aaeb.jpeg\"></p>\n\n<p style=\"text-align:center\"><em>Kate attending a staff function at the Gold Coast</em></p>\n\n<h4><strong>Choose your Mentor Wisely&#xA0;</strong></h4>\n\n<p>Whilst in middle management, one of Kate&#x2019;s managers suggested a female mentor for Kate.&#xA0; Although well-intended, Kate felt she had nothing in common with this particular mentor and discussed this with her manager. &#x201C;Throughout my career, I sought out both male and female mentors in addition to being a mentor myself,&#x201D; recalled Kate. &#x201C;Regardless of gender, a good alignment between mentor and mentee allows each to speak freely and gain honest feedback.&#xA0; Just because you are&#xA0;woman&#xA0;does not mean you have to have a female mentor/mentee.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Take Risks</strong></h4>\n\n<p>Whilst pregnant, Kate was offered an acting position which she turned down.&#xA0; &#x201C;Looking back on this, I do feel like it was a missed opportunity, and I waited longer for that promotion&#x201D; reflected Kate. &#x201C;I was too busy worrying about letting the company down and &#x2018;what-if&#x2019; scenarios, instead of focusing on the&#xA0;long term&#xA0;view and the fact that the company clearly saw my potential.&#x201D; &#xA0;Kate is a strong believer in that women shouldn&#x2019;t wait&#xA0;at&#xA0;the sidelines to be singled out and take the time to acknowledge themselves, instead of waiting for someone else to do it.</p>\n\n<p style=\"text-align:center\">&#xA0;</p>\n\n<p>In addition to Kate, we&#x2019;ve been speaking to a number of women from AECOM around what brought them to the company and why they enjoy working with AECOM. For Kate, the main reason was AECOM&#x2019;s focus on Diversity and Inclusion. &#x201C;The company&#x2019;s focus on improving the promotion and development rates of women is what stood out to me,&#x201D; elaborated Kate. &#x201C;I was offered a large opportunity to take my career to the next level and re-invent myself as a leader.&#x201D;</p>\n\n<p>Kate also called out the fact that not long after starting with AECOM, she had the chance to meet the entire leadership team. &#x201C;I&#x2019;ve followed Lara Poloni&#x2019;s (AECOM CEO, AU &amp; NZ) career from afar and absolutely love her style, which is authentic and straightforward. It&#x2019;s something that I really value and I&#x2019;m excited about stretching myself further&#x201D; concluded Kate.</p>\n\n<p>&#xA0;</p>\n\n<p>Find out more about AECOM and view their jobs <a href=\"/clients/AECOM\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/12","associated_company":"work180"}