{"url":"https://www.work180.com.au/blog/2016/05/aecom-joins-diverse-city-careers-to-support-women-in-engineering","title":"AECOM Joins Diverse City Careers to Support Women in Engineering","author":"WORK180","body":"\n\t\t\t\t\t<p>Diverse City Careers (DCC) are pleased to welcome AECOM to their community of employers with a strong focus on gender diversity.</p>\n\n<p>DCC is a social enterprise helping women pursue rewarding careers, particularly in sectors with high gender inequality rates. Other partners include Accenture, Dropbox, Bank of Queensland, Minter Ellison, Aurizon, Origin Energy, Curtin University and AustralianSuper.</p>\n\n<p>According to the latest data gathered by the Workplace Gender Equality Agency (WGEA), only 20.2% of employees working in Design and Engineering Consulting Services are female, with just 2.7% in CEO roles. The total remuneration (for full time employees) gap for women is 29.7%.</p>\n\n<p><em>&#x201C;Lara Poloni (Chief Executive, Australia and New Zealand) is a great case study of how a large company in a typically male dominated industry has provided the support for a woman to pursue career aspirations while balancing family life,&#x201D; </em>said DCC Cofounder, Valeria Ignatieva.</p>\n\n<p>Leading a team of around 4,000 designers, engineers, planners, scientists, economists and project managers, Lara started her career as a young urban planner over 20 years ago and has instilled a strong culture of flexibility and support within the organisation.</p>\n\n<p>Lara is a strong advocate for flexible working, <em>&#x201C;We must dispel the perception that accessing flexible work arrangements negatively affects career progression. Throughout my career with AECOM, I&#x2019;ve accessed a number of flexible working arrangements and continue to do so today &#x2013; as do many senior leaders across Australia and New Zealand,&#x201D;</em> she said.</p>\n\n<p>The company has continued to go from strength to strength with its diversity and inclusion initiatives, recognised by Fortune as the World&apos;s Most Admired Companies for two consecutive years in 2015 &amp; 2016.</p>\n\n<p>In addition, AECOM&#x2019;s Australian business has been recognised by WGEA for driving positive change through its commitment to gender equality. AECOM is only one of four engineering firms across Australia to receive a citation recognising its sophisticated, holistic approach to supporting women and men&#x2019;s equal participation in all levels of the workplace.</p>\n\n<p>&#x201C;<em>AECOM has measured the gender pay gap across all levels of the business and is implementing a number of strategies for addressing pay inequality at the point of hire, salary review, promotion and during parental leave stages,&#x201D;</em> said DCC CoFounder Gemma Lloyd. &#x201C; <em>We&#x2019;re impressed with the company&#x2019;s successful m-Circles mentoring program which has helped all female employees to access senior male and female leaders, skill development&#xA0; and expand their professional networks.&#x201D;</em></p>\n\n<p>AECOM Human Resources Director Australia and New Zealand and executive team member Helen Fraser, recognises the complex nature of creating a truly equitable workplace.</p>\n\n<p><em>&#x201C;Workplace gender equality is an issue important to so many of our people, both men and women and we&#x2019;re committed to making change for everyone,&#x201D; s</em>he said. <em>&#x201C;At AECOM, our people are proud to work with an organisation that drives change both for our own people and across the industry.&#xA0; We talk transparently about our challenges and our successes, enabling our people to represent AECOM&#x2019;s commitment to our clients.&#xA0; Many of our clients are trying to improve diversity in their own organisations as well, this offers a great opportunity to engage with them and see how together we can influence the broader industry.&#x201D;</em></p>\n\n<p>Working together, AECOM and DCC are running a number of initiatives aimed at driving greater female participation in the engineering industry. These include community events such as the DCC &#x2018;Better Ways of Working&#x2019; meetup along with digital campaigns.</p>\n\n<p><em>&#x201C;We&#x2019;re excited about the next round of meetups where AECOM will be helping attendees discover the best way to negotiate flexibility, no matter what the circumstances are,&#x201D;</em> said Ms Ignatieva. <em>&#x201C;We&#x2019;re also running a campaign to highlight how both women and men are taking up flexible working across different roles along with profiling remarkable women, at various stages of their career journeys.&#x201D;</em></p>\n\n<p>&#xA0;</p>\n\n<p><strong>About AECOM</strong></p>\n\n<p>AECOM is built to deliver a better world. We design, build, finance and operate infrastructure assets for governments, businesses and organizations in more than 150 countries. As a fully integrated firm, we connect knowledge and experience across our global network of experts to help clients solve their most complex challenges. From high-performance buildings and infrastructure, to resilient communities and environments, to stable and secure nations, our work is transformative, differentiated and vital. <em>A Fortune 500</em> firm, AECOM companies had annual revenue of approximately US$18 billion. See how we deliver what others can only imagine at <a href=\"http://aecom.com\">aecom.com</a> and @AECOM.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/05","associated_company":"work180"}