{"url":"https://www.work180.com.au/blog/2017/02/amandas-top-tips-to-back-yourself-and-progress-your-career","title":"Amanda’s Top Tips to Back Yourself and Progress Your Career","author":"WORK180","body":"\n\t\t\t\t\t<p>A few years after joining &#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients/unitywater\" href=\"https://www.dccjobs.com/clients/unitywater\">Unitywater,</a> Amanda Williams, a Chartered Accountant by trade, bravely took on an opportunity to manage a technical Trade Waste function, which was well outside of her specialisation. Amanda thrived in her new role, proving that good leadership is more important than technical experience. In 2015, Amanda was awarded Unitywater Leader of the year for her impact on the staff engagement levels of her teams, which lifted from 40% to 71%; and for her transformational leadership style.<img alt=\"\" data-cke-saved-src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/Amanda88.jpg\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/Amanda88.jpg\">&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/138b3f65-6ee9-4954-873a-cc2ebe06a371.jpeg\" style=\"float: right; margin: 10px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/138b3f65-6ee9-4954-873a-cc2ebe06a371.jpeg\"></p><p>We caught up with Amanda to learn more about her outlook on approaching challenging situations in the workplace.</p><p>Here are her top tips:</p><h3><strong>Grow your Network &amp; Consider Job Sharing</strong></h3><p>&#x201C;It doesn&#x2019;t matter what I do or where I go, it&#x2019;s all about the networks,&#x201D; said Amanda. Tapping into her network was Amanda&#x2019;s path to <a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=unitywater\" href=\"https://www.dccjobs.com/job-search?client=unitywater\">joining Unitywater</a>. In 2012, when Amanda&#x2019;s executive manager, whom she&#x2019;d worked with in a previous role suggested applying for a <a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=unitywater\" href=\"https://www.dccjobs.com/job-search?client=unitywater\">current vacancy at Unitywater,</a> Amanda came in to meet some of her future colleagues, and the rest was history! For the first three years, she worked part time while job sharing her role as Manager Revenue Assurance with another colleague.</p><p>&#x201C;Katherine and I were the polar opposites, yet it was the best experience ever!&#x201D; recalled Amanda. We would continually approach problems from different angles, but always come to the same conclusion. &#xA0;Because we both had the same levels of professionalism and commitment, the arrangement worked really well. <br></p><blockquote><p>&#x201C;We had a fairly high profile position to job share and wanted to make it to work so the rest of the organisation could adopt job sharing more broadly,&#x201D; added Amanda. <br></p></blockquote><p>Both women felt like they had the best of both worlds, being able to contribute to a rewarding role and spend time with their families.&#xA0;</p><p><br></p><h3><strong>Embrace Change and Continuous Improvement</strong></h3><p>In her own words, Amanda loves change, and cannot see herself staying in the same job forever.</p><p>Professional development is also very important to Amanda- &#x201C;It&#x2019;s a good idea to focus on continuous improvement and always look to see what the organisation and its customers need, and then matching the two to your development goals.&#x201D;</p><blockquote><p>&#x201C;Try and learn something new every day, and draw on previous experience,&#x201D; is Amanda&#x2019;s other piece of advice.</p></blockquote><p>Drawing on life experience can also help build confidence to try new things. &#x201C;We can all find courage in previous experiences, which don&#x2019;t necessarily need to be work-related,&#x201D; explained Amanda.&#x201D; For example, if you&#x2019;ve recently completed a marathon, or anything that previously felt out of reach, you can leverage that feeling of accomplishment in your professional career.&#x201D;</p><p><br></p><h3><strong>Don&#x2019;t be Afraid to Lead When Lacking Technical Expertise</strong></h3><p>After spending 3 years with Unitywater in the role of Revenue Assurance manager, Amanda began to feel like she needed a challenge, and was craving to get into a&#xA0;different role in the organisation. After discussions with her executive manager, Amanda was offered the role to lead the Trade Waste team. &#x201C;I knew I was good at managing people and managing change, and I just had to work out how to get up to speed on the technical aspects,&#x201D; recalled Amanda.</p><p>However, she quickly discovered that in order to effectively lead a group of technical experts, the worst thing as a leader could be is too technical. Amanda now faced the challenge of how to introduce herself to the new team. &#x201C;I was not about to tell six men who combined, had 120 years&#x2019; trade waste experience that I was the expert,&#x201D; Amanda told us. Instead, Amanda was open and honest and spoke about what she could bring to the table; such as commitment to the role and the team, a positive attitude and the ability to connect the team with the organisational vision.</p><p><br></p><h3><strong>Learn How to Have Difficult Conversations &amp; Develop Empathy</strong></h3><p>Having the difficult conversation is tough, but it&#x2019;s an essential part of leadership. Amanda&#x2019;s advice is to have those conversations for the respect of the employee, because after all, &#x201C;If no one tells me I wasn&#x2019;t doing a good job, how am I supposed to change?&#x201D; questioned Amanda.</p><p>We also discussed the importance of leveraging leadership traits most evident in female leaders, such as communication and empathy. &#x201C;As a manager, it&#x2019;s really important to respect the people you work with; being higher on the org chart, should not dictate how you interact with people,&#x201D; said Amanda.</p><p><img alt=\"\" data-cke-saved-src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/Amanda%20Williams77.jpg\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/Amanda%20Williams77.jpg\" style=\"height:647px; width:672px\"></p><h3><strong>Back Yourself &amp; Find a Supportive Employer</strong></h3><p>Amanda stressed the importance of backing yourself; &#x201C;If you don&#x2019;t, how can you expect others to?&#x201D;</p><p>We discussed Amanda&#x2019;s varied career path and positive approach to trying new methods and diving into roles outside her immediate expertise. &#x201C;At Unitywater, I feel very supported by the upper management, and it feels like if I do happen to fail, it is going to be ok,&#x201D; explained Amanda. &#x201C;This feeling of trust and support certainly makes it easier to take a step into the unknown, because I know I&#x2019;m not alone in this.&#x201D;</p><p>Whilst Unitywater&#x2019;s workforce has traditionally had a high proportion of male Engineers and tradespeople, and Amanda is a Chartered Accountant by trade, she&#x2019;s always felt welcome and included in the workplace. &#x201C;Despite this seemingly non-traditional environment for a woman, I&#x2019;ve always felt respected and applaud the quality of our people- these are genuinely good people, who want to work hard to achieve our purpose of keeping communities healthy,&#x201D; said Amanda.</p><p>Amanda&#x2019;s tips are great for anyone looking to take bold steps forward in their career.</p><hr><h3><strong>About Unitywater&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients/unitywater\" href=\"https://www.dccjobs.com/clients/unitywater\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ec03769e-194a-4615-8a04-2b8ebcabd588.png\" style=\"float: right; margin: 10px; width: 200px; height: 180px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ec03769e-194a-4615-8a04-2b8ebcabd588.png\"></a></strong></h3><p>Unitywater is a DCC Endorsed Employer for Women. Learn more about them on their <a data-cke-saved-href=\"https://www.dccjobs.com/clients/unitywater\" href=\"https://www.dccjobs.com/clients/unitywater\">Best Employer page.</a><br>&#xA0;</p><p><br>Browse their jobs and apply to join their team <a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=unitywater\" href=\"https://www.dccjobs.com/job-search?client=unitywater\">here.</a></p><p><br></p><hr><h3><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h3><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/02","associated_company":"work180"}