{"url":"https://www.work180.com.au/blog/2018/08/an-insiders-view-on-creating-an-inclusive-corporate-culture","title":"An insider’s view on creating an inclusive corporate culture","author":"WORK180","body":"\n\t\t\t\t\t<p>Corporate Australia is increasingly embracing diversity and inclusion to become a more attractive option for employees. But what does it really take to change a workplace culture and instill values of inclusion?</p><p>Veronica Lakin, pictured left, is the Organisation Development Manager &#x2013; Diversity and Inclusion for Optus. Her role is to design and drive diversity and inclusion initiatives across the company and its 9000 employees to create a culture that allows employees to be their authentic selves at work, to feel confident about their ideas and to ultimately create an innovative buzz that will benefit themselves and their company.</p><p>It was our pleasure to chat to Veronica about the challenges and triumphs she has had in the 14 months she has held the position and learn from her experience.</p><p><br></p><h4><strong>From high school teacher to HR leader</strong></h4><p>Veronica started her career as a high school teacher before moving into employment services and working with unemployed people. She then discovered her passion for human resources and studied in that field before joining Optus first in a Learning and Development role and then in an Organisation Development role.</p><p>Veronica&#x2019;s career has always revolved around helping others by developing their full potential, and her current role is a natural extension of her path thus far. As part of her role as an Organisation Development Manager &#x2013; Talent, Veronica began to look at diversity, particularly increasing female representation.</p><p>&#x201C;We identified the opportunity to do more, so when this role become available to drive that as well as the other areas of focus &#x2013; that&#x2019;s what got me interested,&#x201D; she says. &#x201C;I could see the potential on how we could grow and do better.&#x201D;</p><p>The role had existed previously but was part time, so when it became full time, Veronica jumped at the chance to focus on Optus&#x2019; Diversity and Inclusion Strategy to dial up our efforts, with a focus on gender diversity. Their overall Diversity and Inclusion Strategy also focuses on strengthening their LGBTIQ+ community, harnessing cultural diversity, supporting&#xA0; multigenerational workforce and being an accessible workplace for everyone.</p><p><br></p><h4><strong>How diversity &#x2018;gets done&#x2019;</strong></h4><p>Driving strategy and change is a top-down approach for Veronica. She works primarily with business unit leaders and her HR colleagues to determine how best to create a culture of diversity and thus attract various talent to the company.</p><blockquote><p><em>&#x201C;We are working on creating an inclusive culture that drives </em><em>innovation,</em><em> and making that attractive to people with different backgrounds, experiences </em><em>and</em><em> perspectives. The second step is helping them to be themselves and to reach their full potential,&#x201D; she says. &#x201C;It is all about diversity of thought.&#x201D;</em></p></blockquote><p>Our Optus Diversity and Inclusion Strategy includes company-wide initiatives to create an inclusive culture. We will dial up our efforts in some areas of our business where needed. &#xA0;&#xA0;</p><blockquote><p><em>&#xA0;&#x201C;For example, in our technical areas, our focus is on increasing representation of females as they have a lower number than in other areas of the business,&#x201D; she says.</em></p></blockquote><p><br></p><h4><strong>How to manage change in a big company</strong></h4><p>Shifting work practices and traditional attitudes can be tricky, especially if they are entrenched. Veronica says achieving change &#x201C;is a work in progress all the time&#x201D; &#x2013; and the goalposts are constantly moving.</p><p>&#x201C;There will be leaders that we need to shift more than others and that could be for a range of things,&#x201D; she says. &#x201C;It could be their personal experiences or assumptions they have made. It depends on what they have seen that is successful, so it&#x2019;s how you influence and obtain their buy in that matters.&#x201D;</p><p>Veronica is currently rolling out workshops on inclusive leadership to get everybody on board. She says Optus has many leaders which recognise the advantages of a diverse workforce and are leading by example.</p><blockquote><p><em>&#x201C;We have seen leaders take on a more active role in how they can attract and create a diverse team&#x201D;.</em></p></blockquote><p>Veronica says there is a strong focus on helping leaders to be able to identify strengths in people they may have overlooked previously for a variety of reasons.</p><p><br></p><h4><strong>Why being your &#x2018;authentic self&#x2019; is a critical piece of the puzzle</strong></h4><p>Veronica is very keen on the idea of &#x2018;authentic self&#x2019; and allowing people to feel comfortable about their backgrounds, abilities, sexuality or ethnicity within the workplace. She says this is an incredibly important pillar of her role, and is a win-win for both our people and Optus.</p><blockquote><p><em>&#x201C;When we are thinking about </em><em>diversity</em><em> of thought and innovation, the best ideas come out of people who can feel psychologically safe in their surroundings &#x2013; they are comfortable working with other people and they feel that they can contribute wholly,&#x201D; she says. &#x201C;For </em><em>us</em><em> it is creating that environment so they can do that.</em></p></blockquote><p>&#x201C;From a business perspective, if we can have people feel comfortable and be their authentic self at work we are obviously going to see better productivity, and our customers will have a better experience and outcomes.&#x201D;</p><p><br></p><h4><strong>The biggest challenges</strong></h4><p>The main roadblocks, says Veronica, is attracting women into tech roles and boosting the numbers of women leaders in those divisions. She sees the reluctance of women to train in STEM as part of the problem, and the challenge is for Optus is to market itself as an attractive employer.</p><p>To excite people about working at Optus we have recently launched our new employer brand.&#xA0; Our proposition is all about progression, change, and a keen focus on the future through exciting opportunities with Optus. We don&#x2019;t sit back and let the future happen to us. At Optus, we know tomorrow is ours to create. Optus encourages their business leaders to look outside the traditional areas in order to attract more women.</p><p>&#x201C;Rather than just saying we are only going to look at people who have experience in telecommunications or ICT, we need to broaden it so it is more about digital or emerging technologies so you are expanding and providing more opportunities.&#x201D;</p><p><br></p><h4><strong>The wins so far</strong></h4><p>Since taking on the role, Veronica has seen and heard Optus people, especially leaders, talking more about diversity and inclusion and the role they play. How they can get involved and what they can do to drive a more inclusive workforce. This year we saw a dramatic rise in attendance in events to celebrate diversity including International Women&#x2019;s Day; the results of the annual People Opinion survey have rated Optus higher in the inclusive category; and she has seen a noticeable boost in engagement. And last year Optus&#x2019; commercial team created a two-hour diversity and inclusion working group and invited her to present her strategy.</p><p>&#x201C;We have really started to create the momentum and awareness, and people are actually coming and approaching me within the business as well as HR,&#x201D; she says. &#x201C;What&#x2019;s nice is this awareness is not just coming from the top.&#x201D;</p><hr><h4><strong>About Optus&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" style=\"float:right;width:300px;height:60px;\"></a></strong></h4><p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p><p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p><p>Browse jobs with Optus and apply&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=optus\" href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["corporate culture","diversity and inclusion"],"upload_date":"2018/08","associated_companies":["work180"]}