{"url":"https://www.work180.com.au/blog/2017/08/arcadis-achieves-the-flex-able-certification","title":"Arcadis achieves the Flex Able Certification","author":"WORK180","body":"\n\t\t\t\t\t<p>Requests from employees, and a desire from their CEO Greg Steele led Arcadis to transition to a truly flexible working company, who have now achieved the Flex Able Certification from DCC Jobs.</p><p>HR leaders in the business discovered that working flexibly was being requested more and more. Instead of ignoring the requests, thinking it was too difficult, or expecting their people to just get on with it, they surveyed their staff and found that 89% of people wanted more flexibility.</p><p>This revelation, coupled with having a forward-thinking CEO who is not only a big advocate of flexible working, but also a &#x2018;Male Champion of Change&#x2019;, was the starting point of their journey.&#xA0;</p><p>To create more open discussion around flexible working, both amongst peers and management, Arcadis created &#x2018;Flex Day&#x2019; which was held on 17 November 2016. The purpose of Flex Day was to be the nominated day for every person who wanted to, to trial a flexible work arrangement and talk about their experience.</p><p>A few key steps were taken to ensure that Flex Day was a success:</p><ol><li><p><strong>Piloting stage: </strong>Managers had to be equipped with the skills to handle requests for flexible working. They also needed new skills to manage their people, their teams and their output when some or all the team work flexibly. Therefore, Arcadis rolled out four training sessions on working flexibly per manager over a six-month pilot period.</p></li><li><p><strong>Review and adapt: </strong>During the rest of the year managers were given follow up sessions or had additional conversations to ensure that they had the tools they needed to ensure they were ready for Flex Day.</p></li><li><p><strong>Leading by example: </strong>CEO Greg Steele works flexibly himself, and sent every employee an email about the day. To ensure that spouses knew what was going on, and to ensure that no person was excluded from the offer, Arcadis sent a post card to the home address of every employee to tell them about Flex Day and invite them to trial or talk about possible flexible working arrangements.</p></li></ol><p>There were many positive outcomes from the day, including one person who trialled working from home and reduced the daily commute by 1.5 hours per day, another who decided to pursue part-time working to complete university studies, and someone who opted to work part-time just for 2017 to enjoy their child&#x2019;s last year before school starts. In addition, several fathers started doing the school drop off and starting the day a bit later so they could spend more time with their children.</p><p>Whilst it has been difficult to measure increased creativity in a workplace that is already highly creative, Arcadis believe that their workforce has become more engaged and efficient since Flex Day last year.</p><p>Congratulations Arcadis on a fantastic approach to working flexibly!</p><p><strong>About the Flex Able Certification</strong></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? DCC&#x2019;s Flex Able Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><h4 style=\"font-family: Lato, sans-serif;\"><strong><span style=\"color: rgb(169, 127, 177);\">DCC Flex Able&#xA0;Certified Employers include:</span></strong></h4><p style=\"line-height: 30px;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/01fd4b52-ff62-41b9-84aa-e4d98fb074d8.png\"><br></p><p style=\"line-height: 30px;\"><span style=\"font-size: 16px;\">Learn more about the&#xA0;</span> Flex Able <span style=\"font-size: 16px;\">&#xA0;Certification&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">here</a><span style=\"font-size: 16px;\">.</span></p><p style=\"line-height: 30px;\"><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/08","associated_company":"work180"}