{"url":"https://www.work180.com.au/blog/2017/11/arcadis-encouraging-flexibility-across-the-business","title":"Arcadis encouraging flexibility across the business","author":"WORK180","body":"\n\t\t\t\t\t<p>Arcadis understands life is complicated and rarely lets you focus on work exclusively from Monday to Friday 9&#x2013;5pm.</p><p>Life doesn&#x2019;t simply &#x201C;switch off&#x201D; for 40hrs per week. Embracing flexible working is key to help balance a career and a fulfilling life. Requests from employees and a desire from CEO Greg Steele led Arcadis to transition to a truly flexible working environment and be awarded the&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">Flex Able Certification</a>&#xA0;from DCC Jobs following the launch of&#xA0;<em><a data-cke-saved-href=\"https://www.arcadis.com/en/australia/arcadis-blog/?tag=flex%40arcadis\" href=\"https://www.arcadis.com/en/australia/arcadis-blog/?tag=flex%40arcadis\">Flex@Arcadis</a>.&#xA0;</em></p><p>The Flex Able Certification is to allows employers that walk the talk on flexible working to differentiate themselves from other employers and be easily identifiable to job seekers who value flexible working arrangements.</p><p><em>Flex@Arcadis</em>&#xA0;encourages all employees to talk to their managers about what flexibility means to them and how they would like to work. For Arcadis, flexibility means so much more than part-time or working from home. Fundamentally, it is about the output delivered rather than how, when or where the work is done. For flexibility to be successful, it needs to suit the individual, their role, and the needs of the team, clients and company.</p><p>To help all staff embrace, understand and live flexible working, Arcadis runs several initiatives such as&#xA0;<em>Flex@Arcadis</em><em>&#xA0;Day</em>, where all staff are encouraged to try working flexibly, and regularly shares stories of flexible working across the business, whether that&#x2019;s working four days a week to spend more time with family, or starting early and leaving early to make team sport training. It&#x2019;s about making flexible working normal and part of every-day working life.</p><blockquote><p>Flexible working is key to Arcadis&#x2019; Diversity and Inclusion Strategy, which focusses on developing a varied and inclusive workplace to continue striving towards true innovation and collaboration. Embracing different viewpoints and experiences is a principle Arcadis supports from recruitment to career development, to ensure talented people are supported in realizing their potential.</p></blockquote><p>Complementing&#xA0;<em><a data-cke-saved-href=\"https://www.arcadis.com/en/australia/arcadis-blog/?tag=flex%40arcadis\" href=\"https://www.arcadis.com/en/australia/arcadis-blog/?tag=flex%40arcadis\">Flex@Arcadis</a></em>&#xA0;is the company&#x2019;s award-winning Wellbeing Program, which is Arcadis&#x2019; commitment to help staff improve their quality of life by addressing everything from desk set-up to healthy food choices. The program includes activities such as flu vaccinations, seated massages and skin checks, as well as dedicated Wellness Rooms. Arcadis also offers a &#x2018;gamified&#x2019; version of the program, where they reward Arcadians with points, badges, and levels when they participate, with awards earnt through participation in the program.</p><p>Arcadis supports all staff and offers a range of initiatives to ensure employees are provided with the necessary tools to lead fulfilling lives in all aspects of their life.&#xA0;</p><p><em>This article was originally published by Engineers Australia and can be found&#xA0;<a data-cke-saved-href=\"https://www.engineersaustralia.org.au/News/arcadis-encouraging-flexibility-across-business\" href=\"https://www.engineersaustralia.org.au/News/arcadis-encouraging-flexibility-across-business\" target=\"_blank\">here.&#xA0;</a></em></p><p><strong>About the&#xA0;Flex Able&#xA0;Certification</strong></p><p><a data-cke-saved-href=\"http://www.dccjobs.com/advertisers/flex-able-certification\" href=\"http://www.dccjobs.com/advertisers/flex-able-certification\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? DCC&#x2019;s&#xA0;Flex Able&#xA0;Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><p>Learn more about the&#xA0;&#xA0;&#xA0;Flex Able&#xA0;&#xA0;Certification&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a>.</p><h4 style=\"font-family: Lato, sans-serif;\"><strong>DCC&#xA0;Flex Able&#xA0;Certified Employers include:</strong></h4><p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/01fd4b52-ff62-41b9-84aa-e4d98fb074d8.png\">&#x200B;&#x200B;</p><p style=\"line-height: 30px;\"><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/11","associated_company":"work180"}