{"url":"https://www.work180.com.au/blog/2018/08/are-your-diversity-programs-causing-more-harm-than-good","title":"Are your diversity programs causing more harm than good?","author":"WORK180","body":"\n\t\t\t\t\t<section><p>On a recent trip, I picked up a copy of my usual travel material- the Harvard Business Review. This time, with more excitement than usual, as I noticed the magazine&#x2019;s main topic was &#x201C;Diversity- most programs don&#x2019;t work and here&#x2019;s what to do about it&#x201D;.</p><p>Reading this issue enlightened me to a complete paradigm shift around diversity initiatives, particularly on what most of us believe is the right thing to do when it comes to creating a more diverse and inclusive&#xA0;organisation; such as mandatory unconscious bias training for managers, hiring tests, performance reviews&#xA0;and&#xA0;grievance procedures.</p><p>This blog is an attempt to summarise the many pages of research findings which challenge our belief around what makes unconscious bias training&#xA0;successful,&#xA0;and encourage open discussion and feedback on your own experiences.</p><p>First, let&#x2019;s go back to the reasons why diversity became a &#x201C;thing&#x201D;. We are aware that more diverse&#xA0;organisations&#xA0;are more&#xA0; profitable, more productive and have a lower turnover of staff. It goes without saying that it&#x2019;s the socially right thing to do for people of all different backgrounds, preferences&#xA0;and&#xA0;abilities to have equal opportunities. However, before these findings, back in the 1990&#x2019;s, the focus on diversity and support for women and minorities, came from a series of class action&#xA0;law suits&#xA0;against large financial firms out of the US around sex discrimination claims. Morgan Stanley shelled out $54 million &#x2013; and Smith Barney and Merrill Lynch more than $100 million each. In 2007, Morgan was back at the table, which cost the company $46 million and in 2013, Bank of America Merrill Lynch settled a race discrimination suit for $160 million. These are a few examples&#x2026;but the list goes on.</p><p>The silver lining in all of this though (and has certainly been proven through my work at WORK180) is that there are many&#xA0;organisations&#xA0;that genuinely care about diversity- and it&#x2019;s not just something done to lawfully protect themselves against case actions.</p><p>Let&#x2019;s return to the latest HBR research, according to which, mandatory diversity and unconscious bias training&#xA0;doesn&#x2019;t&#xA0;work in the long term.</p><p>Diversity and unconscious bias training when &#x201C;force fed&#x201D; has shown to produce the complete opposite desired outcome. This research shows that biases can be activated when people are made to undergo such training.</p><p>This seems counterintuitive to me, I&#x2019;ve firmly believed that unconscious bias training is necessary to make people aware of their potential negative&#xA0;behaviours. However, mandatory training can also be perceived (subconsciously) as control tactics. Let&#x2019;s be honest, most people don&#x2019;t like being told what to do.</p><blockquote><p><em>&#x201C;Most diversity programs focus on controlling managers&#x2019;&#xA0;behaviour, and as studies show, this approach tends to activate bias rather than quash it. People rebel against rules that threaten their autonomy&#x201D;.</em></p></blockquote><p>In saying all of this, HBR states that voluntary training evokes the opposite response as people subconsciously have the attitude of &#x201C;I chose to show up, therefore I must be pro-diversity&#x201D;. The suggestion is that diversity and unconscious bias training should be positioned neither as remedial or as something rolled out to deal with &#x201C;problem groups&#x201D;.</p><p>Three basic principles can be applied to yield positive diversity and inclusion results from managers:</p><ul><li>Engaging managers in solving the problem;</li><li>Exposing them to people from different groups;</li><li>Encouraging social accountability for change.</li></ul><blockquote><p><em>&#x201C;Instead of trying to police managers&#x2019; decisions, the most effective programs engage people in working for diversity, increase their contact with women and minorities, and tap into their desire to look good to others.&#x201D;</em></p></blockquote><p>The above is really just the tip of the iceberg around the research in this particular HBR article- I strongly encourage everyone interested in this topic to get a copy.</p><p>If you or your&#xA0;organisation&#xA0;has had experience with unconscious bias training- positive or negative- I&#x2019;d love to hear your thoughts.<br></p><p> Have you seen a change in the attitudes of staff and an increase in women and minority groups, particularly in leadership roles?</p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></section>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2018/08","associated_company":"work180"}