{"url":"https://www.work180.com.au/blog/2017/06/are-you-my-mentor","title":"Are You My Mentor?","author":"WORK180","body":"\n\t\t\t\t\t<p>One of the enduring stories they tell us through our careers is that we need a mentor. They don&#x2019;t exactly say it, but you get the impression that it will solve a lot of problems. Once you find this mysterious person they will guide you on the sacred path to success &#x2014; their wise words will come to you in the darkness, they support at your back will make you strong. Once you have found your mentor &#x2014; you cannot fail!</p>\n\n<p>There&#x2019;s the trouble. Where will you find this mythical person? And how can you convince them that you are the chosen one?<br>\n<br>\nWith that image in mind &#x2014; your quest is kind of doomed from the start.<br>\nBecause life is not exactly like a movie. I mean it is&#x2026; but a movie is the compressed version. It summaries. It put&#x2019;s days, weeks, months, years &#x2014; sometimes a whole lifetime into a couple of hours. It also puts 5 or 10 people into 1. So, when you see someone being a great mentor or leader in a movie &#x2014; in real life, that character would have come from an amalgamation of several different people to bring all of the skills and time and patience together.&#xA0;</p>\n\n<p>Finding a female mentor is also tough &#x2014; I did a quick image search for famous images of female mentors and came up with the&#xA0;<a href=\"http://www.shortlist.com/shortlists/best-movie-mentors#\" target=\"_blank\">50 Best Movie Mentors</a>. Want to guess how many were women? No need to check the link, I think you know&#x2026;</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8d9d14fa-a2e6-4def-9071-929974a47c64.png\">&#x200B;</p>\n\n<p>It&apos;s fair to say we&apos;ve learnt more about life from the Mr Miyagi&apos;s of this world than we have from any classroom&#x2026;</p>\n\n<p>Now personally I don&#x2019;t have much in common with your typical alpha female &#x2014; but I kinda thought having one of those as a mentor would jumpstart my career. When I met one that impressed me I was super-excited.&#xA0;Here was a woman with a lot of experience, organised thoughts, strategic and powerful. I could learn so much from her. So, I gave her my elevator pitch (and it was&#xA0;gooooooood). She said no.&#xA0;</p>\n\n<p>I was a little taken aback. And a little relieved. She was scary.</p>\n\n<p>But I could see her point, she had a full-time job, she was a board member, she already has several mentees, she volunteers &#x2014; adding &#x201C;just one more&#x201D; really wasn&#x2019;t possible.</p>\n\n<p>So I got to thinking. How would anyone that good get to be my mentor? And I realised it was an unrealistic dream. No-one has enough time anymore. But when I started to look around myself at what the real world looks like, in all its crazy messiness &#x2014; I realised the best solution was just to accept that and lean into it.&#xA0;</p>\n\n<p>The answer is obvious &#x2014; companies have been doing it for years.&#xA0;They appoint a Board of Directors. The Board Members each give the company a slice of their time. They provide some oversight. They set strategy.&#xA0;</p>\n\n<p>&#xA0;As a person, why wouldn&#x2019;t I try and get the same kind of expertise and insight? &#x2014; from a board. A Board of Mentors. When you look at your life, I think you&#x2019;ll realise you already have some of the mentors. You mother, your best friend, a work colleague. The others you need are someone doing the next job you want to do, someone in a senior leadership role and someone retired from business but still active in the business network.</p>\n\n<p>You want to bring something to the relationship too. Maybe you volunteer for a cause they care about? Inspiring Mentors are often doing a variety of things &#x2014; get involved.</p>\n\n<p>And when you are meeting one of your mentors for a slice of their time &#x2014;&#xA0;ask for 20 minutes, bring them a coffee and email them your 3 questions in advance.&#xA0;</p>\n\n<p>Good luck finding your board!</p>\n\n<p>&#xA0;</p>\n\n<p>Michelle&#xA0;is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/06","associated_company":"work180"}