{"url":"https://www.work180.com.au/blog/2015/11/are-you-supporting-the-women-around-you","title":"Are you supporting the women around you?","author":"WORK180","body":"\n\t\t\t\t\t<p>Written by Margie Warrell.</p>\n\n<p>&#xA0;</p>\n\n<p>Women must lift as they climb. Together women will go further than they ever will alone.</p>\n\n<blockquote>\n<p><em>&apos;There is a special place in hell for women who don&apos;t help other women.&#x2019;</em></p>\n</blockquote>\n\n<p>These words by Madeleine Albright, America&#x2019;s first female ceiling-smashing Secretary of State, reveal two truths.</p>\n\n<p>Firstly, that many women place a strong value on supporting other women in achieving their ambitions as they work hard to pursue our own.</p>\n\n<p>Secondly, that some women don&#x2019;t; opting instead to pull the ladder up behind them as they climb, presumably because they don&#x2019;t think anyone should have it easier than them.</p>\n\n<p>The former reflects a spirit of generosity and abundance - there&#x2019;s enough success for us all to do well.&#xA0; The latter shows a fear-based scarcity mentality that views success a zero sum game with only so much pie (power and admiration) to go around.&#xA0;&#xA0;</p>\n\n<p>While the latter group of women may be a distinct minority, they can cause an enormous amount of anguish and injury as they reinforce negative female stereotypes, undermine female progress and, on occasion, actively seek to undermine and diminish women whose influence they perceive as a growing threat to their own.</p>\n\n<p>If you&#x2019;ve had that experience yourself, you have my sympathy. Having worked in a toxic and poorly managed all women team early in my career, I know it can siphon even the best job of joy.&#xA0; And while there is no quick-fix remedy, it&#x2019;s important to remain resilient and remember that if these women didn&#x2019;t feel insecure in themselves, they wouldn&#x2019;t need to pull you down to prop themselves up.</p>\n\n<p>Of course, such women are the exception, not the rule.&#xA0; The vast majority of women I&#x2019;ve encountered embody Albright&#x2019;s value set to lift as they climb. Women like Emma Isaacs, CEO of <a href=\"http://www.businesschicks.com.au/\">Business Chicks</a>, a company dedicated to supporting &#x2018;business chicks&#x2019; in supporting each other.&#xA0; With over 35,000 members in Australia, and soon to expand in the USA, Business Chicks hosts events that bring women together to help each other as they are inspired by the experiences and insights of powerhouse people such as Bobbie Brown, Richard Branson, Diane von Furstenberg and Sir Bob Geldoff.&#xA0;</p>\n\n<p>The launch of <a href=\"http://businesschicks.com/\">Business Chicks USA</a> in July with Arianna Huffington, Rachel Zoe and Jane Wurwand speaking at gala lunches in LA, San Francisco and New York gives many more women the opportunity to &#x2018;lift as they climb.&#x2019;&#xA0;&#xA0; Of course, whether you ever make it to a Business Chicks event is far less important than what you do each day to support and embolden the women around you to think bigger about what is possible for themselves &#x2013; to doubt themselves less and back themselves more and call them out when they sell themselves short. Something many women re all too practiced at.</p>\n\n<p>The statistics on the state of women in the world today are compelling (The <a href=\"http://www.weforum.org/reports/global-gender-gap-report-2014\">2014 Global Gender Gap Report</a> shows female economic participation and opportunity now stands at 60%). Closer to home in America, where women are graduating college at a rate of 2:1 over men, they still lag behind them on nearly every other marker from salary, seats at the top table, &#xA0;to accessing venture capital.&#xA0; And this is in the face of overwhelming evidence that shows that as more women are economically and socially empowered, communities, companies and countries are better off on every single measure. &#xA0;So as we look toward the future &#x2013; complete with its uncertainty and the many challenges women face to enjoy genuine equality of opportunity, education and power - there is no doubt in my mind that we women will go so much further together than we can ever will alone.</p>\n\n<p>To that end, I challenge you to think of five women circling your orbit to whom you could lend a helping hand.&#xA0; Whether making an introduction, sharing a useful resource, writing recommendation on Linked In or offering a few words of praise in the presence of decision makers &#x2013; doing so won&#x2019;t diminish your position or power, it will only enhance it.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>Margie is one of our contributors, read more about her and our other contributors <a href=\"/meet-our-contributors\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/11","associated_company":"work180"}