{"url":"https://www.work180.com.au/blog/2018/05/atlassian-aims-to-set-the-bar-even-higher-for-intersectional-gender-diversity","title":"Atlassian aims to set the bar even higher for intersectional gender diversity","author":"WORK180","body":"\n\t\t\t\t\t<p><a href=\"https://www.dccjobs.com/clients/atlassian\">Atlassian </a>is proud to be a WORK180 Endorsed Employer and is working actively to create an environment where every person feels like they can thrive and belong on their team.</p>\n\n<p>Atlassian&#x2019;s mission is to unleash the potential of every team, including its own. By facilitating flexible work arrangements, providing strong parental leave policies, and an inclusive philosophy on growth, Atlassian is working to ensure that its employees have the support and tools they need to thrive both in and outside of work.</p>\n\n<p>This year, Atlassian released its&#xA0;second annual&#xA0;team&#xA0;diversity report. Over the last year, Atlassian&#x2019;s&#x2019; representation of women rose in every category (leadership as well as technical and non-technical roles), and their hiring rates point to continued future progress in this area.</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8ac898eb-562c-4e00-a296-d27334bc9812.jpeg\" style=\"font-size: 16px; float: right; margin: 10px; width: 300px; height: 279px;\"></p>\n\n<p>They also launched internal programs designed to mitigate unconscious bias during the interview process, created professional development programs targeted to and for underrepresented employees, and ensured that underrepresented candidates be considered for director-level roles. These efforts continue the ambitious and iterative diversity &amp; inclusion program catalyzed by Atlassian&#x2019;s first Head of Global Diversity, Aubrey Blanche, pictured, who joined Atlassian in 2015.&#xA0;</p>\n\n<p>Co-Founder and Co-CEO Mike Cannon-Brookes reinforced the need for teamwork to achieve diversity in a company-wide blog:</p>\n\n<blockquote>\n<p><em>&#x201C;To create this culture of belonging </em><em>for</em><em> everyone on our TEAM, it needs to go beyond top-down initiatives and formal programs&#x2026; Only together can we make the change we aspire to see.&#x201D;</em></p>\n</blockquote>\n\n<p>Diversity and inclusion is not just an executive-level mandate at <a href=\"https://www.dccjobs.com/clients/atlassian\">Atlassian</a>; Atlassian believes that each member of the team is responsible for creating an inclusive culture. Who is getting high-profile projects over others? Who feels most empowered to speak up in meetings? Are people working with people different from themselves day to day? Leaders and team members must look into creating balance on their teams and solicit feedback whenever possible to always continue to improve.&#xA0;</p>\n\n<p><em>This article was originally published by Engineers Australia and can be found <a href=\"https://www.engineersaustralia.org.au/News/atlassian-aims-set-bar-even-higher-intersectional-gender-diversity\" target=\"_blank\">here.&#xA0;</a></em></p>\n\n<hr>\n<h4><strong>About Atlassian&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/cc693fda-6f5e-4009-8883-83a5938b763e.png\" style=\"float: right; margin: 10px; width: 200px; height: 200px;\"></strong></h4>\n\n<p>Atlassian is an Endorsed Employer for Women. Employees at Atlassian can expect:</p>\n\n<p>Flexible Working: Yes &#x2705;</p>\n\n<p>Breastfeeding rooms: Yes &#x2705;</p>\n\n<p>Paid Parental Leave at full salary for primary carer: 20 Weeks &#x2705;</p>\n\n<p>Paid Parental Leave at full salary for secondary carer: 6 Weeks &#x2705;</p>\n\n<p>Minimum tenure required to be eligible for Paid Parental Leave: 6 months &#x2705;</p>\n\n<p>Plus more.&#xA0;Read&#xA0;about the company on their Best Employer page&#xA0;<a href=\"https://www.work180.com.au/clients/atlassian\">here</a>.</p>\n\n<p>Apply for their jobs <a href=\"https://www.work180.com.au/job-search?client=atlassian\">here.</a></p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["gender equality","WORK180 News"],"upload_date":"2018/05","associated_company":"work180"}