{"url":"https://www.work180.com.au/blog/2017/10/aurecon-leading-workplace-flexibility","title":"Aurecon leading workplace flexibility - becomes Flex Able Certified ","author":"WORK180","body":"\n\t\t\t\t\t<p>Aurecon&#x2019;s Yes Flex initiative is leading the engineering sector in workplace flexibility around working hours and environments.</p><p>Aurecon has successfully passed&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">DCC&#x2019;s Flex Able Certification</a>&#xA0;process for demonstrating best practices for flexible workplaces, becoming one of the first Australian organisations to be Flex Able Certified and the first to be certified in the engineering sector. Aurecon impressed DCC Jobs with their approach to making flexible work accessible to everyone, including removing the need to specify a reason for requesting flexible work.</p><p>It&#x2019;s been said that in business, flexibility is sometimes the key to stability. &#x2018;<em>Yes Flex&#x2019;</em>&#xA0;is global engineering and infrastructure advisory company Aurecon&#x2019;s approach to flexible working. This &#x2018;all-positions-flexible&#x2019; platform empowers employees to embrace flexibility by nominating their start and end times across their working week; without having to give reasons for the flexibility nor seek permission to do so.&#xA0;<em>Yes Flex</em>&#xA0;also supports managers to manage flexible teams.</p><p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/df35c56c-2ac6-47c7-8feb-97f54e332bfb.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/df35c56c-2ac6-47c7-8feb-97f54e332bfb.jpeg\" style=\"margin: 10px; float: right; width: 300px; height: 199px;\"></p><p>&#x200B;</p><blockquote><p>&#x201C;The overall objective of&#xA0;<em>Yes Flex</em>&#xA0;is to inspire a mindset that everyone can take advantage of flexible working,&#x201D; said Abbie Wright (pictured right) &#x2013; Aurecon&#x2019;s Inclusion Manager. &#x201C;<em>Yes Flex&#xA0;</em>was introduced to create a culture of flexibility which would help attract and retain talent, ensure career progression for flexible workers, and promote a new way of working that would be dynamic &#x2013; adapting to the changing needs of individuals and the organisation. &#xA0;It was also a demonstration of Aurecon&#x2019;s proactive management and strategic approach to flexibility.&#x201D;</p></blockquote><div><p><em>Yes Flex</em>&#xA0;removes previously established start and end times, or work patterns, from employment conditions and, more importantly, from mindsets.&#xA0; The objective was to move away from an 8:30 am to 5:30 pm mindset to a platform of trust; trusting and empowering employees to deliver expected output and continue providing exceptional client service, in whatever work pattern enabled them to integrate work and life to a point they could &#x2018;give their best&#x2019; to Aurecon.&#xA0; A small number of rules were established to protect the well-being of employees, such as limits on the number of hours worked in one day and limits on hours worked without breaks. The key to the success of&#xA0;<em>Yes Flex</em>&#xA0;was employees and managers working together, innovatively and creatively, to find work pattern solutions.</p><blockquote><p>&#xA0;<em>Yes Flex</em>&#xA0;followed a three-staged implementation approach of senior leadership commitment, line manager support, and employee empowerment.&#xA0;The approach was piloted in the largest business unit in Aurecon&#x2019;s Brisbane office with champions, including senior staff, supporting other offices to prepare for implementation in other locations.&#xA0; &#xA0;</p></blockquote><p>&#xA0;While the project is being managed by the Inclusion Manager with strong support from Human Resources, it was agreed from the outset that when&#xA0;<em>Yes Flex</em>&#xA0;was rolled out, the process would be leadership owned and driven. Senior peer-to-peer briefings have been critical to the success of the initiative.&#xA0;These briefings get straight to the heart of dispelling any myths or assumptions about client needs not being met as a result of&#xA0;<em>Yes Flex</em>, and support line managers around their fears associated with leading flexible working teams.</p><p>&#xA0;<em>Yes Flex</em>&#xA0;is a key element of Aurecon&#x2019;s gender inclusion strategy, which also includes initiatives focused on Shared Care, pay equality, mentoring, leadership advancement for high potential women, placing a gender lens on people practices, and gender targets.&#xA0;&#xA0;</p><p><em>This article was originally published by Engineers Australia and can be found <a data-cke-saved-href=\"https://www.engineersaustralia.org.au/News/aurecon-leading-workplace-flexibility\" target=\"_blank\" href=\"https://www.engineersaustralia.org.au/News/aurecon-leading-workplace-flexibility\">here</a>.</em><br><br></p><p><strong>About the Flex Able Certification</strong></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"border: 0px; vertical-align: middle; float: right;\"></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? DCC&#x2019;s Flex Able Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><h4 style=\"font-family: Lato, sans-serif;\"><strong><span style=\"color: rgb(169, 127, 177);\">DCC&#xA0;Flex Able&#xA0;Certified Employers include:</span></strong></h4><p style=\"line-height: 30px;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/01fd4b52-ff62-41b9-84aa-e4d98fb074d8.png\"><br></p><p style=\"line-height: 30px;\">Learn more about the&#xA0;&#xA0;Flex Able&#xA0;&#xA0;Certification&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a>.</p><p style=\"line-height: 30px;\"><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p></div>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/10","associated_company":"work180"}