{"url":"https://www.work180.com.au/blog/2016/11/aurecon-and-cbus-first-to-be-flex-able-certified-by-diverse-city-careers","title":"Aurecon and Cbus first to be Flex Able Certified by DCC Jobs","author":"WORK180","body":"\n\t\t\t\t\t<p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/93207d7c-2d9d-4b85-a196-484d857703f8.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/93207d7c-2d9d-4b85-a196-484d857703f8.png\"></p><p>Aurecon and Cbus Super Fund have successfully passed the accreditation process for demonstrating best practices for flexible workplaces, becoming the first Australian organisations to do so.</p><p>The<a data-cke-saved-href=\"https://www.diversecitycareers.com/flex-able-certification\" href=\"https://www.diversecitycareers.com/flex-able-certification\" target=\"_blank\">&#xA0;Flex Able certification</a>&#xA0;is administered by DCC Jobs, a social enterprise helping women connect to supportive employers. The certification is designed to showcase employers demonstrating best practices for flexible workplaces, adding to DCC&#x2019;s Endorsed Employer of Women certification.</p><p>DCC Jobs is Australia&#x2019;s only jobs board that pre-screens companies based on their commitment to support women&apos;s careers. DCC Jobs works with clients from across a variety of industries, including BHP Billiton, CBA, Atlassian, Accenture, Caltex, Origin, Unitywater and Clayton Utz in addition to several startups and SMBs.</p><p>&#x201C;In a recent survey of over 25,000 female job seekers, flexible work arrangements was the most important criteria women looked for in a new employer,&#x201D; explained Christina Smerdon, Chief Flex Enabler at DCC Jobs.</p><p>In addition, research by PwC found that increasing the female employment rate in Australia to match that of Sweden, for example, could result in a GDP boost of about $162 billion at today&apos;s values over the long run.</p><p>Global engineering and infrastructure advisory firm Aurecon impressed DCC Jobs with their approach to making flexible work accessible to everyone, including removing the need to specify a reason for requesting flexible work.</p><p>&#x201C;At Aurecon, we believe diversity is essential for innovation and flexible work practices are an important way in which we can be a more diverse and inclusive business. We trust and empower our staff to give their best to Aurecon and to our clients through whatever work pattern enables them to integrate work and life&#x201D; explains Liam Hayes, Chief People Officer.</p><p>Cbus is the industry superannuation fund for the construction and building industry and manages over $34 billion for its 720,000 members. Cbus recognises the increasing importance of flexibility in work arrangements to maintain a diverse, adaptive and high performing workforce.</p><p>David Atkin, CEO says&#xA0;&#x201C;Offering genuine flexible working conditions is a positive step towards equity and gender equality in our workplace and we are pleased to offer it to all staff &#x2013; without qualification.1&#xA0;This policy is underpinned by equal opportunity and has been accessed by many of our people. I am delighted to say that the results speak for themselves.&#x201D; Cbus staff are encouraged to negotiate arrangements for flexible work with their manager and are not required to specify a reason.</p><h4 style=\"font-family: Lato, sans-serif;\"><strong><span style=\"color: rgb(169, 127, 177);\">DCC&#xA0;Flex Able&#xA0;Certified Employers include:</span></strong></h4><p style=\"line-height: 30px;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/01fd4b52-ff62-41b9-84aa-e4d98fb074d8.png\"><br></p><p style=\"line-height: 30px;\">Learn more about the&#xA0;&#xA0;Flex Able&#xA0;&#xA0;Certification&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a>.</p><p style=\"line-height: 30px;\"><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/11","associated_company":"work180"}