{"url":"https://www.work180.com.au/blog/2017/08/aurecon-launches-australias-first-shared-care-parental-leave-scheme-among-the-large-engineering-firms","title":"Aurecon Launches Australia’s First ‘Shared Care’ Parental Leave Scheme Among Large Engineering Firms","author":"WORK180","body":"\n\t\t\t\t\t<p>Aurecon, a DCC Endorsed Employer for Women and a <a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">Flex Able Certified Employer</a>, has recently introduced a new &apos;Shared Care&apos; scheme to support new parents within its workforce.</p><p>While momentum builds in the male-dominated property and construction sectors to improve gender equality, Aurecon&#x2019;s CEO Giam Swiegers, a member of the STEM Male Champions of Change group, believes the pace of change remains too slow.</p><blockquote><p>&#x201C;Initiatives such as Shared Care are vital if we are to maintain the momentum in the property and construction sector and retain the innovative STEM talent Australia needs to service our growing infrastructure and property industries,&#x201D; he said.</p></blockquote><p>Swiegers, one of the 2010 Male Champions for Change foundation members, helped found the STEM Male Champions of Change group in 2016, together with the company&#x2019;s Managing Director, William Cox, a Workplace Gender Equality Agency Pay Equity Ambassador.</p><blockquote><p>&#x201C;Aurecon is proud to become the first Australian engineering consultancy to institute a Shared Care policy and hope that other large firms in our industry will follow suit,&#x201D; said Cox. Our initiative follows freight rail company Aurizon&#x2019;s move to introduce its own Shared Care scheme in February, encouraging other firms to consider such initiatives.&#x201D;</p></blockquote><p>Shared Care is about giving Aurecon families a new choice when it comes to considering who takes on child care responsibilities within their home. It was in part inspired by comments made by former Sex Discrimination Commissioner, Elizabeth Broderick AO at a CEDA event late last year when she said: &#x201C;&#x2026;if I could choose one thing to change, it would be for caring responsibilities to be shared equally between men and women.&#x201D;</p><p>Shared care provides financial incentive options that support secondary carers to step into primary carer roles. &#xA0;These incentives apply during a child&#x2019;s first year in the following instances:</p><ul><li>Aurecon employees can take over as primary carer and access paid parental leave if their partner returns to their work</li><li>150% of salary paid if&#xA0;an Aurecon employee returns to Aurecon and their partner is taking over as primary carer and can&#x2019;t access paid primary carers leave through their own employer</li><li>Both parents can access paid parental leave if both are employed with Aurecon&#xA0;</li></ul><blockquote><p>&#x201C;Shared Care will not suit all Aurecon parents and is not intended to encourage mothers to return to work before they are ready,&#x201D; comments Cox. &#x201C;Rather, it provides a source of financial support for Aurecon primary carers who choose to return to work within the child&#x2019;s first year. Shared care is inclusive of all families including same sex relationships, and is available to birth parents, adoptive and foster parents.&#x201D;</p></blockquote><p style=\"text-align:center\">&#x200B;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5fd902fa-f7ec-41b3-a7ff-e01f98c93310.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5fd902fa-f7ec-41b3-a7ff-e01f98c93310.jpeg\"></p><p><strong>Gender Pay Equality</strong></p><p>To help promote the gender pay equality, that such career breaks so often threaten, Aurecon also provides Superannuation both on its paid parental leave, as well as up to 14 weeks of an employee&#x2019;s unpaid portion of the parental leave.</p><p>Aurecon believes that supporting secondary carers and fathers to take active roles in the care of children will support women returning to and staying in the workforce, and reduce the career and wealth penalties imposed by career breaks. Aurecon conducted its first like-for-like pay equality review during 2015 in Australia, and in 2017 in New Zealand, and now annually, aims to close all like-for-like gender pay gaps and put in place measures to ensure they won&#x2019;t happen again.</p><blockquote><p>&#x201C;The firm has also just achieved 30% women in its Australian business (up from 24%), meeting its first gender target set in 2016 as part of a gender equality strategy led by our Australian leadership team. The target was aimed to be achieved by 2020. Achieving it this fast gives us an opportunity to set another target that will continue to drive the positive change we are seeing,&#x201D; says Cox.</p></blockquote><p>Workplace Gender Equality Agency director Libby Lyons said &#x201C;Supporting women and men to share caring responsibilities from the beginning of their parenting journey is an important contribution employers can make to improving workplace gender equality outcomes. I congratulate Aurecon on implementing another important new initiative that will help employees balance their professional and family lives.&#x201D;</p><p>Aurecon has been recognised by the <a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/support-network/government-agencies/workplace-gender-equality-agency\" href=\"https://www.dccjobs.com/what-women-want/support-network/government-agencies/workplace-gender-equality-agency\">Workplace Gender Equality Agency (WGEA)</a> for being an employer who is committed to promoting gender equality in Australian workplaces and holds an Employer of Choice for Gender Equality (EOCGE) citation.</p><blockquote><p>&#x201C;Importantly, Aurecon believes there is not any single initiative that will result in inclusion. To achieve an inclusive workplace, a suite of initiatives need to be enabled which touch many people and are led by our senior leadership team. It is a suite of initiatives such as shared care and restoring gender pay equality which ultimately drives all of our people to feel valued, with a sense of belonging or connectedness. Only then will they will bring their best creativity to support innovation,&#x201D; concludes Swiegers.&#xA0;</p></blockquote><h4><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\t\t\t\t","tags":[],"upload_date":"2017/08","associated_companies":["work180"]}