{"url":"https://www.work180.com.au/blog/2017/07/australiansuper-receives-the-flex-able-certification-by-not-having-a-flexible-working-policy","title":"AustralianSuper receives the Flex Able Certification by not having a Flexible Working Policy! ","author":"WORK180","body":"\n\t\t\t\t\t<p>AustralianSuper don&#x2019;t just talk about flexible working, they live and breathe it.</p><p>By embedding their flexible working policy into their Enterprise Agreement, AustralianSuper have earned the Flex Able Certification without having to create a separate, stand-alone Flexible Work Policy.</p><p>We often see employers who want to move towards flexible working, but hit a brick wall, otherwise known as the Enterprise Agreement. They say there is nothing they can do to change it and need to work with what they have.</p><p>No such brick wall stopped AustralianSuper. By ensuring the &#x2018;hours of work&#x2019; clause did not specify set hours of a standard working day but focused instead on specified total work hours for a week, the fund incorporated flexibility into their Enterprise Agreement.</p><p>During the Flex Able Certification audit process, we discovered potential employees were told they would be treated like adults, and it was assumed they were trustworthy and committed to their role and the company. People will now able to structure their work hours according to what betsts suits them and their line manager.</p><blockquote><p>&#xA0;&#x201C;As part of our commitment to a realistic and sustainable approach, which sees people&#x2019;s jobs being an integrated part of their life, we strive to assist staff to balance work with family and other responsibilities,&#x201D; said Jake Pickard, Resourcing Manager.</p></blockquote><p>&#x201C;We offer flexible hours of work to staff that meet the business requirements of the fund and, where possible, meet the personal circumstances of staff. The span of hours that staff work are discussed with their manager with a view to reaching a mutually satisfactory outcome.&#x201D;</p><p>Jake said that instead of having an expectation about flexible working set out in a policy, AustralianSuper is creating a continuous dialogue about flexibility with regular updates on the intranet, questions in their engagement surveys, regular manager training about flex team delivery and setting an expectation of flexible working.</p><p>It is a testament to a company that has been working to normalise flexible working since 2010, and whose CEO Ian Silk is a Male Champion of Change and a passionate advocate for flexible working and gender equality.</p><blockquote><p>&#x201C;We recognise that investing in the wellbeing, development and performance of our people is a catalyst that helps us achieve more for members &#x2013; so we&#x2019;re committed to creating an environment where our people can thrive,&#x201D; said Ian.</p></blockquote><p>Flexible working at AustralianSuper starts with the recruitment process and is a continuous dialogue with the team:</p><blockquote><p>&#x201C;Expectations of flexible working are communicated by our recruitment team, even before people have joined the Fund,&#x201D; said Jake.</p></blockquote><p>Congratulations AustralianSuper on receiving the Flex Able Certification!</p><p><em>Written by Christina Smerdon, Chief Flex Enabler at DCC Jobs.</em></p><hr><p><strong>About the Flex Able Certification</strong></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float:right\"></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? DCC&#x2019;s Flex Able Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><p><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong><span style=\"color: rgb(169, 127, 177);\">DCC&#xA0;Flex Able&#xA0;Certified Employers include:</span></strong></h4><p style=\"line-height: 30px;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/01fd4b52-ff62-41b9-84aa-e4d98fb074d8.png\"><br></p><p style=\"line-height: 30px;\">Learn more about the&#xA0;&#xA0;Flex Able&#xA0;&#xA0;Certification&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a>.<br><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/07","associated_company":"work180"}