{"url":"https://www.work180.com.au/blog/2015/08/australian-business-leaders-engaging-in-a-day-of-diversity","title":"Australian business leaders engaging in a day of diversity","author":"WORK180","body":"\n\t\t\t\t\t<p>Last Thursday, I was lucky to have a day in Sydney full of events around my passion- workplace gender equality. I wanted to share with you some of the key takeaways and diversity of discussion (excuse the pun) at the different events.</p>\n\n<p>My day started by co-hosting the second of a series of exclusive diversity roundtables on behalf of FITT alongside Oakton. It was great to see organisations such as CBA, Paxus, Cisco and Dimension Data partake in the discussion around:</p>\n\n<p>&#x201C;How to increase the number of women in leadership positions&#x201D;</p>\n\n<p>Considering within ICT only 1 in 5 of people in managerial positions in the top 3 tiers are female, this is definitely an issue the industry needs to discuss and act upon.</p>\n\n<p>Sara Carter, HR Manager at Oakton shared information around their diversity journey and I particularly enjoyed hearing about the success of their recent inaugural Women&#x2019;s Conference.</p>\n\n<p>We then heard from CBA&#x2019;s Peter Rohde, Diversity Chair and Executive General Manager Strategy, Transformation and Governance who covered:</p>\n\n<ul>\n\t<li>\n\t<p>Targets for women in leadership positions</p>\n\t</li>\n\t<li>\n\t<p>Pay equity</p>\n\t</li>\n\t<li>\n\t<p>Women in IT forum</p>\n\t</li>\n\t<li>\n\t<p>CBA Women Can program</p>\n\t</li>\n</ul>\n\n<p>Some of the key points I particularly liked were:</p>\n\n<ul>\n\t<li>\n\t<p>Organisations should look more at the benefits of softer skills (e.g team building and leadership) versus silo skills (e.g. technical) in order to cast net wider to recruit suitable managers</p>\n\t</li>\n\t<li>\n\t<p>Shortlist targets of 50:50 males and females for all roles should be implemented</p>\n\t</li>\n\t<li>\n\t<p>We need leaders to &#x2018;tap suitable females on the shoulder&#x2019; to suggest and recommend applying for promotion, as typically females are more passive and less likely to ask for promotion</p>\n\t</li>\n\t<li>\n\t<p>Ensure diversity messages are relevant to both men and women</p>\n\t</li>\n</ul>\n\n<p>Overall it was an engaging, educational and passionate discussion. I&#x2019;m already very excited for our third diversity roundtable which will be co-hosted by Cisco in November this year!</p>\n\n<p>That evening, I attended the Diversity Dinner Debate hosted by LeadershipHQ, where we heard from a panel which included:</p>\n\n<ul>\n\t<li>\n\t<p>Peter Birtles- CEO Super Retail Group</p>\n\t</li>\n\t<li>\n\t<p>Amanda Rose- CEO Business Women&#x2019;s Media</p>\n\t</li>\n\t<li>\n\t<p>Chris Lamb- HR Director Lend Lease</p>\n\t</li>\n\t<li>\n\t<p>Nicole Mills- CEO Pacific Retail Group</p>\n\t</li>\n</ul>\n\n<p>This was such a great discussion! It was good to see the panel share different views on how to effectively implement diversity and inclusion. Chris Lamb in particular impressed the audience with diversity success stories within Lend Lease.</p>\n\n<p><em>Peter Birtles raised a great point:</em></p>\n\n<p><em>&#x201C;28% of our leadership was female yet our customers were 50% female- we saw a problem and wanted to address it.&#x201D;</em></p>\n\n<p>All in all it was a fantastic day and I learned some valuable insights. In my role as cofounder of <a href=\"/about-us\">DCC Jobs</a>, I come across many organisations at the beginning of their diversity journey. I look forward to sharing these learnings to inspire them and the larger DCC community!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/08","associated_company":"work180"}