{"url":"https://www.work180.com.au/blog/2018/11/be-the-change-you-want-to-see-in-your-business-how-xero-approaches-diversity-and-inclusion","title":"Be the change you want to see in your business","author":"WORK180","body":"\n\t\t\t\t\t<p>Diversity is being invited to the party, inclusion is being asked to dance.</p>\n\n<p>It&#x2019;s with this note from Verna Myers in mind that Bindy Edelman approaches her role as global head of diversity and inclusion at cloud accounting software company Xero.</p>\n\n<p>It comes after years working in this space and seeing attitudes evolve. Edelman started her career as an employment lawyer working with discrimination law; here she worked with people on the protected attributes set out in legislation, such as race, gender, disability, pregnancy, and religion.</p>\n\n<blockquote>\n<p>&#x201C;Over the years it&#x2019;s started to evolve to say, it&#x2019;s got to be the deeper-level things too because if diversity means difference, then it has to include things that you might not even know about a person, such as our perspectives, our life experiences, and our different ways of problem solving,&#x201D; Edelman said.</p>\n</blockquote>\n\n<p>Edelman believes this evolution has come in hand with organisations trying their hand at &#x2018;diversity&#x2019; and not seeing the benefits they had been promised: McKinsey, for example, reported in 2015 that&#xA0;companies in the top quartile for gender diversity are 15 percent more likely&#xA0;to financially outperform those in the bottom quartile.</p>\n\n<p>The report also found that companies in the top quartile for ethnic diversity are 35 percent more likely to financially outperform those in the bottom quartile.</p>\n\n<blockquote>\n<p>&#x201C;It doesn&#x2019;t help you to just have all that difference; actually, that&#x2019;s only part of the journey,&#x201D; Edelman said.</p>\n</blockquote>\n\n<blockquote>\n<p>&#x201C;The journey is actually to create environments where those differences are understood, respected, supported, and fully celebrated. That&#x2019;s where you focus on inclusion; people use those words &#x2013; diversity and inclusion &#x2013; interchangeably, but they&#x2019;re not the same thing.&#x201D;</p>\n</blockquote>\n\n<p>So what does inclusion mean?</p>\n\n<p>For Edelman at Xero, inclusion means an environment where people feel respected, understood, and celebrated for their differences.</p>\n\n<blockquote>\n<p>&#x201C;They have a sense of belonging and feel like they can bring their authentic self into the workplace,&#x201D; she said.</p>\n</blockquote>\n\n<p>Among the initiatives the company has put in place are diversity and inclusion and bias awareness workshops which, in part, look to unpack the concepts of diversity and inclusion and why they are core to the Xero business.</p>\n\n<blockquote>\n<p>&#x201C;Our mission is to serve small business customers and help them thrive, and in order for us to do that, we have to be diverse. How do we create great products that speak to our customers if we&#x2019;re not diverse? As a tech company that wants to innovate, you can&#x2019;t do that if you&#x2019;re not exposed to different ideas or difference,&#x201D; Edelman said.</p>\n</blockquote>\n\n<p>The productivity gains also come from people having more energy to focus on their work rather than on having to hide a part of themselves, Edelman said.</p>\n\n<blockquote>\n<p>&#x201C;It&#x2019;s about, how does not having to focus on the distraction of being something that&#x2019;s not you or not authentic enable you to actually work better? It can make you more focused, more empathetic, more collaborative, and increases your wellbeing.&#x201D;</p>\n</blockquote>\n\n<p>Of course, putting in place a diversity and inclusion program is one thing for a company the size of Xero &#x2013; and rather another for an early-stage startup.</p>\n\n<blockquote>\n<p>&#x201C;There&#x2019;s a lot you can do without money,&#x201D; Edelman said.</p>\n\n<p>&#x201C;There&#x2019;s a lot of low-hanging fruit, and if you want to actually drive a successful business, it&#x2019;s critical to be thinking about it from the get go, and making it a priority.&#x201D;</p>\n</blockquote>\n\n<p>At the core of this is ensuring any drive is leader-led: whoever is leading the business must be invested in diversity and inclusion, and is a champion of and for it.</p>\n\n<blockquote>\n<p>&#x201C;It&#x2019;s also about embedding a culture of respect and fairness from the get-go; things around non-discrimination and harassment are really important no matter what size you are. That&#x2019;s the foundational stuff,&#x201D; Edelman said.</p>\n</blockquote>\n\n<p>In hiring, Edelman advised startups to think about their process and their hiring channels to consider whether they are unknowingly excluding anyone: &#x201C;how are you writing your ads, what imagery are you using, where are you putting them out?&#x201D; &#xA0;</p>\n\n<p>Edelman is also a huge advocate for flexible working, which she believes is a significant driver of diversity and inclusion.</p>\n\n<blockquote>\n<p>&#x201C;Flexible working is so important is because, once you embrace different ways of working, you enable people who might not otherwise be able to participate in your business, to participate,&#x201D; she said.</p>\n\n<p>&#x201C;There can be a perception that flexible working is something reserved for parents, or even mothers, but we need to see it being made mainstream for lots of different reasons; maybe someone has a passion they want to pursue once a week, or they&#x2019;re studying. It can be critical.&#x201D;</p>\n</blockquote>\n\n<p>Other &#x2018;low-hanging fruit&#x2019; can be as simple as installing standing desks and encouraging people to take leave, getting people to think about their wellbeing. &#xA0;</p>\n\n<p>At the end of the day, Edelman believes it all comes back to leadership &#x2013; and here she has amended the famous Gandhi quote: &#x201C;Be the change you want to see in your business.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h5><em>Bindy Edelman was a speaker at Xerocon 2018. The author was a guest of Xero at the conference.&#xA0;</em></h5>\n\n<hr>\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4ef6f8d7-eff1-47a2-84f9-bf5659fdd4ae.png\" style=\"font-size: 16px; float: right; width: 100px; height: 100px;\"></p>\n\n<p>This article was originally published by <a href=\"http://www.startupdaily.net/2018/09/change-want-see-business-xero-approaches-diversity-inclusion/\">startup daily.&#xA0;</a></p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About Xero</strong></h4>\n\n<p>At&#xA0;Xero&#xA0;we are proud of our diverse and inclusive environment. Our Xero&#x2019;s respect, challenge and support each other and have a constant eye on developing innovative and creative solutions to ensure we stay ahead of the curve. &#xA0;We want our employees to have fun while doing the best work of their lives.</p>\n\n<p>Learn more about Xero on their&#xA0;<a href=\"https://www.work180.com.au/clients/xero\">Best Employer page.</a></p>\n\n<p>View all Xero&apos;s jobs and apply&#xA0;<a href=\"https://www.work180.com.au/job-search?utf8=%E2%9C%93&amp;search%5Bquery%5D=xero&amp;search%5Blocation%5D=&amp;search%5Bradius%5D=50.0\">here.&#xA0;</a></p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p>\n\n\t\t\t\t","tags":["diversity and inclusion","Xero"],"upload_date":"2018/11","associated_company":"work180"}