{"url":"https://www.work180.com.au/blog/2015/12/best-practices-and-industry-trends-for-diversity-and-inclusion","title":"Best Practices and Industry Trends for Diversity & Inclusion","author":"WORK180","body":"\n\t\t\t\t\t<p>Over the past few years, I&#x2019;ve both attended and organised many events around gender diversity and although similar topics are always discussed, for example quotas vs targets, there is always something new to be learned.</p><p>This month in particular, I&#x2019;ve attended some great diversity events and wanted to share some of the key takeaways. First up was the &#x2018;Driving a Strategic Approach to Flexibility&#x2019; panel that DCC Jobs hosted with the Workplace Gender Equality Agency. During the panel discussion, the speakers were asked some tricky questions but the panellists did not disappoint, and one realisation in particular stood out to me:</p><p><br></p><p><strong>&#x201C;Fairness&#x201D; has been lifted to a new high by some companies.</strong></p><p>First, Kristan Vingys, COO at ThoughtWorks provided several practical examples when answering the tough question of &#x201C;how can you provide flexibility in a consulting environment?&#x201D; One of which was how two consultants who&#x2019;ve both recently returned from maternity leave, are job sharing a role by working three days each with one day overlapping for handover.</p><p>He also told us about ThoughtWorks evaluating the superannuation gap, which occurs when primary careers work less over the course of their careers. ThoughtWorks are truly leading the way as a great employer of choice for both men and women (females make up 43% of Australian staff) and addressing the superannuation gap is something that only a handful of companies are starting to do.</p><p>Another great example of a unique approach to levelling the playing field came from AECOM this week. They are addressing the fact that women tend to avoid &#x201C;hard negotiations&#x201D; and reviewing the salary of women around each male employee who successfully negotiates a pay rise to make sure they are not left out. AECOM also pledged to be transparent during the interview process when women may ask for less than the role is worth, and offering the candidate more money.</p><p><br></p><p><strong>Naming and shaming can be an effective driver of change.</strong></p><p>At the annual Diversity Council Australia Debate, the topic for the evening was &#x201C;Is there too much talk and not enough action on diversity?&#x201D;</p><p>In the end, both sides were very much on the fence and the unofficial result seemed to be that we need both more talk and more action.</p><p>One of the panellists, Diana Ryall, reminisced on the fact that it wasn&#x2019;t until ASX- listed companies were required to report the number of women on their boards, change started to occur. Sad but true- naming and shaming does seem to work wonders. Unfortunately we have seen this at DCC - companies wanting to advertise with us but getting turned down after they admitted it was a &#x201C;branding exercise&#x201D; for them.</p><p>Those types of companies are likely to never &#x201C;get it&#x201D; but the good news is, there are plenty more that do and the increase in companies on the WGEA Employer of Choice for Gender Equality list is great to see.</p><p><br></p><p><strong>We need to create visibility and celebrate the success of change agents.</strong></p><p>Attending my first ARN Women in ICT awards as a finalist with DCC co-founder Gemma Lloyd was certainly the highlight of the month and we really enjoyed the luncheon.</p><p>Angela Fox, MD at Dell Australia, spoke about the need to recognise and celebrate the success of change agents for D &amp; I within the business, not matter how big or small. At the awards, there were 100 men in the audience, a big jump from just 10 men at the event&#xA0;three years ago.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/966e229c-f2be-49ff-8a74-acb46fa6aa04.png\"></p><p>Many of the men in the audience had nominated their colleagues, mentored and sponsored the females within their organisation and I&#x2019;m sure this has contributed greatly to more and more men getting involved. As Angela noted, change must stem from the top and has to be built into the culture of the business.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/899e98ed-9228-4e85-818a-5b61eac9ecdd.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/899e98ed-9228-4e85-818a-5b61eac9ecdd.png\"></p><p><strong>Storytelling is a key aspect of driving positive change.</strong></p><p>Last but not least, I had the pleasure of attending the Women, Work and Wealth luncheon hosted by Amy Cato, Founder of Executive Women Shortlists. The event included the latest report from the Centre for Workplace Leadership and I was particularly impressed by Adam Fennessy&#x2019;s speech.</p><p>Adam is the Secretary of the Department of Environment, Land, Water and Planning and is a true champion of change. With women making up 46% of the DELWP leadership group, Adam has worked hard to implement flexibility and a more inclusive workplace overall. Adam touched on the importance of storytelling and shared a few examples where positive news was shared and drove change within the department.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/727e274f-76e7-4562-8e07-2e3ec7cef3c7.png\">&#x200B;&#x200B;</p><p>With the recently released, somewhat grim results around the gender pay gap from the WGEA, there is no argument that while we&#x2019;ve improved somewhat, there is plenty of room for progress, and companies need to keep coming up with different ideas to drive this change.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/12","associated_company":"work180"}