{"url":"https://www.work180.com.au/blog/2018/06/bhp-accelerates-flexible-working-as-the-norm","title":"BHP accelerates Flexible Working as the norm","author":"WORK180","body":"\n\t\t\t\t\t<p>A mining giant with multiple mine sites a long way from the city is not the type of employer you typically think of when considering flexible work arrangements. Yet access to flexible work is high on the priority list for the leadership team at BHP.</p>\n\n<blockquote>\n<p><em>In August 2016, BHP launched &#x2018;The Flex Effect&#x2019;. It was and continues to be a series of short video case studies of people at BHP telling their flexible work stories to communicate to the entire </em><em>organisation</em><em> that flexible work is possible for everyone is some capacity, not just those in head offices.&#xA0;</em></p>\n</blockquote>\n\n<p>Through 2018, BHP will continue to accelerate flexible working through publishing new case studies, raising more awareness of flexible working, sharing their toolkits and further understanding the needs of their people to ensure that they meet their needs.</p>\n\n<p>They aren&#x2019;t doing this because it is trendy. They are doing this because they know that access to genuine flexible work arrangements is a key driver of an inclusive workplace. Support is led from the top, with CEO Andrew Mackenzie&#xA0; a strong believer in the value of inclusive workplaces and wants flexible working to be part of the DNA at BHP.&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5380b4f1-f45d-4043-b5f2-502cad4e23e0.png\" style=\"float: right; margin: 10px; width: 300px; height: 157px;\"></p>\n\n<p>Have you ever heard about job sharing while on FIFO? Well, BHP have just commenced a trial of job sharing for surface workers on FIFO. It is too early to see how it plays out, but credit is due for BHP for having a go at something that so many other companies have decided is just too hard to accomplish.</p>\n\n<blockquote>\n<p><em>Flexible working at BHP isn&#x2019;t just for the existing team, and there are no rules about having to work for three months before someone can request it.</em></p>\n</blockquote>\n\n<p>BHP also communicate their flexible work offering during first round phone interviews!</p>\n\n<p>This means that potential candidates can apply for jobs even if they can only work part time, or need to be flexible on working hours. This translates to BHP being able to attract a much wider talent pool when they are recruiting.</p>\n\n<p>BHP continues to evolve their flexible working journey. Congratulations on your commitment to embed flexible work for everyone, and on what has been achieved so far.&#xA0;</p>\n\n<hr>\n<h4><strong>About BHP&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/15d53536-61f7-4647-874b-866c09fddc32.png\" style=\"float: right; margin: 10px; width: 200px; height: 110px;\"></strong></h4>\n\n<p>BHP is an Endorsed Employer for Women and&#xA0;Flex Able&#xA0;Certified.&#xA0;<span style=\"font-size: 1.6rem;\">CEO Andrew Mackenzie says working really hard doesn&apos;t mean you have to work many hours. &#xA0;</span>BHP has also set an aspirational goal to achieve gender balance globally by 2025. It&#x2019;s top 10 most diverse sites already perform 15% better than other mine sites, have better safety records and are more likely to meet production forecasts and maintenance schedules.&#x200B; Learn more about working with BHP on their <a href=\"https://www.work180.com.au/clients/bhp\">Best Employer page.</a></p>\n\n<p><a href=\"https://www.work180.com.au/job-search?client=bhp\">Browse jobs and apply to join BHP here</a>.&#xA0;</p>\n\n<hr>\n<p><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About the&#xA0;Flex Able&#xA0;Certification</strong></h4>\n\n<p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p>\n\n<p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? WORK180&#x2019;s&#xA0;Flex Able&#xA0;Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p>\n\n<p>Learn more about the&#xA0;Flex Able&#xA0;Certification&#xA0;<a href=\"https://www.work180.com.au/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a>.</p>\n\n<p>Flex Able&#xA0;Certified Employers include:</p>\n\n<p style=\"line-height: 30px;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/245a56b6-d30c-4a5b-b43f-8ebf5a79f335.png\"></p>\n\n<hr>\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About&#xA0;the author&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/93df967a-d2b9-481e-9f4c-b87c45078a2e.jpeg\" style=\"float: right; margin: 10px; width: 205px; height: 200px;\"></strong></h3>\n\n<p>Christina Smerdon is the Chief Flex Enabler at WORK180. She certifies employers who wish to qualify for the&#xA0;<a href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">Flex Able</a><a href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">&#xA0;Certification.&#xA0;</a>She has a keen interest in driving the flexible work agenda and believe that it is the way of the future.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3>\n\n<p>WORK180 is&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">jobs board&#xA0;</a><span style=\"font-size: 1.6rem;\">with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;</span><a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">essential tool</a><span style=\"font-size: 1.6rem;\">&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;</span><a href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">one click</a><span style=\"font-size: 1.6rem;\">&#xA0;now.&#xA0;</span></p>\n\n<div>&#xA0;</div>\n\n\t\t\t\t","tags":["job seeking tips","Career Development","flexible working"],"upload_date":"2018/06","associated_companies":["work180"]}