{"url":"https://www.work180.com.au/blog/2016/12/blueprint-for-increasing-the-chances-of-landing-your-ideal-job","title":"Blueprint for Increasing the Chances of Landing your Ideal Job","author":"WORK180","body":"\n\t\t\t\t\t<p>When Marina d&apos;Amico realised it was time for her next career move after landing her first graduate job as a software implementation consultant 5 years ago, she began applying for jobs. However, she found the process largely unsuccessful when she did not hear back from recruiters and received no feedback on the interviews she did manage to land. &#x201C;After a while, I went through a phase of questioning myself,&#x201D; recalled Marina. &#x201C;Was I applying for the wrong jobs, was I not qualified enough or was there something wrong with my resume and cover letter?&#x201D;</p><p>Marina was very honest with us when she told us that eventually, she had to pull herself up for complaining for too long, and make a start on addressing the barriers she thought were preventing her from securing her ideal role.<br></p><p>Marina began by taking lots of little steps to kick off the process, and shared the ones which provided the most impact:</p><p>1.Clearly identify the value you could bring to an organisation.&#xA0;Marina worked with a DCC Jobs coach to understand the best way to highlight her strengths and capabilities to a new employer. &#x201C;Many job seekers take a generic, one size fits all approach when it comes to applying for roles, however the investment in perfecting your value proposition is well worth it,&#x201D; explained Marina.</p><p>2.Networking is more important than you think.&#xA0;Although Marina was not entirely comfortable with the thought of networking, she made a commitment to herself and began attending events in her areas of interest- anything from women in tech events through to startup focused meetups. &#x201C;To be honest, I had to force myself to attend the first few events,&#x201D; confessed Marina. &#x201C;It was not easy at all, however I&#x2019;m glad I made myself do it- I&#x2019;m now really enjoying meeting new people and constantly learning.&#x201D;</p><p>3.Upskilling does not have to cost you the earth.&#xA0;Marina wanted to obtain a Scrum Master Certification, which she felt would strengthen her credentials when applying for new roles. &#x201C;Most certifications were very expensive, however I managed to find some free Scrum Master online training with great Youtube videos,&#x201D; said Marina. She completed an online exam which cost only $30 and began implementing her learnings on the job to build up her practical experience.</p><p>4.The small details matter.&#xA0;In addition to refining her resume and cover letter to ensure it clearly demonstrated her accomplishments, Marina asked a friend to take a new and professional photo for LinkedIn, which was the final edit to her professional online image.</p><p>Marina took about three months to refine her online presence, prep for interviews, build confidence and network with others in the industry.</p><p>&#x201C;Then, something changed and in one week, I suddenly had six interviews,&#x201D; recalled Marina. &#x201C;The phone kept ringing and I had three official offers from the five interviews I attended- I even had to get selective and cancel one of the interviews!&#x201D;</p><p>Marina has since accepted one of the job offers and is now working as a Business Analyst for a leading company in the property data and analytics sector. Her approach to proactively taking small but calculated steps is a great example of steering your own career progression!</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/12","associated_company":"work180"}