{"url":"https://www.work180.com.au/blog/2017/08/boeings-australian-engineers-solving-tomorrows-challenges","title":"Boeing's Australian Engineers Solving Tomorrow's Challenges","author":"WORK180","body":"\n\t\t\t\t\t<p>From fast jet sustainment and factory automation research through to advancing autonomous aerospace systems and customer technical support, <a href=\"https://www.dccjobs.com/clients/boeing\">Boeing Australia&#x2019;s</a> engineering community is solving complex problems for the innovation challenges of today and the next-generation products and services of tomorrow.</p>\n\n<p>With approximately 60 percent of Boeing Australia&#x2019;s more than 3,000 employees performing an engineering or technical role, Boeing celebrated the skills and accomplishments of its engineers during Australian Engineering Week.</p>\n\n<p>New graduates like Louisa Lee (pictured above) are proof that studies in engineering and maths can lead to a career supporting the Royal Australian Air Force&#x2019;s most formidable strike forces.</p>\n\n<p>Based at Amberley, Lee provides technical support to the Australian Super Hornet and Growler fleet as a graduate engineer. She joined Boeing as a vacation student before becoming a full-time employee.</p>\n\n<blockquote>\n<p>&#x201C;I&#x2019;m constantly learning and applying the engineering and maths skills I learnt at university every day on amazing aircraft &#x2013; it&#x2019;s every grad&#x2019;s dream,&#x201D; said Lee.</p>\n</blockquote>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b6a0e1f4-8580-4591-9001-ac8aa5144f16.jpeg\" style=\"float:right; margin:10px\"></p>\n\n<p>In Brisbane, at the core of innovation, is Kelly Cox (pictured above/right), who leads Autonomous Systems research, based at Boeing&#x2019;s research and development hub at the University of Queensland.</p>\n\n<p>With a Bachelor of Engineering Aerospace Avionics and a Masters in Mathematical Science, Cox joined the company in 2007 to pursue a varied career path and growth opportunities.</p>\n\n<blockquote>\n<p>&#x201C;I lead a diverse team that researches new technology to support the future development of resilient autonomous aerospace systems,&#x201D; said Cox. &#x201C;We are focused on pushing the boundaries of technology development that have the potential to leave a mark in history. That&#x2019;s what inspires me at work &#x2013; no two days are the same and I am continually challenged to approach problems in new and innovative ways,&#x201D; she said.&#x200B;</p>\n</blockquote>\n\n<p><strong><a href=\"https://www.dccjobs.com/clients/boeing\">About Boeing</a></strong></p>\n\n<p>Boeing is the world leading aerospace company. 50% of their entry level role recruits are female and they offer a number of flexible working arrangements along with leadership development programs to support your career. Join to support our armed forces, develop innovative cyber solutions, train the future of helicopter pilots and much more.&#xA0;<a href=\"https://www.dccjobs.com/job-search?client=boeing\">Check out their available roles and apply today</a>!<br>\n&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/08","associated_company":"work180"}