{"url":"https://www.work180.com.au/blog/2016/11/book-review-rules-of-the-game-women-in-the-masculine-industries-by-teagan-dowler","title":"Book review: Rules of the game: Women in the masculine industries by Teagan Dowler","author":"WORK180","body":"\n\t\t\t\t\t<p>Teagan Dowler from the<a href=\"/blue-collared-woman\"> Blue Collared Woman</a> regaled us on her experience and research of women working in masculine industries during her book launch last week.</p>\n\n<p>In her recently published book, &#x2018;Rules of the game: Women in the masculine industries&#x2019;, she shares some of her own chilling stories, and others&#x2019; experiences, to explore the reality of being a woman in the masculine workplace. As she makes her case, she introduces some surprising statistics.</p>\n\n<p>According to the Global Gender Gap Report, the World Economic Forum quantifies the magnitude of gender disparities and tracks their progress over time, with a specific focus on the relative gaps between women and men across four key areas: health, education, economy and politics. The 2016 Report covers 144 countries. More than a decade of data has revealed that progress is still too slow for realizing the full potential of one half of humanity within our lifetimes.</p>\n\n<p>What is even more alarming is the fact that Australia charts 46th place out of 144 on the Global Index. This begs the question:&#xA0;why does Australia still have such poor gender equality statistics1when we have various legal Acts and corporate policies, awareness programs and diversity teams?</p>\n\n<p>Teagan believes it comes down to social and cultural resistance. She feels as a society we have not spent sufficient time discussing and questioning our social values, organisational cultures and individual behaviours which support or detract from gender equality.</p>\n\n<p>The book is designed to address this and to &#x201C;raise awareness of our nation&#x2019;s culture, the culture of industries and the behaviours and experiences of people within these industries.&#x201D;</p>\n\n<p>This book should be read by any professional working in the areas of engineering, resources and construction in an effort to help you understand the trials and tribulations of being a female in those industries. Furthermore, this book will show you how to overcome the challenges and make the most of what could potentially be exciting and exhilarating industries to work in as a woman. You can order your copy&#xA0;<a href=\"http://www.thebcw.com.au/shop/\" target=\"_blank\">here</a>.</p>\n\n<p>If you are serious about considering opportunities in any of these industries, DCC Jobs has many vacancies on its&#xA0;<a href=\"/job-search\">jobs board</a>&#xA0;to browse through. New jobs are added daily, so we recommend setting up a&#xA0;<a href=\"/dashboard/candidate\">job alert</a>&#xA0;to ensure you don&#x2019;t miss out on a great opportunity!</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2016/11","associated_company":"work180"}