{"url":"https://www.work180.com.au/blog/2018/09/breaking-down-the-barriers-to-work","title":"Breaking down the barriers to work ","author":"Krishna Rachna K","body":"\n\t\t\t\t\t<p>&#xA0;</p>\n\n<p>I often meet with culturally and linguistically diverse (CALD) job seekers who ask me &#x201C;How can I gain local experience when I never worked locally and all the jobs I apply for ask for local experience?&#x201D;</p>\n\n<p>Employers look for people who they think will be reliable and experienced. If you are new to the country and identify yourself as a CALD woman it is likely you find it even harder to demonstrate the skill sets you brought with you to Australia.</p>\n\n<p>The first question every woman, irrespective of her background or culture, needs to ask herself is &#x2018;what do I want to do&#x2019;. Answering this question is important in order to proceed with your job applications.</p>\n\n<p>I have met clients who are highly skilled in a specific field but they end up working in a different field, simply because they haven&#x2019;t had proper guidance, from themselves.</p>\n\n<p>Let&#x2019;s unpack the situation and look at the most common obstacles and what you can do to overcome them.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>1. I don&#x2019;t speak English</strong></h4>\n\n<p>Learning a new language is a journey and making mistakes is ok. Practice speaking and writing and don&#x2019;t be afraid to try. Be active and immerse yourself in your new environment.</p>\n\n<p>One tip I always tell the women I meet is to listen to the radio, read newspapers, watch the news and attend English classes at least four time a week. Don&#x2019;t forget to speak English at home to further practice and grow your confidence. Find friends who are learning and buddy up with them to make your learning a fun journey.</p>\n\n<p>In order to gain employment, language is one factor but it is not the only consideration. Speak up! Even if you make mistakes in the beginning, please don&#x2019;t let that hold you back.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2</strong><strong>. </strong><strong>I can&#x2019;t find a job that matches my skill sets</strong></h4>\n\n<p>The women I meet are highly educated; doctors, engineers, IT professionals, teachers. The list goes on. Unfortunately, many of their degrees are not recognised once they arrive in Australia so they are forced to study again.</p>\n\n<p>The biggest mistake one can do at this point is to enrol in a course you are not interested in. Make sure you select a field of study that is related to your skills. Only enrol yourself in work experience and internship programs that match your skill set.</p>\n\n<p>Also, don&#x2019;t forget to sign up to career expos, be active in the community and set up a job alert to hear about jobs with employers who will support your career.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3.</strong><strong> I</strong><strong> can&#x2019;t work because of family responsibilities</strong></h4>\n\n<p>Women are often assumed the responsibility for family, household chores and childcare. Whilst staying home might be a conscious choice for some women, to others it is not.</p>\n\n<p>Many women I meet have turned down job opportunities simply because they do not have the support from their partners and families. If you have kids in school or kindergarten, reach out to them and ask about volunteering to see if your skills are required and can be used.</p>\n\n<p>Make use of public libraries and update your skills in your areas of interest. In situations like these, I recommend joining peer groups, multicultural support centres and counselling to increase awareness around your basic rights and equality.</p>\n\n<p>Make sure you know how you can use education and training opportunities to your advantage. Discuss the topic with your family to get the support you need and explain the advantages of women working and being able to support the household.</p>\n\n<p>&#xA0;I have been in the same situation and I know it takes effort and time to overcome your own obstacles and barriers. Through my work, I&#x2019;ve made it my passion to help women like me, to find a place in Australia. Nothing should stop you from applying for a job. What might be a barrier today, can be turned into your strength tomorrow.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><em><strong>Good luck </strong></em><em><strong>in</strong></em><em><strong> your job search.</strong></em></h5>\n\n<p>&#xA0;</p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2018/09"}