{"url":"https://www.work180.com.au/blog/2017/12/can-i-really-be-me-and-succeed-at-work","title":"Can I Really be Me and Succeed at Work?","author":"WORK180","body":"\n\t\t\t\t\t<p>I moderate forums quite regularly for women that focus on the themes of vulnerability, building business acumen and authentic leadership. There is a consistent theme in the conversations I have before, during and after these forums. Frustration and exasperation that women are not advancing quickly enough into leadership.</p>\n\n<p>The structural, system level reasons are well documented, however women tell me:</p>\n\n<ol>\n\t<li>I want to advance, but encounter barriers and exclusion due to implicit bias</li>\n\t<li>I am perceived to lack the confidence that men typically do in the workplace</li>\n\t<li>I want to show up authentically, confidently and courageously, but do not believe I will be rewarded for &#x2018;being me&#x2019;</li>\n</ol>\n\n<h4>WHY DO WOMEN FEEL LIKE THEY CANNOT BE AUTHENTIC?</h4>\n\n<p>One answer is the issue of likeability. There is a catalogue of articles about the &#x2018;Heidi/Howard&#x2019; story cited by Sheryl Sandberg in her seminal work, Lean In. Heidi who is an authentic female entrepreneur and go-getter, successful, wealthy, powerful and respected. Her success story, profile and achievements are reviewed by a group of students from NYU. Then her name is changed to Howard and the same group of students review her/his accomplishments.&#xA0; The students rate Heidi/Howard the same for&#xA0;<u>competence</u>, however Howard was rated as more likeable and someone that the students would prefer to work with. Heidi is&#xA0;<em>&#x2018;selfish and not the type of person you would want to hire or work for.&#x2019;</em></p>\n\n<p>It feels true, doesn&#x2019;t it? It also feels awful and contributes to the exasperation and frustration that women feel. However, there is hope. Andersen Cooper from CNN recently reran&#xA0;<a href=\"https://www.theatlantic.com/sexes/archive/2013/03/are-successful-women-really-less-likable-than-successful-men/273926/\" rel=\"noopener\" target=\"_blank\">the experiment</a>&#xA0;with a group of students. This time around, students rated the female entrepreneur as more likeable and desirable as a boss than the male. Hooray! But why?</p>\n\n<ol>\n\t<li>Because in the 10 years since the original study, we have seen more women ascend to positions of power</li>\n\t<li>Women&#x2019;s participation rates in the workforce are at their highest rate ever</li>\n</ol>\n\n<p>However, the societal expectations of how &#x2018;<a href=\"https://www.theguardian.com/women-in-leadership/2015/nov/17/nice-woman-not-business-liability-success\" rel=\"noopener\" target=\"_blank\">nice girls&#x2019;</a>&#xA0;behave and as a result, the challenge of being an authentic leader, female or male, are not shifting quickly enough.</p>\n\n<p>To put a completely gendered lens to this issue, I asked women;</p>\n\n<ol>\n\t<li>Can I really be me and still advance at work?</li>\n\t<li>Is my authentic feminine leadership style valued the same way as traditional male leadership styles?</li>\n</ol>\n\n<p>Disappointingly, many women say no to both questions. Women are waiting for the right environment to advance to be truly authentic feminine leaders. I say wait no longer!</p>\n\n<h4>WE EXPECT A LOT FROM WOMEN.</h4>\n\n<p>We want them to lead, manage, coordinate and juggle life, leadership and career. Often this results in women prioritising their career last in a long to do list. &#xA0;I want women to invest time and effort in themselves, their development and their fulfilment because&#xA0;I know, from my own experience, that understanding myself, my skills and how to use them effectively has positioned and propelled me into doing what I love and what the world needs. More women in leadership!</p>\n\n<h4>GET THE CAREER ADVICE YOU NEED</h4>\n\n<p>In her&#xA0;<a href=\"https://www.ted.com/talks/susan_colantuono_the_career_advice_you_probably_didn_t_get?utm_source=tedcomshare&amp;utm_medium=referral&amp;utm_campaign=tedspread\" rel=\"noopener\" target=\"_blank\">Ted Talk</a>&#xA0;watched over 3 million times, Susan Colantuono says get the career advice you need, not what you&#x2019;ve always received! Here is some good advice;</p>\n\n<ol>\n\t<li>Traditional training, development &amp; advice will get you to the middle, not the top</li>\n\t<li>Embrace your identity as a leader</li>\n\t<li>Identify and act to close your leadership gaps</li>\n</ol>\n\n<h4>IDENTIFY AND ACT TO BUILD YOUR LEADERSHIP MUSCLE</h4>\n\n<p>If you want to lose weight, get fit and be healthy, then you would identify and act, wouldn&#x2019;t you? You might get a gym membership, start eating healthy or engage a personal trainer to help keep you committed, focussed and accountable.</p>\n\n<p>Why not use the same formula for your career?</p>\n\n<ol>\n\t<li>Lose weight:&#xA0;lose the incomplete career advice, lose the lack of confidence.</li>\n\t<li>Get fit:&#xA0;practice self-awareness &amp; business skills exercises and build authentic leadership&#xA0;muscles</li>\n\t<li>Be healthy:&#xA0;discover your purpose, your vision and values then build a career advancement plan</li>\n</ol>\n\n<p>These are logical&#xA0;steps but require commitment, discipline, support and expertise.</p>\n\n<p><em>This article originally published by <a href=\"https://femeconomy.com/can-i-really-be-me-and-succeed-at-work/\">Femeconomy</a>.</em></p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce943d5d-7fb6-447d-9d6c-c5ebf14c71e1.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/12","associated_companies":["work180"]}