{"url":"https://www.work180.com.au/blog/2017/11/can-you-job-share-this-is-how-you-make-it-happen","title":"Can You Job Share? This is How You Make it Happen.","author":"WORK180","body":"\n\t\t\t\t\t<p>Job Sharing is a hot topic.&#xA0;</p><p>In a lot of industries <a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/04/there-is-no-i-in-job-share\" href=\"https://www.dccjobs.com/blog/2017/04/there-is-no-i-in-job-share\" target=\"_blank\">job sharing is just part of daily practice, </a>example roles include nursing staff, doctors, service technicians, technical support services, public transport drivers and many more. IT professionals don&#x2019;t commonly share roles, where we do see such fluidity in sharing responsibilities is with IT support services and in some cases IT development teams.</p><p>Technical staff often come across as artists and are very possessive of their creations; they normally take real ownership and pride in everything that they create. When a technical staff member achieves something great or new then they flaunt it like a badge, similar to surgeons or artists who take personal pride in their handy work.</p><p><a data-cke-saved-href=\"https://www.dccjobs.com/jobs/it-and-t/\" href=\"https://www.dccjobs.com/jobs/it-and-t/\" target=\"_blank\">Success in IT</a> is predominantly measured by the effectiveness and cohesion of the team and the way this influences the delivery, hence the industry has had major focus on the development of program/project methodologies which have always been viewed as the main influencers for guaranteed, successful projects/programs.</p><p>A new and more flexible view of the working environment is coming into focus, with job sharing options now more in demand within IT development and testing staff teams. Most people think that these are options that should be available to return to work mothers. Due to the criticality on delivery timelines and the requirement to utilize offshore development teams in order to drive down costs, utilizing job sharing options across geographies has become integral.&#xA0; These working arrangement also translates into an ability to cover more hours within a day as part of support agreements.</p><p>With the ever growing demand for women to return to the workplace, it has become even more important for firms to focus on trying to find ways to encourage successful job sharing arrangements. This ensures that women continue working in industries and practices for which they were qualified and trained for, rather than merely having administrative role in a company. It also then promotes gender diversity within the working environment.</p><blockquote><p>A number of principle practices need to be followed to ensure the success of the job sharing experience and the integrity of the relationships between staff members.</p></blockquote><p>&#xA0;The criteria that should be reviewed when making the decision on whether staff members can be involved in such a program are governed by the INDIVIDUAL&#x2019;S CHARACTER TRAITS and HABITS, the skillset to be able to use project management/communication TOOLS, ability to maintain CLIENT RELATIONSHIPS and EXPECTATIONS, and the individual&#x2019;s WORKING ARRANGEMENTS.</p><p><strong>What makes individuals collaborate well?</strong></p><p>We have all worked with that one colleague that was hard to get along with, be it their type of personality being incompatible with us or maybe based on their different perception of the world/topics that we hold an opposing view of.</p><p>The key to creating cohesion amongst people in the same role is to ensure that they are like minded, but as well as that they need to feel:</p><ul><li><strong>A </strong>sense of achievement</li><li><strong>S</strong>timulated&#xA0;</li><li><strong>S</strong>upported by each other</li><li><strong>E</strong>mpowered</li><li><strong>T</strong>rusted</li></ul><p>I call it being an ASSET.</p><p>These are feelings that we hold dear and we would even expect our life partners to respect them.</p><p>Individuals who are most likely be able to analyse how a person is feeling and how this feeling translated into their daily work delivery are often matured professionals who are:</p><ul><li>Sufficiently senior,</li><li>Able to provide handover,</li><li>Can advocate respect for each other&#x2019;s time and boundaries</li></ul><p>and who do not undermine each other&#x2019;s&#x2019; decisions. These are people who have had managerial experience and commonly deal with the complexities of people&#x2019;s daily life struggles at work and at home.</p><p><strong>How can I use Technology to facilitate a better working environment?</strong></p><p>In the past job sharing would require a very rigid regime of having face to face handovers, this, however, does not align with the ethos of building working flexibly within organizations. Living in the digital age allows us to use tools to facilitate the transfer of information, conduct planning, relay our vision and enable us to monitor the realization of our strategy. On the project that I am currently on we use a lot of visual aids like whiteboards for recording discussions, agreeing on architecture and KANBAN boards for recording action items, defects, and queries. There, of course, various conferencing tool solutions out there that one can use, which makes a presentation of handover material much more effective as these are more visual tools.</p><p><strong>How do I manage client expectations if two people are sharing a customer facing leadership role?</strong></p><p>It is recommended that a frank discussion is carried out with your client as part of your client induction program, teaching your client about your arrangements with your personnel especially with respect to flexible hours, job sharing and various other related information around conduct and delivery.</p><p>Clients need to be instructed to addresses emails to both individuals or at least ensure that both individuals are copied into the email chain then either one of you, depending on your arrangement, can manage that particular query. When business critical decisions are required to be made, it is vital that both individuals, especially if there are within a leadership role, make a joint decision which they have discussed. As you will both be the driving force behind the delivery, it is important that you both feel comfortable with the decision that has been made.</p><blockquote><p>If the decision making is only carried out by one of the individuals, the other will never feel accountable and when any problems do arise it will put a strain on the relationship.</p></blockquote><p><strong>Can I continue to work flexible hours in a job share arrangement?</strong></p><p>You can continue working flexible hours as long as your arrangement with your job share colleague is communicated and it suits the needs of the project. In fact, job sharing provides a wider flexibility and options for part-time employees. Managing your hours and the visibility of your availability with your client and team will become trickier. You need to ensure that you have a shared calendar available for your team, to indicate who will be available during certain periods of time. Email communication can help with any last minute changes. If you are working in a segregated office environment with closed offices, you can have a printed calendar outside the office door indicating who is available on certain days/times.</p><p>Whatever arrangements you do come up with, the client should never notice a period of absence or feel like the relationship has become strained with respect to your approachability. Your team should never feel like they are not receiving any direction. Most importantly, when you are working together during the same hours it is important that your shared resources are not receiving confusing directions and conflicts of interest. One person should be left to be responsible for allocating work to the team.</p><p>In summary, the agreements to allow individuals to job share should be based on an assessment of their individual capabilities and take into account their habits, skills and communication styles. If they are naturally strong communicators and have high accountability, the likelihood for them being able to work in a job share arrangement effectively will be highly likely.</p><p>It is important for organizations to adapt to new ways of working as it helps develop employee&#xA0;skills, as it provides a way for individuals to learn from one another. The job sharing can also facilitate the training of like-minded leaders and develop good practice skills by allowing people to observe good habits/traits in others. It is easier to learn from someone who is your peer than someone who is your senior, as it raises a level of expectation for performance, creates a healthy competitive environment and a increases self-awareness and reflection.</p><p>The learning for junior staff members who would like to focus on career growth can have a clear view of the expectations that are necessary for that next promotion.</p><blockquote><p>&#xA0;For long term arrangements the job sharing focus may not be on upskilling more junior staff but just delivering business as usual activities, in which case pairing should happen with similarly trained and experience staff members.</p></blockquote><p>The job sharing initiative will also hopefully grow the diversity in the organisation, by encouraging women to return back to work after having children. It may also facilitate possibilities for up-skilling employees, as they will be able to be exposed to a wider and more complex amount of subject matter. This will be especially true for individuals who have complimentary technical skills but are not experts in their colleague&#x2019;s skills. In most cases, it will allow companies to reduce their risks for retaining skills and knowledge and hence experience less reliance on individuals and create autonomy.</p><p><strong>WORK180&#xA0;introduces Job Sharing<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/973c1956-54ba-4a4d-a256-2121c57c965a.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/973c1956-54ba-4a4d-a256-2121c57c965a.png\" style=\"float:right\"></strong></p><p>WORK180 has created a new feature for the website to help highlight roles which are open to job sharing, to encourage part-time applicants and job-sharing partners to apply. This is something our job seekers have requested and we are happy to finally be able to include it in our job search! We are really looking forward to opening up opportunities to more women who wish to job share.&#xA0; Women looking for part-time work can apply for these roles- we encourage candidates to mention in their cover letter they are interested in job sharing and employers can then look at pairing them up with existing staff or other applicants.</p><p><br></p><h5 style=\"font-family: Lato, sans-serif;\"><strong>About Lilia Christofi</strong></h5><p><a data-cke-saved-href=\"https://www.linkedin.com/in/lilia-christofi-3690886/\" href=\"https://www.linkedin.com/in/lilia-christofi-3690886/\" target=\"_blank\">Lilia Christofi</a>&#xA0;has multinational experience in IT project delivery and operation for public and private sector firms. Over 10 years IT software project delivery and head of operations, leading and managing large teams as Head of IT.&#xA0;&#xA0;She mentors graduates or soon to be graduate females who are studying IT or Engineering. She is passionate about&#xA0;promoting her mentees to build the confidence to ask more questions and not being afraid to say they lack experience in certain areas. Communicating the importance of social interactions and how they can help overcome the lack of knowledge and understanding is her primary interest.</p><p><br></p><h5 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h5><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;<span style=\"font-size: 16px;\">Set up your job alert with&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\" style=\"font-size: 16px;\">1 click</a><span style=\"font-size: 16px;\">&#xA0;now.&#xA0;</span></p>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2017/11","associated_company":"work180"}