{"url":"https://www.work180.com.au/blog/2017/12/career-transition","title":"Career Transition - Overcoming the fear","author":"WORK180","body":"\n\t\t\t\t\t<p>It always seemed like such a scary idea to completely transition careers. Going from something that you have years of experience doing, you&#x2019;re an expert in that field, you know all the people and of course, &#x201C;all the things&#x201D;, to go from that to being the new guy/gal in a new field, no &#x201C;last big project&#x201D; to hang your hat on, just sheer enthusiasm and hope!</p><p>For me, I went from scientific research to marketing &amp; public relations.</p><p>I&#x2019;ve been coming at it sideways in recent years, working on both my photography portfolio and my writing on a blog and, more recently with a couple of Australian brands, creating images for their websites and social media channels.</p><p>But to make that switch, from scientific research all the way to marketing &amp; PR? It feels like a number of things had to line up, a lot of little ducks getting into their neat little rows.</p><p>After five years in research, which is not a long time, I moved into an applications specialist role for a scientific equipment company, which allowed me to keep the science, while dipping my toes into sales.</p><p>Within a year, I was creating the marketing communications for our department while at the same time being an applications specialist. The marketing was something that I loved doing, but it was an extra on top of my real job, it wasn&#x2019;t recognized formally, and so it was never allowed to be a real focus. Since it was something that I enjoyed doing, when I saw an opportunity, I took it.</p><blockquote><p>That&#x2019;s my advice, if you want to try something, particularly if it&#x2019;s something that you&#x2019;re passionate about, just try it. You won&#x2019;t find out if it&#x2019;s right until you actually try.&#xA0;</p></blockquote><p>So, I spent nine years in that role, and for a time in a territory sales manager role, teaching, selling, occasionally creating,&#xA0;traveling&#xA0;the entire country, day in, day out.</p><p>The travel was a lot. The sheer amount of time spent away from home meant that the (unofficial) marketing part of my role died for a time. And I became resentful of that. It was a joyful part of what I did, and being denied that was difficult for me.</p><p>Until I found photography.</p><p>I&#x2019;d always enjoyed photography but had never been serious about it. But the travel schedule forced me away from home and into some amazing cities, so why not get out and see them? See the world from behind my lens?</p><p>And so my obsession with photography began. I would take one evening each trip (if I could) and go out, either on my own, or in a like-minded group, and lose myself behind the lens for just a couple of hours. It was enough to refresh and recharge, and it made me less resentful of the ridiculous hours and intense travel schedule. I taught myself with so much reading &#x2013; online magazines, real magazines, and just trying things.</p><p>During that time, I was also writing. Short stories. Dark stories. I&#xA0;reveled&#xA0;in that. And I felt like I needed to share my little creations with people.</p><p>So I started a blog and also began my first foray into social media. And I loved it. Loved the process, loved learning what worked and what didn&#x2019;t. And especially loved the community of people that you develop on those channels.</p><p>Then, after 9 years in that first sales company, I had a career switch, to a role that gave me the freedom to develop a business my own way. Exciting products, still in science but still a lot of travel. I was able to use what I&#x2019;d learned so far to build a business, apply those skills and that expertise to a new opportunity and grow something from the ground up.</p><p>What was missing though, was the space to create. It was a small team, so the workload was high and the scope for fitting in a creative marketing strategy was severely limited. They had a marketing person already, so again this was not my focus. I enjoyed the&#xA0;work,&#xA0;but didn&#x2019;t love it. I was missing the passion.</p><p>And all of a sudden, this current opportunity appeared. A not-for-profit business, supporting scientific research, and they needed someone to lead their marketing team.</p><p>A marriage of science and creativity.</p><p>Sounds like magic.</p><p>I have officially been in marketing, communication and public relations for a little over three months now. It&#x2019;s so dynamic, there are a million things to do, there are so many people who need something from me, there are never enough hours in the day, the task list is never completed.</p><p>And yet I feel like I&#x2019;m home.</p><p>I&#x2019;m in the place I&#x2019;m supposed to be.</p><p>So what is it like in a day in the life of a Marketing &amp; Public Relations Manager?</p><p>The day begins with the social media check-in. Emails, Instagram, Blog and Facebook for my photography business, and LinkedIn for myself, usually over coffee and toast, with my&#xA0;dog&#xA0;curled up in my lap on the sofa. Then, once I&#x2019;m in the office, checking Twitter, LinkedIn, Facebook and the online enquiry mailbox. Liking, retweeting, replying, forwarding &#x2013;&#xA0;lots of adverbs in the morning.</p><p>Next is to check in with the sales team to see what events are coming up, what collateral they need, what our customers and competition are up to. And also a catch-up with my communications officer to see how things are going for her, making sure we&#x2019;re addressing the right things and keeping on top of events for the sales team.</p><p>Throughout the day, I&#x2019;m creating brochures and flyers, making social media posts that pop, coordinating our annual report, writing copy for our new website, setting up our new website(!), updating the social media calendar, photographing staff for the new website and annual report, and taking calls and emails from coworkers to work through events or a campaign.</p><p>Oh&#xA0;that&#x2019;s right, I just mentioned social media again. I continue to check social media throughout the day, monitoring retweets and mentions and shares, checking what our partners are posting and retweeting and sharing those.</p><p>I&#x2019;m fascinated by the analytics. It may be the scientist in me. I love discovering what content works and what doesn&#x2019;t. And analysing which time of the day is best for us. It&#x2019;s just three months in, but I feel like I&#x2019;m making an impact. And I even enjoy preparing the reports on what&#x2019;s been done and how we&#x2019;re performing &#x2013; it&#x2019;s gratifying to see those numbers climb and to know that I&#x2019;ve helped that happen.</p><p>Alongside the reporting, is the planning.&#xA0;Oh&#xA0;how I love the planning! It was almost a clean slate, so it&#x2019;s been very satisfying to set up the calendar for marketing events, social media posts and strategies for the next few months. This process also takes up a good proportion of my day and it&#x2019;s ongoing.</p><p>I&#x2019;m very lucky to have found a place where I can just dive in and make things happen. I started 2017 with a plan to make a change this year. And I started it with a phrase to live by. That phrase was: &#x201C;create every day&#x201D;.</p><p>And you know what? That&#x2019;s what I&#x2019;m doing.</p><p><br></p><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/12","associated_company":"work180"}