{"url":"https://www.work180.com.au/blog/2018/11/catching-the-next-wave","title":"Catching the Next Wave","author":"WORK180","body":"\n\t\t\t\t\t<p>Who knew that one day I&apos;d end up living in the sun and surf capital of Australia. I grew up surfing the pristine beaches of Western Australia and was always interested in the environment. I completed a double degree in Engineering and Science at the University of Western Australia (UWA) to combine how nature worked, with how to solve nature&#x2019;s problems. I still remember a book I had as a 12 year old which explained global warming, a common concept nowadays. I didn&#x2019;t really think much of the ratio of females to males in the core engineering subjects at university (somewhere around 20% if I remember correctly), partly because I studied Environmental Engineering, which was quite evenly gender balanced, but also because of the few women I encountered in the water surfing.&#xA0;</p><p>Fast forward a few years, after cutting my teeth in engineering consulting, and then working for a water utility, I met my partner in Melbourne.&#xA0;We moved to China together to pursue an opportunity he had, and with some luck I landed a job with Siemens. After a few crazy years we relocated to Perth, thinking about starting a family. Coming back to Australia was like shining a light on all the things you never realised about this place. Like, how few people there are in this country, and how amazing our clean unpolluted environment is. But also how much business relationships are forged over (quite) a few beers, and how being the only woman in the room was not uncommon.&#xA0;</p><p>While in Perth we had two girls. Siemens were fantastic at offering me flexibility returning to work both times as well as keeping me engaged and involved during the maternity leave period.&#xA0;It helped me to appreciate the role that organisations need to play in keeping women in the workforce during the child bearing years if there is a genuine desire to increase the number of women in senior management. When Siemens offered me the opportunity to take on a new role in Queensland, my husband was also able to take on a new role with his company, making the decision an easier one.&#xA0;</p><p>Recently I started as General Manager of the Siemens Building Technologies business in Queensland. After a big few weeks, I am a bag of mixed emotions.&#xA0;Excited about the new&#xA0;challenge but also sad to be away from family support and an amazing group of friends.&#xA0;Luckily I have a warm and welcoming team and there is some pretty awesome surf close by.&#xA0;</p><p>Thanks to all the people that have supported me to get this far, my role models, mentors and friends. I hope to inspire my daughters to dream big and have the mindset that they can achieve whatever they want.</p><p><br></p><hr><h4><br><strong>About SIEMENS</strong></h4><p><br></p><p>Siemens&#xA0;employs 2,200 people in Australia and 377,000 globally. As the business continues to grow,<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/bc9db6c1-3d09-4105-9454-27dd7760eec4.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/bc9db6c1-3d09-4105-9454-27dd7760eec4.png\" style=\"float: right; width: 150px; height: 63px;\">&#xA0;they&#x2019;ll be offering new&#xA0;<span style=\"font-size: 1.6rem;\">employees a range of great benefits, including mentoring programs, gender-neutral parental leave and the oportunity to work flexibly.</span></p><p><a data-cke-saved-href=\"https://lnkd.in/edXRYaf\" href=\"https://lnkd.in/edXRYaf\" style=\"font-family: Helvetica, Arial, sans-serif; font-size: 14px; background-color: rgb(255, 255, 255);\">Read more</a><span style=\"color: rgb(29, 33, 41); font-family: Helvetica, Arial, sans-serif; font-size: 14px;\">&#xA0;</span><br><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p><p><br></p>\n\t\t\t\t","tags":["Siemens","women in senior management","Engineering","flexibility"],"upload_date":"2018/11","associated_company":"work180"}