{"url":"https://www.work180.com.au/blog/2016/04/cbus-extends-family-violence-support-measures-and-parental-leave","title":"Cbus extends family violence support measures and parental leave","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally posted on the Cbus website. &#xA0;The original can be viewed <a href=\"http://www.cbussuper.com.au/about-cbus/news/latest-news/cbus-extends-family-violence-support-measures-and-parental-leave\">here</a>.</p>\n\n<p>Family violence is a significant social issue that has far reaching effects on the Australian community &#x2013; employers can, and should, play a role in helping victims of this problem.</p>\n\n<p>Cbus has taken steps to ensure that any employee affected by family violence will have access to extensive support measures.</p>\n\n<p>This includes:</p>\n\n<ul>\n\t<li>\n\t<p>emergency accommodation support for 2 weeks;</p>\n\t</li>\n\t<li>\n\t<p>furniture removal to help with relocation;&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>advance pay (loan) if needed;</p>\n\t</li>\n\t<li>\n\t<p>individualised counselling to assist employees; and</p>\n\t</li>\n\t<li>\n\t<p>streamlined access to 2 weeks leave.&#xA0;</p>\n\t</li>\n</ul>\n\n<p>David Atkin, Cbus CEO, said <em>&#x201C;We sincerely hope that no Cbus team member needs to access these provisions; however if they do then we will ensure they are supported. Cbus prides itself on being a caring and supportive employer of choice &#x2013; these measures underline our commitment to our people.&#x201D;</em></p>\n\n<p>In addition, Cbus has updated its already significant parental leave provisions to be completely gender neutral. Primary carers will be entitled to 16 weeks paid leave at any stage during the first year (birth or adoption related). This is in addition to two weeks of paid paternity leave.</p>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p><em>&#x201C;Cbus aims to be truly inclusive and we believe all parents should have the opportunity to nurture and enjoy their new children. We are delighted to offer this benefit to our people. Cbus is proud to invest for the long term. We take this approach with our assets and our people.&#x201D;</em> said Mr Atkin.</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p><strong>About Cbus</strong></p>\n\n<p>Established in 1984, Cbus is the industry superannuation fund for the construction, building and allied industries. Cbus is run only to benefit members and recently received recognition for its 10 years as a platinum rated fund by independent ratings agency SuperRatings.*</p>\n\n<p>Cbus also invests back into the construction and building industry, which not only provides strong long-term investment returns, but helps boost our economy and create jobs within the industry.</p>\n\n<p>Cbus has approximately:</p>\n\n<ul>\n\t<li>\n\t<p>200 employees</p>\n\t</li>\n\t<li>\n\t<p>720,000 members</p>\n\t</li>\n\t<li>\n\t<p>100,000 employers</p>\n\t</li>\n\t<li>\n\t<p>$32 billion in funds under management</p>\n\t</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<p>Media contact</p>\n\n<p>James Bennett</p>\n\n<p>0410 142 435&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>*SuperRatings is a ratings agency that collects information from superannuation funds to enable performance comparisons.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/04","associated_company":"work180"}