{"url":"https://www.work180.com.au/blog/2017/05/celebrating-world-telecommunication-and-information-society-day","title":"Celebrating World Telecommunication and Information Society Day","author":"WORK180","body":"\n\t\t\t\t\t<p>Today, May 17, is the UN&apos;s&#xA0;<a data-cke-saved-href=\"http://www.un.org/en/events/telecommunicationday/index.shtml\" href=\"http://www.un.org/en/events/telecommunicationday/index.shtml\">World Telecommunication and Information Society Day</a>&#xA0;&#xA0;(<a data-cke-saved-href=\"https://twitter.com/hashtag/WTISD?src=hash\" href=\"https://twitter.com/hashtag/WTISD?src=hash\">#WTISD</a>)&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d2e4ea84-bb48-4266-91b7-c20711ad66ac.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d2e4ea84-bb48-4266-91b7-c20711ad66ac.png\" style=\"float:right; height:120px; width:144px\"></p><p>The day is held to raise awareness of the possibilities that the use of the Internet and other information and communication technologies (ICT) can bring to societies and economies, as well as of ways to bridge the digital divide. That is the divide between those who have access and use the technology vs. those who don&#x2019;t.</p><p>It marks the anniversary of the signing of the first International Telegraph Convention and the creation of the International Telecommunication Union.&#xA0;</p><p>To celebrate the day we would like to honour the inspiring women who changed the technology landscape and gave us the ICT tools we most often take for granted.</p><p><strong>Ada Lovelace</strong><br><br><a data-cke-saved-href=\"http://www.biography.com/people/ada-lovelace-20825323\" href=\"http://www.biography.com/people/ada-lovelace-20825323\">Ada Lovelace</a>&#xA0;has been referred to as the &apos;prophet of the computer age&apos; and was a mathematician. Born in 1815, she is considered to have written instructions for the first computer program in the mid-1800s and introduced many computer concepts making her the first computer programmer. However, it wasn&#x2019;t until the 1950s that her contributions to the field of computer science were truly acknowledged. In 1953 B.V. Bowden republished her notes in Faster Than Thought: A Symposium on Digital Computing Machines. Since then she has received numerous posthumous awards.</p><p><strong>Shirley Ann Jackson</strong><br><br><a data-cke-saved-href=\"http://president.rpi.edu/president-biography\" href=\"http://president.rpi.edu/president-biography\">Dr Jackson</a>&#xA0;has become one of the most recognisable names in telecommunication. She completed a PhD in nuclear physics from MIT in the 70s, making her the first African-American to receive a doctorate from MIT. Her research has enabled the development of touch-tone telephones, call waiting,&#xA0;fibre&#xA0;optic cables, portable fax machines and the technology behind caller ID.</p><p>In 1999 Dr Jackson was appointed the 18th&#xA0;president of the Rensselaer Polytechnic Institute, established in 1824 it is the oldest technological research university in the US. In 2010 the board unanimously voted to extend her position for another ten years which she accepted. In 2011 Dr Jackson was a keynote speaker at the&#xA0;<a data-cke-saved-href=\"https://ghc.anitaborg.org/\" href=\"https://ghc.anitaborg.org/\">Grace Hopper Celebration of Women in Computing</a>. Watch her inspiring speech:</p><p style=\"text-align:center\"><iframe allowfullscreen frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/qQPw3XbvwhQ\"></iframe></p><p><br></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/00cf00af-26e8-4a95-809d-80bc58fb710e.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/00cf00af-26e8-4a95-809d-80bc58fb710e.jpeg\" style=\"float:right; height:161px; width:306px\"><strong>Hedy Lamarr</strong></p><p>Whilst&#xA0;<a data-cke-saved-href=\"https://en.wikipedia.org/wiki/Hedy_Lamarr\" href=\"https://en.wikipedia.org/wiki/Hedy_Lamarr\">Hedy Lamarr</a>&#xA0;is known by many as a Hollywood star she also played a key role as an inventor. Together with George&#xA0;Antheil&#xA0;they pioneered a way to manipulate radio frequencies and developed a radio guidance system for the Allied forces in World War II, allowing the allies to communicate secret messages during the war. The technology was not adopted until the 1960s by the US Navy but the principles are incorporated in modern Wi-Fi and essentially contributed to the wireless communications we use today.</p><p><br></p><p><br></p><p><img alt=\"\" data-cke-saved-src=\"https://diversecitycareers.com/media/diversecitycareers/Articles/Grace%20Hopper%20Wiki.jpg\" src=\"https://diversecitycareers.com/media/diversecitycareers/Articles/Grace%20Hopper%20Wiki.jpg\" style=\"float:right\"></p><p><strong>Grace Hopper</strong></p><p><a data-cke-saved-href=\"https://en.wikipedia.org/wiki/Grace_Hopper\" href=\"https://en.wikipedia.org/wiki/Grace_Hopper\">Grace Hopper</a>&#xA0;was a US Navy rear admiral, inventor and computer scientist. As a child, she loved disassembling alarm clocks and was always searching for the answer to understanding exactly how things worked &#x201C;inside&#x201D;. She went on to earn a doctorate in mathematics in 1934 from Yale and joined the Navy shortly thereafter to fight in World War II. She was instrumental in the development of COBOL, one of the first high-level programming languages after promoting the idea of machine-independent programming languages. She was also one of the first programmers of the&#xA0;<a data-cke-saved-href=\"https://en.wikipedia.org/wiki/Harvard_Mark_I\" href=\"https://en.wikipedia.org/wiki/Harvard_Mark_I\">Harvard Mark I</a>&#xA0;computer and has received a number of nicknames over the years such as the &#x201C;Queen of Code&#x201D; &#x201C;amazing Grace&#x201D; and the &#x201C;mother of computing&#x201D;. She passed away in 1992 and was awarded the&#xA0;<a data-cke-saved-href=\"http://www.navy.mil/submit/display.asp?story_id=97807\" href=\"http://www.navy.mil/submit/display.asp?story_id=97807\">Presidential Medal of Freedom</a>&#xA0;posthumously in 2016 by former US president Barack Obama.</p><p><br></p><p><strong>Ann Moffatt</strong></p><p><a data-cke-saved-href=\"http://godigitalqld.dsiti.qld.gov.au/AnnMoffatt\" href=\"http://godigitalqld.dsiti.qld.gov.au/AnnMoffatt\">Ann Moffatt</a>&#xA0;started working the Information Technology Industry in 1959 as a programmer for Kodak. In 1974 she moved from the UK to Australia to work as an IT executive at AMP Society, where she was the only female executive until 1986. In 1990 Ann founded&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/fitt\" href=\"https://www.diversecitycareers.com/fitt\">Females in Information Technology and Telecommunications</a>&#xA0;(FITT) an organisation which has a subscriber base of around 4,000 today. In 2002, Ann was the first woman inducted into the Australia ICT Hall of Fame. In 2006 she was awarded an Honorary Doctorate by USQ and inducted to the Pearcey Hall of Fame, the highest Australian professional award for a lifetime achievement in the ICT industries in 2011. In 2015, Microsoft listed her as one of 12 Australian innovators for her pioneering work and advocacy for teleworking.</p><p>Ann Moffatt talks about some of the changes she has seen in the computer industry since she started out in 1959 in this&#xA0;<a data-cke-saved-href=\"https://www.frasercoastchronicle.com.au/videos/digital-champion-ann-moffatt/37098/\" href=\"https://www.frasercoastchronicle.com.au/videos/digital-champion-ann-moffatt/37098/\">video</a>.</p><p><br></p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/05","associated_company":"work180"}