{"url":"https://www.work180.com.au/blog/2018/05/celebrating-inwed18-international-women-in-engineering-day","title":"Celebrating INWED18 - International Women in Engineering Day","author":"WORK180","body":"\n\t\t\t\t\t<p><strong>Rising to the challenge: promising data shows women engineers are most resilient in the job market.</strong></p>\n\n<p>&#xA0;</p>\n\n<p>The theme for International Women in Engineering Day (INWED 2018) is &#x201C;Raising The Bar&#x201D;. At WORK18, we are fortunate to meet many inspiring women working in non-traditional fields, challenging stereotypes and ideas of who can do what type of work. Everyday, we are working to Raise The Bar. We work to showcase the amazing career opportunities the engineering industry offer as well as celebrate outstanding achievements by the women already making their mark in the workplace.</p>\n\n<p>This INWED 2018, we encourage you to celebrate the female engineers you have in your network and to take the opportunity to inspire our future women in engineering.</p>\n\n<p>The future is looking promising. Today, we would like to shine the spotlight on two Endorsed Employers for Women who are creating powerful and positive&#xA0;initiatives to tackle diversity in the industry.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>BAE Systems graduate named one of the UK&apos;s top 50 women engineers 2017.</strong></p>\n\n<p>Sophie Dent, 24, is an engineering graduate at BAE Systems Submarines in Barrow-in-Furness, Cumbria. Sophie proved instrumental in designing the first engineering badge for the Girl Guides. Unsurprisingly, she was named one of the country&apos;s leading female engineers in The Daily Telegraph&apos;s Top 50 Women in Engineering 2017.</p>\n\n<blockquote>\n<p>&#xA0;&#x201C;As a female engineer, I was in the minority throughout university, but I&apos;m hopeful this won&apos;t be the case for girls in future. I am so passionate about engineering and if I can break down some barriers and change perceptions of the industry for just a few girls, I&apos;ll be very happy.&quot;<span style=\"font-family: sans-serif, Arial, Verdana, &quot;Trebuchet MS&quot;;\">&#xA0;</span></p>\n</blockquote>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b77e5abe-8564-4eff-a1c0-b5d2b0d1e4fb.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<p><strong>Schneider Electric inspires a new generation of women engineers. </strong></p>\n\n<p>Schneider Electric are challenging the stereotypes and biases that prevail within the male dominated engineering and technology sectors by running school reach out programmes- these are key to encouraging young women into the STEM fields. By rallying volunteers, Schneider Electric now have over 100 STEM ambassadors taking part in local activities like science fairs, school projects and career events! Interested in joining SE and becoming a STEM ambassador too?&#xA0;<a href=\"http://work180.co/jobs/employer/Schneider%20Electric%20UK\">Explore their jobs</a>.</p>\n\n<blockquote>\n<p>&#x201C;The journey of being a female engineer certainly has been tough at times. Even though I&#x2019;m in a minority situation and breaking the stereotypes, I have no absolute regrets on choosing this career path. I am proud to be a female engineer in Schneider, and I hope someday the barrier will be removed, and both men &amp; women can be equally succeeded in the engineering sector&#x201D;.&#xA0; &#xA0; Maulidya Falah, one of two female Field Service Representatives at Schneider Electric.</p>\n</blockquote>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d1439ded-ce41-415a-83dd-f62430fcc4da.jpeg\"></p>\n\n<div>&#xA0;</div>\n\n<div><strong>About WORK180</strong></div>\n\n<p><a href=\"http://www.work180.co\">WORK180</a> is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our website, so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p><a href=\"http://www.work180.co/\">Visit the UK WORK180 website</a></p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2018/05","associated_companies":["work180"]}