{"url":"https://www.work180.com.au/blog/2018/10/celebrating-ada-lovelace-day","title":"Celebrating Ada Lovelace Day","author":"WORK180","body":"\n\t\t\t\t\t<p>Thank you to journalist and software activist&#xA0;<a data-cke-saved-href=\"https://work180.co/partner/finding-ada\" href=\"https://work180.co/partner/finding-ada\">Suw Charman-Anderson</a>&#xA0;who founded Ada Lovelace Day. Today, we celebrate the achievements of women in the fields of science, technology, engineering and mathematics. Today we mark the impact of women and pay tribute to the first computer programmer, Ada Lovelace.</p><p>In the 1830s, Ada&#x2019;s mother insisted she was tutored in mathematics and science - subjects often not offered to girls at this time, At seventeen, Ada, met her mentor, mathematician Charles Babbage, the inventor of the mechanical calculator.</p><p>Ada wrote a set of notes on Babbage&#x2019;s Analytical Engine which were recognised as the first algorithms. Therefore, Ada is known as the world&#x2019;s first computer programmer. Not just the world&#x2019;s first female programmer - as she is often referred to.</p><p>In the words of Dr Sue Black:</p><p>Coding simply didn&#x2019;t exist before her.</p><p>By creating Ada Lovelace Day, Suw ensures that women in tech are visible and in turn will inspire future generations. Rather than highlighting the problem and the worry that women are not noticed in tech, today we broadcast all the groundbreaking things they&#x2019;ve achieved. Ada is the perfect mascot to illuminate women in STEM.</p><blockquote><p>Many of our most successful women have never been given the credit they deserve, overshadowed by the men that they worked with for no better reason than that it was just &#x201C;how things were&#x201D;. And many of the women working in STEM today go unnoticed and unremarked.</p></blockquote><p>Suw Charman-Anderson</p><p><br></p><p>It wasn&#x2019;t until the 1950s that Ada&#x2019;s contributions to the field of computer science were truly acknowledged. We need to make sure that women&apos;s voices are heard. By 2020, there will be&#xA0;<a data-cke-saved-href=\"https://mic.com/articles/189829/nearly-two-thirds-of-women-in-tech-say-their-ideas-are-ignored-until-a-man-repeats-them-study-shows#.LsvzFZYaM\" href=\"https://mic.com/articles/189829/nearly-two-thirds-of-women-in-tech-say-their-ideas-are-ignored-until-a-man-repeats-them-study-shows#.LsvzFZYaM\" target=\"_blank\">1.4 million jobs in computer science</a>. However, women are on track to fill a tiny 3% of those roles. Being ignored in meetings, asked to take notes or get coffee, and being paid less overall for their work, are standing in the way of women joining the technology force. This is why WORK180 only endorse&#xA0;<a data-cke-saved-href=\"https://work180.co/employer-search\" href=\"https://work180.co/employer-search\">employers</a>&#xA0;that foster policies to enable gender-equal career paths.</p><blockquote><p>We are trying to effect cultural change. But you don&#x2019;t change culture overnight. Equality is here, but it&#x2019;s not evenly distributed. Some technology companies are doing a grand job. Other companies need to work a lot harder.</p></blockquote><p>Suw Charman-Anderson</p><p>Ada&#x2019;s achievements &amp; legacy are proof that diversity matters. We need technology that reflects the needs and wants of women. It&#x2019;s vital that women and girls inspire future innovations.</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["ada lovelace","stem"],"upload_date":"2018/10","associated_company":"work180"}