{"url":"https://www.work180.com.au/blog/2017/06/celebrating-the-first-woman-in-space","title":"Celebrating the First Woman in Space","author":"WORK180","body":"\n\t\t\t\t\t<p>On June 16, 1963, Soviet cosmonaut Valentina&#xA0;Tereshkova became the first woman to fly to&#xA0;space when she embarked on the Vostok 6 mission, calling out &#x201C;Hey sky, take off your hat, I&#x2019;m on my way!&#x201D; before launching. In total, she spent almost 3 days in space, orbiting Earth 48&#xA0;times. Her trip was the longest time anyone has ever spent in space at that time, more time than all U.S astronauts,who combined, had orbited the Earth 36 times.Today, we celebrate Valentina and pay tribute to her pioneering space travel for women.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Early Life</strong></p>\n\n<p>Valentina was born in 1937, her mother widowed with three children to support when Valentina was just two years old. In her early teens, Valentina worked at the textile factory and developed a fascination for parachuting. She joined the local aviation club and made her first parachute jump at the age off 22. Her love for parachuting led her to join the Soviet Space program and her knowledge of parachuting was crucial to her success. Although leaving earth in the space shuttle, cosmonauts are required to eject and parachute themselves out of the shuttle at 20, 000 feet (6000 m) to return to earth and Valentina was well prepared for the challenge.</p>\n\n<p>&#xA0;</p>\n\n<p><img alt=\"\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/Valentina%20Tereshkova%201.jpg\" style=\"float:right; height:216px; margin:20px 10px; width:214px\"></p>\n\n<p><strong>Overcoming Barriers for Women in Space</strong></p>\n\n<p>At that stage, the Space Race between the U.S and the Soviet Union has escalated to a competition between who could be &#x201C;the first&#x201D; when it came to space travel. The Soviet Union were determined to put the first woman in space. Valentina along with four other women was selected out of 400 applicants to join the training to achieve this goal. The U.S considered female pilots in a screening process between 1959-60, however, shortly after they decided to restrict astronaut training to men only. It was not until 1983 that the U.S saw astronaut and physicist Sally Ride become the first American in space on board the space shuttle Challenger.</p>\n\n<p>&#xA0;</p>\n\n<p><img alt=\"\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/Valentina%20Tereshkova%204.jpg\" style=\"float:right; height:193px; margin:50px 10px; width:124px\"><strong>Valentina&#x2019;s Accolades</strong><br>\n<br>\nUpon her return to earth, Valentina joined the Zhukovsky Military Air Academy and graduated with distinction. She became the head of the Soviet Committee for Women from 1968-87 and attended the UN conference for the International Women&#x2019;s Year in 1975, representing USSR. In the Soviet Union, she was pictured on postage stamps and had a crater on the moon named after her. After her voyage to space, she was awarded the Order of Lenin, the highest decoration bestowed by the Soviet Union and Hero of the Soviet Union, the highest distinction given to individuals or groups for heroic feats in the service of the Soviet state and society.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Next Stop, Mars</strong></p>\n\n<p>In 2013, Russia celebrated the 50th&#xA0;anniversary of her historic space flight along with Valentina&#x2019;s 76thbirthday. Part of the group who studied the possibility of going to the Red Planet, Valentina concluded that if she could, she would fly to Mars, even on a one-way ticket. This year, Valentina will turn 80 and she continues to be an icon of our time, pushing the limits of what women were thought to be able to do.</p>\n\n<p style=\"text-align:center\"><img alt=\"\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/Valentina%20Tereshkova%203.jpg\"></p>\n\n<p style=\"text-align:center\">&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/06","associated_company":"work180"}