{"url":"https://www.work180.com.au/blog/2018/07/celebrating-naidoc-week-xeros-story","title":"Celebrating NAIDOC week - Xero's story","author":"WORK180","body":"\n\t\t\t\t\t<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a309cabd-c6c0-4678-b337-08097bc1d75e.png\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a309cabd-c6c0-4678-b337-08097bc1d75e.png\" style=\"font-size: 16px; margin: 10px; float: right;\"></p><p>At Xero we&#x2019;re celebrating NAIDOC (National Aboriginal and Islanders Day Observance Committee) Week and encouraging our people to participate in a range of activities to support our local Aboriginal and Torres Strait Islander communities.</p><h4><strong>Comms Guide for &#x2018;Welcome to </strong><strong>and</strong><strong> Acknowledgement of Country&#x2019;</strong></h4><div><p>To kick off NAIDOC Week, we are really excited that as a key initiative we will be launching our Xero &#x2018;Welcome to and Acknowledgement of Country&#x2019; Comms Guide. This internal guide provides useful information about how we can show our respect for and recognise Aboriginal and Torres Strait Islander people as the First Australians and the Traditional Owners and Custodians of our land, sea and waters. This is important because Aboriginal and Torres Strait Islander people have experienced a long history of exclusion from Australian history books, the Australian flag, the Australian anthem and, until more recently, Australian democracy. At Xero, this is just one of the ways we can acknowledge this and contribute to ending the exclusion that has been so damaging throughout our history.</p><h4><strong>Celebrating NAIDOC Week @ Xero</strong></h4><p>The week we&#x2019;ve also organised a range of activities including holding a special Morning Tea in our Melbourne office last Friday, where Aunty Georgina Nicholson from the Wurundjeri Land Council conducted a Welcome to Country and spoke about NAIDOC&#x2019;s theme this year &#x2018;Because of Her, We Can&#x2019; and the powerful, strong, cultural women in her family. Some of the other things we have planned during NAIDOC Week include displaying the Aboriginal flag, showing Indigenous artwork on all Xero screens across our Australian offices, launching our comms guide at our Australia-wide kick off, and hosting a special trivia night with NAIDOC themed questions. We hope everyone will get involved in celebrating NAIDOC Week! It&#x2019;s one of the ways we can build connections and show our respect for Aboriginal and Torres Strait Islander people and importantly ensure we create an inclusive culture where everyone can bring their whole selves to work and have a sense of belonging.</p><hr><h4><strong><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/346f0eab-dbfa-4349-a4fb-1e56e52d39bb.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/346f0eab-dbfa-4349-a4fb-1e56e52d39bb.png\" style=\"float: right; margin: 10px; width: 200px; height: 200px;\">What makes Xero unique?</strong></h4><div><br></div><p>At&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients/xero\" href=\"https://www.dccjobs.com/clients/xero\">Xero</a>&#xA0;we are proud of our diverse and inclusive environment. Our Xero&#x2019;s respect, challenge and support each other and have a constant eye on developing innovative and creative solutions to ensure we stay ahead of the curve. &#xA0;</p><p>We want our employees to have fun while doing the best work of their lives.</p><p>Learn more about Xero on their&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients/xero\" href=\"https://www.dccjobs.com/clients/xero\">Best Employer page.</a></p><p>View all Xero&apos;s jobs and apply&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=xero\" href=\"https://www.dccjobs.com/job-search?client=xero\">here.</a>&#xA0;</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div>\n\t\t\t\t","tags":["diversity and inclusion","gender equality"],"upload_date":"2018/07","associated_companies":["work180"]}