{"url":"https://www.work180.com.au/blog/2019/01/celebrating-women-who-made-it-to-the-top-in-2018","title":"Celebrating women who made it to the top in 2018","author":"WORK180","body":"\n\t\t\t\t\t<p><strong>Women in history shouldn&#x2019;t be a mystery</strong></p>\n\n<p>Today we are shining a light on those women who broke down barriers and shattered the glass ceiling in 2018. It&apos;s vital that we acknowledge and celebrate the women that are now leading some of the world&#x2019;s most successful companies, often in male-dominated sectors.</p>\n\n<p><strong>Land O&apos;Lakes made history when Beth Ford took over as CEO</strong></p>\n\n<p>Beth is the first openly gay woman to lead a Fortune 500 company, and one of just 25 women overall.</p>\n\n<p>&quot;The Board chose the person they felt best met the criteria to drive success in the business,&quot; said Beth. &quot;I realize this is an important milestone for many people and I am pleased to share it. Leadership is a team sport. Male or female - it&#x2019;s really not about me&quot;.</p>\n\n<p>Beth recalls an important lesson she learnt from her mother: &quot;Beth, if you want something, ask for it. You expect you&apos;re going to be recognized because you&apos;ve done the hard work, and that isn&apos;t actually how it always happens&quot;.</p>\n\n<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a5abd7bc-2f75-4247-aef1-cc75c27f8932.png\"></p>\n\n<p>&#xA0;</p>\n\n<p><strong>Nike appoints Tamika Curry Smith as VP of Diversity and Inclusion</strong></p>\n\n<p>Tamika is now responsible for leading and advancing their D&amp;I strategy. Previously, Tamika developed and spearheaded a holistic D&amp;I approach across the Mercedes-Benz USA workforce.</p>\n\n<p>&#x201C;Tamika brings a breadth of experience to this role. Over the course of her career, she has worked with global companies, non-profits, academia and the public sector; she designed and implemented D&amp;I strategies to increase awareness and communication, improve representation and retention, and drive accountability&#x201D;.</p>\n\n<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f068dcc-e02c-4f44-8f61-3cf93d2bc643.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<p><strong>Aston Martin appoints first-ever female president, Laura Schwab</strong></p>\n\n<p>A woman in the driver&apos;s seat: Laura says her promotion signals a &#x201C;pivotal moment in time for women&#x201D; &#x2013; not just in the auto industry, but all around the world. &#x201C;I am desperate for more women to apply for jobs in automotive. For some women it&#x2019;s scary&#x2026;they might not think they know that much about cars or that much about technology.&quot;</p>\n\n<p>Five weeks after accepting the position, Laura found out she was pregnant. Now with a one year old, Laura is often asked: &#x201C;how you do it&#x201D;, and her response is always the same: &#x201C;When was the last time you asked a man that question?&#x201D;.</p>\n\n<p>&#x201C;I never thought of myself as a role model but now that I am in this role, women are looking to me and saying, &#x2018;I can do it.&#x2019; And if I can play a small part in encouraging women that automotive is a wonderful place to work and an inspiring and exciting place, then I&#x2019;ll take on that role for sure.&#x201D;</p>\n\n<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7645d78e-9724-4eb9-8f04-e94cd5bec0bf.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<p><strong>Premier League names Susanna Dinnage as Chief Executive</strong></p>\n\n<p>Susanna is the fourth person and the first woman to lead the organisation. She will take up the role in 2019 and will become the most senior female leader in the world&apos;s major professional sports leagues. Due to the immense influence of the Premier League, Susanna will be the most powerful figure in British sport.</p>\n\n<p>&#x201C;We had a very strong field, but Susanna was the outstanding choice given her track record in managing complex businesses through transformation and digital disruption&#x201D; - Bruce Buck, chairman of Chelsea FC.</p>\n\n<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7d65d76b-69fc-435d-aadc-496fd756013e.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<p><strong>NASA Appoints Holly Ridings as first female Chief Flight Director</strong></p>\n\n<p>When NASA sends humans to space, the Chief Flight Director at Mission Control in Houston, Texas is in charge of the whole operation. For the first time in history, a woman will serve in this position.</p>\n\n<p>&#x201C;Holly has proven herself a leader among a group of highly talented flight directors. I know she will excel in this unique and critical leadership position providing direction for the safety and success of human spaceflight missions. She will lead the team during exciting times as they adapt to support future missions with commercial partners and beyond low-Earth orbit&quot;. - Brian Kelly, Director of Flight Operations.</p>\n\n<p>&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c332a3b2-12c4-415c-8824-71f46bf746cf.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<hr>\n<h4>&#xA0;</h4>\n\n<section>\n<div>\n<h3><strong>About WORK180</strong></h3>\n</div>\n</section>\n\n<section>\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n</section>\n\n\t\t\t\t","tags":["women to the top","leading","female CEO","female president","role model","succeeding","influencers","leadership"],"upload_date":"2019/01","associated_companies":["work180"]}