{"url":"https://www.work180.com.au/blog/2015/12/celebrating-female-role-models-in-stem","title":"Celebrating Female Role Models in STEM","author":"WORK180","body":"\n\t\t\t\t\t<p>Happy Ada Lovelace Day!</p><p>Regarded as the first computer programmer for her work on Charles Babbage&#x2019;s early mechanical computer the &#x2018;Analytical Engine&#x2019;, Ada Lovelace is one of the earliest role models for women in STEM (Science, Technology, Engineering and Maths).&#xA0;</p><p>She was born, December 10, 1815 and she was the&#xA0;only legitimate child of famous poet Lord Byron. Ada was taught mathematics and science, which was very unusual for women at the time.&#xA0; Her mother believed engaging in these subjects would prevent her from developing her father&#x2019;s moody temperament!</p><blockquote><p>At the age of 17, Ada met Charles Babbage and the two became friends.&#xA0; Ada was fascinated by Babbage&#x2019;s work and was asked to translate an article about the Analytical Engine.&#xA0; She not only translated it, but expanded it with her own ideas, resulting in an article three times the length of the original.&#xA0;</p></blockquote><p>She theorised a method to repeat a series of instructions, now known as looping, described how codes could be created to handle letters, symbols and numbers and theorised wider uses for computers in society.&#xA0; This work has led to Ada, posthumously, being considered the first computer programmer.&#xA0;&#xA0; Unfortunately, her article attracted little attention when she was alive and she died from uterine cancer in 1852 aged just 36 years old.</p><p>In the 1980s, the United States Department of Defence created a computer language called Ada in recognition of her work.&#xA0; The British Computer Society host the BCSWomen Lovelace Colloquium, an annual conference for women undergraduates.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/635bb766-f287-46f7-bc7f-2e518b8cdc21.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/635bb766-f287-46f7-bc7f-2e518b8cdc21.jpeg\"></p><p>Ada Lovelace Day aims to raise the profile of women in STEM and provide role models for girls by encouraging people to celebrate their achievements and the achievements of women that inspire them.&#xA0; Despite many girls succeeding in these subjects at school, few study them at university and even fewer go on to work in these fields.&#xA0; The reasons? Social pressure, misogyny and lack of flexible working opportunities to name a few.&#xA0;</p><blockquote><p>Today, we invite you to join the celebration of Ada&#x2019;s achievements by using the hashtag #BCSWomenAda and sharing your photos. BCS Women would like to collect&#xA0;photos of groups of women, who work on or use computers, from all parts of the world, wishing Ada a happy birthday.</p></blockquote><h3><strong>Here are some more women we at DCC Jobs look up to as role models in ICT.</strong></h3><p><strong></strong><br></p><h4><strong>Dame Stephanie &#x201C;Steve&#x201D; Shirley</strong></h4><p>Shirley is a British software pioneer, businesswoman and philanthropist, and one of the first female tech entrepreneurs.</p><p>After leaving school, she was offered the opportunity to study biology at university (the only &#x201C;science&#x201D; subject available to females at the time) but decided instead to look for employment in mathematics and technology.&#xA0; She worked for a company building computers and writing code, earning a degree in mathematics after taking six years of evening classes.</p><p>In 1962, she founded a software company called Freelance Programmers and employed primarily women, responsible for projects such as the programming of Concorde&#x2019;s black box flight recorder.&#xA0; The company was eventually valued at $3 billion, making millionaires of 70 of her team members. Shirley adopted the name Steve to gain acceptance in the male dominated world, and in this <a data-cke-saved-href=\"https://www.youtube.com/watch?v=Ftow7dSpaiY\" href=\"https://www.youtube.com/watch?v=Ftow7dSpaiY\">TED Talk</a>, she reveals how, following the name change, her calls for meetings started being accepted.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/68ee88d6-75de-4c52-87a6-80ad8aa149a3.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/68ee88d6-75de-4c52-87a6-80ad8aa149a3.jpeg\"></p><p>She retired aged 60 and has since donated most of her wealth to charity and set up the Shirley Foundation aiding research for autism spectrum disorders.&#xA0; She has been honoured by many universities, received the Beacon Fellowship Prize, appointed as a Fellow of the Royal Academy of Engineering, received the Mountbatten Medal and named as one of the 100 Most Powerful Women and one of the Top 100 Practising Scientists in the UK.</p><h4><strong>Dr Jenine Beekhuyzen</strong></h4><p>Dr Beekhuyzen founded the <a data-cke-saved-href=\"http://www.diversecitycareers.com/page/partner-network/industry-alliances/tech-girls-are-superheroes/\" href=\"http://www.diversecitycareers.com/page/partner-network/industry-alliances/tech-girls-are-superheroes/\" target=\"_blank\">Tech Girls Movement</a> (TGM) in 2014, which empowers school girls to consider the opportunities afforded by studies and a career in Information Technology and related disciplines.</p><p>Through using superhero characters based on real life female role models, she has created short fiction stories that tell their story of how they change the world with technology. The book, called <em>Tech Girls Are Superheroes</em> provides a sisterhood for girls to join, to empower them to create their own future in the tech industry. Free books for school girls are available <a data-cke-saved-href=\"http://www.techgirlsmovement.org/order-your-book/\" href=\"http://www.techgirlsmovement.org/order-your-book/\">here</a>.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/37f84440-d6ee-43ce-b5df-ee088b288a54.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/37f84440-d6ee-43ce-b5df-ee088b288a54.png\"></p><p>Other TGM Activities include promoting the characters in the media especially on social media, an app, mobile games, an online weekly radio show and school visits across Australia. Most recently, TGM organised an incredible showcase event and national competition in search of the next &#x2018;Tech Girl Superhero.&#x2019;</p><p>Dr Beekhuyzen was recently named by the Sydney Morning Herald as a female rising star in ICT and is the winner of the 2014 Australian Information Industries Association (AIIA) iAward for Queensland ICT Woman of the Year. Jenine&#xA0;is also an Adjunct Professor with the Institute of Integrated and Intelligent Systems at Griffith University and lectures in the Information Technology programmes. Publishing over 50 articles in refereed journals, conferences and books, she has a PhD. in Information Systems, an IT degree, a Grad Cert in Research Management, and a Diploma of Business.&#xA0;</p><h4><strong>Ann Moffatt</strong></h4><p>26 years ago, Ann Moffatt founded <a data-cke-saved-href=\"http://www.diversecitycareers.com/fitt\" href=\"http://www.diversecitycareers.com/fitt\">Females in IT and Telecommunications</a> (FITT) a not-for profit network that aims to inspire women in ICT through networking and supporting programmes.</p><p>FITT is now Australia&#x2019;s largest national network for women in ICT with over 4,000 members working in both technical and operations roles. FITT is run by a volunteer committee and hosts many events, webinars, networking sessions and mentor programs.&#xA0;</p><p>Ann has professional experience in many areas including positions as a programmer &#x2014; having worked with Dame Shirley herself, &#x2014; an analyst, a company manager and has sat on several company boards.&#xA0; She was the first woman to be inducted into the Australian ICT Hall of Fame and was induced into the Pearcey Hall of Fame, the highest professional award for ICT industries, in 2011.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b32dadd8-05f0-46c4-8f6b-7603eb88794e.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b32dadd8-05f0-46c4-8f6b-7603eb88794e.jpeg\"></p><p style=\"text-align:center\"><em>Ann Teleworking in 1966</em></p><p>Today, Ann is still giving back to the community, with her latest venture, the Silicon Coast Extracurricular Code School providing rural and regional high school children with the chance to <a data-cke-saved-href=\"http://www.frasercoastchronicle.com.au/news/crack-the-computer-code/2549067/\" href=\"http://www.frasercoastchronicle.com.au/news/crack-the-computer-code/2549067/\" target=\"_blank\">learn computer coding</a> at an industry standard.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/333ea4a0-240a-4497-a72b-0d0116e09341.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/333ea4a0-240a-4497-a72b-0d0116e09341.jpeg\">&#x200B;</p><p>These women are a truly inspirational, paving the way for future generations and making a huge difference while juggling a number of other responsibilities.</p><blockquote><p><big><a data-cke-saved-href=\"https://www.dccjobs.com/jobs/science/\" href=\"https://www.dccjobs.com/jobs/science/\" target=\"_blank\">Explore jobs in science on DCC Jobs.</a></big></p><p><big><a data-cke-saved-href=\"https://www.dccjobs.com/jobs/it-and-t/\" target=\"_blank\" href=\"https://www.dccjobs.com/jobs/it-and-t/\" class=\"\">Explore</a><a data-cke-saved-href=\"https://www.dccjobs.com/jobs/it-and-t/\" target=\"_blank\" href=\"https://www.dccjobs.com/jobs/it-and-t/\"> jobs in IT&#xA0; &amp; Tech on DCC Jobs.</a></big></p><p><big><span style=\"font-size: 16px;\">Set up your job alert with one</span><a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">&#xA0;click</a><span style=\"font-size: 16px;\">&#xA0;now.&#xA0;</span></big><br></p></blockquote><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs&#xA0;</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.<span style=\"font-size: 16px;\">&#xA0;Set up your job alert with&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">1 click</a><span style=\"font-size: 16px;\">&#xA0;now.&#xA0;</span></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2015/12","associated_company":"work180"}