{"url":"https://www.work180.com.au/blog/2019/01/connectstem-the-arup-community-group-empowering-women","title":"ConnectSTEM: the Arup Community Group Empowering Women","author":"WORK180","body":"\n\t\t\t\t\t<p>It&#x2019;s a hot topic. Those with skills related to science, technology, engineering and mathematics are in high demand and short supply in a world moving through the Fourth Industrial Revolution. Added to this, the participation rates of women in these fields are startlingly low. To be successful and relevant, we know we need a diverse workforce, and with only 12.4% of all of Australia&#x2019;s engineers being female, the engineering industry desperately needs to tap into the &#x201C;other half&#x201D; of our population to access the full pool of talent that we know we have.</p>\n\n<p>For me, as a female engineer joining in this conversation regularly, the question arises: are we moving past the talk and into action?</p>\n\n<p>And so, to address this question, at Arup we formed ConnectSTEM.</p>\n\n<p>ConnectSTEM was born out of a collective desire to make change. We realised that there is so much more work to be done to attract and retain women into the industry, but we need strategy and action to have true impact. We also realised that to have impact, we need to examine the entire pipeline of a career, from infancy to education to leadership. &#xA0;</p>\n\n<p>We aim to empower and motivate women, and to encourage them to not only join the engineering industry, but to stay in it. We don&#x2019;t want to just tell people what an exciting career choice engineering is, we want to show it; we want people to feel it. We want to spark imagination.</p>\n\n<p>To do this? We&#x2019;ll start at the heart where community, culture and story-telling will connect to the human centre of engineering. We will examine the conditions needed in our industry to inspire women to join us.</p>\n\n<p>We will bring people to the forefront. We will showcase women at the height of their career to celebrate their success and inspire others. We will cultivate community through mentoring and networking programs at work and university programs and connect through to school-age children who are just beginning to imagine their futures.</p>\n\n<p>We want to shift the needle in the engineering profession and show that a career in STEM is a career for everyone.</p>\n\n<p>No matter your background, you can help us achieve this vision. But first, pause for a moment and look around you. Think about how an engineer had a hand in designing the room you&#x2019;re in; the smart phone you&#x2019;re reading this on; the roads you take to get to work.</p>\n\n<p>And now, let yourself wonder. Let yourself imagine the future. Tell your daughter, sister or friend&#xA0;about how amazing it would be to play a part in creating the world around us. A career in STEM is a career in creativity and design, with people at the centre. You could inspire the next generation of engineers by asking a simple question: what do you want to design?</p>\n\n<hr>\n<h4><strong>About Arup&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8ef148cd-2e8e-4931-9c33-3d2df7127624.png\" style=\"border:0px;vertical-align:middle;float:right;width:300px;height:119px;\"></strong><br>\n&#xA0;</h4>\n\n<p>Offering 16 weeks paid parental leave at full salary after only 3 months employment, Arup also pays superannuation whilst staff are on unpaid parental leave up to the first year - working to close the gender&#xA0;hashtag#supergap.<br>\n<a href=\"https://www.work180.com.au/clients/arup\">Learn more about why Arup became an&#xA0;endorsed employer for women here.</a></p>\n\n<hr>\n<h4><strong>About WORK180<br>\n&#x200B;</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p>\n\n\t\t\t\t","tags":["Empowering Women","Arup","ConnectSTEM","Future"],"upload_date":"2019/01","associated_company":"work180"}