{"url":"https://www.work180.com.au/blog/2018/08/creating-a-blameless-culture","title":"Creating a blameless culture","author":"WORK180","body":"\n\t\t\t\t\t<section name=\"57eb\" style=\"clear:both;\"><div><div style=\"margin-left:auto;\"><p name=\"7a1d\" id=\"7a1d\">Blameless culture has been on my mind recently. Aspects of it can be seen in the&#xA0;<a data-cke-saved-href=\"https://en.wikipedia.org/wiki/Toyota_Production_System\" href=\"https://en.wikipedia.org/wiki/Toyota_Production_System\" data-href=\"https://en.wikipedia.org/wiki/Toyota_Production_System\" rel=\"nofollow noopener\" target=\"_blank\">Toyota Production System</a>, however, only more recently did &#x201C;blameless&#x201D; start to be used to describe it. Across the software engineering profession, it seems to have become the gold standard and practiced by all the top tech companies.</p><p name=\"c307\" id=\"c307\">Personally, I&#x2019;ve always felt uncomfortable when blame was thrown around. I tended to get defensive quickly or remove myself from the situation, whether I was being blamed or not! I can&#x2019;t remember a time in my life (work or personal) when blaming lead to a positive outcome. So in 2012 when I read&#xA0;<a data-cke-saved-href=\"https://codeascraft.com/2012/05/22/blameless-postmortems/\" href=\"https://codeascraft.com/2012/05/22/blameless-postmortems/\" data-href=\"https://codeascraft.com/2012/05/22/blameless-postmortems/\" rel=\"nofollow noopener\" target=\"_blank\">John Allspaw&#x2019;s (Etsy)</a>&#xA0;article on a blameless post mortem it was a lightbulb moment for me. He articulated a way of doing things that I already felt was right, a fundamental belief had now been articulated for me. I was sold.</p><p name=\"1d66\" id=\"1d66\">Let&#x2019;s remind ourselves of the basic principles &#x2014; I love this stuff.</p><p name=\"d3fe\" id=\"d3fe\">Blameless culture fundamentals</p><ul><li name=\"bf41\" id=\"bf41\">Assume people are doing the best they can with the information they have.</li><li name=\"e927\" id=\"e927\">Create an environment where people can explain why the action made sense to them at the time, without feeling insecure or judged.</li><li name=\"4381\" id=\"4381\">See human error as an effect of deeper systematic vulnerabilities within the organisation. Focus on the system, rather than the person.</li><li name=\"0caa\" id=\"0caa\">Dig deeper into what caused the problem. Use the&#xA0;<a data-cke-saved-href=\"https://en.wikipedia.org/wiki/5_Whys\" href=\"https://en.wikipedia.org/wiki/5_Whys\" data-href=\"https://en.wikipedia.org/wiki/5_Whys\" rel=\"nofollow noopener\" target=\"_blank\">5 Whys</a>&#xA0;technique.</li><li name=\"75c5\" id=\"75c5\">Celebrate that organisations can only improve by constantly seeking out their systematic vulnerabilities. The very best way to find out&#xA0;&#x2026; through the person who made the mistake.</li></ul><p name=\"6c2d\" id=\"6c2d\"><a data-cke-saved-href=\"http://indecorous.com/fallible_humans/\" href=\"http://indecorous.com/fallible_humans/\" data-href=\"http://indecorous.com/fallible_humans/\" rel=\"nofollow noopener\" target=\"_blank\">Alan Malpass</a>&#xA0;wrote a great post years ago on the fallibility of humans. He took us back to ancient times with this anecdote:</p><blockquote name=\"7c05\" id=\"7c05\">The ancient Greeks&#xA0;&#x2026; would respond to calamities such as plague, famine, or invasion by selecting a person, usually a cripple, or a beggar, or a criminal. This person&#x200A;&#x2014;&#x200A;the pharmakos&#x200A;&#x2014;&#x200A;would be beaten, stoned, and driven from the city&#xA0;&#x2026; This isn&#x2019;t healthy. It&#x2019;s also not effective. We don&#x2019;t learn from our mistakes this way. The Greeks kept succumbing to plagues because it turns out that beating up a beggar is less effective at preventing disease than coming up with a functional sanitation system.</blockquote><p name=\"7bf5\" id=\"7bf5\">Rather than working in a climate of fear (I&#x2019;m going to get fired, judged, excluded), a blameless culture creates a workplace where there is a genuine focus on understanding where the&#xA0;<em>system</em>&#xA0;failed. With the intention of trying to stop it failing again &#x2014; basically problem solving. I find engineers naturally do this really well when given the chance.</p><p name=\"b02d\" id=\"b02d\">And here&#x2019;s the great benefit that flows from a blameless culture: we get great insight into where our systems are failing! In a climate of fear, people rarely explain the real reason something went wrong. In a blameless culture, people feel more comfortable to speak out, to help solve the problem so it doesn&#x2019;t happen to someone else.</p><p name=\"81c3\" id=\"81c3\">Of course, I still come across non-believers in the blameless way of thinking. They say: &#x201C;that&#x2019;s not really how business gets done&#x201D;, &#x201C;people need to know they have made a mistake&#x201D;, &#x201C;nobody will be accountable for their actions&#x201D;. Believe me, when someone makes a mistake which causes an&#xA0;<em>incident</em>, they know! Sometimes there are edge cases where people aren&#x2019;t aware of their mistakes and in those situations it&#x2019;s management&#x2019;s responsibility to deal with that separately. That being said, it is rare in workplaces I&#x2019;ve worked in.</p></div></div></section><section name=\"36f7\" style=\"clear:both;\"><div><hr></div><div><div style=\"margin-left:auto;\"><p name=\"50c6\" id=\"50c6\">For people who are in an environment where blame is often used, I&#x2019;ve included a list of alternatives you can use when a colleague reverts to seeking blame:</p><p name=\"6eae\" id=\"6eae\">Blaming: Who caused this problem?<br>Blameless:&#xA0;<em>Why did this problem occur?</em></p></div></div></section><section name=\"1b28\" style=\"clear:both;\"><div><hr></div><div><div style=\"margin-left:auto;\"><p name=\"a6a9\" id=\"a6a9\">Blaming: Who&#x2019;s fault is this?<br>Blameless:&#xA0;<em>Where did the system fail to allow this to happen?</em></p></div></div></section><section name=\"5a6c\" style=\"clear:both;\"><div><hr></div><div><div style=\"margin-left:auto;\"><p name=\"b961\" id=\"b961\">Blaming: Amy deployed a change to production.<br>Blameless:&#xA0;<em>A commit was deployed to production.</em></p></div></div></section><section name=\"8fa7\" style=\"clear:both;\"><div><hr></div><div><div style=\"margin-left:auto;\"><p name=\"3d39\" id=\"3d39\">Blaming: Person &#x201C;X&#x201D; caused the incident (note: this is not blameless, it&#x2019;s just nameless).<br>Blameless:&#xA0;<em>Let&#x2019;s really try and understand what happened to prevent it from happening again?</em></p></div></div></section><section name=\"adcc\" style=\"clear:both;\"><div><hr></div><div><div style=\"margin-left:auto;\"><p name=\"acd0\" id=\"acd0\">The seeds for <a data-cke-saved-href=\"https://www.work180.com.au/clients/zendesk\" href=\"https://www.work180.com.au/clients/zendesk\">Zendesk</a>&#x2019;s blameless mindset were sown early, most likely before I joined. But in the early days I did notice that people consciously tried to:</p><ul><li name=\"f5b9\" id=\"f5b9\">Recognise hindsight bias. It&#x2019;s very easy to look back and see how something happened. It&#x2019;s not always that clear at the time.</li><li name=\"ce4d\" id=\"ce4d\">Use phrases like &#x201C;lead to human error&#x201D;, to put emphasis on the system failure.</li><li name=\"1f0d\" id=\"1f0d\">Call out people if they blamed, normally in a private note sent swiftly after the comment.</li></ul><p name=\"ef25\" id=\"ef25\">It&#x2019;s been nice to see this mindset spread organically to the rest of the organisation. We weren&#x2019;t that purposeful about it, we didn&#x2019;t display it in light boxes around the office, chant it or bake it into fortune cookies. It wasn&#x2019;t rocket science, maybe we got lucky, but that&#x2019;s how it worked for us. We do it well. We aren&#x2019;t perfect. But, I&#x2019;m confident when we regress, the organization will self-correct. It&#x2019;s one of the things I love about working here, and I want to keep having the conversation about it. It&#x2019;s fundamental to our success.</p><hr><p>About Zendesk&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/95eb387d-e936-4891-91f6-275feb1babf1.png\" style=\"float: right; margin: 10px; width: 150px; height: 109px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/95eb387d-e936-4891-91f6-275feb1babf1.png\"></p><p>Zendesk is a key supporter of flexible working and they have&#xA0;only 6 months minimum tenure to be eligible for their impressive 16 weeks paid parental leave for BOTH carers. Learn more on their <a data-cke-saved-href=\"https://www.work180.com.au/clients/zendesk\" href=\"https://www.work180.com.au/clients/zendesk\">Best Employer page.&#xA0;</a><br></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=zendesk\" href=\"https://www.work180.com.au/job-search?client=zendesk\">Browse jobs with Zendesk here.</a><br><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div></div></section>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/08","associated_companies":["work180"]}