{"url":"https://www.work180.com.au/blog/2016/11/creating-a-successful-career-in-engineering","title":"Creating a Successful Career in Engineering","author":"WORK180","body":"\n\t\t\t\t\t<p>Jessi Bolton is a Principal Civil Engineer, part of <a href=\"/clients/aecom\">AECOM</a>&#x2019;s Civil Infrastructure end-market and has worked with the company for over 8 years. We spoke to Jessi about her experience in working in a non-traditional industry and managing family commitments whilst working on large-scale, demanding yet exciting projects- a challenge that&#x2019;s not easy to juggle!</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/91b404b5-2356-43b2-9a67-5e469c2a638d.jpeg\"></p>\n\n<p>Here are Jessi&#x2019;s top lessons learnt:</p>\n\n<h4><strong>Make Speculative Applications</strong></h4>\n\n<p>Jessi has never actually applied for a specific job advert.&#xA0; Instead, she targeted companies she wanted to work for and sent them her resumes.&#xA0; &#x201C;When I was first starting out as a Civil Engineer in the US, I drove around with a map and a list of engineering companies and simply stopped at their offices and asked if they had a job&#x201D; recalled Jessi. This persistence and drive continued to shape her career as she moved countries and pursued challenging projects.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Search for Win/Win in Negotiations</strong></h4>\n\n<p>Jessi joined AECOM in Australia in 2008, and due to family circumstances, decided to move back to the States after two years. &#x201C;At first, I assumed that was it,&#x201D; recalled Jessi. &#x201C;However, my manager suggested that instead of quitting, which would cancel my visa, I should take unpaid time off and keep my visa valid.&#xA0; After four months in the US, I decided to come back to Australia.&#x201D; Jessi&#x2019;s relocation from the US was simple and she felt supported through the entire process, and recommends women discuss options with their manager in similar situations- you may be surprised with the outcome!</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/230b8877-489c-4007-bd19-6f522122a129.jpeg\"></p>\n\n<h4><strong>Figure out the Working Style That Suits You</strong></h4>\n\n<p>After the birth of Jessi&#x2019;s first child, she moved into AECOM&#x2019;s Defence team, working four days a week, with shorter days in the office and opportunity to work from home. &#x201C;I originally spent three days in the office and one day at home&#x201D; said Jessi. &#x201C;However, I found it difficult to settle in with the team when we only had face to face contact for three days.&#x201D;&#xA0; Jessi decided to add the extra day in the office to give her more time to get to know her colleagues.&#xA0; &#x201C;Now that I know my team well, I feel like it would be easy to scale back my working hours if I wanted or needed to.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Managing a Large Workload</strong></h4>\n\n<p>Responsible for complex, multi-million dollar projects, Jessi&#x2019;s advice for managing a huge workload is to be flexible. &#x201C;I go through waves of intense pressure from a project, through to periods of downtime between projects. I think it&#x2019;s important to leverage this tempo, and allow yourself to recover- this will drive better satisfaction and therefore productivity overall.&#x201D; While we recognise that it&#x2019;s hard to slow down after an intense pace, we feel this advice applies to absolutely anyone!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>The Importance of Team Culture</strong></h4>\n\n<p>Jessi reflected on the change within her after coming back from maternity leave. Even though she was aware of AECOM&#x2019;s focus on providing a flexible workplace, early on in her career, she felt conscious and always justified leaving early.&#xA0; &#x201C;Now I don&#x2019;t feel like that.&#xA0; My colleagues know I will get the work done no matter what time I leave&#x201D; explained Jessi. &#x201C;If I say no to a certain task, no-one gives me a hard time, there&#x2019;s trust that I&#x2019;ll do the work. Culturally I&#x2019;m not burdened with that guilty feeling anymore.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Forward Planning</strong></h4>\n\n<p>Jessi was impressed when her manager&#x2019;s manager asked if she saw herself staying in her current team long term.&#xA0; &#x201C;It really showed me that people cared and looked out for me as well as keeping me in mind for other projects&#x201D; Jessi told us. Discussing her future plans with her manager&#x2019;s manager allowed Jessi to explore her motivations and where she saw herself going next.&#xA0; &#x201C;We discussed projects that I feel really passionate about and could see the impact I would have&#x201D; continued Jessi. &#x201C;The variety in the type of work you can do at AECOM impresses me.&#xA0; From that conversation, nothing seems closed off.&#x201D;</p>\n\n<p>Read more about AECOM and view their jobs <a href=\"/clients/aecom\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/11","associated_company":"work180"}