{"url":"https://www.work180.com.au/blog/2018/08/cricket-australias-endorsement-has-been-suspended","title":"Cricket Australia’s endorsement has been suspended","author":"WORK180","body":"\n\t\t\t\t\t<p>In July 2018, Cricket Australia became an an Endorsed Employer for Women by meeting minimum standards for the WORK180 criteria. This included amount of paid parental leave for both primary and secondary carers, support for flexible working and initiatives for women in leadership.&#xA0;</p><p>We take our endorsements seriously. Therefore, in light of the <a data-cke-saved-href=\"https://www.examiner.com.au/story/5560780/cricket-australia-under-attack-over-sacking/\" href=\"https://www.examiner.com.au/story/5560780/cricket-australia-under-attack-over-sacking/\" target=\"_blank\">Angela Williamson case</a>, we have suspended Cricket Australia&apos;s status as an Endorsed Employer for Women. While the case is under investigation by Fair Work Australia, we encourage Cricket Australia to reconsider Angela&apos;s dismissal.</p><p>Having seen how tirelessly the team has worked to achieve endorsement status, we believe Cricket Australia is capable of not only rectifying the situation, but also becoming a stronger and more progressive organisation because of it.</p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["WORK180 News"],"upload_date":"2018/08","associated_company":"work180"}