{"url":"https://www.work180.com.au/blog/2016/05/culturally-diverse-women-in-stemm-smashing-two-ceilings","title":"Culturally Diverse Women in STEMM: Smashing Two Ceilings","author":"WORK180","body":"\n\t\t\t\t\t<p><em>This article was originally published on&#xA0;<a data-cke-saved-href=\"https://womeninscienceaust.org/\" href=\"https://womeninscienceaust.org/\" target=\"_blank\">Women in Science AUSTRALIA</a></em></p><p>By Dr Shokoufeh Malekjani</p><p><br></p><p>Going up the career ladder in science, technology, engineering, mathematics and medicine (STEMM) is indeed hard. Even harder if you are a woman and hardest when you are a woman of diverse background. A significant proportion of graduates in western countries are culturally diverse women, many of them amongst our top performers; but this is not reflected at the highest levels in STEMM.</p><p>The career pitfalls of culturally diverse women are barely talked about and as a woman of diverse background in STEMM, I see a need to drive this important conversation. Similar to the gender-equity conversation in STEMM, the intersection with cultural diversity needs to be recognized since women of diverse background not only have to shatter the &#x201C;glass ceiling&#x201D;, but they must also break-through the &#x201C;bamboo ceiling&#x201D;. The &#x201C;bamboo ceiling&#x201D; refers to the limitations of the current system in promoting culturally diverse groups, as well as the cultural misconceptions that can block these individuals&#x2019; path up the ladder.</p><p>There is a body of studies demonstrating how culturally diverse people experience unconscious bias and stereotyping, particularly in regard to their cultural identity, leadership capabilities, English proficiency and age, as well as misinterpretation of their cultural values, such as respect for authorities, being quiet and reserved, avoiding self-promotion, etc. [1-4]. Without doubt, these studies confirm the lack of an appropriate system to accommodate culturally diverse people, strengthening the &#x201C;bamboo ceiling&#x201D; but discussing the strategies employers need to develop to fit more culturally diverse women/people is not the scope of this post. Indeed, the focus of this post is to empower disadvantaged women to take charge of their own career.</p><p>As culturally diverse women in STEMM, we need to understand the contributing factors so that we can encourage change, challenge the unconscious bias and strengthen our ability to lead and empower other women. It is up to us to raise our voices and question the lack of representation at the senior levels in STEMM. We must be willing to ask ourselves &#x2013; are we ready to lead? What is stopping us? How can we overcome it? What can we do?</p><p>Yes, sure there are a lot of misconceptions about culturally diverse people leading to unfair stereotyping and bias, but placing the blame entirely on the employer can promote victim mentality and consequential passivity. On the other hand, we must not to place all of the blame on our cultural values either. Indeed, it is more about raising awareness and mutual understanding in anticipation of possible challenges. It&#x2019;s about setting goals and pursuing dreams.</p><p><br></p><p><strong>So what can we do?</strong></p><p>In an effort to overcome the double ceiling as a culturally diverse woman in STEMM, I have found the following tips very useful:</p><p><br></p><p><strong>Self-awareness: </strong>Understanding my weaknesses and strengths is vital in improving my response to different situations, as well as my ability to tune-in to others. Developing a comprehensive understanding of my personal traits and cultural values, and how these interact with the prevailing culture is essential for me to make positive changes. This is not about changing who I am as an individual with a distinct background, but more about being more effective in the workplace.</p><p><br></p><p><strong>Speaking up: </strong>Developing my own voice doesn&#x2019;t mean I aim to be aggressive, but I am able to express my own opinions and ideas. I consider it important to actively communicate and contribute in meetings. If you are like me, you may hate speaking up in public, but I have found self-awareness can help tremendously in developing strategies to overcome the fear of public speaking. I am never ashamed of my accent or the time I need to take to speak. Instead I am proud (I might be the only one in the audience who can speak another language) and it helps to teach others to be more patient and understanding. I believe I should also be able to question someone&#x2019;s decision. Authorities&#x2019; expectations in terms of respect can be very different in different countries. In Australia, questioning a decision does not necessarily mean disrespect.</p><p>If I face an issue, I have learnt not to be shy to raise the issue. In many cultures, girls are specifically encouraged to stay quiet and leave when they face an issue to avoid trouble. But addressing an issue is the only way to improve or eliminate it.</p><p><br></p><p><strong>Networking: </strong>Developing a professional network is crucial. It is totally natural to feel more comfortable around the people of the same culture and language, and not comfortable otherwise. But to be part of a wider community, it is important to include a broad range of people in your network.</p><p><br></p><p><strong>You are good enough</strong>: Having so much to overcome as a double-bind minority, there are times we can feel we are being judged, measured and/or at risk. As a consequence, we frequently reach the point where we feel inadequate and can have self-doubt. Such experience of feeling inadequate or not being good enough is very common and is referred to as &#x201C;imposter syndrome&#x201D;, however, unfortunately those who belong to underrepresented groups are influenced by &#x201C;imposter syndrome&#x201D; more frequently [5,6].</p><p>To overcome imposter syndrome, I surround myself with supportive people and those who can offer constructive advice. Many people feel this way, so sharing your perspective can help. It might put a smile on your face to know that research has shown that the better we get, the worse &#x201C;imposter syndrome&#x201D; gets [5,7]. Resist comparing yourself to others and stay focused on your goals. If there are things you are dreaming about, put yourself forward and do it anyway. We never know what is waiting for us until we try.</p><p><br></p><p><strong>Increased visibility: </strong>Raising your profile matters. It potentially expands your network and can demonstrate your career progression. Research shows that lack of visible role models leads people in underrepresented groups feeling less welcome and more anxious in their professions [8], while an abundance of visible role models is a key career motivator.</p><p><br></p><p><img alt=\"\" data-cke-saved-src=\"http://oliver-uploads-aus.s3.amazonaws.com/2017/07/13/18/25/24/830/fotolia_57986624_l.jpg\" src=\"http://oliver-uploads-aus.s3.amazonaws.com/2017/07/13/18/25/24/830/fotolia_57986624_l.jpg\" style=\"width:100%\"></p><p><br></p><p><strong>Leading change</strong></p><p>In conclusion, as employers and organizations are waking up to the importance of an inclusive environment and culture in the workplace, it is up to us to help drive positive change. We should embrace that we still have things to learn and enjoy it for what it is, increase our visibility and provide support for each other. Employers should also take appropriate steps toward building cross-cultural awareness. In a globalizing world, employers will face serious growth limitation by neglecting such potentials if they don&#x2019;t take the required actions toward inclusion and diversity. I encourage all culturally diverse women in STEMM to take charge and lead the change we want to see.</p><p><a data-cke-saved-href=\"/jobs/science/\" href=\"https://www.dccjobs.com/jobs/science/\">Explore jobs in science on DCC Jobs.</a><br></p><p><br></p><p><br></p><p><strong>References</strong></p><p>A Festekjian, S Tram, C B Murray, T Sy, H P Huynh, &#x201C;I See Me the Way You See Me: The Influence of Race on Interpersonal and Intrapersonal Leadership Perceptions&#x201D;, Journal of Leadership &amp; Organizational Studies 2014; 21(1), 102-119.</p><p>P Li, &#x201C;Recent Developments Hitting the Ceiling: An Examination of Barriers to Success for Asian American Women&#x201D; Berkeley Journal of Gender, Law &amp; Justice 2014, Vol. 29, 141-167.</p><p>C k Lai et al., &#x201C;Reducing Implicit Racial Preferences: I. A Comparative Investigation of 17Interventions&#x201D;, Social Science Research Network: <a data-cke-saved-href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2155175\" href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2155175\" target=\"_blank\">http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2155175</a></p><p>S Stroessner and C Good. Stereotype threat: an overview. <a data-cke-saved-href=\"http://diversity.arizona.edu/sites/diversity/files/stereotype_threat_overview.pdf\" href=\"http://diversity.arizona.edu/sites/diversity/files/stereotype_threat_overview.pdf\" target=\"_blank\">http://diversity.arizona.edu/sites/diversity/files/stereotype_threat_overview.pdf</a></p><p>R P Clance, S A Imes, &#x201C;The imposter phenomenon in high achieving women: Dynamics and therapeutic intervention&#x201D;, Psychotherapy: Theory, Research &amp; Practice 1978, 15, 241-247.</p><p>K Cokley, S McClain, A Enciso , M Martinez, &#x201C;An Examination of the Impact of Minority Status Stress and Impostor Feelings on the Mental Health of Diverse Ethnic Minority College Students&#x201D;, Journal of Multicultural Counseling and Development 2013, 41, 82-95.</p><p>&#xA0;S Kumar, C M Jagacinski, &#x201C;Imposters have goals too: The imposter phenomenon and its relationship to achievement goal theory&#x201D;, Personality and Individual Differences 2006, 40, 147-157.</p><p>Career Advancement In Corporate Canada: A Focus On Visible Minorities~Survey Findings, Catalyst: <a data-cke-saved-href=\"http://www.catalyst.org/knowledge/career-advancement-corporate-canada-focus-visible-minoritiessurvey-findings\" href=\"http://www.catalyst.org/knowledge/career-advancement-corporate-canada-focus-visible-minoritiessurvey-findings\" target=\"_blank\">http://www.catalyst.org/knowledge/career-advancement-corporate-canada-focus-visible-minoritiessurvey-findings</a></p><p><br></p><p><em><a data-cke-saved-href=\"https://womeninscienceaust.org/2016/04/21/culturally-diverse-women-in-stemm-smashing-two-ceilings/\" href=\"https://womeninscienceaust.org/2016/04/21/culturally-diverse-women-in-stemm-smashing-two-ceilings/\" target=\"_blank\">Read the original article</a></em></p><p><br></p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2016/05","associated_company":"work180"}