{"url":"https://www.work180.com.au/blog/2017/08/dcc-jobs-named-winners-in-the-2017-tech-diversity-awards","title":"DCC Jobs honoured to be recognised twice in the 2017 Tech Diversity Awards","author":"WORK180","body":"\n\t\t\t\t\t<h3>DCC Jobs named winners in the 2017 Tech Diversity Awards for Media &amp; Advertising and the Victorian Innovation Minister&#x2019;s Diversity Award</h3><p>Last night, over 400 people from the digital technology industry in Victoria came together for the #TechDiversity Awards Gala Dinner. The Awards Gala celebrated and recognised the people behind important diversity initiatives within the tech ecosystem.</p><p>It was with great excitement the team at DCC were announced as winners in the Media &amp; Advertising category for the second year in a row! DCC is Australia&#x2019;s only job site which pre-screens employers based on their policies and initiatives around supporting women in the workplace. DCC turn down around 10% of employers who apply to advertise jobs, because they don&#x2019;t meet their criteria. Around 80% of those employers return to advertise after improving internal policies around paid parental leave, flexible working and equal pay to name a few.</p><p>By showcasing companies who strive to close the gender gap, DCC is influencing companies to change their policies, and helping women find great jobs at the same time.</p><p>We were also very honoured to be awarded the Victorian Innovation Minister&#x2019;s Diversity Award by Hon. Philip Dalidakis MP Minister for Small Business, innovation and trade.</p><blockquote><p><em>&quot;DCC is fully deserving of this award and I&apos;m delighted to be acknowledging such a wonderful company. We&apos;re lucky to have them in Victoria and grateful for the work they are doing in championing diversity&quot;&#xA0;</em></p></blockquote><h5>- Hon. Philip Dalidakis MP Minister for Small Business, innovation and trade. Also pictured below with DCC cofunders Gemma Lloyd and Valeria Ignatieva.</h5><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/359e108b-c0af-4630-b81f-407d5506e078.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/359e108b-c0af-4630-b81f-407d5506e078.jpeg\" style=\"margin-bottom: 10px; margin-top: 10px;\"></p><p>A special thank you to Dr Jenine Beekhuyzen, founder of Tech Girls Movement. Together with TGM, our Superhero Daughter Day initiative was a finalist in the Education category.</p><p>Determined to challenge gender bias and stereotypes in technology through a bold initiative aimed at primary school girls, Superhero Daughter Day promotes technology as a career path of choice for young women in a fun and interactive environment. A national series of events across Australia and New Zealand in March celebrating International Women&#x2019;s Day, this initiative has reached 2000 girls from 5-12 years old and parents since 2016.</p><h5 style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/aae9e857-cd1e-439e-a0bb-962d52201310.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/aae9e857-cd1e-439e-a0bb-962d52201310.png\" style=\"margin-bottom: 10px; margin-top: 10px;\"><br><em>Dr Beekhuyzen and one of the Superheroes in Brisbane</em></h5><p>Congratulations to all 2017 #TechDiversity winners and finalists, including another DCC partner Femeconomy and DCC Endorsed Employer for Women Avanade!</p><p style=\"text-align: center;\">&#x200B;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/06efe9d1-c913-4f3a-999a-1a1257c0089b.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/06efe9d1-c913-4f3a-999a-1a1257c0089b.jpeg\"></p><h5><em>Avanade team</em></h5><p>We would also like to thank the never-ending support we have received from the industry, our community and our endorsed employers for women. We are passionate about continuing to drive positive change and creating a more equitable future in the tech industry in addition to other, non-traditional industries for women. This is only the beginning!</p><p>About #TechDiversity</p><p>Launched in August 2015, #TechDiversity is an industry alliance committed to amplifying diversity awareness and achieving a culture of inclusion in the digital technology sector, through conversation, collaboration and action. With a focus on strengthening frameworks to increase the participation of women and minority groups in the digital technology industry, the #TechDiversity vision is for inclusion to be built into all facets of the digital industry sector &#x2013; specifically education, business, government and advertising. The aim of the #TechDiversity Awards and recognition program is to showcase the successful initiatives being implemented, enabling other organisations to learn and emulate these successes.</p><h3>ABOUT DCC JOBS</h3><p><a data-cke-saved-href=\"https://www.dccjobs.com/\" href=\"https://www.dccjobs.com/\">DCC</a>&#xA0;is a jobs board with a&#xA0;difference! We ask the hard questions on your behalf to help women find employment in companies that actually want you&#xA0;for&#xA0;who you are. DCC pre-screen employers on paid parental leave, pay equity, flexible working and much more. If they don&#x2019;t meet our criteria, they simply cannot advertise. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p><p><br></p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/08","associated_companies":["work180"]}