{"url":"https://www.work180.com.au/blog/2016/11/diverse-city-careers-and-jobs-shared-partner-to-increase-gender-diversity-within-australian-workplaces","title":"DCC Jobs and Jobs Shared Partner to Increase Gender Diversity within Australian Workplaces","author":"WORK180","body":"\n\t\t\t\t\t<p>Two Australian startups, both led by female CEOs, have joined forces to create one of the most extensive resources for female job seekers and employers in Australia.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p style=\"text-align:center\"><a href=\"/jobs-shared\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1def4416-a0f4-47c1-b36c-7497e229a7d5.png\"></a></p>\n\n<p>The new partnership will provide over 30,000 subscribers access to one of Australia&#x2019;s leading job share resources along with access to Australia&#x2019;s only jobs site that selects employers based on their commitment to supporting women. Together, DCC Jobs and Jobs Shared offer the most comprehensive platform for gender equality and workplace flexibility initiatives for employers in Australia.</p>\n\n<p>DCC Jobs pre-screen employers on their initiatives for supporting women in the workplace before allowing them to advertise - this has led them to be named as Leaders in Advertising in the 2016 Tech Diversity Awards. DCC Jobs has had tremendous success in the market, helping companies diversify their workplaces and assisting women to progress their careers while balancing personal and family commitments. DCC Endorsed Employers for Women include the likes of AECOM, Accenture, Atlassian, BHP Billiton, Deloitte, Caltex, CBA and Xero along with a number of startups and SMBs.</p>\n\n<p>&#x201C;In a recent survey of over 25,000 female job seekers who utilise the DCC jobs board, flexible work arrangements was the most important criteria women looked for in a new employer,&#x201D; said Valeria Ignatieva, DCC Jobs co-founder. &#x201C;Flexibility encompasses many different aspects, and job sharing is one key initiative that can contribute to more inclusive workplaces.&#x201D;</p>\n\n<p>Jobs Shared is a job sharing consultancy which provides a free online matching platform, helping people find others to share a full time role. Founder Simone McLaughlin is a former ad executive and identified the ad industry as desperately in need of more flexible work arrangements.</p>\n\n<p>According to a recent study of 400 people in the advertising industry released by AdNews in conjunction with SheSays, 38% of female creatives left agencies because they didn&apos;t feel valued or recognised and 43% did so they could find better work life balance.</p>\n\n<p>McLaughlin has since expanded into other industries and sees the partnership with DCC Jobs as key to driving the uptake of job sharing with more organisations.</p>\n\n<p>&#x201C;DCC Jobs work with companies which are open to discussing flexible work arrangements. When job seekers are applying for a full-time role as a job share team, these are the companies they&#x2019;d want to approach,&#x201D; explained McLaughlin. &#x201C;This partnership means Jobs Shared are able to expand our reach and provide our community with more opportunities to meet their job share partners.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/11","associated_company":"work180"}