{"url":"https://www.work180.com.au/blog/2016/11/diverse-city-careers-and-femeconomy-partner-to-increase-womens-workforce-participation","title":"DCC Jobs and Femeconomy Partner to Increase Women's Workforce Participation","author":"WORK180","body":"\n\t\t\t\t\t<p>Australia&#x2019;s number one jobsite for women, <a href=\"/about-us\" target=\"_blank\">DCC Jobs</a> and Australia&#x2019;s&#xA0;shopping for equality website,&#xA0;<a href=\"http://www.femeconomy.com/\" target=\"_blank\">Femeconomy&#xA0;</a>have joined forces to accelerate Australia&#x2019;s advancement towards gender equality by offering any Femeconomy approved brands a 10% discount on DCC&#x2019;s services.<br>\n<br>\nAustralia continues its gender equality decline, sliding from 36th in 2015 to 46th in 2016 on the&#xA0;<a href=\"http://reports.weforum.org/global-gender-gap-report-2016/\" target=\"_blank\">World Economic Forum&apos;s Gender Gap Index</a>.&#xA0;<br>\n<br>\nDCC Jobs Co-Founder, Gemma Lloyd said, &#x201C;Female participation in the workforce is one of the key indicators of gender equality used by the World Economic Forum. DCC has tremendous success in the market, helping companies diversify their workplaces and assisting women to progress their careers while balancing personal and family commitments.&quot;<br>\n&#xA0;<br>\n&#x201C;DCC Jobs knows how to help organisations and women across a variety of industry. DCC&#x2019;s list of endorsed employers for women include Atlassian, BHP Billiton, Commonwealth Bank of Australia, Caltex and Cbus.&#x201D;<br>\n&#xA0;<br>\nDCC Jobs Co-Founder, Valeria Ignatieva said, &#x201C;DCC Jobs identifies and collaborates with partners who assist companies to move towards diversified workplaces faster and who are creating meaningful change towards gender equality. We believe Femeconomy&#x2019;s approach to consumer activism around gender equality is going to make a positive impact.&#x201D;<br>\n<br>\nFemeconomy Co-Founder, Jade Collins said, &#x201C;The key motivator for us to create Femeconomy was that women make 85% of purchase decisions. Femeconomy steers women towards brands that are working towards gender equality not just giving lip service to it.&#x201D;<br>\n&#xA0;<br>\nFemeconomy Co-Founder, Alanna Bastin-Byrne said, &#x201C;At Femeconomy we inform customers which brands have at least 30% of women on the Board of Directors or are 50% female owned. Out of 2000 brands on our site, over 700 currently meet our approval criteria.&#x201D;<br>\n<br>\nDCC&apos;s unique criteria process ensures that the only jobs advertised on their site are with organisations who are committed to supporting women in the workplace. A transparent approach to listing initiatives on offer at each organisation ensures women are able to make more informed choices before applying.<br>\n<br>\nValeria said, &#x201C;At DCC Jobs we want to reward those companies given Femeconomy&#x2019;s badge of approval by offering a 10% discount on our services.&#x201D;<br>\n<br>\nFor more information&#xA0;on DCC Jobs 10% saving for Femeconomy approved brands, please <a href=\"/get-in-touch\">get in touch</a>.<br>\n&#xA0;</p>\n\n<p>DCC Jobs media contact:&#xA0;Valeria Ignatieva, 0478 199 800,&#xA0;<a href=\"mailto:valeria@diversecitycareers.com?subject=DCC%20and%20Femeconomy%20partnership\" target=\"_blank\">valeria@diversecitycareers.com</a></p>\n\n<p>Femeconomy media contact:&#xA0;Alanna Bastin-Byrne, 0429 605 306,&#xA0;<a href=\"mailto:Alanna@femeconomy.com?subject=DCC%20and%20Femeconomy%20partnership\" target=\"_blank\">Alanna@femeconomy.com</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/11","associated_company":"work180"}