{"url":"https://www.work180.com.au/blog/2017/06/dcc-endorsed-employer-for-women-agl-sets-new-industry-standard-for-paid-parental-leave","title":"DCC Endorsed Employer for Women AGL Sets New Industry Standard for Paid Parental Leave","author":"WORK180","body":"\n\t\t\t\t\t<p>12 months after being approved to join DCC Jobs Endorsed Employers for Women group, AGL are extending paid parental leave from 14 weeks to 20 weeks for primary carers, effective 1 July 2017.</p>\n\n<p>According to public reports from DCC&#x2019;s Partner Workplace Gender Equality Agency (WGEA), AGL offers the highest amount of paid parental leave for primary carers in the energy industry sector. It is also the second highest number of paid weeks among ASX-listed companies. DCC Endorsed Employer for Women REA Group offers the highest amount- 26 weeks of paid parental leave for primary carers and 12 weeks paid leave for secondary carers.</p>\n\n<p>In a recent survey conducted by DCC Jobs, gender neutral parental leave was identified as the top priority among job seekers when finding their ideal employer. In Australia, only 48% of Australian organisations, with over 100 employees, offer paid parental leave for primary careers. In contrast, 100% of DCC Endorsed Employers for Women offer paid parental leave for primary carers.</p>\n\n<p>&#x201C;DCC Jobs has had a tremendous effect on promoting gender-neutral parental leave policies. Organisations engaged with DCC have increased the amount of paid parental leave weeks, included paid leave for secondary carers and changed the way they speak about parenthood,&#x201D; said Gemma Lloyd, DCC Jobs cofounder.</p>\n\n<p>Other DCC Endorsed Employers for Women leading the way for paid parental leave are Hubspot and ABC who offer 4 weeks paid leave for secondary carers, where the average across other employers is 2 weeks. Schneider Electric has a &#x201C;no minimum tenure&#x201D; policy meaning their employees are entitled to paid leave from day one. BHP Billiton&#x2019;s minimum tenure is just 3 months for permanent full-time or part-time employees. Recently approved and endorsed DCC Jobs employer Reserve Bank of Australia offer 14 weeks paid leave for primary carers. They are currently developing a company program to facilitate the reintegration for parents returning to work after parental leave, recognising the importance of supporting employees throughout their different life stages.</p>\n\n<p>WGEA&#x2019;s director Libby Lyons describes it as an &#x201C;increasing trend&#x201D; among leading employers who have started to &#x201C;recognise that focusing on paid parental leave, as a strategic area of investment, leads to long-term payoffs in terms of staff retention, engagement and productivity&quot;. This includes more organisations encouraging men to utilise the parental leave that is available to them. I commend all employers who have recognised that extending paid parental leave for their employees makes good business sense&#x201D; Lyons said in a recent AFR article.</p>\n\n<p>DCC Jobs emphasise transparency across DCC&#x2019;s Endorsed Employers for their job seekers. Companies working with DCC Jobs now report on their progress via their profile pages. where women can assess information on each employer such as the amount of paid parental leave, focus on pay equity and flexible working arrangements, employee engagement scores plus much more. The majority of this information is not publicly listed elsewhere and is a necessary tool for job seekers.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/06","associated_company":"work180"}