{"url":"https://www.work180.com.au/blog/2017/08/dcc-endorsed-employer-laing-orourkes-md-confirmed-as-a-wgea-pay-equity-ambassador","title":"DCC Endorsed Employer Laing O’Rourke’s MD confirmed as a WGEA Pay Equity Ambassador","author":"WORK180","body":"\n\t\t\t\t\t<p>Endorsed Employer for Women, Laing O&#x2019;Rourke&#x2019;s Australia Hub Managing Director Cathal O&#x2019;Rourke has been confirmed as a WGEA Pay Equity Ambassador. The <a data-cke-saved-href=\"http://www.dccjobs.com/what-women-want/support-network/government-agencies/workplace-gender-equality-agency\" href=\"http://www.dccjobs.com/what-women-want/support-network/government-agencies/workplace-gender-equality-agency\">Workplace Gender Equality Agency (WGEA) </a>is a Commonwealth Government agency created to promote and improve gender equality in Australian workplaces. Pay Equity Ambassadors are a network of business leaders committed to pay equity and gender equality. &#xA0;</p><p>Cathal joins more than 100 CEOs and directors across Australia who have all taken the pledge and confirmed their commitment to shrinking Australia&apos;s gender pay gap.&#xA0;</p><blockquote><p>&#x201C;I am proud to represent Laing O&#x2019;Rourke as a Pay Equity Ambassador and I look forward to doing what we can to ensure this issue is addressed by businesses across Australia,&#x201D; Cathal said. Last year we conducted a gender pay gap review across Australia and I am proud to say we now have pay parity across the organisation and have filters in place to ensure men and women&#x2019;s salaries do not diverge.&quot;</p></blockquote><p>In 2016 women made up only 11.7 per cent of the workforce in the construction sector and the current national gender pay gap is 15.3 per cent.&#xA0;</p><blockquote><p>&#x201C;As Australia&#x2019;s largest privately-owned construction and engineering business, we have a responsibility to demonstrate that meaningful and rewarding career paths are available in this industry, regardless of a person&#x2019;s gender,&#x201D; Cathal added.&#xA0;</p></blockquote><p>Laing O&#x2019;Rourke is committed to attracting, engaging and retaining a skilled and diverse workforce and in recent years has introduced a number of initiatives to improve diversity in the workplace.&#xA0;</p><blockquote><p>&#x201C;I am delighted to confirm we have today released an update to our industry leading paid parental leave policy,&#x201D; Cathal said.&#xA0;</p></blockquote><p>In 2014 Laing O&#x2019;Rourke introduced a new paid parental leave policy providing primary carers with access to 26 weeks of paid leave. The policy has now been updated to clarify the inclusion of all staff, both male and female, who assume the role of primary carer in their family.&#xA0;</p><blockquote><p>&#x201C;We understand the importance of family friendly practices and flexible work programs to ensure our employees are supported by the business while they respond to the evolving changes and demands of their personal and family lives,&#x201D; Cathal said.&#xA0;</p></blockquote><p>Other initiatives introduced at Laing O&#x2019;Rourke include:</p><ul><li>Inspiring STEM+ - a school engagement programme designed to encourage more girls into STEM courses at university and ultimately careers in construction and engineering</li><li>Keep in Touch and Return to Work coaching programs for all staff on parental leave&#xA0;</li><li>A Connecting Women network &#x2013; a program of events designed to build engagement and greater visibility of our female leaders and to provide a forum for connecting our women, role modelling careers, and building new networks for support and advice; and&#xA0;</li><li>Flexible work programs.</li></ul><p><strong>The WGEA Pay Equity Pledge</strong></p><p><em>&#x201C;We </em><em>recognise</em><em> gender bias can creep into performance, talent development and pay decisions to create like for like gender pay gaps. That&#x2019;s why we </em><em>analyse</em><em> and monitor our talent management data, including pay, by gender and take action. We also set the expectation among people managers that they address gender bias in their decision making. We do this because we know we can&#x2019;t attract and retain the best people and improve workplace productivity if there&#x2019;s any unfairness or perception of unfairness in our workplaces. We encourage all business leaders to take the first step. Equal pay is in your hands.&#x201D;&#xA0;</em><br></p><hr><h5><strong>About Laing O&#x2019;Rourke </strong></h5><p>Laing O&#x2019;Rourke is a $6 billion international operation with 50 years of involvement in Australian construction and infrastructure including more than a decade under the Laing O&#x2019;Rourke banner. The business is currently delivering some of Australia&#x2019;s most exciting projects across the transport, building construction, defence, airports, mining, civil and social infrastructure sectors. Laing O&#x2019;Rourke is committed to becoming the recognised leader for innovation and excellence in the construction industry and has twice been named as one of Australia&#x2019;s Top 10 most innovative businesses by BRW Magazine.<br></p><p>Read more on their <a data-cke-saved-href=\"https://www.dccjobs.com/clients/laing-orourke?\" href=\"https://www.dccjobs.com/clients/laing-orourke?\">Best Employer page.&#xA0;&#x200B;</a><br><br><a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=laing-orourke\" href=\"https://www.dccjobs.com/job-search?client=laing-orourke\">Browse jobs</a> with Laing O&apos;Rourke.</p><hr><p>We are proud to&#xA0;see many of DCC&apos;s Endorsed Employers featured on WGEA&#x2019;s&#xA0;<a data-cke-saved-href=\"https://www.wgea.gov.au/pay-equity-leadership/meet-our-pay-equity-ambassadors\" href=\"https://www.wgea.gov.au/pay-equity-leadership/meet-our-pay-equity-ambassadors\">Pay Equity Ambassador list</a>:<br><br><a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">Cbus, NAB, Rabobank, BP, Mercy Health, Aurecon, GHD, Clayton Utz, WMware, Accenture, ThoughtWorks, Henry Davis York, Deloitte, EY, Vicinity Centres, Commonwealth Bank, AECOM, PwC, Reserve Bank of Australia, Australian Super, AGL Energy, MSD, Robert Bird Group, QinetiQ, REA Group, Laing O&apos;Rourk, Ashurst, Altis Consulting, Arcadis, AMEX and BOQ</a>.<br></p><hr><h5><strong>About DCC Jobs</strong></h5><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers. Set up your job alert with <a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a> now.&#xA0;<br></p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/08","associated_companies":["work180"]}