{"url":"https://www.work180.com.au/blog/2017/05/dcc-and-liquid-learning-announce-a-strategic-partnership-to-support-women-in-leadership-events","title":"DCC Jobs and Liquid Learning announce a strategic partnership to support Women in Leadership events.","author":"WORK180","body":"\n\t\t\t\t\t<p>DCC Jobs and&#xA0;<a href=\"https://www.diversecitycareers.com/page/partner-network/professional-development-services/liquid-learning/\" target=\"_blank\">Liquid Learning</a>, Australia&apos;s leading professional development provider are proud to announce a strategic partnership.&#xA0;<a href=\"https://www.diversecitycareers.com/member/createjobalert.aspx\">DCC Jobs members</a>&#xA0;will receive an exclusive 10% discount on any of Liquid Learning&apos;s Women in Leadership Conferences with the booking code QD. &#xA0;</p>\n\n<p>DCC Jobs Co-Founder, Valeria Ignatieva said, &#x201C;DCC Jobs carefully select and work with partners who actively contribute to shape better workplaces for women. We believe Liquid Learning&apos;s conferences are positively creating opportunities for women to step up in their career.&quot; &#xA0; &#xA0;&#xA0;</p>\n\n<p>Despite studies showing diverse leadership teams lead to better company results, women still occupy only 20% of executives positions in Australia. Through tailor-made events across all industries, Liquid Learning aims to provide development opportunities for emerging, aspiring and established women leaders.</p>\n\n<p>&quot;DCC Jobs is a great platform because it highlights good practices and creates role models for other companies to follow&#x201D;, says Morgane, Marketing Partnership Manager at Liquid Learning. &quot;I really enjoy working with DCC Jobs to help women across all industries to take the next step in their careers.&#x201D; At Liquid learning the core value is &quot;be better&quot;. Our conferences are designed to inspire, connect, improve and lead delegates to achieve both professional and personal development. &#x201C;The incredible feedback we receive makes us passionate about producing innovative engagements that continue to inspire women throughout the country.&quot; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;</p>\n\n<p>To find out more about Liquid Learning&apos;s Conferences, check out DCC Jobs <a href=\"http://dcc.dev.volcanic.net.au/events\">event page.</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/05","associated_company":"work180"}