{"url":"https://www.work180.com.au/blog/2018/08/digging-deep-the-women-behind-sydneys-new-tunnel","title":"Digging Deep - The Women Behind Sydney's New Tunnel","author":"WORK180","body":"\n\t\t\t\t\t<p>A group of eight engineers at <a href=\"https://www.work180.com.au/clients/cpb-contractors\">Endorsed Employer for Women CPB Contractors</a> are taking on the complex and challenging tunnelling works at the WestConnex New M5 project, <span style=\"font-size: 16px;\">&#xA0;with positions ranging from undergraduate roles to management and leadership positions. The women also offer a new set of diverse role models in an&#xA0;otherwise often male-dominated industry.</span></p>\n\n<p>With the support of this group and other women at the project,&#xA0; Katherine Scevity and Vimala Ferrari founded the group&#xA0;Women in Non-Traditional Roles (WINTR). The initiative has been established to encourage more women to join the construction industry and to provide active networking opportunities for women at the project.&#xA0;</p>\n\n<p>In addition to our engineers, women are filling a wide range of roles on the New M5, in disciplines including safety, environment and community relations.</p>\n\n<p>Project Engineer Sharlott Misra (pictured first on the right), who is based at the Bexley tunnel site, said the complex technical environment of a major tunnelling project was an appealing challenge for engineers.</p>\n\n<blockquote>\n<p><em>&#x201C;Tunnelling involves all of the complexities of civil engineering construction but with more constraints posed by the conditions of working underground,&#x201D; she said.</em></p>\n</blockquote>\n\n<p>Bexley Foreman Fred Hill said team diversity and the skills brought by women were positive outcomes for the project and the industry.</p>\n\n<blockquote>\n<p><em>&#x201C;I enjoy working with the women engineers on our team as they contribute strong communication and planning skills,&#x201D; he said.</em></p>\n\n<p><em>&#x201C;It is an important outcome that we are seeing a growing number of women who are interested in </em><em>tunnelling</em><em> and other industry </em><em>sectors,</em><em> and that we support them in their </em><em>endeavours</em><em>.&#x201D;</em></p>\n</blockquote>\n\n<p>WINTR aims to build networks for women in non-traditional roles, raise the profile of women on projects, and help retain and grow the number of women in technical and leadership positions.</p>\n\n<p>CPB Contractors is working with&#xA0;<a href=\"https://www.work180.com.au/clients/rms\">Roads and Maritime Services</a>&#xA0;,&#xA0;who are also a WORK180 Endorsed Employer for Women, to design and construct Sydney&#x2019;s $4.3 billion New M5 Motorway in a joint venture with Dragados and Samsung C&amp;T.</p>\n\n<p>The project will deliver approximately 9km of new tunnels, motorway-to-motorway connections to the King Georges Road Interchange Upgrade at Beverly Hills and a new interchange at St Peters.</p>\n\n<p>Major works commenced in mid&#x2010;2016 and the New M5 is scheduled to open to traffic in late 2019.</p>\n\n<p><em><small>Pictured (L-R)&#xA0;&#x2013; Bethany Bent (Site Engineer), Awani Gajjar (Site Engineer), Georgia Moo (Safety Graduate) and Sharlott Misra (Project Engineer).&#xA0;</small></em></p>\n\n<hr>\n<h4><strong>About CPB Contractors&#xA0;<a href=\"https://www.work180.com.au/job-search?client=cpb-contractors\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7e4b80b9-5c12-456a-885f-a5bd13aa38dc.png\" style=\"float: right; margin: 10px; width: 200px; height: 153px;\"></a></strong></h4>\n\n<p><span id=\"ember5706\">CPB Contractors is an Endorsed Employer for Women. Join a performance-based culture and build a rewarding career. Learn more and apply for great job opportunities at C</span><span id=\"ember5717\">PB Contractors&#xA0; who offers:&#xA0;</span></p>\n\n<ul>\n\t<li>Flexible working</li>\n\t<li>10 weeks paid parental leave</li>\n\t<li>Internal women&apos;s networking groups</li>\n\t<li>Mentoring &amp; coaching programs</li>\n</ul>\n\n<p><a href=\"https://www.work180.com.au/clients/cpb-contractors\"><span>&#xA0;+ More on their Best Employer page.&#xA0; &#xA0;</span></a></p>\n\n<p><a href=\"https://www.work180.com.au/job-search?client=cpb-contractors\">Browse and apply and for their jobs here.&#xA0;</a></p>\n\n<hr>\n<h3><strong>About WORK180</strong></h3>\n\n<p>WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.</p>\n\n\t\t\t\t","tags":["Celebrating Women","gender equality","Pictured (L-R) – Bethany Bent (Site Engineer) Awani Gajjar (Site Engineer), Georgia Moo (Safety Graduate) and Sharlott Misra (Project Engineer)."],"upload_date":"2018/08","associated_company":"work180"}