{"url":"https://www.work180.com.au/blog/2015/06/diversity-whats-the-point","title":"Diversity: what's the point?","author":"WORK180","body":"\n\t\t\t\t\t<p><br></p><blockquote><p>&#x200B;<strong><em>&quot;You don&#x2019;t need to talk to me about diversity, seven out of eight people in my team are women already.&quot;</em></strong></p></blockquote><p><br></p><p>I caught up with a friend of mine recently who is the Head of Diversity and Inclusion at a major, ASX listed company. During our discussion she mentioned the comment above, made by a male manager at her organisation. This seemingly innocent enough comment highlights the huge gap between acknowledgement and belief when it comes to diversity.</p><p>Like a lot of people this manager was acknowledging the company&#x2019;s stated goal of creating a diverse workplace. He&#x2019;d heard of the goal, knew it was part of the strategy and like a lot of men (including me once) believed that diversity was just another label for &#x201C;giving jobs to women&#x201D;. It wasn&#x2019;t until I was educated to the benefits of diversity and inclusion and took the time to really understand and think about it that I became a convert.</p><p>I am male, tertiary educated and had never been exposed to the gender discrimination that women face. It&#x2019;s not an excuse, it&#x2019;s that I hadn&#x2019;t ever made time to think about diversity nor to consider my role in unconscious bias. When I examined my attitude, past behaviour and thinking I was shocked and embarrassed. I hadn&#x2019;t gone out of my way to discriminate but I realised that I held and, therefore unconsciously maintained, an out-dated, male-orientated status quo attitude.</p><p>This new understanding was so enlightening. Diversity is not about &#x201C;giving jobs to women&#x201D;, it&#x2019;s about creating a team or group that contains diversity of culture, gender, life experience. It&#x2019;s about the value that comes from having different viewpoints, histories, upbringing. Multiple studies[1] have shown that diverse teams produce better results than homogenous teams. It&#x2019;s a no-brainer isn&#x2019;t it?</p><p>I&#x2019;ve used words like &#x201C;convert&#x201D; and &#x201C;enlighten&#x201D; deliberately because despite the evidence and logic we have a long way to go still to achieve equality and become truly diverse. With more men named &#x201C;Peter&#x201D; than women in ASX200 Chair and CEO roles[2] and a gender pay gap[3] of 18.8% that has widened over the past 20 years, the proof is stark.</p><p>Its not enough that you acknowledge the need for diversity, it&#x2019;s also not enough to understand what diversity means. To make a real difference you have to <em>believe</em> the value (and fairness) of having a diverse workforce and an inclusive way of working.</p><p>The manager who made this comment clearly didn&apos;t know what diversity actually meant. Hopefully once its been explained and had the benefits shared as well, he will start to believe and see the right way forward.</p><p>We all have a role to play to help educate and enlighten others as to the value and benefits of diversity and by working together and being heard we can accelerate change.</p><p><br></p><p>[1] A couple of examples:</p><p><a data-cke-saved-href=\"http://www.mckinsey.com/insights/organization/is_there_a_payoff_from_top-team_diversity\" href=\"http://www.mckinsey.com/insights/organization/is_there_a_payoff_from_top-team_diversity\" target=\"_blank\">http://www.mckinsey.com/insights/organization/is_there_a_payoff_from_top-team_diversity</a>, <a data-cke-saved-href=\"http://www.forbes.com/forbesinsights/innovation_diversity/index.html\" href=\"http://www.forbes.com/forbesinsights/innovation_diversity/index.html\" target=\"_blank\">http://www.forbes.com/forbesinsights/innovation_diversity/index.html</a></p><p>[2] Georgina Dent, Women&#x2019;s Agenda 6/3/15 (<a data-cke-saved-href=\"http://www.womensagenda.com.au/\" href=\"http://www.womensagenda.com.au/\" target=\"_blank\">www.womensagenda.com.au</a>)</p><p>[3] Workplace Gender Equality Agency: Gender Pay Gap Statistics 1/5/15 (<a data-cke-saved-href=\"http://www.wgea.gov.au/\" href=\"http://www.wgea.gov.au/\" target=\"_blank\">www.wgea.gov.au</a>)</p><p><br></p><em></em><p>Matt is one our Contributors, read about them all&#xA0;<a data-cke-saved-href=\"/contributors\" href=\"https://www.dccjobs.com/contributors\">here</a>.</p><em></em><p><br></p><h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/06","associated_company":"work180"}