{"url":"https://www.work180.com.au/blog/2016/08/diversity-branding-part-1","title":"Diversity Branding, Part 1","author":"WORK180","body":"\n\t\t\t\t\t<p>Clients often approach us around consulting for employer branding, except they are calling what we do at DCC Jobs, &#x2018;Diversity Branding&#x2019;. My brutally honest answer to &#x201C;What can we do to stand out in this space?&#x201D; &#xA0;is that it&#x2019;s a lot more &#x2018;doing&#x2019; then having meetings figuring out how to put a spin on something that barely exists. It&#x2019;s about putting in place initiatives that are truly remarkable and make an impact, then talking about it. While DCC&#x2019;s main area of expertise is gender diversity, we&#x2019;ve compiled a number of real life examples that can be of inspiration to anyone interested in Diversity Branding.</p>\n\n<p>At a recent briefing by the Australian Institute of Company Directors (AICD), the biggest take away for the audience was if you position your company as something it&#x2019;s not, people will find out fairly quickly, and leave, possibly taking some of the best talent with them. Not to mention talk about your brand to others and with the power of social media, that&#x2019;s something not to be taken lightly.</p>\n\n<p>Not long we started DCC Jobs, my cofounder Gemma and I met with a large, IT company which shall remain unnamed. They were keen to advertise with us and when we brought up the criteria process, which was received with blank stares, one of the recruitment leads said &#x201C;Oh I wouldn&#x2019;t say we&#x2019;re a great place to work for women. But look, we have a massive employer branding budget so that&#x2019;s not an issue.&#x201D;</p>\n\n<p>We haven&#x2019;t heard back from that company after offering to go through the criteria to identify areas they can improve on, and eventually advertise with us. I&#x2019;m hoping the bottomless employer branding budget is being redirected to genuinely improve their company, before it&#x2019;s spent on branding activities.</p>\n\n<p>Here are some ways you can differentiate a genuine way.</p>\n\n<h4>Hire for culture contributions, not culture fit</h4>\n\n<p>Founded in Denmark, Zendesk brought their incredible culture and strong values to Australia when setting up its office in Melbourne. From its gender neutral, 16 week paid parental policies through to the company&#x2019;s goal of providing 1,000 volunteer hours during the working week to those in need, Zendesk&#x2019;s heart is in the right place, and it shows. As a result, each employee is an ambassador for the business, making the recruitment process very genuine.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/fa4ce3eb-f78a-42d4-9489-eeb285b12347.jpeg\"></p>\n\n<p>&#x201C;At Zendesk, we aim to push the boundaries of innovation when developing software products. Likewise we must include innovation at the heart of our hiring process,&#x201D; said Ian Chaplin, Recruiter - ANZ &amp; Japan at Zendesk. &#x201C;By looking for &#x2018;Culture Contribution&#x2019; over &#x2018;Cultural Fit&#x2019; we consider potential employees who will expand the personality and interests of our vibrant culture. In creating a diverse workforce we find the special sauce that will not only influence how we think and solve problems, but more importantly, work to identify the problems that we think are worth solving. By building teams who can see many sides to a problem we are able to add value to our products for more people in more communities around the world.&#x201D;</p>\n\n<h4>Figure out what&#x2019;s important to the company, and focus on just that</h4>\n\n<p>Envato is a great example, and at the same AICD briefing, their cofounder, Cyan Ta&#x2019;eed, shared how things changed once they zeroed in on two of the most important aspects of their culture: Flexibility and Diversity &amp; Inclusion. Named as&#xA0;<a href=\"http://inside.envato.com/envato-coolest-company-for-women/\" target=\"_blank\">Australia&apos;s Coolest Company for Women</a>, Envato were also recognised as one of the&#xA0;<a href=\"http://press.envato.com/109596-envato-named-one-of-2015-s-best-places-to-work\" target=\"_blank\">Best Places to Work in Australia</a>&#xA0;in the 2015 BRW Awards.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6fafe63c-2d56-4fb5-b8c1-e272196db12a.jpeg\"></p>\n\n<p>&quot;At Envato, we want our people to be happy inside and outside of work,&#x201D; said Elizabeth Enders - Talent Acquisition Manager at Envato. &quot;When we asked our people what was important to them, it became clear that life doesn&apos;t always fall outside 9-5 and that they love to work from more places than just our bricks and mortar office. So, we gave our employees the ability to work flexible hours, work from home as much as they want and&#xA0;<a href=\"http://inside.envato.com/reflections-on-remote-working/\" target=\"_blank\">work from anywhere around the globe</a>&#xA0;up to 3 months every year. We also have gradual return to work for primary caregivers, and have had some secondary caregivers take up &apos;dad days&apos;: part time work to support their partners and spend time with their kids.&#xA0;Opening up our minds to flexible working has paid off in terms of positive feedback from our people1, whose priorities range from raising families, seeing the world, coping with mental illness or simply having other interests outside of work.&quot;</p>\n\n<h4>Happy employees make the best &#x2018;recruiters&#x2019;</h4>\n\n<p>By firstly consulting with staff, then implementing real policies that are embraced by everyone creates a culture where employees feel like they belong and perform at their best, leveraging their preferred working style. AECOM is a great example of a&#xA0;<a href=\"https://www.diversecitycareers.com/page/about-us/campaigns/aecom-flexibility-works/\">truly flexible</a>&#xA0;workforce, in an industry not known for flexibility. We&#x2019;ve also interviewed a&#xA0;<a href=\"https://www.diversecitycareers.com/aecom\">number of women</a>&#xA0;who&#x2019;ve progressed their careers with the business while juggling personal commitments along the way.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/794cf642-3c62-4529-8df0-9c6eb1573c76.jpeg\"></p>\n\n<p>&#x201C;At AECOM we&#x2019;re creating a culture that is defined by output and behaviour, not where and when the work takes place.&#xA0;<a href=\"https://www.diversecitycareers.com/page/companies-we-endorse/aecom/life-at-aecom/life-at-aecom-sarah-dove/\">Sarah&#x2019;s story</a>&#xA0;demonstrates that&#xA0;when you take a team and client focused approach to accessing workplace flexibility, it&#x2019;s a win/win situation for the individual and the business1.&#x201D;- Josh Cass, Senior HR Business Partner, ANZ at AECOM.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/08","associated_company":"work180"}