{"url":"https://www.work180.com.au/blog/2017/07/diversity-is-much-more-than-a-numbers-game","title":"Diversity Is Much More Than A Numbers Game ","author":"WORK180","body":"\n\t\t\t\t\t<p>Written by Mahnaz Javid.</p>\n\n<p>Metrics. It&#x2019;s how many of us measure our success. If you want to prove impact, you set a measurable goal and achieve it. This gives you something tangible that proves &#x201C;yes, I&#x2019;ve done what I needed to do.&#x201D; In my role as global talent acquisition lead at Avanade, I&#x2019;m no different &#x2013; I ask myself, what do we need to accomplish: Increase applications? Reduce time to hire? Build a more diverse workforce? Lower attrition? I then set a goal and partner with my team to make sure we are doing all we can to meet those goals and claim &#x201C;success&#x201D;.</p>\n\n<p><strong>The same applies to building a more diverse and inclusive workplace&#xA0;</strong>&#x2013; something I am passionate about doing here at Avanade. Diversity is critical to our success: it improves employee engagement and performance, drives innovation for our clients resulting in better business outcomes and better experiences for their customers, and ultimately positively impacting our bottom line. Here at Avanade, we have strategic goals to ensure we are building a diverse workplace, and I&#x2019;m proud of the progress we&#x2019;ve made, particularly around bringing more female technologists to Avanade.&#xA0;<strong>We&#x2019;ve increased total female hires to above 25%, with over 17% of our director and above positions now being held by women (compared to an average 11% at Fortune 500 companies).</strong>&#xA0;In fact, two of our three Area Presidents are women. The visibility of our women leaders and increase in female hires coupled with strong community engagement and internal programming means we are on the right path.</p>\n\n<p><strong>However, numbers don&#x2019;t always tell the whole story.&#xA0;</strong>Often, they barely scratch the surface. Significant change takes time, and it&#x2019;s easy to get frustrated when you don&#x2019;t feel like things are happening fast enough. That&#x2019;s when you must look deeper to see the meaningful progress being made. For me, I see Sara Battistella, a recruiter in Italy who, when faced with low quantity and quality of applicants,&#xA0;<a href=\"http://blog.avanade.com/inside-avanade/women-at-avanade/innovative-academy-trains-women-for-a-future-in-tech/\" target=\"_blank\">developed an academy</a>&#xA0;to upskill women and get them employed, and ultimately create a better future for them and their families. I see Yuka Shinkawa, a young technologist in Japan who is able&#xA0;<a href=\"http://blog.avanade.com/inside-avanade/employee-stories/life-at-avanade-with-yuka-shinkawa/\" target=\"_blank\">to pursue challenging work while balancing the demands of having a young family</a>. I see Pam Maynard, Europe President, who has taken&#xA0;<a href=\"https://www.youtube.com/watch?v=Jd51p66dSd8\" target=\"_blank\">her successful career journey and is paying it forward</a>&#xA0;by focusing on mentorship of young women.</p>\n\n<p>These stories are all around us &#x2013; Avanade&#x2019;s commitment to developing the careers of women in technology, and fostering diversity across all areas of our company, is more than just meeting the numbers on our scorecard. I remain focused on continuing the positive progress we&#x2019;ve made, but will also seek to look beyond the numbers, and recognise the truly amazing things our people are doing each day to create a place where people love to work.</p>\n\n<p style=\"text-align:center\"><iframe allowfullscreen frameborder=\"0\" height=\"253\" src=\"https://www.youtube.com/embed/R3YYoKVlqMs\" width=\"450\"></iframe></p>\n\n<p>Originally published by&#xA0;<a href=\"http://blog.avanade.com/inside-avanade/diversity-inclusion/diversity-is-much-more-than-a-numbers-game/\" target=\"_blank\">Avanade</a>.</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/07","associated_companies":["work180"]}