{"url":"https://www.work180.com.au/blog/2015/09/diverse-city-careers-announce-their-advisory-board-a-group-of-individuals-passionate-about-gender-equality","title":"Diverse City Careers announce their Advisory Board- a group of individuals passionate about gender equality","author":"WORK180","body":"\n\t\t\t\t\t<p>Diverse City Careers (DCC Jobs) is pleased to announce the members of its Advisory Board, all committed to the company&#x2019;s mission to create better workplaces for women.</p>\n\n<p>Launched on 15th May, 2015 by Gemma Lloyd and Valeria Ignatieva, DCC Jobs is Australia&#x2019;s only jobs&#xA0;site that selects&#xA0;employers based on their internal policies - only advertising roles at companies, which have demonstrated a commitment to creating ideal workplaces for women.</p>\n\n<p>DCC Jobs offers a unique employee branding platform for Australia&#x2019;s ambassadors for gender equality, proudly showcasing their clients&#x2019; available jobs along with various initiatives aimed at supporting females in the workplace.</p>\n\n<p><em>&#x201C;We are honoured to have such an amazing group of people to support us on our journey. All our board members share the DCC values and vision and bring a wealth of expertise and energy to our team,&#x201D;</em> said Gemma.</p>\n\n<h3><strong>Members of the DCC Advisory Board are:</strong></h3>\n\n<p>&#xA0;</p>\n\n<p><strong>Matt Lee, Principal Consultant at oooi Consulting Group.</strong></p>\n\n<p>As a former COO at Qantas and Director at Virgin, Matt has been exposed to various cultures and ways of working which have shown, and reinforced for him, the value of diversity and inclusion in business. A keen advocate for diversity, Matt is a father of three girls and two boys with hopes for a future where all of his children have equal opportunities and earning potential.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Victoria Keeys, Senior Manager, Culture and Diversity, CBA.</strong></p>\n\n<p>As a leader in the field of Organisational Development, Victoria is very passionate about diversity and inclusion and has recently established the Industry Diversity Roundtable in partnership with Female in IT &amp; Telecommunications (FITT), where senior leaders join forces to enhance industry inclusiveness.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Faith Rees, Co-founder and CEO of SixPivot.</strong></p>\n\n<p>With a career in IT spanning 18 years prior to launching her own tech start-up, Faith is a strong believer in giving back to the community, volunteering her time across various IT associations and on a number of government and industry committees. Faith is an advocate for diversity and in particular supporting women in their careers through her membership with Women on Boards and as a mentor for the WiT Board Readiness Program.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Michele Hamdorf, CEO &amp; Founder, lime door brands. </strong></p>\n\n<p>A start-up &amp; turnaround expert, Michele (M.E. (Exec), M.IoDSA, MAICD &amp; MAMI) has delivered marketing, merchandise &amp; retail successes in fashion, telecommunications &amp; e-commerce gaining global recognition with 25 + years&#x2019; experience internationally.&#xA0;Michele is passionate about helping women develop rewarding careers and fostering diversity at leadership levels- she believes this is the key to companies performing at their best, both ethically and financially.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Damian Maclennan, CTO Octopus Deploy.</strong></p>\n\n<p>Damian is a technologist, mentor and speaker with over 15 years&#x2019; experience across various industries and has been responsible for the architecture, development and operation of some of Australia&apos;s most high profile websites. As a father of two young children (both are learning to code) Damian believes diversity is necessary for a healthy and creative team, and that those in the position to help should do what they can to help the sustainability of their team, their company and their industry.</p>\n\n<p>&#xA0;</p>\n\n<p><em>&#x201C;We are very fortunate to be following our passion of advocating for gender equality and working with some of Australia&#x2019;s top companies who share our vision. We are excited about DCC&#x2019;s future and the changing landscape of Australian businesses and their focus on diverse and inclusive workplaces&#x201D;</em> said Valeria.</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2015/09","associated_company":"work180"}