{"url":"https://www.work180.com.au/blog/2017/08/diversity-in-marketing","title":"Diversity in Marketing?","author":"WORK180","body":"\n\t\t\t\t\t<p>Following a recent business meeting in the city, my colleague and I needed to de-brief and plan our next steps. It was the end of the day so we decided to take advantage of our location, duck into a bar and enjoy a drink while we chatted. Nothing new here.</p>\n\n<p>This particular bar offered locally brewed, craft beers - a great initiative and wonderful support for local brewers. We opted for a pale ale and a pilsner and went off to find a quiet corner for our discussion. Nothing new here.</p>\n\n<p>Before we left the bar I took a picture of the beer taps and the images used by the brewer to market their beers (see above). Seven different beers and a cider, eight taps, eight images.....eight suggestively posed, scantily clad women. Nothing new here - and that&apos;s the problem!</p>\n\n<p>A day after the new New Zealand Labour opposition leader is&#xA0;<a href=\"http://www.theage.com.au/world/totally-unacceptable-new-zealand-labour-leader-jacinda-ardern-quizzed-on-baby-plans-20170802-gxnj7z.html\" target=\"_blank\">asked questions that no male predecessor would</a>&#xA0;be asked, it depressingly feels like we still have so far to go when it comes to progress on diversity and inclusion.</p>\n\n<p>In the case of both the questions put to the New Zealand Labour leader and the beer images its the sub-text that is the issue: &quot;a woman&apos;s place is in the home, caring for children - not holding a significant leadership role&quot; and &quot;the way to use women in marketing is to objectify their bodies&quot;. Clearly, women don&apos;t have brains and are unable to achieve great things unless they are at home chained to the sink or scantily clad or, ideally, both!</p>\n\n<p>People may argue that the questions asked of the Labour Leader and the beer images are innocent and not meant to be offensive. They may say I&#x2019;m being a bit prudish. They may say that women conceive, carry and give birth to children and not men so it is perfectly OK to ask these questions.</p>\n\n<p>These people are missing the point. A society or culture that perpetuates the stereotypes of a woman&#x2019;s primary role being motherhood and/or her looks is not progressive. It&apos;s not appropriate and it is a poor reflection of all the amazing work done by women and men to advance the case for equality, diversity and inclusion. Canadian prime minister, Justin Trudeau, summed this up so eloquently after being elected and announcing his cabinet when he was asked by a reporter &#x201C;why it was so important to have a cabinet that is gender balanced&#x201D; by simply stating: &#x201C;<a href=\"https://www.youtube.com/watch?v=LLk2aSBrR6U\" target=\"_blank\">Because it&#x2019;s 2015</a>&#x201D;!</p>\n\n<p>The value of diversity lies in celebrating our differences and the varied, opposing and alternative views that are offered. Reinforcing out-dated stereotypes either consciously or sub-consciously stifles creativity and doesn&#x2019;t build for the future. Men and women can lead and men and women can stay home and care for their families.</p>\n\n<p>Anyway, back to my beer. Nothing new there.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/08","associated_company":"work180"}