{"url":"https://www.work180.com.au/blog/2016/07/diverse-city-careers-win-number-techdiversity-award-for-unique-jobs-board","title":"Diverse City Careers win #TechDiversity Award for unique jobs board","author":"WORK180","body":"\n\t\t\t\t\t<p>Diverse City Careers (DCC) have been announced as leaders in Advertising, winning in the category at the inaugural #TechDiversity awards.</p><p><br></p><p>#TechDiversity is an industry alliance committed to amplifying diversity awareness and increase the participation of women and minority groups in the digital technology industry.</p><p>DCC, a niche jobs board, has turned advertising and talent attraction on its head by evaluating clients based on how well they support women in the workplace, only advertising roles with employers who demonstrate strong commitment. The companies are assessed in areas such as flexibility, women in leadership, equal pay and opportunities for professional development.</p><p>Since its launch 18 months ago, the jobs platform has helped many clients, particularly in non-traditional industries attract top talent. The DCC cofounders refer to an experiment back in the 1970&#x2019;s that proves the power of &#x2018;diversity branding&#x2019;. In 1972, following the appointment of Myra Strober as the first female faculty member of the Graduate School of Business at Stanford, the organisation and other Business Schools nationwide started a recruitment drive for females. &#xA0;What happened next was phenomenal- as soon as women knew that Business Schools nationwide wanted to enrol women, the women applied in droves.</p><p>&#x201C;Great employers are out there, yet it&#x2019;s hard for female job seekers to know what&#x2019;s behind the walls of these companies, and how supportive they are. On the flipside, lots of organisations have transformed from an outdated, boys&#x2019; club to a modern workplace, yet struggle to articulate this change to the market. We&#x2019;re on a mission to elevate companies taking this seriously,&#x201D; said Gemma Lloyd, DCC co-founder.</p><p>The unique business model has seen DCC turn down clients, but on a more positive note, the cofounders have been approached by a number of clients who are at the beginning of their transformation, to gain insights and learn about best practices.</p><p>&#x201C;We&#x2019;re lucky in the sense that our clients are passionate about their industry as a whole and are willing to share their experiences of what worked and what didn&#x2019;t with others, creating a positive ripple effect,&#x201D; said Valeria Ignatieva, DCC co-founder.</p><p>DCC work with some of the biggest players in the tech sector including Accenture, Avanade, VMware, EMC and Dropbox along number of tech start-ups, such as The Yield, who are also finalists in the #TechDiversity Awards, in the Business category-a credit to their incredible culture, which has built in a commitment to diversity from day one.</p><p>&#x201C;Gemma and Valeria have built diversity into all facets of Diverse City Careers. Looking at the diversity challenge from a holistic perspective DCC addresses recruitment, training, branding, communications, mentoring and coaching as integrated elements required to achieve diversity,&#x201D; said Deidre Diamante, Co-Founder at #TechDiversity.</p><p><br></p><p style=\"text-align:center\">&#x200B;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c5a0ecdb-d9d7-4927-ac27-94e3af1ec4c3.png\">&#x200B;</p><p>From left to right, Gemma Lloyd, DCC cofounder, Ros Harvey, Founder and Managing Director, The Yield, Valeria Ignatieva, DCC Cofounder</p><p><br></p><h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/07","associated_company":"work180"}