{"url":"https://www.work180.com.au/blog/2016/02/diverse-city-careers-partners-with-dropbox-to-promote-diversity-in-the-workplace","title":"Diverse City Careers partners with Dropbox to promote diversity in the workplace","author":"WORK180","body":"\n\t\t\t\t\t<p>Diverse City Careers (DCC) and Dropbox today announced a partnership to encourage diversity amongst Australian workplaces.</p>\n\n<p>Through this partnership, Dropbox and DCC hope to help women enter industry sectors with traditionally low female participation and pursue rewarding careers. The initiative will see DCC receive ongoing support of their work in raising awareness about diversity and inclusion in Australia through educational events, campaigns, webinars and free resources.</p>\n\n<p>Charlie Wood, Managing Director of Dropbox ANZ, said that working with DCC aligns with Dropbox&#x2019;s local and international efforts to attract and retain top women and minority talent in the workforce.</p>\n\n<blockquote>\n<p><em>&#x201C;We want to be a company where Dropboxers from any background can build a career they love. That&#x2019;s why we&#x2019;re committed to building a team with diverse perspectives focused on creating innovative products that are used by more than 400 million people around the world. We&#x2019;re working hard to minimise unconscious bias in the workplace by changing how we recruit, retain and promote employees with unique life experiences,&quot; </em>said Mr Wood.</p>\n</blockquote>\n\n<p>Dropbox joins DCC&#x2019;s repertoire of pre-qualified companies championing action and change against these figures by creating supportive environments for women across a wide range of industries, including global professional services company Accenture, which has also been announced today as a supporting partner of the program. Other DCC endorsed companies include: PwC, IBM, EMC, Curtin University, Minter Ellison, Origin Energy, Cue Clothing and ThoughtWorks.</p>\n\n<blockquote>\n<p><em>&#x201C;Accenture are proud to support DCC in their efforts to encourage diversity and equality in Australian workplaces. The diversity of our people is a key differentiator and critical for innovation.&#xA0; We welcome this opportunity to support and encourage more women to pursue rewarding careers particularly in industries with typically low female participation such as technology,&#x201D; </em>said Jordan Griffiths, Accenture Australia Inclusion &amp; Diversity Lead.</p>\n</blockquote>\n\n<blockquote>\n<p><em>&#xA0;&#x201C;We&#x2019;re absolutely humbled by the amount of support we&#x2019;ve received both from the industry and the community since DCC&#x2019;s inception,&#x201D; </em>said Gemma Lloyd, DCC co-founder. &#x201C;<em>Diversity and inclusion are becoming a key focus with more and more companies, which is fantastic to see.&#x201D;</em></p>\n</blockquote>\n\n<blockquote>\n<p><em>&#x201C;We are very thankful for the support both Dropbox and Accenture will be providing to help drive the DCC mission in Australia and New Zealand and look forward to an incredible 2016</em>,&#x201D; said Valeria Ignatieva, DCC co-founder.</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p><strong>About Diverse City Careers</strong></p>\n\n<p>Founded in February 2015 by Gemma Lloyd and Valeria Ignatieva, DCC is a social enterprise helping women pursue rewarding careers, particularly in sectors high gender inequality rates. Since its conception, DCC has grown rapidly and is now regarded as one of Australia&#x2019;s leading authorities on gender diversity. The DCC jobs board is Australia&#x2019;s only exclusive jobs board, meaning employers must be pre-qualified before advertising to ensure they support women&#x2019;s careers. DCC produces a number of resources on topics such as personal branding, negotiation skills and&#xA0;other&#xA0;areas of professional development. The organisation also hosts educational events and campaigns in order to raise awareness around gender inequality in Australia. DCC cofounders regularly participate in advocacy events on gender diversity and run community meet-ups and corporate panel sessions along with in-company training.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>About Dropbox</strong></p>\n\n<p>Dropbox&apos;s mission is to simplify the way people work together. With 400 million users, we&apos;re building the world&apos;s simplest, most powerful collaboration platform. For more information, please visit <a href=\"https://www.dropbox.com/press\">https://www.dropbox.com/press</a></p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/02","associated_company":"work180"}