{"url":"https://www.work180.com.au/blog/2017/07/diverse-city-careers-rebrands-to-dcc-jobs","title":"Diverse City Careers rebrands to DCC Jobs ","author":"WORK180","body":"\n\t\t\t\t\t<p>Diverse City Careers (DCC) was born in 2015, with the goal to empower women and fast-track gender equality. Two years later, we are excited to announce a brand re-fresh which involves the company name, logo and tagline. We are taking the opportunity to evolve our logo to represent who we are and the role we play in driving gender equality in the workplace. We are thrilled to introduce DCC Jobs &#x2013; Working for Women.</p><p><br></p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3b615497-1ab5-471c-9926-ba2e3329bebe.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3b615497-1ab5-471c-9926-ba2e3329bebe.png\"></p><p><br></p><h4><strong><span style=\"color:#a87eb1\">Our Journey</span></strong></h4><p>The concept for the unique female-friendly job platform came to us after spending over 10 years in IT, where we experienced firsthand the challenges many women face in industries under-represented by women. We wanted to create a platform where women can easily identify the best employers, and hold organisations accountable for providing equal opportunities.</p><p><em>&#x201C;The premise is simple: we believe women should feel valued at work, and employers who support women&#x2019;s careers deserve the best talent&#x201D;&#x201D;</em></p><p>Since the beginning, DCC has received a tremendous amount of support from organisations, NFPs and the wider community, growing rapidly into a multi-award winning social enterprise. Initially focusing on non-traditional industries such as Tech and Engineering, our <a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">Endorsed Employers group</a> grew to encompass a broad range of industries, with organisations coming on board to demonstrate their support for women from sectors such as Education, Retail and Health.</p><p><br></p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/dcd4efa9-1ddb-4ddc-a485-1d49d1326cb7.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/dcd4efa9-1ddb-4ddc-a485-1d49d1326cb7.png\"></p><p><br></p><p>DCC has made some bold statements, including rejecting 10% of employers who apply to advertise on our platform and don&#x2019;t meet our criteria. The criteria was developed in consultation with industry experts, through surveying thousands of women, and reviewing hundreds of companies&apos; policies. In early 2017, we&#x2019;d also introduced transparency across company policies and initiatives. Women can now easily find out what employers offer in terms of paid parental leave, pay equity, flexible working arrangements, employee engagement scores plus much more. This information is not publicly listed elsewhere and forms a valuable tool for assessing employers.</p><p><br></p><h4><strong><span style=\"color:#a87eb1\">The Story Behind </span></strong><strong><span style=\"color:#a87eb1\">our</span></strong><strong><span style=\"color:#a87eb1\"> Name &amp; Logo</span></strong></h4><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c0e81d1c-447b-41e2-9184-90e9345c0fa6.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c0e81d1c-447b-41e2-9184-90e9345c0fa6.jpeg\"></p><p>The original name, Diverse City Careers, was created to convey a message of support for diversity, with a little play on words for creativity. The DCC logo was designed to be bright and vibrant, and representative of genders using the traditional pink, lilac and blues we typically associate. The linking of the letters symbolised unity, equality and collaboration. Over time, Diverse City Careers have become known simply as &#x2018;DCC&#x2019; to our job seekers and endorsed employers for women. Updating our logo to incorporate this is therefore an important move to better reflect our community.</p><p>We&#x2019;re proud to have influenced positive change within organisations, who have improved internal policies in order to work with DCC. We&#x2019;re excited to evolve the company name, logo and tagline, to be representative of this bold statement and convey the part our team plays in driving gender equality in the workplace.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3b615497-1ab5-471c-9926-ba2e3329bebe.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3b615497-1ab5-471c-9926-ba2e3329bebe.png\"></p><p>The colours and symbols of unity will remain the same, with the introduction of some new aspects:</p><ul><li><p>The company name has changed to DCC Jobs- this is in response to the community mainly referring to us as &#x2018;DCC&#x201D;. We love Diverse City Careers, but DCC Jobs is much simpler to say, write and remember!</p></li><li><p>The &#x201C;O&#x201D; in jobs became the female gender symbol, standing out to be bold and empowering for women</p></li><li><p>The &#x201C;O&#x201D; doubles as a magnifying glass, representative of the search for a great employer in addition to transparency across employers&#x2019; policies and initiatives</p></li><li><p>The new tagline &#x201C;Working for Women&#x201D; is multifaceted:</p><ul style=\"list-style-type:circle\"><li><p>DCC is <em>working for women</em> to advance gender equality by rejecting employers who don&#x2019;t meet our standards. 80% of those who are rejected go on to improve internal policies and initiatives, such as increasing parental leave, introducing paid superannuation on both paid and unpaid parental leave and making flexible working accessible to all employees</p></li><li><p>DCC is <em>working for women</em> by making it easy to find great jobs with truly supportive employers who will respect and value them</p></li></ul></li><li><p>Please note the original URL will be still directed to the site however, you can also find us at <a data-cke-saved-href=\"http://www.dccjobs.com/\" href=\"http://www.dccjobs.com/\">www.dccjobs.com</a></p></li></ul><p>We&#x2019;d like to thank everyone who has supported DCC throughout our journey, we&#x2019;re very pleased to see our vision come to life and have some ambitious goals for the future- this is just the beginning!</p><p><br></p><p>Gemma Lloyd &amp; Valeria Ignatieva</p><p>DCC Cofounders&#xA0;</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/07","associated_company":"work180"}