{"url":"https://www.work180.com.au/blog/2015/11/diverse-city-careers-announced-as-finalists-in-the-2015-arn-women-in-ict-awards","title":"Diverse City Careers announced as finalists in the 2015 ARN Women in ICT Awards","author":"WORK180","body":"\n\t\t\t\t\t<p>The Diverse City Careers (DCC) Co-founders are honoured to be among an elite group of finalists representing the ICT industry in the 2015 ARN Women in ICT Awards (WIICTA) awards within the Innovation category.</p>\n\n<p>The Innovation award recognises candidates who stand-out in delivering &#x2018;big picture&#x2019; ideas and vision in the ICT industry, thereby responding to change and discovering unique and challenging business opportunities. The candidates have a proven track record of finding new and better ways of doing business, continually pushing the envelope in the ICT industry.</p>\n\n<p>DCC is a Social Enterprise created to make a difference &#x2013;working exclusively with organisations that are great workplaces for women.</p>\n\n<p>Countless research indicates companies with successful gender diversity strategies outperform competitors. However, the fact remains that many people are not sold on the &#x201C;doing the right thing&#x201D; angle alone. In Australia, the number of women in leadership roles is steadily declining, with only a small percentage of organisations taking a strategic approach to close the gender remuneration gap and support flexible working alongside other initiatives.</p>\n\n<p>DCC clients go through a screening process to ensure they support DCC&#x2019;s vision of creating better ways of working. Launched in May 2015, DCC is advertising roles across a variety of sectors with a strong focus on ICT; clients advertising tech roles include EMC, PwC, Origin Energy, ThoughtWorks and Dropbox.</p>\n\n<p>Both founders&#xA0;are very active in the diversity and inclusion community &#x2013; Gemma&#xA0;a is a board member of IT Queensland and Females in IT &amp; Telecommunications (FITT) and Valeria has served on the FITT committee for two years prior to DCC and continues to volunteer her time to support various industry groups nationally.</p>\n\n<p>DCC works hard to raise the profile of companies who provide great workplaces for women and shares stories and commitment from industry leaders,&#xA0;through digital campaigns like the <a href=\"http://www.diversecitycareers.com/page/companies-we-endorse/leaders-for-gender-diversity/\">Australian Leaders in Gender Diversity</a> campaign and events such as this week&#x2019;s <a href=\"http://www.arnnet.com.au/article/588603/flexible-working-workplace-gender-diversity-all-about-productivity-panel-20-photos/\">&#x201C;Driving a Strategic Approach to Flexibility&#x201D;</a><a href=\"http://www.arnnet.com.au/article/588603/flexible-working-workplace-gender-diversity-all-about-productivity-panel-20-photos/\" target=\"_blank\"> </a>luncheon with The Workplace Gender Equality Agency and sponsored by GHD, Dropbox and ThoughtWorks.</p>\n\n<p>The women also provide support to female candidates through a range of events, webinars and free resources on topics such as personal branding, negotiation skills and&#xA0;other&#xA0;areas of professional development.&#xA0;</p>\n\n<p><em>&#x201C;We are absolutely thrilled to join the WIICTA finalists and congratulate all the talented women across the categories, and look forward to driving the diversity agenda forward with the support of our clients and partners!&#x201D;</em> said Gemma Lloyd, DCC Co-founder.</p>\n\n<p>For a full list of finalists, please visit the ARN website: <a href=\"http://www.arnnet.com.au/womeninict/\" target=\"_blank\">http://www.arnnet.com.au/womeninict/</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2015/11","associated_company":"work180"}