{"url":"https://www.work180.com.au/blog/2017/06/domestic-violence-is-a-workplace-issue","title":"Domestic Violence is a Workplace Issue","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/domestic-violence-is-a-workplace-issue/\" target=\"_blank\">Femeconomy</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Alison Blyth, Director and Principal Lawyer at&#xA0;<a href=\"https://www.outsidelegalsolutions.com.au/\" target=\"_blank\">Outside Legal Solutions</a>&#xA0;knows from experience that if victims of domestic violence (generally women) cannot work because they are scared, injured or unsafe, there are consequences for their ability to support themselves and their families. This may mean they have no other option but to return to&#xA0;a violent relationship.</p>\n\n<p>She&#xA0;was involved&#xA0;in the drafting of the 2016 Qld Law Society Domestic and Family Violence Best Practice Guidelines for use by lawyers in their client dealings.</p>\n\n<p>Alison&#xA0;has contributed a guest post, based on her experience in this area, to raise awareness of impacts of workplace support on domestic violence victims.</p>\n\n<p><em>&#x201C;After four attempts, I left a violent marriage and took my two year old to live in a friend&#x2019;s carport, a temporary safe house till I could save enough for bond on accommodation. I still worked at the same place.</em></p>\n\n<p><em>One day my ex-husband staked out my work and followed me in. He picked up the receptionist&#x2019;s monitor and whilst screaming, threw it at me. My boss asked him to leave and then called me into his office and threatened me with dismissal if that ever happened again. I felt so ashamed. I had nowhere to go and a child to care for.&#x201D;</em></p>\n\n<p>~ Domestic Violence survivor, 1993</p>\n\n<p>&#xA0;</p>\n\n<p><strong>We do not like to bring our personal problems to work. But if we are experiencing domestic violence, it can be impossible not to.</strong></p>\n\n<p>Whether we are a victim, a carer, or a perpetrator, domestic violence can affect our physical and mental capacity to do our job. It can make us scared and sick, and diminish our performance and productivity. The cost of this physical and mental incapacity to do our job is reflected in the numbers.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>According to a&#xA0;<a href=\"http://www.dss.gov.au/sites/default/files/documents/05_2012/vawc_economic_report.pdf\">KPMG Report</a>, domestic violence costs the Australian&#xA0;</strong><strong>economy</strong><strong>&#xA0;$13.6 billion per year and these costs may, without action, rise to around $15.6 billion in 2021-22.&#xA0;</strong>Which means, even if we fortuitously do not directly experience or see domestic violence, based on the substantial cost to our community and economy, we are impacted. Therefore, it is our problem. If we are not victims or perpetrators, then people we love, know and work with are.</p>\n\n<p>Workplaces, employees and colleagues, can look out for victims and guard against perpetrators. Workplaces are where we spend much of our lives. And they directly influence the attitudes, cultures and behaviours that can lead to violence. They can promote or demote equality and respect.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Enabling victims of domestic violence to stay in the workplace to keep their incomes and financial independence is the greatest predictor of whether victims stay, leave or go back to an abusive relationship.</strong></p>\n\n<p>As&#xA0;Judith Lewis Herman states in&#xA0;<a href=\"https://www.bookdepository.com/Trauma-and-Recovery-Judith-Lewis-Herman/9780465061716?redirected=true&amp;utm_medium=Google&amp;utm_campaign=Base1&amp;utm_source=AU&amp;utm_content=Trauma-and-Recovery&amp;selectCurrency=AUD&amp;w=AF45AU9S572PKHA80C7JAC5H&amp;pdg=kwd-105117711219:cmp-680104063:adg-35441289072:crv-151945028117:pid-9780465061716:dev-c&amp;gclid=CjwKEAjw9MrIBRCr2LPek5-h8U0SJAD3jfhtgeyMfkp3IyV7nfqSvm6z0yIE2GZhlYLmGTr9Ia23rhoCkajw_wcB\" target=\"_blank\">Trauma and Recovery</a>: &#x201C;The guarantee of safety in a battering relationship can never be based upon a promise from the perpetrator, no matter how heartfelt. Rather, it must be based upon the self-protective capability of the victim. Until the victim has developed a detailed and realistic contingency plan and has demonstrated her ability to carry it out, she remains in danger of repeated abuse.&#x201D;</p>\n\n<p>Workplaces, which adopt a proactive and supportive approach to domestic violence victims, can empower victims to have &#x201C;detailed and realistic contingency plans&#x201D;.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>There are simple responses and strategies workplaces can implement to support victims of domestic violence.</strong></p>\n\n<ul>\n\t<li>Promote respectful relationships and challenge inappropriate behaviour: from the boardroom to the checkout.</li>\n\t<li>Develop and communicate a Code of Conduct and Policy regarding domestic violence. Make the policy available to everyone.</li>\n\t<li>Recognise signs of violence and respond appropriately. A safe and supportive workplace for victims can make all the difference.</li>\n\t<li>Consider workplace safety and emergency procedures.</li>\n\t<li>Don&#x2019;t discriminate. Maintain privacy and confidentiality.</li>\n\t<li>Provide resources that give guidance on what to do.</li>\n\t<li>Refer employees&#xA0;to professional assistance such as an employee assistance program provider.</li>\n\t<li>Suggest or help&#xA0;with safety planning such as a security escort to a car.</li>\n\t<li>Offer flexible work arrangements and an extension of paid or unpaid leave.</li>\n</ul>\n\n<p><a href=\"http://bit.ly/2o4JSkF\" target=\"_blank\">It is easy to find out if a DCC Endorsed Employer for Women&#xA0;</a><a href=\"http://bit.ly/2o4JSkF\" target=\"_blank\">ha</a>s<a href=\"http://bit.ly/2o4JSkF\" target=\"_blank\">&#xA0;a domestic violence policy.&#xA0;</a>Simply choose a company and look at their workplace initiative grid, placed at the end of each company profile. The information is provided along with much more.&#xA0;</p>\n\n<p><strong>IF YOU NEED ASSISTANCE IN AUSTRALIA PLEASE CALL THE NATIONAL DOMESTIC VIOLENCE HELPLINE: 1800 737 732 OR 1800RESPECT.</strong></p>\n\n<p><strong>IN AN EMERGENCY CALL TRIPLE ZERO.</strong></p>\n\n<p>&#xA0;</p>\n\n<p><strong><img alt=\"\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/Alison-Blyth-Headshot-20170512-150x150.jpg\" style=\"float:right; height:150px; margin-bottom:10px; margin-top:10px; width:150px\"></strong></p>\n\n<p><strong>Alison Blyth is the Director and Principal Lawyer at&#xA0;<a href=\"https://www.outsidelegalsolutions.com.au/\">Outside Legal Solutions</a>.</strong></p>\n\n<p>Outside Legal Solutions&#xA0;provide on-demand and affordable legal counsel for businesses that need increased in-house legal capacity or expertise, for temporary periods, without the overheads, as well as outside legal review of communications, compliance or process.</p>\n\n<h4>About Femeconomy</h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/06","associated_company":"work180"}