{"url":"https://www.work180.com.au/blog/2016/07/dont-settle-for-the-first-offer-top-tips-for-negotiating-a-salary","title":"Don’t settle for the first offer- top tips for negotiating a salary","author":"WORK180","body":"\n\t\t\t\t\t<p>Congratulations! After what seems like a gruelling and intensive interview process, you&#x2019;ve finally been told you&#x2019;ll be receiving a job offer. You can&#x2019;t wipe the smile off your face or shake the excitement that has over taken you&#x2026;until the offer arrives&#x2026; Wait, how can this be? It&#x2019;s $10k less than what you thought would be offered! But hey, the role is with a fantastic company and exactly what you wanted, so you take the offer and tell yourself that as soon as they see how great you are in the job, surely they&#x2019;ll give you the wage you deserve right? Wrong.</p>\n\n<p>The wage gap in Australia between males and females currently stands at around 18%. There are many factors that contribute to this, but one of those comes down to that as females, we typically don&#x2019;t have confidence to negotiate our salaries the same way men do. Even straight out of university, the wage gap in Australia between males and females is 7%, a shocking statistic considering this is before women leave to have children and take a break from work.</p>\n\n<p>Negotiating a salary can seem intimidating to some people, but you owe it to yourself to ensure you&#x2019;re paid as you should be by your employers. Below are 5 important tips on how to do this:</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>1. Research</strong></h4>\n\n<p>Before you&#x2019;re even offered the position, you should research the market rate of the job you are going for, which is fairly easy to do online. When doing your research, look for comparison for not only the job title, but location and size of company. If you know anyone currently working in the company you are applying for, ask them if they know what the salary averages are.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2. Know what&#x2019;s important to you</strong></h4>\n\n<p>Many of us are willing to compromise on salary for the right role and benefits. Make a list of what&#x2019;s important to you- whether that be flexible hours, bonuses, learning opportunities or ability to work from home. Know what your bottom line is, perhaps you can accept less salary if the role has other great benefits.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3. Don&#x2019;t sell yourself short</strong></h4>\n\n<p>During the interview process, it&#x2019;s likely you&#x2019;ll be asked what salary you&#x2019;re looking for. If asked that question, put it back on the interviewer and explain it&#x2019;s dependent on the role. Ask for the salary range that they are looking to offer. That way you&#x2019;ll know what numbers you have to work with during the negotiation.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>4. Be confident and know your achievements</strong></h4>\n\n<p>As females, we can often be quite modest, particularly when it comes to selling yourself and talking about your achievements. It&#x2019;s really important to outline your achievements during the interview process. That&#x2019;s not just crucial to getting the job offer, but also ensures the organisation understands your value and makes it easier when negotiating your salary.&#xA0;</p>\n\n<h4><strong>5. Understand the expectations for the role</strong></h4>\n\n<p>Asking what your KPI&#x2019;s are or what milestones you&#x2019;re expected to achieve is very important during the interview process. Once you know this, you can explain to the interviewer that these are very similar to the expectations of your previous role and give real examples of when you&#x2019;ve exceeded expectations. This will also put you on the front foot to ask for a higher salary.</p>\n\n<p>The most important thing to remember when negotiating your salary is that employers expect it. Don&#x2019;t be afraid, be confident and believe in yourself. By doing solid research and backing up your negotiations with market facts and examples of your achievements, you&#x2019;re putting yourself in a great position to ask for more. Finally, during a negotiation, know when to say yes. If your future employer has increased their offer, don&#x2019;t be too aggressive with trying to get more and more.</p>\n\n<p>With the pay gap in Australia between males and females around 18%, it&#x2019;s important that we step up and start asking for more. There are some great organisations that actively address salary differences to ensure gender equality.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Diverse City Careers &amp; Women in Digital present: Asking for a Raise</strong></h4>\n\n<p>Join us in Brisbane on the 20th July to learn about how to ask for a raise and get it with Matt Wallaert, behavioral scientist and creator of GetRaised.com, a free tool that has helped women in the US earn over $2.3B in raises&#xA0;<a href=\"http://divercitycareers.us10.list-manage.com/track/click?u=b7edcb910bf084d8a89d1c86f&amp;id=256a344e51&amp;e=34ee2a59f6\" target=\"_blank\">Book here.</a></p>\n\n<h4>Presenter</h4>\n\n<p>Matt Wallaert is a behavioral psychologist and entrepreneur focused on building products and programs that create behavior change to help people lead better, happier lives. &#xA0;He is currently based in New York as a Global Director of Microsoft&#x2019;s Startup and Accelerator programs, where he uses psychology to build products that enable people to take action on their ideas, questions, and desires.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2016/07","associated_company":"work180"}