{"url":"https://www.work180.com.au/blog/2017/12/employers-take-note-heres-what-employees-really-want","title":"Employers Take Note: Here's What Employees Really Want","author":"WORK180","body":"\n\t\t\t\t\t<p>One of the most enjoyable and rewarding coaching assignments I have had this year was with a new leader. She had just been promoted to run a large division within a national firm and therefore decided to engage in coaching. My client wanted to ensure she established an executive presence, and to increase the performance and collaboration of her new team. In this case, the client herself initiated the coaching, something that some of my other clients, with the benefit of hindsight, wished they had negotiated at pivotal points in their careers.</p>\n\n<blockquote>\n<p>It made me ponder, when salary review occurs or people are promoted into senior executive positions what elements are they wishing for in their new salary packages?</p>\n</blockquote>\n\n<p>When I began my career as an organisational psychologist I worked at Mercer in their consulting team with a focus on remuneration consulting. Although my passion was never designing pay scales, the work gave me a detailed understanding of how jobs are sized and pay ranges are determined. Irrespective of the industry in which you work, your pay is influenced by scope and complexity of the decision making for which you are accountable. Ie &#x201C;where the buck stops&#x201D;. Whilst we may not be like the super models of the 90&#x2019;s who wouldn&#x2019;t get out of bed for less than $10,000 a day, if we are perfectly honest with ourselves, when we are not &#x201C;paid&#x201D; what we believe we are worth <a href=\"http://onlinelibrary.wiley.com/doi/10.1002/job.377/abstract\" target=\"_blank\">our motivation and discretionary effort </a><a href=\"http://onlinelibrary.wiley.com/doi/10.1002/job.377/abstract\" target=\"_blank\">decreases</a>.</p>\n\n<p>Increasingly, employers are realising that pay is not just about money in the bank. In order to attract and retain staff, employers are getting creative and as a result there has been a rise in personalised salary benefits. A recent Mercer survey found that <a href=\"https://www.mercer.com.au/our-thinking/career/benchmarking-surveys/rise-of-personalised-benefits.html#contactForm\" target=\"_blank\">employees see benefits as their second highest priority after, actual pay.</a> &#xA0;As to be expected, they also found that there is a great deal of individual difference in the types of benefits people want and they believe personalised salary packages are the future. There are often interesting stories in the news of &#x2018;salary packaging&#x2019;.&#xA0;&#xA0;An American&#xA0;fast food&#xA0;chain, allows its staff to<a href=\"https://www.businessnewsdaily.com/5134-cool-job-benefits.html\"> take time off to attend their children&#x2019;s events and activities,</a> a PR firm offers its staff <a href=\"https://www.businessnewsdaily.com/5134-cool-job-benefits.html\">free financial education classes</a>.&#xA0; The CEO of Evernote <a href=\"http://thenextweb.com/insider/2012/04/09/sweet-if-you-work-for-evernote-you-get-your-house-cleaned-twice-a-month-and-unlimited-vacations/\">gives his staff a home cleaner every two weeks</a>.</p>\n\n<p>These initiatives, in my opinion, are not really perfect, as they are based on assumptions around what matters to people. The psychology of individual differences, research on motivation, and supportive leadership (to name a few) emphasise the fact that not all employees are motivated by the same things or share the same values as each other.</p>\n\n<p>The challenge for you as leaders when meeting employee needs is to ensure equity whilst meeting bespoke demands. If you fail at this challenge <a href=\"https://www.aonhewitt.com.au/Home/Hot-topics/Enabling-transparency-in-reward-communications?utm_source=GaggleAMP-Aon%27s%20Visible%20Experts&amp;utm_medium=LinkedIn%20(GaggleAMP)&amp;utm_campaign=AU%20-%20Reward%20(GaggleAMP)&amp;utm_content=employees-are-showing-increased-expectations-for-transparency-ar-1177562\" target=\"_blank\">then your initiatives will cause more trouble than they are worth</a>. In addition, the benefits/perks that are being considered should also align to the real (not aspirational) values you want to encourage in your organisation.</p>\n\n<blockquote>\n<p>As you all know a good leader doesn&#x2019;t make decisions based on assumptions, rather they will regularly catch up with their staff and create an environment conducive to open conversations around meaningful workplace benefits.</p>\n</blockquote>\n\n<p>Encourage such discussions at times when the employees&#x2019; life circumstances change, career goals are being defined, times of promotion and/or significant change in role. &#xA0;The more you are on the front foot with these discussions<a href=\"http://onlinelibrary.wiley.com/doi/10.1348/096317905X36731/full\" target=\"_blank\"> the less likely your staff will feel the need to resort to Oliver Twist style pleading</a> should they want a bit &#x2018;more&#x2019; in their salary package.&#xA0;</p>\n\n<p>The famous scene in &#x201C;Oliver Twist The boy who asked for more&#x201D;.</p>\n\n<div><iframe allow=\"encrypted-media\" allowfullscreen frameborder=\"0\" gesture=\"media\" height=\"480\" src=\"https://www.youtube.com/embed/BbdNgbCOq_s\" width=\"100%\"></iframe></div>\n\n<p>&#xA0;</p>\n\n<p><em>Please contact me directly to discuss how to effectively negotiate one of </em><em>my&#xA0; bespoke</em><em> coaching packages for yourself, or your leadership team.</em><br>\n&#xA0;</p>\n\n<p><strong>About the author:</strong><br>\nAt the end of my Masters degree in Organisational Psychology a friend told me the best place to work is &#xA0;&quot;wherever you can find a good boss&quot;. As an&#xA0;Executive&#xA0;Coach my role is to help my clients be &#x2018;excellent bosses&#x2019;, so that they and their direct reports all&#xA0;bounce out of bed excited about their day at work. &#xA0;My 20 year career as an organisational psychologist has been driven by a belief that we spend so much time at work it should be an enjoyable, challenging and energising experience.&#xA0;</p>\n\n<p><strong>Contact:</strong><br>\n0400 808 492<br>\n<a href=\"mailto:tamar@balkincoaching.com.au\">tamar@balkincoaching.com.au</a><br>\n<a href=\"http://www.balkincoaching.com.au\" target=\"_blank\">www.balkincoaching.com.au</a><br>\n<a href=\"https://twitter.com/tamarbalkin\" target=\"_blank\">twitter: @tamarbalkin&#xA0;</a><br>\n<a href=\"http://www.linkedin.com/in/tamarbalkin/\" target=\"_blank\">www.linkedin.com/in/tamarbalkin/</a></p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["job seeking tips","Career Development"],"upload_date":"2017/12","associated_company":"work180"}