{"url":"https://www.work180.com.au/blog/2016/09/employer-branding-number-youredoingitwrong","title":"Employer Branding: #YoureDoingitWrong","author":"WORK180","body":"\n\t\t\t\t\t<p>&#xA0;</p>\n\n<p>Someone recently told me, &#x201C;The war on talent is over, the talent has won.&#x201D;</p>\n\n<p>Whilst sounding mildly cheesy, this statement holds a lot of truth.</p>\n\n<p>CEOs, Executives, Managers, HR and Recruitment teams all realise how critical hiring good people is, but finding it more difficult than ever with the current competitive employment landscape and skills gap.</p>\n\n<p>Since the 1990&#x2019;s when the concept of employer branding (and the employee value proposition (EVP)) originated, it has moved from being the responsibility of HR/Recruitment, to then Marketing and now for many organisations, the CEO.</p>\n\n<p>At&#xA0;Diverse City Careers&#xA0;(DCC), our main product is our exclusive jobs platform, but a large part of what we do is assist organisations strengthen their employer brands (specifically aimed at female candidates). We&#x2019;ve seen employers doing some great things around promoting their EVP, but we&#x2019;ve also seen many with the right intentions, but missing the mark.</p>\n\n<p>Social media plays a critical role in communicating the employer brand, and organisations have recognised they need more than recruiters alone evangelising why the organisation is a great place to work. Marketing teams are now collaborating with recruitment to push out the messaging via digital channels. Social channels are being used to share employee stories, community activities the organisations are participating in and highlighting strengths and authenticity via content.</p>\n\n<p>Producing interesting and attention grabbing content isn&#x2019;t easy, and one of the biggest mistakes we see companies make (and I&#x2019;m sorry if this is going to sound harsh) is thatNo-one cares about why Jane (your employee) likes working at XYZ Pty Ltd (your company).</p>\n\n<p>At DCC, one of the ways we achieve success for clients who hire talented women through DCC, is by sharing what it&#x2019;s like to work with them. We&#x2019;ve been asked countless times how the content we produce about being an employee, yields a much greater engagement rate than some of the content put together internally by a company. The answer is simple- when we produce content, we write not with the employee or the company in mind that we&#x2019;re promoting. We write the content with the READER in mind.</p>\n\n<p>Can you honestly say, if you saw an article pop up on your LinkedIn feed titled &#x201C;read all about why Jane likes working at XYZ Pty Ltd&#x201D; you&#x2019;d click on it? I might click on it if I knew Jane personally&#x2026;or if I was already considering XYZ Pty Ltd as a company to work for. Other than that, no chance.</p>\n\n<p>However, if I saw an article pop up on my LinkedIn feed and I thought it was going to educate me and help me develop professionally or personally, I&#x2019;d certainly click on it.</p>\n\n<p>For example, the DCC audience consists of women in the workforce and we know (through experience, surveys and discussions) they&#x2019;re interested in topics such as building confidence, professional development, negotiation and navigating traditionally masculine industries. Therefore, when we write content, we tell stories about the women that work at the companies, but with the topics our audience is interested in as the main theme. The end result is that women read the articles to learn something from other women and end up exploring what it&#x2019;s like to work with a company at the same time. Our clients are very supportive of women&#x2019;s careers and are doing great things both internally and within the industry so there&#x2019;s always great material to cover, which in turn promotes them as an employer of choice for women.</p>\n\n<p>Here are two examples:</p>\n\n<p>Caltex-&#xA0;<a href=\"https://www.diversecitycareers.com/page/companies-we-endorse/caltex/life-at-caltex-deb-scown/\" target=\"_blank\">A how-to guide on taking yourself out of your comfort zone &#x2013; Deb&#x2019;s story</a></p>\n\n<p>AECOM-&#xA0;<a href=\"https://www.diversecitycareers.com/page/companies-we-endorse/aecom/life-at-aecom/life-at-aecom-sarah-dove/\" target=\"_blank\">6 steps for transitioning to working flexibly after maternity leave &#x2013; Sarah Dove</a></p>\n\n<p>Content written in this way yields incredible results compared to more traditional content pieces for employer branding. We&#x2019;ve seen these articles shared, liked and commented on by hundreds of women across social media and read by thousands, across Australia and internationally.</p>\n\n<p>This is just one of many improvements that we see can be made when it comes to standing out in the crowd with your employer branding strategy. In a time when the talent is winning, it&#x2019;s more important than ever.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/09","associated_company":"work180"}