{"url":"https://www.work180.com.au/blog/2016/09/equal-pay-day-is-over-what-now","title":"Equal Pay Day is over-what now?","author":"WORK180","body":"\n\t\t\t\t\t<p>September 8th&#xA0;was Equal Pay Day, marking the day when women&#x2019;s average earnings catch up to men&#x2019;s for the previous financial year. With many negative statistics surrounding this day in terms of the pay gap, less superannuation savings for women and only a small number of employers who are actively addressing these issues, we wanted to shine the spotlight on positive actions and share best practices from around the world.</p><p><br></p><p><strong>1. Putting their money where their mouth is</strong></p><p>After performing a comprehensive analysis of the salaries of more than 17,000 global employees, Salesforce identified that approximately 6% of employees (both female and male) required a salary adjustment, and spent nearly $3 million dollars to eliminate the differences in pay.</p><p>In Australia,&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/aecom\" href=\"https://www.diversecitycareers.com/aecom\">AECOM</a>&#xA0;has also invested in closing the gender pay gap and in the space of 12 months, reduced the gap by 3.4% across its 2,750 Australian&#xA0;employees.</p><p><br></p><p><strong>2. Banning an irrelevant question</strong></p><p>There&#x2019;s been lots of discussion around the need for employers to ask job applicants for their salary history, with Massachusetts making history recently by&#xA0;<a data-cke-saved-href=\"https://www.theguardian.com/us-news/2016/aug/02/massachusetts-equal-pay-law-women-salary-history\" href=\"https://www.theguardian.com/us-news/2016/aug/02/massachusetts-equal-pay-law-women-salary-history\">making it illegal</a>&#xA0;to do so. We&#x2019;ve seen a small number of companies adopt this locally too.</p><p>This&#xA0;<a data-cke-saved-href=\"http://www.forbes.com/sites/lizryan/2016/08/30/ten-reasons-it-should-be-illegal-to-demand-a-job-seekers-salary-history/?utm_content=bufferfa455&amp;utm_medium=social&amp;utm_source=linkedin.com&amp;utm_campaign=buffer#54e505d65fed\" href=\"http://www.forbes.com/sites/lizryan/2016/08/30/ten-reasons-it-should-be-illegal-to-demand-a-job-seekers-salary-history/?utm_content=bufferfa455&amp;utm_medium=social&amp;utm_source=linkedin.com&amp;utm_campaign=buffer#54e505d65fed\">article</a>&#xA0;lists the top 10 reasons why we should stop asking this question, and it&#x2019;s hard to argue against it. After all, questions with no clear relationship to a job-seeker&#x2019;s qualifications such as race, ethnicity, marital status, are prohibited by law. Previous salary details are also irrelevant to an applicant&#x2019;s ability to do the job, so why isn&#x2019;t that question in the same basket?</p><p><br></p><p><strong>3. Raising awareness within their industry and taking action to inspire others</strong></p><p>When McCullough Robertson participated in the DCC 2016 International Women&#x2019;s Day&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/page/about-us/campaigns/2016-iwd-pledge-for-parity-campaign/\" href=\"https://www.diversecitycareers.com/page/about-us/campaigns/2016-iwd-pledge-for-parity-campaign/\">#PledgeForParity campaign,</a>&#xA0;Guy Humble, (Business Unit Leader for Litigation and Disputes Resolution and Chair of Diversity Committee) voiced his concern at the gender pay gap of 34.3% within the legal industry. McR was addressing this through additional superannuation payments for women on maternity leave and Guy asked other firms to consider this. &#xA0;More recently, Guy shared how McR is constantly challenging its diversity blind spots that ultimately lead to unbalanced options for women such as gender pay gaps and an ability for women to move into partnership. &#x201C;McR are proud of our recent promotions, where 10 females were promoted to senior positions but know that our drive and commitment must continue,&#x201D; said Guy.</p><p><br></p><p><strong>4. Not taking advantage of women who&#x2019;ve been previously underpaid</strong></p><p>When hiring women, AECOM compares their salary expectations to what their male peers at the company are receiving to make sure they are not selling themselves short. For example, if the company believed a senior engineer was worth $100,000 but a female applicant asked for a $90,000 salary because she had been underpaid in her past role, it would offer her $100,000.&#xA0;</p><p>A similar story was shared with us through Zendesk, where a female and male applicant was put forward by a recruiter, who asked the hiring manager if he was sure he wanted to pay the female the same amount as what the male was asking for, because previously, she was on $20,000 less. Zendesk&#x2019;s reply?</p><p>&#x201C;Just because she was getting underpaid in her last role,&#xA0;it doesn&#x2019;t mean we should continue that trend.&#x201D;</p><p>Whilst these are some fantastic examples of companies taking responsibility and doing their part to eradicate the gap, we need all companies to be doing this. The gap is currently estimated at taking 118 years to close.</p><p>For assistance on how to assess and address the gender pay gap within your organisation, check out the&#xA0;<a data-cke-saved-href=\"https://www.wgea.gov.au/lead/addressing-pay-equity\" href=\"https://www.wgea.gov.au/lead/addressing-pay-equity\">resources</a>&#xA0;available through our partners The Workplace Gender Equality Agency and BPW Australia, who&#x2019;ve just released an&#xA0;<a data-cke-saved-href=\"http://www.bpw-australia.org/\" href=\"http://www.bpw-australia.org/\">e-book</a>&#xA0;on this topic.</p><p>And if you&#x2019;re a job-seeker reading this, rest assured we&#x2019;ve done our own research before accepting clients to advertise on our site. This means that when&#xA0;<a data-cke-saved-href=\"/job-search\" href=\"/job-search\">applying for any job via DCC Jobs</a>, you can trust that it&#x2019;s with a company committed to ensuring equal pay for both women and men.</p><hr><p>We are proud to&#xA0;see many of DCC&apos;s Endorsed Employers featured on WGEA&#x2019;s&#xA0;<a data-cke-saved-href=\"https://www.wgea.gov.au/pay-equity-leadership/meet-our-pay-equity-ambassadors\" href=\"https://www.wgea.gov.au/pay-equity-leadership/meet-our-pay-equity-ambassadors\">Pay Equity Ambassador list</a>:<br><br><a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">Cbus, NAB, Rabobank, BP, Mercy Health, Aurecon, GHD, Clayton Utz, WMware, Accenture, ThoughtWorks, Henry Davis York, Deloitte, EY, Vicinity Centres, Commonwealth Bank, AECOM, PwC, Reserve Bank of Australia, Australian Super, AGL Energy, MSD, Robert Bird Group, QinetiQ, REA Group, Laing O&apos;Rourk, Ashurst, Altis Consulting, Arcadis, AMEX and BOQ</a>.<br></p><hr><h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/09","associated_company":"work180"}