{"url":"https://www.work180.com.au/blog/2017/08/female-leader-kate-morris-adore-beauty","title":"Female Leader, Kate Morris, Adore Beauty","author":"WORK180","body":"\n\t\t\t\t\t<p>Kate Morris, CEO and Founder of&#xA0;<a href=\"https://www.adorebeauty.com.au/\" target=\"_blank\">Adore Beauty</a>&#xA0;disrupted the beauty industry back in 1999, investing $12,000 to bootstrap her business, now turning over&#xA0;in excess of $10 million annually. She launched the venture from her Melbourne garage while&#xA0;an undergraduate student, at age 21. Her inspiration was her experience working on beauty counters at department stores, where she noticed that many female customers&#xA0;felt the cosmetics shopping experience was intimidating and realised this was a market opportunity.</p>\n\n<p>Kate is also a Non-Executive Director of the&#xA0;<a href=\"http://www.nora.org.au/\" target=\"_blank\">National Online Retailers Association</a>&#xA0;(NORA) and&#xA0;Co-Founder of&#xA0;<a href=\"http://findation.com/\" target=\"_blank\">Findation.com</a>, a crowdsourced database of matching foundation shades. By entering the shades they have used in the past, users can get recommendations of similar shades in brands they haven&#x2019;t tried.</p>\n\n<p>Kate has picked up a slew of awards during her 17 years in business, starting with being awarded Telstra Young Businesswoman of the Year, 2010. In 2015, she was a Vogue Women of the Moment, and also&#xA0;inducted into the Australian Businesswomen&#x2019;s Network Hall of Fame. &#xA0;In 2014, Kate&#xA0;won an Innovation Award, in the Telstra Business Women&#x2019;s Awards and in both 2015 and 2016 was named an&#xA0;Inside Retail Top 50 People in E-commerce. She is also a&#xA0;Class of 2017 inductee in EY&#x2019;s Entrepreneurial Winning Women program.</p>\n\n<p><strong>It took six years for Clarins to sell product on&#xA0;<a href=\"https://www.adorebeauty.com.au/\" target=\"_blank\">Adore Beauty</a>. In that time you said you &#x2018;kept the conversation going.&#x2019; what were your communication strategies for varying levels of the organisation and how often did you implement them?</strong></p>\n\n<p>First of all, I had to make sure I was communicating with the right person &#x2013; that is, the person with influence on decision making. That can be a battle in and of itself. From there, I find the most successful approach is to try and work out what you can do for them, rather than just focusing on what you want yourself. Ask what their challenges are and show you can help by offering value, no strings attached. Even just sending useful little tidbits of information can help to build a relationship.</p>\n\n<p><strong>The tech and marketing landscape has changed dramatically over the last 17 years. What are some of the opportunities you invested in which sparked significant growth for&#xA0;<a href=\"https://www.adorebeauty.com.au/\" target=\"_blank\">Adore Beauty</a>?</strong></p>\n\n<p>When I started, there was no broadband, no social media, and no smartphones. So it&#x2019;s been an ongoing process of continual investment to take advantage of the changes. Recently we have started using artificial intelligence to get faster results on A/B testing for design and feature changes on our site. We&#x2019;re also now processing more sales on mobile than on desktop, which is evidence of the successful improvements we&#x2019;ve made to our mobile experience.</p>\n\n<p><strong>Adore products are sold in over 200 countries thanks to a partnership with Borderfree. How are you shaping the brand online to cater for cultural influences?</strong></p>\n\n<p>We are at the very start of our journey in this respect! Fortunately, Australia&#x2019;s population is very multicultural, so many beauty concerns that we already address are the same across many cultures. If you look at our Instagram feed, for example, you can see that we do try hard to represent diverse beauty. We&#x2019;ve also recently ramped up our inventory of darker foundation shades so that everyone can find the right colour. It&#x2019;s a good start but something we need to keep working on.</p>\n\n<p><strong>You have had the unique experience of selling a 25% stake in your company to Woolworths and then buying it back. Before founders sell a stake in their company to a large corporate, what should they consider?</strong></p>\n\n<p>I really enjoyed working with Woolworths and have zero regrets about it. When two companies come together, of any size, you&#x2019;re always going to have two sets of values and visions; and even if they&#x2019;re in great alignment at the beginning, unfortunately, you can&#x2019;t always foresee what might happen to cause those to diverge. Plan for the best, but also think about what happens if it doesn&#x2019;t work out.</p>\n\n<p><strong>What has been your greatest challenge?</strong></p>\n\n<p>There have been many challenges over the years! Starting as a clueless 21 year old with no money was a pretty big one, as was having to convince the entire Australian beauty industry that e-commerce was a good idea. Currently, my biggest challenge is that we are growing much faster than we expected, especially in the last few months. Not a bad challenge to have, I suppose!</p>\n\n<p><strong>What are you most proud of?</strong></p>\n\n<p>I&#x2019;m really proud of my team. I can&#x2019;t tell you how thrilled it makes me see them step up to challenges, roll their sleeves up and dive in. Seeing people grow is like having the most wonderful and exotic garden just sprout up out of nowhere.</p>\n\n<p><strong>What&#x2019;s one piece of advice for future female leaders?</strong></p>\n\n<p>Be brave: think bigger, and then go for it. Don&#x2019;t sell yourself short by being realistic. I always try and ask myself, not &#x201C;can I?&#x201D; but &#x201C;HOW can I?&#x201D;</p>\n\n<p>This article was originally published by <a href=\"https://femeconomy.com/female-leader-kate-morris-adore-beauty/\">Femeconomy</a>.</p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"text-align:center\"><a href=\"https://femeconomy.com/submit-a-brand/\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f76a4cc-ab81-479a-999f-7c5c4b7e7ecb.jpeg\"></a><br>\n&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/08","associated_companies":["work180"]}