{"url":"https://www.work180.com.au/blog/2018/01/female-leader-linda-ryle-president-indigenous-lawyers-association-queensland","title":"Female Leader, Linda Ryle, President Indigenous Lawyers Association Queensland","author":"WORK180","body":"\n\t\t\t\t\t<p>Linda Ryle is currently&#xA0;<a href=\"http://www.indigenouslawyersqueensland.com.au/\" rel=\"noopener\" target=\"_blank\">President of Indigenous Lawyers Association Queensland</a>, an organisation that is completely&#xA0;financed through the volunteer efforts and fundraising of their Management Committee (not government funded). She is a strong and eloquent advocate for the rights of&#xA0;Aboriginal and Torres Strait Islander people within the justice sector. Linda&#x2019;s career has been devoted to ensuring that cultural intelligence and context is applied in consideration of Aboriginal and Torres Strait Islander people&#x2019;s representation within the legal system.&#xA0;</p>\n\n<p>Linda was Deputy Chair of the&#xA0;<a href=\"http://www.qls.com.au/For_the_profession/First_Nations_People#rap_launch\" rel=\"noopener\" target=\"_blank\">Queensland Law Society&#x2019;s Reconciliation Action Plan</a>&#xA0;(RAP) working group, and in August delivered the keynote speech at the RAP launch. The RAP exists to help bridge the gap between the underrepresentation of First Nations&#xA0;people in the Queensland legal profession, with their overrepresentation in the justice system.</p>\n\n<p>Linda has consistently worked, studied, volunteered and mentored concurrently since the late 1990s. As a trusted and respected leader, she has been instrumental as a communication liaison between the&#xA0;Aboriginal and Torres Strait Islander community and the legal profession. Linda is a proud Aboriginal woman of Birrigubba (Bowen Qld) and Kamilaroi (Monaro NSW) heritage and through tireless volunteering and advocacy works to amplify the voices and perspectives of Aboriginal women and provide equitable access to justice, education and economic advancement. Quite clearly, her remarkable legacy will translate directly to greater acknowledgement of cultural priorities and access to opportunity for First Nations people.</p>\n\n<h4>YOU DIDN&#x2019;T COMPLETE HIGH SCHOOL BUT IT HASN&#x2019;T STOPPED YOU FROM ACHIEVING IN YOUR CAREER. WHAT&#x2019;S YOUR ADVICE TO PEOPLE WHO WANT TO UNDERTAKE CAREER OPPORTUNITIES, BUT WHO FEEL LIKE LACKING A HIGH SCHOOL CERTIFICATE IS HOLDING THEM BACK?</h4>\n\n<p>Whatever it is that you would like to pursue, even if you know what that is, regard any barriers as a challenge and find the creative way to progress. This in itself can be an element to your character that will set you apart from the rest. Every journey considered should be just that, a journey &#x2013; not just a means to an end.</p>\n\n<p>Thought diversity&#xA0;can be lacking in many sectors. Creative intelligence and the audacity to creatively challenge the status quo is something worth pursuing. Don&#x2019;t just accept the way things are if they&#xA0;only adequately serve the current purpose. Always ask&#xA0;<em>why?</em></p>\n\n<p>Never be told that you are overqualified &#x2013; there is no such thing! Embrace the ideas of others, different onotologies, epistemologies, and hermeneutics (ways of being, knowing and interpreting). Constructively challenge the legacy systems you inherit and embrace the excitement new technology brings. Continued education and life long learning is the key to a well balanced, open minded and well informed life.</p>\n\n<p>In the professional context I am of the belief that a simple Law Degree is no longer enough. Academically equip yourself thoroughly and tackle the problems of equity and justice with just enough fear to keep you honest and focussed.</p>\n\n<h4>HOW HAS THE EXPERIENCE OF GROWING UP IN NORTHERN QUEENSLAND AND NEW ZEALAND, AND WORKING IN HOSPITALITY AND RETAIL, HELPED SHAPE THE LEADER YOU ARE TODAY?</h4>\n\n<p>My experiences growing up have always served to remind me that, a job, wealth or possessions do not define a person. How you treat others is the key to your worth. My early years in hospitality provided very clear experiences about how the apparent &#x201C;well to do&#x201D; treat service staff (and those they consider beneath them). I have always endeavoured to never treat anyone as lesser.</p>\n\n<p>Treat others how you would like to be treated and always remember that&#xA0;when conflict arises, consider carefully whether you have all the facts and find out if the other side knows something you don&#x2019;t. Challenge your own perspectives first.&#xA0;</p>\n\n<p>Group think is infectious and insidious &#x2013; avoid it at all costs! Below is a poster I have on my home office wall.</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a2081ff1-1a12-4732-b606-c1d36072a152.jpeg\"></p>\n\n<h4>TELL US ABOUT YOUR BARRISTER MENTOR AND HOW THIS CHANGED YOUR CAREER PATH.</h4>\n\n<p>Kevin Rose is a Barrister who has worked with Aboriginal and Torres Strait Islander communities across Queensland for many years.</p>\n\n<p>I first worked with Kevin in Bowen when he was based in Townsville in 1999. Kevin then moved to Mackay with the MATSICLAS (Mackay Atsils) and would also travel to Bowen to assist with our local legal service clients. In those days there were 13 separately operating ATSILS corporations. Kevin and I also worked closely with then Barrister (now Magistrate) Damien Dwyer. We three were the legal team responsible for the only District Court matter in Bowen to return an acquittal, at that time&#xA0;(after a second local&#xA0;trial was ordered).</p>\n\n<p>Kevin was the professional responsible for encouraging me to enter the study of law.&#xA0;I came to Brisbane and stayed with Kevin&#x2019;s cousin and her family.&#xA0;Kevin&#x2019;s cousin was married to Zach Sarra and they had two daughters. They accepted me as a guest in their home at Highgate Hill in about 2001 or 2002.</p>\n\n<p>Kevin and I worked with extremely high numbers of Aboriginal young people and others from the town. We did much more than criminal work. And often used our extensive networks of family and friends to secure work and accommodation for our clients. Many, many hours were spent in watch house cells over weekends, and the 24/7 on-call hours sometimes appeared to never end. Kevin married a Townsville Murri girl and their wedding was attended by many of the local North Queensland profession.</p>\n\n<p>I have many stories of the insightful interpretations Kevin had on client&#x2019;s behaviour&#xA0;(which he transformed into court submissions &#x2013; many being very entertaining!). Kevin&#x2019;s bizarre sense of humour I have yet to experience since. Kevin has been a&#xA0;key influence in my ability to interpret matters in an alternative fashion. His example from the early days taught me to reconsider, reconsider and then reconsider again. Toowoomba is, in my view, very fortunate to have a professional of such depth looking out for their justice interests.</p>\n\n<p>Kevin&#x2019;s humanity and commitment to our communities is only further enhanced by the absolute character that he is.&#xA0;Kevin assisted me to believe that the law could make a difference to ordinary people and reinforced the thinking my mother instilled in me. That I should never feel excluded.</p>\n\n<p>Beyond those early days to times more recent, I have encountered a wide range of individuals in all sorts of circumstances. The most difficult times I have ever experienced have been when people I respected and thought I could trust to be honest, I have found to have fallen a long way short of my expectations.&#xA0;<em>Trust</em>&#xA0;is big ticket item for me. Betrayal is fatal, (to the relationship and to my commitment to you),&#xA0;particularly if specifically orchestrated.&#xA0;It never ceases to amaze me just how apparently intelligent individuals&#xA0;quickly and completely submit to flawed, popularist thinking.</p>\n\n<h4>WHAT ARE SOME OF THE ABORIGINAL LEGAL SERVICES AND COURTS&#x2019; ACHIEVEMENTS DURING YOUR TIME WITH THESE SERVICES, AND WHAT DO YOU BELIEVE STILL NEEDS TO CHANGE?</h4>\n\n<p>Aboriginal and Torres Strait Islander Lawyers are too few in number and fewer in the higher realms of the profession. Aboriginal and Torres Strait Islander people make up the majority of all law and justice clientele (simply based upon the numbers that end up incarcerated). And yet the profession and associated service providers&#xA0;appear to be all but bereft of real tenured cultural intelligence (CQ). There are too few First Nations people in the positions where key decisions are being made.&#xA0;Diversity and Inclusion cannot be left to Government. The corporate sector and the professions need to take the lead in this space.</p>\n\n<p>Much research supports the&#xA0;existence of&#xA0;a clear and definite business case to support diversity. This includes not just gender diverse business environments but thought diversity and cultural intellect across the board.&#xA0;</p>\n\n<p>ASX20 corporations in Australia have improved upon their female Board of Directors metrics from just 9% in 2009 to closer to 30% in 2016, and this is great work. But I wonder just how many of those women are Aboriginal or Torres Strait Islander women &#x2013; not too many I would wager.</p>\n\n<h4>WHAT HAS BEEN YOUR GREATEST CHALLENGE?</h4>\n\n<p>Being heard. Aboriginal women are the most disregarded, misrepresented and silenced sector of our contemporary society. Those intelligent, socially conscious First Nations women who dare to challenge the status quo to effect positive change are constantly demonised or dismissed as angry black women.</p>\n\n<p>Modern Australia consistently fails to recognise the strength, tenacity and resilience of Aboriginal women. It was our women that have carried our families through the generations of despair and continue to do so in the most challenging of all human environments. More credit is due to our Aboriginal women, Australia.</p>\n\n<h4>WHAT ARE YOU MOST PROUD OF?</h4>\n\n<p>I don&#x2019;t think I have done that yet, I am just getting up to par with the rest of you (apparently). I was told by others &#x2013; outside my immediate family &#x2013;&#xA0;from a very early age that Aboriginal women are dirty, cannot raise good&#xA0;well balanced children, cannot get and keep a decent job, cannot pay their way, are not to be trusted, loose with their affections and prone to addictions.</p>\n\n<p>I&#x2019;m very house proud, have raised an honest,&#xA0;respectful son who works hard. I have a solid and growing tertiary education, I have always earned an honest living, I pay my bills as and when they are due. I&#x2019;m considered in my decision making. My husband and I are committed to each other and I assist others at every opportunity, including through formal volunteering.</p>\n\n<h4>WHAT IS ONE PIECE OF ADVICE FOR FUTURE FEMALE LEADERS?</h4>\n\n<p>Don&#x2019;t underestimate the&#xA0;perspectives and advice of the&#xA0;Aboriginal women in your family, social and business community. If you bother to&#xA0;take the time, you may be surprised just how much we have to&#xA0;offer. But be considered in your approach. Tokenism is offensive &#x2013;&#xA0;as is the case across other sectors, being an Aboriginal woman, alone, can never be enough.</p>\n\n<p>Ask yourselves constantly if you are being completely true to diversity and inclusion. Just how much have you considered (and accommodated) the perspectives and teachings that Aboriginal Women could bring to your table (from the kitchen table to and including the Boardroom table)?</p>\n\n<p>Diversity is much more than a gender issue.</p>\n\n<p>Always schedule date nights in your diary&#xA0;and make them not negotiable. You need time to remind yourself why and for whom you do what you do.</p>\n\n<p>It is always important to find time to do the things, that are not business or profession related, preferably away from your computer and devices. For me that is being in the company of Mother Nature, especially gardening.</p>\n\n<p>To my First Nations Sisters &#x2013; shake off the fear that comes with the so called &#x201C;big noting&#x201D; aka &#x201C;Tall Poppy Syndrome&#x201D;, do not tolerate the lateral violence that does its best to hold you back.</p>\n\n<p>Never compromise your integrity and always call out the wrongs for what they are. Embrace and enjoy your successes and share them as you like.</p>\n\n<p>Do not be beholden, in any way, to those who do not love, respect and support you. You are beautiful, you are clever and I&#x2019;ve got your back!</p>\n\n<p>Also, &#x201C;Every girl needs a financial plan&#x2026;and a man is not a financial plan&#x201D;. I don&#x2019;t know where I got this but I absolutely believe it!</p>\n\n<p><em>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/female-leader-linda-ryle/\" target=\"_blank\">Femecoonomy.</a></em></p>\n\n<p><em><a href=\"https://femeconomy.com/female-leader-linda-ryle/\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce943d5d-7fb6-447d-9d6c-c5ebf14c71e1.jpeg\">&#x200B;<br>\n&#x200B;</a></em></p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2018/01","associated_companies":["work180"]}