{"url":"https://www.work180.com.au/blog/2018/04/female-leader-emily-duggan-australian-racing-car-driver","title":"Female Leader, Emily Duggan, Australian Racing Car Driver","author":"WORK180","body":"\n\t\t\t\t\t<p>When&#xA0;<a data-cke-saved-href=\"https://www.emilyduggan.com.au/\" href=\"https://www.emilyduggan.com.au/\" rel=\"noopener\" target=\"_blank\">Emily Duggan</a>, Australian Racing Car Driver was preparing for her first race in 2014, to compete against an all male field, she called the Confederation of Australian Motor Sport (CAMS) to check with officials whether it was within the rules to allow a woman to compete. Fortunately, they confirmed there was no rule to exclude her, so her starting race was secured.</p><p>In an incredible story of following your dream, and doing everything in her power to accomplish it, Emily is now a winning race car driver. With no previous background in Motorsport racing, she has achieved her aspiration to race V8 Supercars based on hard work, determination and a healthy dose of self belief. As well as being a brave and fearless racer, she&#x2019;s a savvy businesswoman who&#x2019;s secured a number of sponsorship deals to support her in pursuing her racing ambitions.</p><p>2016 was Emily&#x2019;s breakout year, when she became the first female driver to race in the&#xA0;V8 Touring Car Series. She had several podium finishes in the Series X3 NSW category, winning the one-hour endurance race, recording 15 top-five finishes for the season and impressively finishing fifth overall in the championship.</p><p><a data-cke-saved-href=\"https://www.emilyduggan.com.au/\" href=\"https://www.emilyduggan.com.au/\" rel=\"noopener\" target=\"_blank\">Emily</a>&#xA0;was a Finalist in&#xA0;<a data-cke-saved-href=\"https://www.cosmopolitan.com.au/women-of-the-year/2017-cosmopolitan-women-of-the-year-awards-winners-24626\" href=\"https://www.cosmopolitan.com.au/women-of-the-year/2017-cosmopolitan-women-of-the-year-awards-winners-24626\" rel=\"noopener\" target=\"_blank\">2017 Cosmopolitan Woman of the Year</a>&#xA0;in the Sports category.</p><h4>YOU SAY YOUR DREAM HAS ALWAYS BEEN TO RACE V8 SUPERCARS. HOW DID YOU GET STARTED IN CAR RACING?</h4><p>As simple as I make it sound, I went out and brought a race car and entered my first race. Underlining it all was research into what category I could afford and was able to run in. And then making a strategic route to progress myself into Supercars. Starting out I didn&#x2019;t know much about the racing industry but I think that has been my blessing. I don&#x2019;t follow the rules or the typical steps of how to become a professional driver, I follow my gut.&#xA0;</p><h4>YOU WON THE 5TH MOTORSPORT&#xA0;RACE YOU COMPETED IN. TELL US THE STORY OF HOW YOU ACHIEVED THIS SO EARLY AFTER YOUR DEBUT INTO THE SPORT.</h4><p>I&#x2019;ve never had any fear when I race and I think that&#x2019;s the biggest part of being able to win a race. You need to be able to see a gap or a chance to make a move, and you need to make the move with commitment and confidence. I&#x2019;ve had a thirst to be at the pointy end ever since I started, and I&#x2019;ve had the belief in myself to say &#x201C;I can be there&#x201D;. That&#x2019;s the key I believe, having the belief and confidence to know you deserve to be where you want to be.&#xA0;</p><h4>AS THE FIRST FEMALE TO LINE UP ON THE GRID IN THE 2016 KUMHO V8 TOURING CAR SERIES, YOU&#x2019;RE A TRAILBLAZER AND LEADER FOR WOMEN IN YOUR SPORT. WHAT WOULD YOU LIKE YOUR LEGACY TO BE?</h4><p>Not following the typical route for a professional racing car driver I was often told &#x201C;I can&#x2019;t&#x201D; for what I believe was two reasons: 1. not growing up within Motorsport, and 2. for being a girl. Neither of these reasons seemed valid to me, so I pursed my dream anyway. I would love my legacy to be just that, for anyone that was ever told that they couldn&#x2019;t do something that they wanted, for she or he to know that they can.</p><h4>SPORT IS BIG BUSINESS. WHAT ARE SOME OF THE KEY BUSINESS CONSIDERATIONS IN THE V8 RACING INDUSTRY?</h4><p>Media attention and strategic exposure for brands, as the industry is televised and the 3rd most watched sport in Australia. Planning strategic partnership is very valuable as this can lead to longevity within the sport for myself, but also enhances a partnership brand&#x2019;s audience and likeability within the audience demographics. Partnerships with an athlete isn&#x2019;t purely about assisting the athlete, but planning and obtaining a return for the investment, through events and marketing. With the spotlight heavily on women in male sports its a marketer&#x2019;s dream!&#xA0;</p><h4>WHAT HAS BEEN YOUR GREATEST CHALLENGE?</h4><p>The greatest challenge would have to be holding onto resilience. I&#x2019;ve been knocked back and knocked down&#xA0;numerous times but you&#x2019;ve got to keep fighting for what you want to achieve. It&#x2019;s hard to hear a no or for someone to say you can&#x2019;t do it, but you learn to take it with a gain of salt as they say. I turn the negative into fighting power and use it to fuel the fire inside me that keeps the passion and determination alight. There isn&#x2019;t a easy way about it but as long as you keep your resilience up, you&#x2019;re bound to be successful.&#xA0;</p><h4>WHAT ARE YOU MOST PROUD OF?</h4><p>The small moments when a mother or father comes up to me and tells me that their kid watches what I do, and to hear that it&#x2019;s inspiring kids and/or adults to go after their own dreams. I&#x2019;m a big believer that people can do anything they set their minds to achieve. I know I am inspired by quite a few people, so when you hear that someone is inspired by what you do, it&#x2019;s a proud moment and I can&#x2019;t help but to smile.&#xA0;</p><h4>WHAT&#x2019;S ONE PIECE OF ADVICE FOR FUTURE FEMALE LEADERS?&#xA0;</h4><p>Trusting your gut and believing that you&#xA0;deserve&#xA0;to be where you want to be. This is for sport and in business: if you have an idea or process or anything that&#x2019;s never been done before, or in the way you think it should be done, trust you know what you are doing. You have to do things your way. Even if it hasn&#x2019;t been done that way before, it doesn&#x2019;t mean it can&#x2019;t be done. Believe and trust in yourself.&#xA0;</p><p>This post was originally published by<a data-cke-saved-href=\"https://femeconomy.com/female-leader-emily-duggan-australian-racing-car-driver/\" href=\"https://femeconomy.com/female-leader-emily-duggan-australian-racing-car-driver/\" target=\"_blank\">&#xA0;Femeconomy.</a></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About Femeconomy</strong></h4><p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/about/\" href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/category/female-leaders/\" href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p><p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p><p>Female leaders will&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/the-femeconomy-effect/\" href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce943d5d-7fb6-447d-9d6c-c5ebf14c71e1.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce943d5d-7fb6-447d-9d6c-c5ebf14c71e1.jpeg\"></p><p><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180&#xA0;is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" style=\"color: rgb(115, 207, 236); outline: 0px !important;\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2018/04","associated_company":"work180"}