{"url":"https://www.work180.com.au/blog/2017/01/female-leader-denice-pitt-ceo-online-education-services","title":"Female Leader, Denice Pitt, CEO Online Education Services","author":"WORK180","body":"\n\t\t\t\t\t<p>Denice Pitt CEO&#xA0;<a href=\"http://www.oes.edu.au/\" rel=\"noopener\" target=\"_blank\">Online Education Services</a>&#xA0;(OES) has held this position since the company formed in 2011. Her previous roles were&#xA0;President and Country Head of Aegis Australia, and Vice President of Operations, Chief Operating Officer and CEO of the UCMS Group Ltd, as well as National Customer Service Manager of Optus. She is a Non-Executive Director for Firbank Grammar and previous Non-Executive Director for Good Shepherd Microfinance.</p>\n\n<p>Under Denice&#x2019;s leadership, OES was named BRW Fastest Growing Company in 2015.&#xA0;It was also under her leadership that OES has been accredited as an Aon Hewitt Best Employer for four consecutive years and awarded the prestigious &#x2018;Best of the Best&#x2019; award in 2017. A values based leader, and gender equality advocate, Denice uses her role to create a work culture that values balance and outcomes over attendance.</p>\n\n<h4>HOW HAVE DIGITAL TECHNOLOGIES CHANGED EDUCATION OVER THE LAST TEN YEARS?</h4>\n\n<p>Online education is now part of mainstream teaching and learning. Most education institutions offer some form of online or blended teaching modes to students. This has enabled more people to access high quality education &#x2013; students want study to suit their lifestyle.</p>\n\n<p>Over the past decade, we&#x2019;ve seen widespread adoption of mobile devices, the proliferation of social media and a boom in start-ups, which has really matured the online education industry. This has allowed education to be more personalised to student&#x2019;s needs, meaning they can choose when, where and how they access their studies.</p>\n\n<p>This demand for education online means that the traditional ways of doing things have been reimagined to provide the best service to students in digital environments.</p>\n\n<h4>HOW DOES OES OPEN UP OPPORTUNITIES FOR A MORE DIVERSE GROUP OF STUDENTS TO HAVE ACCESS TO A QUALITY EDUCATION?</h4>\n\n<p>By working closely with our university partners,&#xA0;<a href=\"http://www.oes.edu.au/\" rel=\"noopener\" target=\"_blank\">OES</a>&#xA0;is able to provide access to more diverse learners by designing and delivering their high quality education for the digital environment to be accessible by more people.</p>\n\n<p>The impact of more accessible education has been a shift in the &#x2018;traditional student&#x2019;. Across the board, there are more women, part-time, mature-age, indigenous and first-in family Australians studying through us than what you would traditionally see on campus.</p>\n\n<p>Instead of people delaying or deciding against study due to being locked into a schedule, it is now possible to study straightaway due to the flexibility of online. People no longer have to leave a job to go to university, they can study when it suits them.</p>\n\n<p>Further education is imperative in today&#x2019;s knowledge-driven society and we are proud to be able to open up these opportunities for more people.</p>\n\n<h4>HOW DOES OES SUPPORT ONLINE STUDENTS?</h4>\n\n<p>Technology has enabled&#xA0;<a href=\"http://www.oes.edu.au/\" rel=\"noopener\" target=\"_blank\">OES</a>&#xA0;to have an entirely student-centric approach to education as we understand education is now 24/7. Our services are streamlined to meet the needs of the student. This means administration processes and support services are quick and personalised.</p>\n\n<p>Increasingly, students want the options for a self-service model supporting their education. They want the ability to do what they need to, right then and there. Particularly when they are busy or full-time workers &#x2013; they want to solve their problems instantly.</p>\n\n<h4>WHAT TRENDS WILL EMERGE IN ONLINE EDUCATION OVER THE NEXT DECADE?</h4>\n\n<p>More personalisation. We regularly talk to and survey students that study through us to ensure we are offering the best possible support and service. Through these discussions, we&#x2019;ve come to realise students are increasingly using mobiles for study.</p>\n\n<p>If you look at other industries, services have been fit for mobile for some time and, in some ways, education has lagged behind this uptake. However, as we see students demand quick and personalised services, it&#x2019;s important to meet these needs. This means using technology to make processes and services more efficient so students can focus on learning and leave the rest to us.</p>\n\n<p>At&#xA0;<a href=\"http://www.oes.edu.au/\" rel=\"noopener\" target=\"_blank\">OES</a>&#xA0;we work very hard to understand the needs of non-traditional students and how we can leverage technology to help them succeed. We know a high proportion of online students are leading busy lives and want to be able to optimise the time they have available to study.</p>\n\n<h4>WHAT HAS BEEN YOUR GREATEST CHALLENGE?</h4>\n\n<p>My career journey has had some great challenges. Looking back, I respect what I&#x2019;ve learned and have taken each experience as an opportunity to further my skills.</p>\n\n<p>Whether I was changing industries, working through redundancies or profit warnings to moving from a specialist to a generalist, each challenge has impacted my leadership style. It is the ability to bounce back and apply what I have learned through challenge that pushes me forward.</p>\n\n<h4>WHAT ARE YOU MOST PROUD OF?</h4>\n\n<p>That I am driven to create an inclusive environment. No matter where I have been employed, regardless of industry, I am committed to building a culture that values diversity. This means fostering a workplace where people with different backgrounds and lifestyles can share opinions with one another respectfully. As a whole, an environment that celebrates diversity thrives, as the organisation and individuals within benefit from collective thoughts, experiences and intelligence to take on any challenges and opportunities.</p>\n\n<h4>WHAT IS ONE PIECE OF ADVICE FOR FUTURE LEADERS?</h4>\n\n<p>Make people a top priority. Having a clear understanding and vision of people practices and the culture you want to create, needs to be the focus. This cannot, ever, be delegated to anyone or any department. They can support and enhance the culture but the vision needs to come from the top.</p>\n\n<p>To lead this vision, it&#x2019;s important to constantly revisit your progress and ensure you don&#x2019;t have any practises or policies that could undermine the culture. It comes down to that old adage, lead by example. If you are demonstrating that culture is a priority, people will follow and build it with you.</p>\n\n<p><em>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/denice-pitt-ceo-online-education-services/\" target=\"_blank\">Femecoonomy.</a></em></p>\n\n<p>&#xA0;</p>\n\n<p><em><a href=\"https://femeconomy.com/denice-pitt-ceo-online-education-services/\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce943d5d-7fb6-447d-9d6c-c5ebf14c71e1.jpeg\"><br>\n&#x200B;</a></em></p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p>&#xA0;</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/01","associated_company":"work180"}