{"url":"https://www.work180.com.au/blog/2017/10/female-leader-sue-maslin-producer-film-art-media","title":"Female Leader: Sue Maslin, Producer Film Art Media","author":"WORK180","body":"\n\t\t\t\t\t<p>Sue Maslin, Executive Director and Producer of&#xA0;<a href=\"http://www.filmartmedia.com/\" rel=\"noopener\" target=\"_blank\">Film Art Media</a>, is one of Australia&#x2019;s most successful film, television and digital content producers. She has a formidable track record of creating award winning feature and documentary films. Everyone would be familiar with her most recent remarkable hit,&#xA0;<em>The Dressmaker,</em>&#xA0;starring Kate Winslet and Judy Davis. The film scooped the highest number of nominations at the 2015 Australian Academy Awards, winning five including the coveted People&#x2019;s Choice Award for Favourite Australian Film. It also smashed the box office and remains one of the highest grossing Australian films ever. Astonishingly, Sue faced obstacles convincing investors to finance its production.</p>\n\n<p>Sue is foremost a storyteller who sees her role as that of a creative entrepreneur. Someone who connects talent, finance and audiences to the creative vision using a series of experiences. She generated audiences for The Dressmaker using social media by connecting with fashion bloggers, leveraging the story&#x2019;s underlying fashion theme. The stories she champions are the strong, unique and unusual. Ones that will haunt your consciousness and leave you thinking slightly differently about life.</p>\n\n<p>Sue has served as a member of numerous Boards across the screen and creative industries. Sue is currently a Patron of&#xA0;<a href=\"http://wiftvic.com.au/\" rel=\"noopener\" target=\"_blank\">Women In Film and Television Victoria</a>, reflecting her commitment to advocacy for women. She is also President of the&#xA0;<a href=\"https://nataliemillerfellowship.com/\" rel=\"noopener\" target=\"_blank\">Natalie Miller Fellowship</a>, dedicated to inspiring leadership and increasing the participation of women in the screen industry.</p>\n\n<p>Sue&#x2019;s list of awards for the prolific number of features and documentaries she has produced are extensive.&#xA0;<em>Road To Nhill&#xA0;</em>was&#xA0;winner of 2003 Best Feature Film at Thessaloniki International Film Festival.&#xA0;<em>Japanese Story</em>, won the 2003 AFI Award for Best Feature Film. And&#xA0;<em>Hunt Angels,</em>&#xA0;won the 2006 AFI Award for Best Feature Documentary Film.</p>\n\n<p>Sue&#x2019;s outstanding 35-year contribution to the Australian screen industry has been widely recognised. She was appointed Adjunct Professor of the School of Media &amp; Communication at RMIT University. In 2012 she was awarded the inaugural Jill Robb Award for Outstanding Leadership, Achievement and Service to the Victorian Screen Industry.</p>\n\n<h4>WHAT DIFFICULTIES DID YOU ENCOUNTER WHEN YOU WERE TRYING TO MAKE THE DRESSMAKER AND HOW HAS ITS SUCCESS LED THE WAY FOR MORE FEMALE DRIVEN FILMS IN AUSTRALIA?</h4>\n\n<p>When I was trying to raise finance for The Dressmaker five years ago, I was consistently reminded by (mostly male) distributors that despite the casting, a best selling book by Rosalie Ham and a fabulous story, the audience was &#x201C;limited&#x201D;. Because the film was &#x201C;too heavily skewed to females&#x201D;.</p>\n\n<blockquote>\n<p>Even with Kate Winslet and Judy Davis attached, I was told it was not enough. And in order for the film to sell internationally I needed to cast an A List male! Women loved the movie. More importantly, they came back again with others. Their husbands, daughters, boyfriends, girlfriends, book groups &#x2013; and the film went on to gross more than $20 million at the box office.&#xA0;The Dressmaker was one of the highest grossing Australian films of all time&#xA0;.</p>\n</blockquote>\n\n<p>The Dressmaker proved once and for all that there was a business case that could be made for a film&#xA0;<em>by&#xA0;</em>and&#xA0;<em>about</em>&#xA0;women targeted to a female audience. I am particularly proud that it has just been listed by Screen Australia in its&#xA0;<a href=\"https://thescreenblog.com/screenintel/part-three-the-financial-hits/\" rel=\"noopener\" target=\"_blank\">Top 10 list of films that have returned on investment</a>. I recognise that ROI is hugely important to investors, be they cultural or financial returns. The fact that my private investors are now in profit is very important to me.</p>\n\n<h4>AS PRESIDENT OF THE NATALIE MILLER FELLOWSHIP, HOW ARE YOU INSPIRING FUTURE FEMALE LEADERS IN THE SCREEN INDUSTRY?</h4>\n\n<p>The mission of the&#xA0;<a href=\"https://nataliemillerfellowship.com/\" rel=\"noopener\" target=\"_blank\">Natalie Miller Fellowship</a>&#xA0;is to recognise and nurture the next generation of female leaders in the Australian screen industry. And inspire them to reach the very top of their fields. There are simply not enough women at the table deciding what scripts are green lit for production, and what films are screened to audiences in this country. Men overwhelmingly dominate the key creative and business roles. It has been this way for the past 30 years.</p>\n\n<p>The Fellowship is named after the sole female owner of a cinema exhibition company in Australia. Natalie is an enormous inspiration to us. She is a very successful businesswomen who has shifted the screen culture landscape over many years. Including establishing the fabulous Cinema Nova. We in turn inspire women by offering numerous cash fellowships to women to pursue their leadership goals, in addition to mentoring programs and networking events.</p>\n\n<h4>YOU&#x2019;VE RECENTLY LAUNCHED AUSTRALIA&#x2019;S FIRST BUSINESS SCHOOL FOR CREATIVES, COMPTON SCHOOL. WHAT OUTCOMES WOULD YOU LIKE COMPTON SCHOOL TO DRIVE WITHIN CREATIVE COMMUNITIES?</h4>\n\n<p><a href=\"http://compton.school/\" rel=\"noopener\" target=\"_blank\">Compton School</a>&#xA0;is Australia&#x2019;s first business school for creatives. It is designed to meet the needs of entrepreneurs working at the intersection of creativity, business and technology in any profession. The landscape has profoundly changed on every level over the past 5 years. Including the collapse of old formats and revenue streams, the rise of new delivery platforms such as Subscription Video on Demand, a profound shift in the way audiences choose to access content, piracy and much more.</p>\n\n<blockquote>\n<p>Yet so many creatives find themselves unprepared for this. And they are not necessarily getting the training at traditional arts and media courses. We want to see more people equipped to meet the challenge of building sustainable creative businesses.</p>\n</blockquote>\n\n<h4>WHAT CHALLENGES AND OPPORTUNITIES ARE ON THE HORIZON FOR AUSTRALIA&#x2019;S SCREEN INDUSTRY AS A RESULT OF DIGITAL DISRUPTION?</h4>\n\n<p>I am enormously excited by this disruption, as creatives will be best prepared to meet the challenges ahead. We are used to innovating, working in collaborative teams, risk-taking, attracting talent and the resources required to connect powerful ideas to people. Exactly what will be needed going forward.</p>\n\n<p>The opportunity we have is that we can do all of this on a global stage now so easily with the available technology. And find the people who connect to our ideas anywhere in the world. The challenge is that EVERYONE these days is a screen content producer and content is utterly ubiquitous.</p>\n\n<p>Now more than ever, we need to think not only about the content but more importantly, the experience for audiences that sits&#xA0;<em>aroun</em>d the content. The new currency is &#x2018;attention&#x2019;. Those who are best able to attract and keep the attention of time poor people will flourish.</p>\n\n<h4>WHAT HAS BEEN YOUR GREATEST CHALLENGE?</h4>\n\n<p>Finding a work/life balance in a profession that requires unbelievable passion, perseverance and 20 hour days when in production or dealing with multiple time zones. My partner reminds me that I still haven&#x2019;t got it right!</p>\n\n<h4>WHAT ARE YOU MOST PROUD OF?</h4>\n\n<blockquote>\n<p>That despite all of the challenges, for 30 years I have been able to keep producing entertaining stories about ideas that matter. I&#x2019;m proud that The Dressmaker brought a highly talented female director, Jocelyn Moorhouse back into making movies after 4 children and a 16-year absence from directing. I am very excited about working with her again on our next film together about Clara Schumann,&#xA0;<a href=\"http://www.filmartmedia.com/projects/the-variations/\" rel=\"noopener\" target=\"_blank\">The Variations</a>.</p>\n</blockquote>\n\n<h4>WHAT&#x2019;S ONE PIECE OF ADVICE FOR FUTURE FEMALE LEADERS?</h4>\n\n<p>To remember that ultimately it is always far more empowering to share information than to withhold it.</p>\n\n<p>Also, a trick I learned coming from a long line of farmers. Always plan for a four-day week and allow one day to deal with the &#x2018;unknown unknowns&#x2019; that inevitably crop up!<br>\n&#x200B;</p>\n\n<p><em>This article was originally published by <a href=\"https://femeconomy.com/female-leader-sue-maslin-producer-film-art-media/\" target=\"_blank\">Femecoonomy.<br>\n&#x200B;</a></em></p>\n\n<h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\"><strong style=\"box-sizing: border-box;\">About Femeconomy</strong></h4>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif; text-align: center;\"><a href=\"https://femeconomy.com/submit-a-brand/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f76a4cc-ab81-479a-999f-7c5c4b7e7ecb.jpeg\" style=\"box-sizing: border-box; border-width: 0px; border-style: initial; vertical-align: middle; max-width: 100%;\"></a><br style=\"box-sizing: border-box;\">\n&#xA0;</p>\n\n<h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\"><strong style=\"box-sizing: border-box;\">About DCC Jobs</strong></h4>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"www.dccjobs.com/clients\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;<span style=\"box-sizing: border-box; font-size: 16px;\">Set up your job alert with&#xA0;</span><a href=\"https://www.dccjobs.com/users/login\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease; font-size: 16px;\">1 click</a><span style=\"box-sizing: border-box; font-size: 16px;\">&#xA0;now.&#xA0;</span></p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/10","associated_companies":["work180"]}