{"url":"https://www.work180.com.au/blog/2017/08/female-leader-elizabeth-proust-chair-australian-institute-of-company-directors","title":"Female Leader, Elizabeth Proust, Chair, Australian Institute of Company Directors","author":"WORK180","body":"\n\t\t\t\t\t<p>Elizabeth Proust AO is one of the most respected business and thought leaders in Australia. She has contributed a 30+ year career to a range of public sector, listed&#xA0;company senior leadership and Board Director roles. Currently, she is Chairwoman of the&#xA0;<a href=\"http://aicd.companydirectors.com.au/\" target=\"_blank\">Australian Institute of Company Directors</a>&#xA0;(AICD), Chairwoman of the Bank of Melbourne&#xA0;and Chairwoman of Nestle Australia. Prior to embarking on Non-Executive Director roles, Elizabeth was the Managing Director of Esanda and in executive&#xA0;leadership roles with ANZ. Formerly she was&#xA0;CEO of Victoria&#x2019;s Premier and Cabinet and Chief Executive of the City of Melbourne.</p>\n\n<p>In 2010, Elizabeth was made an Officer of the Order of Australia for her service to a range of charitable, arts, university and business boards. In her role as&#xA0;Chair of the AICD, Elizabeth has been a vocal and forthright advocate for increasing&#xA0;gender diversity&#xA0;in corporate Australia, and specifically on Boards of Directors. The AICD has set a target of achieving 30% female directors on the ASX200 Boards by 2018. They have further&#xA0;gone to the lengths of corresponding repeatedly with the Boards of ASX200 companies with only one or no female board directors, to ask them why they didn&#x2019;t have more women on their board.</p>\n\n<p>Some of the responses received by AICD from ASX200 Boards in favour of preserving the status quo were shocking and made&#xA0;<a href=\"http://www.theaustralian.com.au/business/news/women-talk-too-much-make-board-meeting-long/news-story/ae82caa99043dad26c9b3f4791493e6d\" target=\"_blank\">newspaper headlines</a>. The exercise&#xA0;culminated in a video released by the AICD for International Women&#x2019;s Day 2017. The video is lead by Elizabeth and features 9 prominent Australian female Board Directors reading&#xA0;some of the more outrageous comments&#xA0;received, ending with the assurance that the AICD will continue to advocate for gender diversity.</p>\n\n<p><iframe allowfullscreen frameborder=\"0\" height=\"360\" mozallowfullscreen=\"\" src=\"https://player.vimeo.com/video/205836042\" webkitallowfullscreen=\"\" width=\"100%\"></iframe></p>\n\n<p><a href=\"https://vimeo.com/205836042\">Should there be more women in Australian boardrooms?</a> from <a href=\"https://vimeo.com/aicdirectors\">AICD</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n\n<p><strong>As chair of&#xA0;<a href=\"http://aicd.companydirectors.com.au/\" target=\"_blank\">Australian Institute of Company Directors</a>, what talent do boards need to attract to help future proof their companies in the age of digital disruption?</strong></p>\n\n<p>Boards need diversity &#x2013; of thought, of background, of gender and culture to ensure that they get the best thinking and to guard against &#x201C;group think&#x201D;.</p>\n\n<p><strong>As chair and non-executive director of many companies, what gender equality strategies have you lead at a board level to help shape company culture?</strong></p>\n\n<p>At the&#xA0;<a href=\"http://aicd.companydirectors.com.au/\" target=\"_blank\">AICD</a>, I am leading the push for ASX200 companies to have 30% women by the end of 2018. The current figure is 25.3% but the momentum has slowed this year and it&#x2019;s no longer clear that we will reach this target. I&#x2019;ve also been involved (e.g. when I was on the board of Perpetual) in raising issues about the gender pay gap, and ensuring that management was held accountable for closing the gap.</p>\n\n<p><strong>In a recent AICD survey of more than 1100 directors, a record 57% of directors believe their businesses will grow over the next 12 months and plan to invest and hire&#xA0;staff at levels not seen since 2011. What is driving this renewed confidence in business and what are the potential impacts on Australia&#x2019;s economic future?</strong></p>\n\n<p>It was great to see optimism in our recent Director Sentiment Index. It is still in negative territory though. We think that the uptick in sentiment was caused by external events (e.g. Brexit and the election of Trump) not turning out to be as negative as people had feared. That said, there is still nervousness both about the global economy, and the Australian one, with much more needed to be done, by business and governments, to ensure a growing economy and society.</p>\n\n<p><strong>You are often cited as being in favour of quotas for gender diversity at a company board level. How would you like to see this implemented in Australia?</strong></p>\n\n<p>The difference between &#x201C;targets&#x201D; and &#x201C;quotas&#x201D; is often a semantic one. The AICD has set the&#xA0;<a href=\"http://aicd.companydirectors.com.au/advocacy/board-diversity\" target=\"_blank\">30% target</a>, not a quota. Generally, quotas are set by governments (for example Norway) to mandate a certain percentage of women on boards. I&#x2019;m sceptical about government action as it often has unintended consequences but if a business can&#x2019;t see the need for genuine diversity, on boards and in executive ranks, and doesn&#x2019;t act, then we should not be surprised if governments take action to impose quotas.</p>\n\n<p><strong>What has been your greatest challenge?</strong></p>\n\n<p>I think that the biggest career challenge happened to me early and was instrumental in shaping my whole career. I became CEO of the City of Melbourne in 1990 and had the responsibility of turning around its culture and its finances.</p>\n\n<p><strong>What are you most proud of?</strong></p>\n\n<p>My proudest achievement is my daughter and my grandsons. No career achievement comes close!</p>\n\n<p><strong>What&#x2019;s one piece of advice for future female leaders?</strong></p>\n\n<p>I would advise future female leaders to lead balanced lives, to choose their life partner very carefully, to get as much experience as they can, and to contribute back to society.</p>\n\n<p>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/female-leader-elizabeth-proust-chair-australian-institute-of-company-directors/\" target=\"_blank\">Femeconomy</a>.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"text-align:center\"><a href=\"https://femeconomy.com/submit-a-brand/\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f76a4cc-ab81-479a-999f-7c5c4b7e7ecb.jpeg\"></a><br>\n&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/08","associated_companies":["work180"]}