{"url":"https://www.work180.com.au/blog/2017/05/femeconomy-interviews-kate-jenkins-sex-discrimination-commissioner-australia","title":"Femeconomy Interviews Kate Jenkins, Sex Discrimination Commissioner Australia","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/female-leader-kate-jenkins-sex-discrimination-commissioner-australia/\" target=\"_blank\">Femeconomy</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Kate Jenkins is&#xA0;<a href=\"https://www.humanrights.gov.au/about/commissioners/sex-discrimination-commissioner-kate-jenkins\" target=\"_blank\">Australia&#x2019;s Sex Discrimination Commissioner</a>, and was appointed to the role in 2016, having previously served as Victoria&#x2019;s&#xA0;Equal Opportunity and Human Rights Commissioner. In the 2015 AFR/Westpac 100 Women of Influence Awards, Kate was recognised for her work in public policy. With a background in employment law, Kate has always worked to progress gender equality. However, she believes that although the law provides a mechanism for legal protection, it does not provide a pathway to achieve gender equality, as it relies on individuals to raise complaints, often at great personal cost.</p>\n\n<p>Kate thinks that raising consciousness in&#xA0;the wider community and media about why&#xA0;gender equality matters will have the greatest&#xA0;impact.&#xA0;On International Women&#x2019;s Day 2017, Kate is urging women to raise their voices using social media to share their views&#xA0;on gender equality.</p>\n\n<p>You have been working for 25 years in Human Rights and Equal Opportunity Law. Was there a particular catalyst that sparked this interest?</p>\n\n<p>I have always had a strong sense of justice and fairness. This is something I inherited from my mother and is a trait that has guided me throughout my career.</p>\n\n<p>As a law student, I was passionate about anti-discrimination law and feminist legal theory. I never planned to spend 20 years working at a top tier corporate law firm. But, when I discovered the extraordinary employment law practice at Freehills, my plan had to change! Employment law is all about people, and it is the human face of law that I love the most.</p>\n\n<p>I worked at Freehills at a time when there was increasing awareness of sexual harassment in the corporate world. Working in this field allowed me to combine the intellectual stimulation of legal practice with my passion for fairness and eliminating discrimination.</p>\n\n<p>My experience in the corporate world has been invaluable training for my roles at the Victorian Equal Opportunity and Human Rights Commission and now as federal Sex Discrimination Commissioner. I ultimately left the corporate sector because I wanted to make a substantive contribution to closing the gender gap. The opportunity to spend every day raising awareness of the value of equality for all Australians is an absolute privilege.</p>\n\n<p>As Sex Descrimination Commissioner, you&apos;ve identified tackling violence against women, women&apos;s economic security and empowerment and leadership diversity as your three priority areas? How can all women support what you are trying to achieve?<br>\n<br>\nWomen have had equality under the law for decades; the&#xA0;Sex Discrimination Act&#xA0;commenced in 1984. But, we are still a long way from having substantive gender equality in Australia.</p>\n\n<p>We need to tackle entrenched attitudes and invisible systemic barriers where we work, live, play and learn&#xA0;. All of us have the ability to influence change in our everyday lives.&#xA0;Whether that is by providing flexible working opportunities as a manager, or encouraging our daughters to excel in sport.</p>\n\n<p>We need to hear more women&#x2019;s voices. That is why I am encouraging women to take to social media on International Women&#x2019;s Day (8 March) to share their experiences and views about gender equality. Let&#x2019;s connect on&#xA0;<a href=\"https://twitter.com/Kate_Jenkins_\">Twitter</a>,&#xA0;<a href=\"https://www.instagram.com/katejenkinssdc/?hl=en\">Instagram</a>&#xA0;and&#xA0;<a href=\"https://www.facebook.com/SexDiscrimination/\">Facebook</a>.</p>\n\n<p>You are on the board of directors for Carlton Football Club and Heide Museum of Modern Art. For 15 years you were a board member of Berry Street, Victoria&apos;s largest independent child and family welfare organisation. What are the unique perspectives you can bring to governing an organisation because you are on three very diverse boards?</p>\n\n<p>It has been a privilege to hold leadership positions on these diverse boards, which embody my passion for sport, the arts and social justice.</p>\n\n<p>Carlton, Heide and Berry Street operate within very different industries. Regardless of the industry that we&#x2019;re dealing with, all organisations must ensure that they reflect their communities and enjoy the benefits of diversity. This is a principle I encourage all organisations to embrace.</p>\n\n<p>As Sex Discrimination Commissioner, I am committed to championing diverse women&#x2019;s voices. The research is clear that diversity makes good business sense and leads to better performance and financial gains.&#xA0;</p>\n\n<p>Tell us about some of the community and diversity programs you have instigated at Carlton Football Club since becoming a board director?</p>\n\n<p>Sport is one of the most impactful place to change attitudes and experiences for women. Consider the extraordinary response to the AFL women&#x2019;s competition that kicked off last month!</p>\n\n<p>Carlton has always been committed to the community it represents. One of the key pillars of the club is diversity and inclusion. Carlton lives up to this through a range of programs, like our community camps, which see players visit schools and hospitals, and the Multicultural Round.</p>\n\n<p>The Club is committed to its Reconciliation Action Plan and values its relationships with Aboriginal and Torres Strait Islander communities. In 2016 it launched #CarltonRespects, a family violence prevention initiative promoting respect and equality. All of these programs improve the Club and influence the community, which is an important way the Club can help advance equality.</p>\n\n<p>What has been your greatest challenge?</p>\n\n<p>While I&#x2019;m optimistic about our ability to achieve gender equality, the pace of change is far too slow.&#xA0;&#xA0;One of the greatest challenges I&#x2019;ve faced is maintaining my optimism despite international indicators that show that Australia is lagging behind in some key areas of gender equality.</p>\n\n<p>I have drawn a great deal of inspiration from the recent wins in the world of sport. A few examples that come to mind include Netball Australia&#x2019;s recent pay deal&#xA0;which&#xA0;saw average salaries jump from $40,000 to $67,500.&#xA0;Also, the community support for the Women&#x2019;s Big Bash League and AFL women&#x2019;s competition.</p>\n\n<p>What are you most proud of?</p>\n\n<p>The work I&#x2019;m most proud of is where I&#x2019;ve been privileged to work in collaboration with others.&#xA0;Community groups, governments, organisations and individuals. Because I believe&#xA0;working together is the only way we can close the gender and inequality gap&#xA0;.</p>\n\n<p>What&apos;s one piece of advice you have for future female leaders?</p>\n\n<p>Take the time to mentor and support the next generation of women leaders.&#xA0;Including women who may be very different to you.</p>\n\n<h4>About Femeconomy</h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/bf9725a6-aacf-423d-a116-77c5a372f3bf.jpeg\"></p>\n\n<p style=\"text-align:center\">&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/05","associated_company":"work180"}