{"url":"https://www.work180.com.au/blog/2017/06/femeconomy-interviews-spell-and-the-gypsy-collective","title":"Femeconomy Interviews Spell & The Gypsy Collective","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/female-leader-elizabeth-abegg-spell-the-gypsy-collective/\" target=\"_blank\">Femeconomy</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Elizabeth Abegg, Co-Founder of&#xA0;<a href=\"https://shop.spelldesigns.com/\" target=\"_blank\">Spell &amp; the Gypsy Collective</a>&#xA0;with sister Isabella Pennefather shares how she career transitioned from film editing to fashion retail and how the&#xA0;sisters from Byron Bay have grown a market jewellery business into a global fashion success story.</p>\n\n<p>Known worldwide for its gypsy inspired, modern bohemian creations,&#xA0;<a href=\"https://shop.spelldesigns.com/\" target=\"_blank\">Spell</a>&#xA0;has attracted an incredible customer following, and counts&#xA0;Katy Perry and Alessandra Ambrosio among their devoted fan base.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>You left Bondi for Byron and swapped film editing for fashion to work with your sister. How has your technical art of telling stories as a film editor, influenced and helped define Spell as a brand?</strong></p>\n\n<p>My past life played a huge role in being able to share the story of our brand with our customers. For our latest collection, we did an Insta-story runway and I grabbed the camera and shot the whole thing myself. It was fun thinking about it from an editing perspective again. The story telling element always came easily for us, which allowed our audience to be part of the story too.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>When you first moved into fashion, what professional development did you undertake in order to understand a completely new industry?</strong></p>\n\n<p>I&#x2019;m quite&#xA0;embarrassed&#xA0;to say&#x2026;absolutely none. But to put it into&#xA0;perspective, when I joined the business we were literally two girls selling some jewellery at the markets. So I never felt a need to up-skill&#xA0;beyond what my sister was teaching me in jewellery making skills. Over time, and just in time, I hired a few key staff (business manager and also a good accountant) who helped&#xA0;us navigate the growth. That&#x2019;s not to say that I haven&#x2019;t learned a tonne from trial and error along the way.&#xA0;But the growing pains and learning curve happened as we went, so it was okay!</p>\n\n<p>&#xA0;</p>\n\n<p><strong>What are some of your tips for managing a global brand whilst living in Byron Bay?</strong></p>\n\n<p>Build a strong team around you. Hire&#xA0;people&#xA0;who complement your weaknesses. Hire locally to support the community, but also recruit from larger cities to keep pushing boundaries.&#xA0;Find a good internet provider. Be mindful of extra freight time and costs getting&#xA0;things&#xA0;to and from a regional town. Nurture a good work/life balance because that&#x2019;s why you live in Byron Bay in the first place!</p>\n\n<p>&#xA0;</p>\n\n<p><strong>How has your success influenced the startup ecosystem in Byron Bay?</strong></p>\n\n<p>The Arts and Industry Estate has always been a thriving melting pot of different creatives, but these days more so than ever!&#xA0;Whether to say we influenced that, is another story! We did the markets with so many of the brands that are global now, and it has been an exciting journey to watch each other grow and learn from each other. Byron has always been somewhere people have dreamed of coming to live. I know I always dreamed of living here with my family, so it&#x2019;s not surprising it is the creative mecca that it&#x2019;s become.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>If the universe could grant you one wish for Spell&apos;s future, what would it be?</strong></p>\n\n<p>To continue and&#xA0;thrive on&#xA0;our&#xA0;sustainability&#xA0;and ethics&#xA0;journey. Having a profitable&#xA0;business means that you can finally start to really give back and&#xA0;make a difference in the choices you make! We hope we can&#xA0;continue to really make a difference.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>What has been your greatest challenge?</strong></p>\n\n<p>Growing pains! The past few years have been a wild ride &#x2013; equal parts overwhelming and amazing. Learning how to navigate a very fast moving train has been a huge challenge. Also having every single move you make examined&#xA0;by your customers makes it challenging to always do and say the right thing because everyone wants something different. We are learning to listen to our customers while also staying true to our own values.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>What are you most proud of?</strong></p>\n\n<p>Our community of customers. They are amazing.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ba3c0a5b-ec6a-47c1-994b-75c2284cedd7.jpeg\"></p>\n\n<p style=\"text-align:center\">&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/06","associated_company":"work180"}