{"url":"https://www.work180.com.au/blog/2017/06/femeconomy-interviews-tracey-spicer-ceo-of-spicer-communications","title":"Femeconomy Interviews Tracey Spicer, CEO of Spicer Communications","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/female-leader-tracey-spicer-spicer-communications/\" target=\"_blank\">Femeconomy</a>.&#xA0;</p>\n\n<p>Tracey Spicer, CEO of&#xA0;<a href=\"http://spicercommunications.biz/\" target=\"_blank\">Spicer Communications</a>,&#xA0;has an enviable portfolio career encompassing&#xA0;television, newspaper, radio and online&#xA0;journalism, and is a highly sought-after writer, speaker and media trainer. She has just authored&#xA0;<a href=\"http://www.booktopia.com.au/the-good-girl-stripped-bare-tracey-spicer/prod9780733335631.html\" target=\"_blank\">The Good Girl Stripped Bare</a>, challenging&#xA0;the structural workplace barriers faced by women.&#xA0;Tracey is passionate about equality, which is&#xA0;a central tenet of her book. The Good Girl Stripped Bare recounts her experience of being sacked by a news network via email, after having a baby. In a brave move at a vulnerable time, she took&#xA0;legal action against them.</p>\n\n<p>Tracey&#xA0;is a&#xA0;leader to admire and to emulate. Someone who tirelessly gives back as&#xA0;an ambassador for innumerable charitable causes, and a mentor for&#xA0;<a href=\"http://www.womeninmedia.net/\" target=\"_blank\">Women in Media</a>. She&#xA0;also released an influential TED Talk.&#xA0;<a href=\"https://www.youtube.com/watch?v=PENkzh0tWJs&amp;feature=youtu.be\" target=\"_blank\">The Lady Stripped Bare</a>&#xA0;in 2014. Watch it. It&#xA0;will make you question your beauty routine and what value it actually adds&#xA0;to your life. Comfortable in her own skin, and preferably in bare feet or thongs (she&#x2019;s from&#xA0;Queensland &#x2013; it&#x2019;s hot), Tracey&#xA0;is hilariously funny and outspoken. Her comedy chops were on display at this year&#x2019;s Melbourne Comedy Festival. The Good Girl Stripped Bare is an entertaining, but most of all an important read.&#xA0;</p>\n\n<p><strong>Your TED&#xA0;Talk&#xA0;<a href=\"https://www.youtube.com/watch?v=PENkzh0tWJs&amp;feature=youtu.be\" target=\"_blank\">the lady stripped bare</a>&#xA0;has been viewed over 1.5 million times. You talk about the loss of productivity due to the arduous grooming women undertake as a result of society&#x2019;s expectations. In the video recorded in 2014, you promised to change some of your own behaviour like simplifying your hairdo, minimising makeup and no longer having a spray tan. What have you achieved in the last few years as a result of this increased productivity?</strong></p>\n\n<p>I&#x2019;ve expanded the variety of my work, including starting a business to amplify female voices called Outspoken Women. And I&apos;ve taken up new interests and hobbies, such as singing lessons and paddle boarding. Honestly, it&#x2019;s extraordinary how much extra time is created by letting go of society&#x2019;s unrealistic expectations about how a woman should appear.</p>\n\n<p><strong>Your book&#xA0;<a href=\"http://www.booktopia.com.au/the-good-girl-stripped-bare-tracey-spicer/prod9780733335631.html\" target=\"_blank\">the good girl stripped bare</a>&#xA0;is a&#xA0;</strong><strong>femoir</strong><strong>&#xA0;recounting your incredible career. You encourage other women to speak out about issues in their workplaces. Did you feel like you needed to reach a certain level in your career before speaking up?</strong></p>\n\n<p>Excellent question. I&#x2019;m a little ashamed of myself for not speaking out sooner, but I&#x2019;d been brought up to be the &#x2018;good girl&#x2019;: pleasant and pliable, not pushy. There was a deep-seated fear of losing my job. I understand why women often don&#x2019;t report discrimination in the workplace. However, if we start to shake off the shackles, employers will have no choice but to improve policies and procedures to make it fairer for women.</p>\n\n<p><strong>If someone is prepared to speak up about discrimination in their workplace, what support mechanisms would you advise having in place, and what information should you have in your toolkit? &#xA0;</strong></p>\n\n<p>Research, research, research. In my maternity leave case, I collected state and federal legislation, and union guidelines, before confronting my boss, and then HR. Also, find a mentor or supporters in your workplace, as you&#x2019;ll need good sounding boards. Finally, talk to your friends and family, as it can be emotionally exhausting.</p>\n\n<p><strong>In March 2016 ABC reported that for all news coverage, internationally and at home only about 24% of the people seen, heard or read about were female. A level unmoved from five years earlier. Research also consistently finds that men are more likely to be mentioned as experts and women as &#x201C;general public&#x201D; sources. As a journalist and influencer, what needs to change in the media industry to make this figure more representative of the population?&#xA0;</strong></p>\n\n<p>Our&#xA0;<a href=\"http://www.womeninmedia.net/\" target=\"_blank\">Women in Media research</a>, conducted with inertia, revealed that female journalists quote women experts twice as often as male journalists. We&#x2019;re creating female expert databases for media organisations, and talking to executives about gender targets/quotas for voices, similar to the BBC and Bloomberg.</p>\n\n<p><strong>What has been your greatest challenge?&#xA0;</strong></p>\n\n<p>Realising I was being sidelined at work, while our baby was fighting for his life in a neo-natal intensive care unit.</p>\n\n<p><strong>What are you most proud of?&#xA0;</strong></p>\n\n<p>Preparing Federal Court action and starting a national media campaign about maternity discrimination.</p>\n\n<p><strong>What&#x2019;s one piece of advice for future female leaders?&#xA0;</strong></p>\n\n<p>Go hard. Every time I&apos;ve thought that my career would end due to being outspoken, the opposite has occurred. Sky News gave me a role on air because the boss admired my courage. Then, ABC TV hired me, regardless of my authorship of a deliberately provocative book. Stand strong in order to &#x2018;sheconstruct&#x2019; your future.</p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<h4><span style=\"color:rgb(169, 127, 177)\"><strong>About DCC Jobs</strong></span></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/06","associated_company":"work180"}