{"url":"https://www.work180.com.au/blog/2017/10/finding-your-passion-tammy-barton-director-mybudget","title":"Finding Your Passion: Tammy Barton, Director, MyBudget","author":"WORK180","body":"\n\t\t\t\t\t<p>Tammy Barton, Director and Founder of&#xA0;<a href=\"https://www.mybudget.com.au/\" rel=\"noopener\" target=\"_blank\">MyBudget</a>&#xA0;bought her first house at 19 years of age. At age 22, in 1999 she left her job at an Adelaide law firm, where she had been entrusted to deal with debt collection to start MyBudget from home. Her mission was to help people like those she had come into contact with. Those struggling financially and needing guidance and support on how to plan and manage their personal budget. Initially Tammy was handwriting budgets for people, like she did her own.</p>\n\n<blockquote>\n<p>Now,&#xA0;<a href=\"https://www.mybudget.com.au/\" rel=\"noopener\" target=\"_blank\">MyBudget</a>&#xA0;manages close to $1 billion in client salaries each year, and have served over 65,000 Australians. Client&#x2019;s salary is paid into the MyBudget trust account, budgeted household expenses are deducted, bills paid, the administration fee taken, and the residual amount is returned to the client&#x2019;s for discretionary spending. They offer both a structured financial management process, as well as goal setting and coaching to help people live within their means and work towards lifestyle goals.</p>\n</blockquote>\n\n<p>A totally new category of business in financial services, MyBudget has grown year on year. The business was in the BRW Fast 100 from 2009-2012, and is now turning over more than $30 million per annum. Tammy herself was named 2007 South Australia Telstra Business Woman of the year, and in 2008 EY&#x2019;s Young Entrepreneur of the Year. She&#x2019;s currently in EY&#x2019;s Entrepreneurial Winning Women&#x2122;&#xA0;<a href=\"http://www.ey.com/cn/en/services/strategic-growth-markets/ey-asia-pacific-entrepreneurial-winning-women-class-of-2017\" rel=\"noopener\" target=\"_blank\">Class of 2017</a>&#xA0;for Asia-Pacific, which will fuel her current goals to take her business to a global platform.</p>\n\n<h4>HOW HAS YOUR LEADERSHIP STYLE CHANGED DURING YOUR GROWTH PHASES?</h4>\n\n<p><a href=\"https://www.mybudget.com.au/\" rel=\"noopener\" target=\"_blank\">MyBudget</a>&#xA0;grew from my kitchen table to the national company it is today and enjoyed nearly 50% average annual growth for over a decade. As the business expanded, it became clear that I was going to have to stop working in the business and start working&#xA0;<em>on</em>&#xA0;it. One of the keys has been to identify, recruit and develop the right people into the right roles. As a leader, my role is to act as a mentor and enabler, providing staff with the training, support and resources they need to succeed.</p>\n\n<blockquote>\n<p>Another of my leadership responsibilities is to develop our company culture. To embed our values of caring, providing a difference and fostering financial responsibility in all of our activities and decision-making processes. This is done through storytelling and by engaging our team in routines and behaviours that bring our company values to life.</p>\n</blockquote>\n\n<p>Lastly, growth has demanded my leadership style become more strategic and visionary. My role is to envision the future, develop our goals and design a strategic plan to achieve them. While I continue to maintain oversight of the entire business, I&#x2019;m no longer involved in granular decisions. I entrust process and procedural changes to our teams and leaders, and see my role as providing them with clear, strategically-aligned goals and the resources they need to succeed.</p>\n\n<h4>HOW HAVE YOU USED TECHNOLOGY TO SCALE YOUR BUSINESS?</h4>\n\n<p>When I started&#xA0;<a href=\"https://www.mybudget.com.au/\" rel=\"noopener\" target=\"_blank\">MyBudget</a>, every process was manual. From creating clients&#x2019; budgets to standing in line at the post office to pay their bills. As the business grew, I took on staff then mortgaged my home to fund the development of software that automated MyBudget&#x2019;s processes. Automation allowed me to help more people and, notably, established personal budgeting as a standalone financial services category.</p>\n\n<p>Today, MyBudget relies on technology to execute its proprietary budgeting platform and adhere to strict security and regulatory requirements. Our systems are progressively being migrated to a cloud-computing environment. This provides us with scalability without the need for upfront hardware investment. It&#x2019;s an important innovation for a constantly growing company. We&#x2019;ve also appointed an internationally head-hunted Chief Technology Officer whose experience will ensure that our innovation continues to be cutting edge.</p>\n\n<p>System developments, including implementation of our mobile app and digital signing, have increased self-service options for clients. This has reduced waiting times and resulted in greater client satisfaction. Real-time, intelligent systems also allow us to provide powerful reporting tools. These give clients a high degree of control over their budgets. Further, by mining the wealth of financial data captured in our system, we can deliver enormous client value and gain powerful business insights into their needs.</p>\n\n<h4>WHAT DID YOU LEARN AT EY&#x2019;S WINNING WOMEN&#x2019;S PROGRAM IN INDIA?</h4>\n\n<p>EY&#x2019;s Winning Women&#x2019;s program was an important reminder to think globally. In business, there is often a tendency to focus on the local or national scene. Opportunities, obstacles, markets, demographics, economics and regulation. The program expanded my mind by reminding me to think beyond Australia&#x2019;s borders. To imagine what&#x2019;s possible on a global scale.</p>\n\n<h4>WHAT IS ONE THING EVERY WOMAN CAN DO TO IMPROVE THEIR FINANCIAL POSITION?</h4>\n\n<p>Women are especially adept at putting other people&#x2019;s needs before their own. My top tip for women wanting to improve their finances is to define their financial goals and create a plan to achieve them. Without a destination, it&#x2019;s easy to go nowhere. Getting financially fit is a lot like getting physically fit. If your goal is to get stronger or fitter or faster, you will benefit from having a customised training plan to follow. In money terms, we call that a budget. A detailed plan that acts as road map to achieving financial fitness.</p>\n\n<h4>WHAT HAS BEEN YOUR GREATEST CHALLENGE?</h4>\n\n<p>In a fast-growing business, the challenge is to keep up with the pace of change and develop scalable systems that are flexible enough to meet business demands. Technology like cloud-based computing has been one of the keys to growth. It&#x2019;s allowed us to scale our systems without investing in expensive hardware. On the upside, with every challenge there is opportunity. The transition to becoming a technology company is allowing&#xA0;<a href=\"https://www.mybudget.com.au/\" rel=\"noopener\" target=\"_blank\">MyBudget</a>&#xA0;to reach more markets, including international ones.</p>\n\n<h4>WHAT ARE YOU MOST PROUD OF?</h4>\n\n<p>I&#x2019;m extremely gratified by the success of&#xA0;<a href=\"https://www.mybudget.com.au/\" rel=\"noopener\" target=\"_blank\">MyBudget</a>, but my proudest achievement is my three children. They are each in their own ways independent, caring, intelligent, fun-loving and all-round amazing human beings.</p>\n\n<h4>WHAT&#x2019;S ONE PIECE OF ADVICE FOR FUTURE FEMALE LEADERS?</h4>\n\n<p>My advice to future female leaders is to find your passion. No matter what that may be, gravitate towards what you love so that your life&#x2019;s work is fulfilling and rewarding beyond money. If you can find your passion and be true to your values, your business or job role may evolve over time, but remaining true to your values is a way to ensure that you always stay connected to your mission.</p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\"><em style=\"box-sizing: border-box;\">This article was originally published by&#xA0;<a href=\"https://femeconomy.com/female-leader-tammy-barton-director-mybudget/\" target=\"_blank\">Femecoonomy.<br style=\"box-sizing: border-box;\">\n&#x200B;</a></em></p>\n\n<h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\"><strong style=\"box-sizing: border-box;\">About Femeconomy</strong></h4>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif; text-align: center;\"><a href=\"https://femeconomy.com/submit-a-brand/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f76a4cc-ab81-479a-999f-7c5c4b7e7ecb.jpeg\" style=\"box-sizing: border-box; border-width: 0px; border-style: initial; vertical-align: middle; max-width: 100%;\"></a><br style=\"box-sizing: border-box;\">\n&#xA0;</p>\n\n<h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\"><strong style=\"box-sizing: border-box;\">About DCC Jobs</strong></h4>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"www.dccjobs.com/clients\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;<span style=\"box-sizing: border-box; font-size: 16px;\">Set up your job alert with&#xA0;</span><a href=\"https://www.dccjobs.com/users/login\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease; font-size: 16px;\">1 click</a><span style=\"box-sizing: border-box; font-size: 16px;\">&#xA0;now.&#xA0;</span></p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/10","associated_companies":["work180"]}