{"url":"https://www.work180.com.au/blog/2016/11/five-tips-on-proactively-enhancing-your-career","title":"Five Tips on Proactively Enhancing Your Career ","author":"WORK180","body":"\n\t\t\t\t\t<p>Jenny Edlington is a Senior Technical Officer at AECOM&#x2019;s Perth office. Jenny&#x2019;s journey in the industry began 14 years ago and has been completely self-driven. The result? A rewarding career, which fits in with Jenny&#x2019;s family and outside interests. Here are her top tips to enhancing your career that you can implement immediately.</p>\n\n<p>&#xA0;</p>\n\n<h4>IT&#x2019;S OK TO RE-CALIBRATE YOUR CAREER PATH</h4>\n\n<p>Jenny&#x2019;s career did not follow a &#x201C;standard&#x201D; path. &quot;Originally, I wanted to be a civil engineer, but didn&#x2019;t get the marks so I went to TAFE, to do a Diploma of Civil and Structural Drafting,&#x201D; recalled Jenny. &#x201C;I ended up getting a job in drafting, and after some time, I decided I liked drafting more than what the engineers around me were doing.&#x201D; One of Jenny&#x2019;s colleagues specialised in road design, and Jenny found herself drawn to this type of work. &#x201C;Greg really took me under his wing, and I learned more from him than any course I&#x2019;ve ever completed,&#x201D; said Jenny.</p>\n\n<p>&#xA0;</p>\n\n<h4>YOU CAN LEARN FROM EVERYBODY</h4>\n\n<p>Jenny is a strong believer in driving your own self development, and not necessarily through formal study. &#x201C;You need to show interest, ask lots of questions and work to get people around you to download their knowledge,&#x201D; explained Jenny. &#x201C;You also need to&#xA0;<span style=\"color:inherit !important\">learn something new every day- don&#x2019;t be content with the humdrum of the way things were always done</span>.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<p>Professional development is an ongoing process for Jenny. Learning about design started at the bottom, and as she upskilled herself, she found herself thrown in the deep end on really challenging projects, and expanding her knowledge even more.</p>\n\n<p style=\"text-align:center\"><img alt=\"NPBH Aug 09 - Dorsett Road\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/07113814-d24d-435b-b1d9-e084042efea6.jpeg\"></p>\n\n<h4>KNOW WHEN IT&#x2019;S TIME TO MOVE ON&#xA0;</h4>\n\n<p>Jenny loved her job, but felt that colleagues only saw her as a drafter, limiting her opportunities to take a step up in her career. Her advice to others considering a move; &#x201C;<span style=\"color:inherit !important\">Acknowledge that change isn&#x2019;t always a bad thing</span>- if I didn&#x2019;t make the switch, it&#x2019;s very likely I&#x2019;d still be in the same role, still drafting.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<p>Jenny made the difficult choice of moving on, and started to research which company she wanted to work with. &#x201C;I noticed AECOM was winning a lot of exciting projects, and I wanted to be part of that and join a team that I could learn a lot from,&#x201D; said Jenny.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4>GET INVOLVED IN MEANINGFUL PROJECTS</h4>\n\n<p>One of the most rewarding aspects for Jenny&#x2019;s role is contributing to local projects, which directly impact Jenny, her family and community. &#x201C;I was very excited to work on the new Perth Bunbury Highway,&#x201D; Jenny told us. &#x201C;The highway we were designing was going to be the connection between my area and my family down south.&#x201D; explained Jenny. &#x201C;I was in charge of designing a little rest area, which was the first proper design of my own. To this day, when we go on motorbike rides, that area is our designated meeting spot, which my friends call &#x2018;Jenny&#x2019;s rest area&#x2019;.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<p>Jenny was also excited to work on the GatewayWA project, an upgrade to the road leading to the Perth Airport. Jenny had the opportunity to be the designer involved in an Australian first &#x201C;tennis ball&#x201D; interchange. &#x201C; <span style=\"color:inherit !important\">We have the challenging task of designing a roundabout, which has to accommodate&#xA0;36 metre trucks</span>&#xA0;and still reduces the vehicle approach speed, and while it&#x2019;s not going to be easy, I love the idea of doing something different for the very first time,&#x201D; said Jenny.</p>\n\n<p style=\"text-align:center\"><img alt=\"Roe Berkshire March 2016\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/de2533f1-9894-4ccf-8ac0-f071e1bef7f0.jpeg\"></p>\n\n<h4>CHOOSE YOUR EMPLOYER WISELY</h4>\n\n<p>After the birth of her son Kyle, who is now one year old, Jenny returned to flexible working arrangements, where she works from home each Wednesday. Jenny described the handover period as very smooth. &#x201C;While I was on leave, I had a colleague (we call them buddies) who was my point of contact with my team and kept me updated and across group emails that were relevant.&#x201D;&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>Jenny did not feel excluded, in stark contrast to some of her friends outside the company, who reported feeling isolated while on maternity leave.</p>\n\n<p>&#xA0;</p>\n\n<p>&#x201C;AECOM deserves to be applauded for the support they offer to all new parents,&#x201D; Jenny told us. &#x201C;After maternity leave, I felt like I did not miss a beat- it feels like I&#x2019;ve never been away and the company follows this process regardless of the reason for people taking leave.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<p>Jenny also works from home on some occasions in addition to each Wednesday. &#x201C;For example, if my son is unwell and I cannot come into the office but can still work from home, my team is very supportive of this.&#x201D; Her advice to women looking for a new employer is to do their research, and ensure the company walks the talk on flexibility.</p>\n\n<p>&#xA0;</p>\n\n<p>Jenny&#x2019;s story is a great example of how your career does not have to miss a beat while balancing family responsibilities. Having the right kind of supportive employer certainly plays a big part- you can learn more about working with AECOM&#xA0;<a href=\"https://www.diversecitycareers.com/aecom\">here</a>&#xA0;and explore their available roles&#xA0;<a href=\"https://www.diversecitycareers.com/advancedsearch.aspx?search=1&amp;advertiserid=7266\">here</a>.&#xA0;</p>\n\n<h5><span style=\"color:rgb(169, 127, 177)\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/11","associated_company":"work180"}