{"url":"https://www.work180.com.au/blog/2017/05/five-tips-to-bring-more-balance-into-your-life","title":"Five Tips to Bring More Balance into Your Life","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published by&#xA0;<a href=\"https://www.herbolduniverse.com/2017/05/02/five-tips-to-bring-more-balance-into-your-life/\">Her Bold Universe</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Having a balanced life seems to be quite a hot topic at the moment, which makes sense considering the constant stimulus hitting us from all angles. We are constantly connected to people and work through our phones and computers, and so learning how to balance all that can be pretty tough.</p>\n\n<p>So, I decided to share some of the habits I have been adopting to bring some more balance into my life. I am guilty of putting too much pressure on myself, or stressing too much to be healthy, and so these are five things I&#x2019;ve been more mindful of including in my day-to-day life.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. Making time for exercise</strong></p>\n\n<p>No matter how busy I am there is one thing I don&#x2019;t sacrifice: the time I have for exercise.</p>\n\n<p>Exercising for me is so much more than simply working off the donut I (accidentally) ate at morning tea. Not only is it my meditation and stress-relief, but I also see it as an investment in my time. If I exercise at lunch, regardless of how busy I think I am, my afternoons are so much more productive. If I&#x2019;m stressed, a yoga class after work can clear my head and calm my racing thoughts.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Being OK with saying no</strong></p>\n\n<p>Lately, I&#x2019;ve been a lot more mindful about my responses to certain situations or invitations. There are some days when I really, really just need to be at home in front the TV rather than out somewhere, and so I&#x2019;m learning that saying no and listening to my body when I need a rest is far more healthy than doing something I don&#x2019;t want to be doing.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Knowing the hours you put in don&#x2019;t necessarily reflect your performance</strong></p>\n\n<p>Although I have done my share of crazy work weeks, where I literally work until I can&#x2019;t keep my eyes open, I&#x2019;m a strong believer in simply working my contracted hours. For me, it&#x2019;s 8am til 5pm, so I try my best to leave around 5pm every day. If I&#x2019;m delivering the outcomes my manager or client are expecting, there is absolutely no reason why I should stay back. Not only does it leave me plenty of time for all the other things I want to do outside of work (which makes me a happier employee in general), but it also keeps me efficient during the day.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Understanding shifts in priorities</strong></p>\n\n<p>Although we would all like a perfect life, it&#x2019;s not that way. Sometimes, we do need to work those extra few hours, and the result is it&#x2019;s takeaway for dinner and the basket of laundry doesn&#x2019;t get put away. Other times, we might have to prioritize our family, and so we can&#x2019;t see our friends as much as we&#x2019;d like.</p>\n\n<p>What is important is that we understand that these different aspects of our life require constant shifts in balance. This is why if I don&#x2019;t need to stay past 5, I don&#x2019;t, because I know that in the near future I might need to work late a few nights. Understanding this means that I know that I will have time soon to clean out my wardrobe; just not right now.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5.&#xA0;It&#x2019;s OK not to be perfect</strong></p>\n\n<p>We aren&#x2019;t super humans or robots. We can&#x2019;t keep it up&#xA0;day in, day out; working crazy hours at work, going home to cook a healthy meal, and going to the gym every day. There will be days when we&#x2019;re just plain tired need a rest from it all.</p>\n\n<p>So it&#x2019;s OK when I simply&#xA0;can&#x2019;t, when I had planned to eat a chicken salad for dinner, go to the gym and work on the blog, but I end up eating takeaway Thai in front of three episodes of my current Netflix show.&#xA0;Because sometimes, a rest is just as important as being productive, and that tomorrow I&#x2019;ll pick myself up and keep going.<br>\nWhat do you do to bring balance into your life?</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/05","associated_company":"work180"}