{"url":"https://www.work180.com.au/blog/2017/12/flexible-working-its-outcomes-that-matter-at-nestle","title":"Flexible Working - it's All About the Outcomes at Nestlé ","author":"WORK180","body":"\n\t\t\t\t\t<p>We are excited to welcome Nestl&#xE9; on board as the latest progressive employer to achieve the Flex Able certification!</p><p>Whether it&#x2019;s day-to-day flexibility or more permanent flexible arrangements, the workplace culture at Nestl&#xE9; supports the different priorities and life stages of their employees. Nestl&#xE9; is committed to empowering their people through flexible work practices. They know priorities can blend and blur on any given day, which is why they trust their people to make choices about when and where they get their job done, so that they can better balance their work and personal commitments.</p><p>And it&#x2019;s all about two simple questions that employees ask themselves to decide whether to work flexibly:</p><p>1. Will I be able to get my job done?<br>2. Will my choice negatively affect others?</p><p>Nestl&#xE9; Oceania Director Human Resources, Biplab Baksi says, &#x201C;We call this <em>How We Work</em>. Our people have embraced it and we&#x2019;ve all witnessed the benefits it has created.</p><blockquote><p><em>&#x201C;We&#x2019;ve learnt new, novel ways of working, enabled by technology, which has in turn encouraged further innovation. We&#x2019;ve also strengthened our communications with colleagues as well as built new connections. Above all, our renewed focus has been a revelation. Our people have increased efficiency in both their work and personal lives, and this is leading to better results for everyone.&#x201D;</em></p></blockquote><p>Across the company, the clear focus is on outcomes, not when or where work is being done. Fostering a diverse and inclusive workplace by embracing flexibility is just one way that Nestl&#xE9; that supports their people to give their best and develop their potential.</p><p><strong>About the Flex Able Certification</strong></p><p><a data-cke-saved-href=\"http://www.dccjobs.com/advertisers/flex-able-certification\" href=\"http://www.dccjobs.com/advertisers/flex-able-certification\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float:right;\"></a></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? DCC&#x2019;s Flex Able Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><p><span style=\"font-size: 16px;\">Learn more about the&#xA0;&#xA0;</span> Flex Able <span style=\"font-size: 16px;\">&#xA0;Certification&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">here</a><span style=\"font-size: 16px;\">.</span></p><h4><strong>DCC Flex Able&#xA0;Certified Employers include:</strong></h4><p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/01fd4b52-ff62-41b9-84aa-e4d98fb074d8.png\">&#x200B;&#x200B;</p><h4><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/12","associated_company":"work180"}