{"url":"https://www.work180.com.au/blog/2018/10/flex-work-is-also-about-flexible-thinking","title":"Flex work is also about flexible thinking","author":"Sally Bruce","body":"\n\t\t\t\t\t<p>A while ago, I shared a photo on Workplace (AMP&#x2019;s internal news channel) with my team of how I put flexible work into action. I came across that post again the other day, coincidentally having just walked into work a little late after dropping my girls off at school. It made me reflect on how far we&#x2019;ve come on workplace flexibility in a relatively short space of time.</p><p>I&#x2019;m really pleased to be able to say all AMP Bank roles are All Flex because flexibility is for everyone.</p><p>With this in mind, I invited our employees to share how they make Flex work for them and their examples are fantastic. It&#x2019;s really strengthened my belief that flexible work is not just for working mums. It&#x2019;s also thinking flexibly about who else could benefit.</p><p>Don&#x2019;t get me wrong - for working mums and working dads, adjusting hours to make the school pickup is a big one. However, it&#x2019;s so rewarding to see so many examples of workplace flexibility in action in my team, and I love the little reminders &#x2013; a child in the background of a work teleconference, our CFO working at home on Wednesdays to be with the kids.</p><p>One dad recently worked from home to look after his son, to enable his wife to focus on finding her feet in a new work role. A team member with a chronic illness works from hospital on days when she needs an infusion and would otherwise need to take annual leave. Horses are a passion for another member of our team, who works from home so she can leave earlier for competitions on Friday afternoons. And for a recent new starter, working from home simply allows uninterrupted time to concentrate on induction modules.</p><p>Working flexibly looks different to different people and it is really important we have an open, ongoing conversation about it. So, in the time since I first asked the question, all AMP Bank leaders have asked their employees what flexibility might mean for them.</p><p>Available flexibility might include things like job-sharing, purchasing leave and taking career breaks. Traditional arrangements work best for some people and this is okay too, but situations change and it&#x2019;s important that people know there are options to them.</p><p>Flexible working arrangements are proven to benefit employers as well; improving productivity and bringing employees back to work who may otherwise been restricted (OECD).</p><p>Employees shouldn&#x2019;t need an excuse to work this way, because a culture of flexibility helps them to be their best self both at work and at home. If it&#x2019;s an opportunity afforded to everyone, we can more successfully break down workplace culture barriers that cause people to hesitate to ask for flexible arrangements.&#xA0;</p><p>I am personally grateful for how workplace flexibility allows me to live a higher version of my life.&#xA0;And I&#x2019;m really proud that flexibility is the norm in AMP Bank. In my experience, organisations and teams will only benefit when they embrace flexibility.</p><hr><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/594986ee-cebe-48ad-be8d-628f7f22cab3.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/594986ee-cebe-48ad-be8d-628f7f22cab3.jpeg\" style=\"font-size: 16px; float: right; margin: 10px; width: 100px;\"></p><p>This post was originally published by <a data-cke-saved-href=\"https://www.linkedin.com/pulse/flex-work-also-flexible-thinking-sally-bruce/\" href=\"https://www.linkedin.com/pulse/flex-work-also-flexible-thinking-sally-bruce/\">Sally Bruce.</a>&#xA0;</p><p><br></p><h4><strong>About AMP</strong></h4><p><span id=\"ember5688\">In 2017, </span><a data-cke-saved-href=\"https://www.work180.com.au/clients/amp\" href=\"https://www.work180.com.au/clients/amp\"><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:4007\">AMP</span></a><span id=\"ember5696\"> was again named an Employer of Choice for Gender Equality by the Workplace Gender Equality Agency. And by the end of 2020, the company aims to have women in 47% of senior executive roles and 50% of middle management roles. Maybe one of those women could be you. Visit the <a data-cke-saved-href=\"https://www.work180.com.au/clients/amp\" href=\"https://www.work180.com.au/clients/amp\">AMP employer page</a> to see what else is on offer.</span>&#x200B;</p><hr><h4><strong><span>About WORK180</span></strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.&#xA0;&#xA0;</a></p><div><br></div>\n\t\t\t\t","tags":["flexible working"],"upload_date":"2018/10"}