{"url":"https://www.work180.com.au/blog/2018/04/flexible-working-5-ways-to-keep-your-sanity-when-working-from-home","title":"Flexible Working - 5 Ways to Keep Your Sanity When Working From Home","author":"WORK180","body":"\n\t\t\t\t\t<p><img alt=\"Gemma Lloyd DCC Jobs cofounder\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/97cb708c-0457-4080-8b22-c21df0e8096a.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/97cb708c-0457-4080-8b22-c21df0e8096a.jpeg\" style=\"float:right; height:300px; margin:10px; width:200px\">When WORK180 suveyed its community, women revealed <a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want\" href=\"https://www.dccjobs.com/what-women-want\">access to flexible working a top priority</a> when assessing an employer. There&#x2019;s no argument about the benefits of flexible working- increased productivity, happier and more engaged staff and reduced office costs to name a few.<br>&#x200B;<br>Whilst flexible working comes in many forms, working from home is one that is highly desirable by employees and becoming more and more accessible. However, although working from home is incredibly beneficial (to both employee and employer), there can be some downsides if you don&#x2019;t put in place particular measures.</p><p><br></p><blockquote><p><em>WORK180 cofounder Gemma Lloyd, shares her top tips to successfully work from home.</em></p></blockquote><p><br>Working from home has been a benefit I&#x2019;ve been able to reap for the last seven years and throughout that time, I&#x2019;ve experienced both positive outcomes as well as some downsides that come with it. This includes everything from feeling lonely from not being in an office environment to working an 18-hour day because I&#x2019;ve lost track of time.<br>Below are my five top tips on how to keep your sanity when working from home:</p><h3>1) Set your alarm</h3><p>Now I&#x2019;m sure when you read that, you probably thought I meant setting your alarm to wake-up in the morning&#x2026;not this time. Set your alarm to STOP work. When working from home, it&#x2019;s extremely easy to lose track of time as you don&#x2019;t need to leave the office to go home. You can find yourself sitting in the same spot for hours on end, and before you know it, it&#x2019;s 7pm and you&#x2019;ve been working for 12 hours with barely a break. This isn&#x2019;t healthy- not only for you personally, but also for the quality of your work and personal life. Set an alarm at the beginning of the day when you begin work for 8 hours so you know when you need to clock-off. If you&#x2019;d still like to work overtime, that&#x2019;s fine, hit the snooze button- but much like we wouldn&#x2019;t sleep in too long, don&#x2019;t work too late.</p><h3>2) Get moving</h3><p>Even if you go to the gym daily, you still need to ensure you&#x2019;re having regular mini-breaks to get up, stretch and move around when working from home. I like to use Tabata, which is about 15 minutes of high intensity exercise and I do this every 2-3 hours. After this, I feel great, fresh and energised! However, even just a walk around the house will do you good.</p><h3>3) Utilise social networks</h3><p>Most organisations will have an internal social network. At WORK180, we&#x2019;ve recently moved across to Yammer. With staff spread nationally across Australia and the UK all working flexibly, this helps us keep in touch and the instant message feature is great for a quick chat. It&#x2019;s important to keep yourself connected and social especially when working from home.</p><h3>4) Set up a good workspace</h3><p>For many years when working from home, I used to drift between working on my couch, to my dining table and sometimes even my bedroom. I never fully felt in my groove until one day I set up a proper office for myself. It&#x2019;s worth investing in an ergonomic chair and desks that you&#x2019;re comfortable and don&#x2019;t cause yourself any back issues. Some employers would cover these costs so feel free to raise it with your manager. Plenty of natural light in the room is also beneficial, along with any pictures, plants or artwork (this can be a huge benefit of NOT working in a dreary office space).</p><h3>5) Shower</h3><p>&#x201C;Ewww!&#x201D; I hear you say &#x201C;of course I would shower!&#x201D; Well I&#x2019;m sorry, but if I had a dollar for the number of times people told me they wake up and sit in their PJ&#x2019;s all day while working, I&#x2019;d be very rich. Aside from the obvious cleanliness benefits of showering, it wakes you up! It makes you believe you are going into an office like you would any other day. Whereas if you do sit in your PJ&#x2019;s, it&#x2019;s easy to feel sluggish and not as productive as you usually would.<br><br>Flexible working (and in particular working from home) is incredible. It really changes your life, makes you happier and more productive both at work and personally. Following these five tips will make your work from home experience the best it can be.</p><blockquote><p><big>At WORK180, not only do our staff all work flexibly, the employers we work with are supportive of flexible working too. </big></p></blockquote><p><br></p><p><a data-cke-saved-href=\"www.dccjobs.com/advertisers/flex-able-certification\" href=\"www.dccjobs.com/advertisers/flex-able-certification\"><img alt=\"DCC&apos;s Flex Able Certification\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f162b003-0ed6-4299-868a-e88bfa272fc3.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f162b003-0ed6-4299-868a-e88bfa272fc3.png\" style=\"float:right\"></a>Look out for<a data-cke-saved-href=\"http://www.dccjobs.com/advertisers/flex-able-certification\" href=\"http://www.dccjobs.com/advertisers/flex-able-certification\">&#xA0;Flex Able Certification.</a> This is Australia&apos;s only accreditation for employers who are serious when it comes to flexibility and are &#x201C;walking the walk&#x201D;.</p><p>Join a WORK180 Endorsed Employer for Women <a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">here</a>.</p><p><br></p><p>We are also hiring! Check out the roles below to join our team:</p><p><a data-cke-saved-href=\"https://www.dccjobs.com/job/software-engineer-20/\" href=\"https://www.dccjobs.com/job/software-engineer-20/\">Software Engineer</a>&#xA0;(Australia)</p><p><a data-cke-saved-href=\"https://www.dccjobs.com/job/government-client-engagement-manager/\" href=\"https://www.dccjobs.com/job/government-client-engagement-manager/\">Government Client Engagement Manager&#xA0;</a>&#xA0;(Australia)</p><p><a data-cke-saved-href=\"https://www.dccjobs.com/job/community-engagement-manager/\" href=\"https://www.dccjobs.com/job/community-engagement-manager/\">Community Engagement Manager</a>&#xA0;(London)</p><p><br></p><p><strong>Interested in more stories about flexible working? </strong></p><p>WORK180 hosted Australia&apos;s first <a data-cke-saved-href=\"https://www.dccjobs.com/campaigns/dccs-flexible-working-week\" href=\"https://www.dccjobs.com/campaigns/dccs-flexible-working-week\">Flexible Working Week</a> in June. To celebrate all things flex we created a magazine with articles from our employers and their employees sharing stories of working flexibly. You can<a data-cke-saved-href=\"https://www.flipsnack.com/DCCJOBS/dccs-flexible-working-week-magazine.html\" href=\"https://www.flipsnack.com/DCCJOBS/dccs-flexible-working-week-magazine.html\"> read WORK180&apos;s Flexible Working Week Magazine here</a>.&#xA0;</p><p><a data-cke-saved-href=\"https://www.flipsnack.com/DCCJOBS/dccs-flexible-working-week-magazine.html\" href=\"https://www.flipsnack.com/DCCJOBS/dccs-flexible-working-week-magazine.html\"><img alt=\"DCC Jobs Flexible Working Week Magazine\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4bd5eef6-964d-4e6c-82ad-67f34931c7c7.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4bd5eef6-964d-4e6c-82ad-67f34931c7c7.png\" style=\"margin:10px\"></a></p><h5><strong>About WORK180</strong></h5><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/04","associated_company":"work180"}