{"url":"https://www.work180.com.au/blog/2018/12/nestle-flex-able-certified","title":"Food for thought why Nestlé has put trust at the heart of its business","author":"Christina Smerdon, Chief Flex Enabler","body":"\n\t\t\t\t\t<p>Nestl&#xE9; has done it again.</p>\n\n<p>They&#x2019;ve qualified for Flex Able Certification in recognition of their flexible work culture and continued efforts to embed flexibility throughout the organisation.</p>\n\n<p>They discuss it in job interviews, it&#x2019;s available to all office-based employees and everyone, from the CEO down, is behind it.</p>\n\n<p>In reality, some forms of flexible working have been available at Nestl&#xE9; for years. But in 2017, the company simplified their approach to flexible working to make it more accessible to more employees.</p>\n\n<p>They did this by launching their <em>How We Work</em> policy which was backed by a demonstrated and open commitment from the CEO and senior leadership team.</p>\n\n<p><em>How We Work </em>asks employees to answer two simple questions when considering working flexibly:</p>\n\n<ol>\n\t<li>Will I be able to get my work done?</li>\n\t<li>Will my choice negatively affect others?</li>\n</ol>\n\n<p>When the answer is &#x2018;yes&#x2019; and &#x2018;no&#x2019; respectively, employees have the green light to make appropriate choices about how and where they work.</p>\n\n<p>It&#x2019;s a philosophy that helps people achieve a balance between work and personal commitments.</p>\n\n<p>&#x201C;It was the simplicity of the two questions that helped our leaders better understand and support the initiative. We found they were better equipped to navigate the &#x2018;grey&#x2019; situations that sometimes arise with flexibility,&#x201D; says Alison Bourke, Head of Talent in Oceania.</p>\n\n<p>Some managers who were initially resistant to flexible work now acknowledge the business benefits it brings through enhanced engagement and productivity.</p>\n\n<p>Access to genuine flexible work arrangements as a core part of the Nestl&#xE9; employee value proposition has enabled them to tap into a much wider talent pool. This in turn helps the business bring more diversity into the organisation, including increased gender balance.&#xA0;&#xA0;</p>\n\n<p>Simon Sinek wrote that, &#x201C;Trust is a biological reaction to the belief that someone has our well-being at heart&#x201D; and, &#x201C;when we feel the Circle of Safety around us, we offer our blood and sweat and tears and do everything we can to see our leader&#x2019;s vision come to life&#x201D;.&#xA0;</p>\n\n<p>At Nestl&#xE9;, trust is the cornerstone of <em>How We Work</em>. It&#x2019;s about:</p>\n\n<ul>\n\t<li>Trusting their people to get their day-to-day job done, focusing even more on outcomes and less on where and when work gets done.</li>\n\t<li>Empowering their people to make choices&#xA0;</li>\n\t<li>Knowing that access to genuine flexible work arrangements makes people more productive, more inspired and more engaged which delivers better business outcomes</li>\n</ul>\n\n<p>It&#x2019;s mutual trust that Nestl&#xE9; values the most; business leaders trust their people and their people feel trusted. The HR team place a high value on &#x2018;corridor talk&#x2019; where they hear real life examples of how trust and access to flexibility is improving the lives of employees &#x2013; not just the mums with young children.</p>\n\n<p>More and more, Nestl&#xE9; are seeing the benefits of the trust they place in their employees, which is far greater than originally anticipated.</p>\n\n<p>Congratulations Nestl&#xE9; on qualifying to be a Flex Able Certified Employer once again.</p>\n\n<p>&#xA0;</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About the Flex Able Certification</strong></h4>\n\n<p><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p>\n\n<p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p>\n\n<p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? WORK180&#x2019;s&#xA0;<a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">Flex Able</a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">&#xA0;Certification&#xA0;</a>helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p>\n\n<p>Learn more about the&#xA0;Flex Able&#xA0;Certification&#xA0;<a href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">.</a></p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["nestle","flex able certification"],"upload_date":"2018/12"}