{"url":"https://www.work180.com.au/blog/2017/10/forget-bossy-let-go-of-fear-and-become-a-leader","title":"Forget Bossy: Let Go of Fear and Become a Leader","author":"WORK180","body":"\n\t\t\t\t\t<p>Since I was little, I always knew that a woman who knew her own mind was treading the fine line of being bossy. Sometimes, a little girl, who might show leadership potential, is endearingly called a little &#x2018;bossy-boots&#x2019;, and we all look at her and smile.</p>\n\n<p>But when she&#x2019;s an adult, that smile turns into a sneer of disgust. If people whisper behind her back about her, she&#x2019;s known as bossy in the worst way possible.&#xA0; &#xA0;</p>\n\n<blockquote>\n<p>For every woman, it&#x2019;s a label we&#x2019;re petrified of.</p>\n</blockquote>\n\n<p>If we want to excel in our career and <a href=\"https://www.dccjobs.com/clients\" target=\"_blank\"><strong>become a leader</strong></a>, how do we do all that without the fear of being labelled bossy?</p>\n\n<p>Until we see real generational change and our society has eliminated subconscious bias, I&#x2019;m not sure we can completely eliminate that fear. Instead, I think we need to focus our attention on working to become the best leader we can be then we should push past our fear to <strong>become role models</strong> for the next generation so that the idea of a woman in a leadership position is just as normal as a man in one.</p>\n\n<h2><strong>Becoming a leader: Confidence &amp; assertiveness</strong></h2>\n\n<p>Reflect for a moment on the people in your workplace (and here, gender is irrelevant) who you love to work for: who are great leaders because they can inspire and influence others to work for them unerringly. They will take charge, direct people, make decisions and expect hard work and dedication from their team.</p>\n\n<p>But they also know when to back down, when to listen to others, and when to take advice on board. They&apos;ll treat everyone equally, from a graduate to a senior executive, and keep an open mind. If they know they are right on a particular point, they will assert that respectfully. If their team have missed a deadline, they will question the why, and ask them to do a better job next time.</p>\n\n<p>Aim to be a leader who trusts in their team but knows when to be assertive when necessary. People will respect you all the more for it. It&#x2019;s not being bossy. It&#x2019;s being a true leader. &#xA0;</p>\n\n<h2><strong>Being yourself: working with integrity and authenticity</strong></h2>\n\n<p>A fundamental way in which to ensure we gain others&#x2019; respect is to behave in a way that aligns truly with our character, and to work in the most authentic way possible.</p>\n\n<p>I think that some of us are afraid of behaving in ways that show our feminine traits. But I strongly believe that these traits shouldn&#x2019;t be ignored. I genuinely think that one of the most compelling reasons for gender diverse teams is the opportunity to harness the different ways that men and women think to achieve the best outcome.</p>\n\n<p>We sometimes joke that we are &#x201C;mothers&#x201D;, but if you are by nature warm and friendly, do not think that you need to hide that characteristic of yours to become a leader. Some people might worry that this comes across as <em>weak, </em>but if you are confident, assertive when necessary, and simply good at what you do, you shouldn&#x2019;t let that fear stop you. In fact, I think embracing our true natures simply allows our team to see us for <em>us</em>, and encourages a more trusting team dynamic. I think it makes for a better leader.</p>\n\n<blockquote>\n<p>So, be yourself. Don&#x2019;t be afraid to be <em>female</em>, and show the world what you can do.</p>\n</blockquote>\n\n<h2><strong>Becoming a role model</strong></h2>\n\n<p>We can differentiate women in leadership positions because there are so few of us there. It&#x2019;s not the norm to have a woman on an executive board. And because of this, she may feel different; singled out; the topic of conversation.</p>\n\n<p>But that&#x2019;s fine. I think we need to be strong and fight the fear that we&#x2019;ll be labelled as bossy, and work on becoming the best leader we can be, and ultimately to be a role model for our children. We need to show that women leaders are effective and can bring around change.</p>\n\n<blockquote>\n<p>We need to show our daughters that they too, can be leaders, and show our sons that it&#x2019;s normal. Yes, our generation may struggle.</p>\n</blockquote>\n\n<p>But if we raise our heads, straighten our backs and walk into that boardroom with confidence, assurance, and a smile on our face, then we are one step closer to creating a society that embraces women as leaders without a second thought. &#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["become a leader","become a role model","Career Development"],"upload_date":"2017/10","associated_company":"work180"}