{"url":"https://www.work180.com.au/blog/2018/05/four-inspiring-pieces-of-advice-from-jamila-rizvi","title":"Four inspiring pieces of advice from Jamila Rizvi","author":"WORK180","body":"\n\t\t\t\t\t<h3>Jamila Rizvi is known for her humour, irreverence and authenticity. She inspires women to challenge the status quo and to own their own achievements. Jamila shared her stories with GHD and their clients at their 2018 International Women&#x2019;s Day event in Melbourne.</h3>\n\n<p>We asked Jamila about the challenges that women face in the workplace and what more we can do to overcome them &#x2013; here is her inspiring advice.</p>\n\n<p>&#xA0;</p>\n\n<h4>1. Don&#x2019;t worry about being perfect</h4>\n\n<p><br>\n&#x201C;I came across evidence that showed men would apply for jobs when they met 60% of the criteria, and women only at 100%. This encouraged me to stop worrying about being perfect all the time and to just have a go &#x2013; because that&#x2019;s what the blokes were doing and it was working for them.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4>2. You are entitled to take up space in the world</h4>\n\n<p><br>\n&#x201C;To speak up for yourself and have an impact requires a belief that you&#x2019;re entitled to take up space in the world. I work with a lot of women and men in the confidence space and it always begins with that simple proposition. So I look at stereotypes, presumptions and unconscious biases that make us feel like we shouldn&#x2019;t be entitled to have space and challenge those as best I can.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4>3. Bring men along on the journey</h4>\n\n<p><br>\n&#x201C;It&#x2019;s a genuine challenge for the feminist movement to find ways to bring men with us. It begins, I believe, with challenging conventional wisdom and assumptions that say we currently operate from a position of equality. We don&#x2019;t. Our workplaces are a lot more equal than they were 50 or even 20 years ago - but that doesn&#x2019;t mean they&#x2019;re equal. Using a strong evidence base to illustrate current realities of inequality and how they shape attitudes is an important first step.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4>4. Leverage your enthusiasm</h4>\n\n<p><br>\n&#x201C;The best advice I received as a young girl was that enthusiasm is the most important quality you can have at work &#x2013; always be willing to have a go.&#x201D;</p>\n\n<hr>\n<p>This post was originally published by <a href=\"https://www.ghd.com/Modules/News/index.aspx?keyword=&amp;date=04/01/2018&amp;lang=en-au&amp;newsId=b4bf52a6-1dbb-4338-8831-1329be6fec61\">GHD</a>.&#xA0;</p>\n\n<h4><a href=\"https://www.work180.com.au/clients/ghd\"><img src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDUvMDkvMDkvNTAvNTAvMTY5L0dIRCBhcHByb3ZlZC5qcGciXV0\" style=\"float: right; width: 150px; height: 147px; margin: 10px;\"></a>About GHD</h4>\n\n<p>At GHD, we want our people to feel comfortable to share all aspects of themselves at work. Our commitment to diversity and inclusion is embodied within our strategy and includes championing gender equality.</p>\n\n<p>According to Phil Duthie, our General Manager &#x2013; Australia, &#x201C;Our approach recognises that our people have a life outside of work - a life which can exist in harmony with their life at work. We&#x2019;re committed to increasing female representation in leadership positions, cultural acceptance of flexible working for all of our people, and gender balanced shortlists. Our actions continue to position us as an industry leader.&#x201D;</p>\n\n<p>Read more about GHD on their <a href=\"https://www.work180.com.au/clients/ghd\">Best Employer page.&#xA0;</a></p>\n\n<p>Browse jobs and apply to<a href=\"https://www.work180.com.au/job-search?client=ghd\"> join GHD here.&#xA0;</a></p>\n\n<hr>\n<p>Jamila was a guest speaker at our 2018 International Women&#x2019;s Day event in Melbourne:&#xA0;&#xA0;</p>\n\n<div><iframe allow=\"autoplay; encrypted-media\" allowfullscreen frameborder=\"0\" height=\"459\" src=\"https://www.youtube.com/embed/OZgMqvUX4t8\" width=\"100%\"></iframe></div>\n\n<p>&#xA0;</p>\n\n<h4>About Jamila Rizvi&#xA0;</h4>\n\n<p>Jamila is author of the best-selling&#xA0;Not Just Lucky, she writes a twice weekly column for News Limited and is a regular commentator on The Project, Today, The Drum and Q&amp;A. Previously she was Editor in Chief of the Mamamia Women&apos;s Network and an advisor to the Australian Government.</p>\n\n<hr>\n<h4>About WORK180</h4>\n\n<p>WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.</p>\n\n\t\t\t\t","tags":["gender equality","Celebrating Women","Career Development","job seeking tips"],"upload_date":"2018/05","associated_companies":["work180"]}