{"url":"https://www.work180.com.au/blog/2016/08/four-ways-to-never-feel-intimidated-again","title":"Four ways to never feel intimidated again","author":"WORK180","body":"\n\t\t\t\t\t<p>&quot;It&#x2019;s often got nothing to do with the person they&#x2019;re intimidated by, and plenty to do with the story they&#x2019;ve created about them&quot;</p>\n\n<p>Not long ago a woman in her 40s approached me after a speaking at her company&#x2019;s annual conference to ask my advice on how to have a &#x2018;courageous conversation&#x2019; with a colleague. After our conversation she said, &#x201C;Before we talked I&#x2019;d been quite intimidated by you. I guess I shouldn&#x2019;t have been.&#x201D;</p>\n\n<p>Of course I like to think of myself as approachable and unintimidating. However over the years I&#x2019;ve learnt that when people feel intimidated, it&#x2019;s often got nothing to do with the person they&#x2019;re intimidated by, and plenty to do with the story they&#x2019;ve created about them and who they are in relation to them.</p>\n\n<p>I remember back in my 20s feeling very intimidated by Bob, the national marketing manager with the oil company where I began my (first) career. It wasn&#x2019;t that Bob did anything to intimidate me. In fact he was always very friendly. Rather it was simply that he seemed so important compared to &#x2018;little ole me.&#x2019;</p>\n\n<p>While there are people in the world who have power, talent, fame, or fortune that you don&#x2019;t, none of that makes them any &#x2018;better&#x2019;, or more worthy, than you. When you own that truth, live from that truth, and connect from that truth, everyone is better off.</p>\n\n<p>Here&#x2019;s four ways to help you do just that.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. Beware of your own prejudice</strong></p>\n\n<p>So often we pre-judge people and make assumptions about what they think about us that are completely false. Yet those assumptions can derail our ability to talk to them, much less forge rewarding relationships. Engaging with people from the assumptions of &#x201C;they are better than me&#x201D; or &#x201C;they don&#x2019;t have time for the likes of me&#x201D; can exact a steep toll &#x2013; on our careers, business, relationships and self-confidence. If the story you&#x2019;re telling yourself about someone is making you feel intimidated, make up a new one.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Put no-one on a pedestal</strong></p>\n\n<p>Courtesy of Business Chicks, last year I had the incredible opportunity to spend five days with Richard Branson on Necker Island. While it would be easy to put the founder of one of the world&#x2019;s most iconic brands on a pedestal I knew that doing that might render me speechless the first time he sat down beside me at lunch. Sure, he&#x2019;s a brilliant businessman, extraordinary leader and all round pretty cool guy, but engaging with him as another human being (rather than an entrepreneurs demi-god!) enabled me to have fun as we talked about his life journey so far. So while there&#x2019;s nothing wrong with admiring people greatly, it&#x2019;s important not to treat anyone as more human than yourself.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Stand tall in your own worth</strong></p>\n\n<p>How you hold yourself physically impacts not only your psychology, but your physiology. So channel the bravest person you know, then put a quiet smile on your face, stand tall in your value, and hold yourself as every bit as worthy as anyone else. If you&#x2019;re feeling nervous about walking into a room of people, take a few deep breaths and adjust your posture and expression into that of someone who is intimidated by no-one. Your way of being, speaks far more loudly than words ever can.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Expect people to think you&#x2019;re fabulous</strong></p>\n\n<p>Whatever you project out to others is generally what you attract back. If you expect people not to notice you or think you aren&#x2019;t particularly talented or someone worth knowing, then chances are they probably will do just that. At the very least, you won&#x2019;t make near the impression on them that you&#x2019;d like. However, when you step into conversations with people from a place of self-love and self-worth, you&#x2019;ll find people are value you more highly than they would otherwise. Confident people win the confidence of people.</p>\n\n<p>&#xA0;</p>\n\n<p>Of course, there will always be insecure people in the world who deliberately use their personality, position, physicality or power to intimidate, coerce and bully in order to prop up their fragile ego. Such is life. While you cannot change them, you can choose to stand your ground and refuse to let them play you small.</p>\n\n<p>So my challenge to you is this: Next time you find feeling &#x2018;less than&#x2019; someone, make a conscious decision to put aside your assumptions, give up what you &#x201C;think they think&#x201D;, and engage with them as a human being who is no less than, nor better than, anyone else.</p>\n\n<p>When you own the one-of-a-kind fabulous person that you are, you&#x2019;ll find people will see that in you also!</p>\n\n<p>&#xA0;</p>\n\n<p>Margie is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>Originally posted on&#xA0;<a href=\"http://www.businesschicks.com.au/\" target=\"_blank\">Business Chicks</a>. &#xA0;The article can be viewed&#xA0;<a href=\"http://www.businesschicks.com.au/articles/featured/four-ways-to-never-feel-intimidated-again?mc_cid=da279c9e4e&amp;mc_eid=b8507801f4\" target=\"_blank\">here</a>.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/08","associated_company":"work180"}