{"url":"https://www.work180.com.au/blog/2017/01/four-ways-to-connect-and-support-team-members-on-parental-leave","title":"Four Ways to Connect and Support Team Members on Parental Leave","author":"WORK180","body":"\n\t\t\t\t\t<p>We recently had the pleasure of catching up with Rachel June, Analysis &amp; Improvement Specialist working with the <a data-cke-saved-href=\"https://www.dccjobs.com/clients/bhp\" target=\"_blank\" href=\"https://www.dccjobs.com/clients/bhp\">BHP</a> Coal Strategy &amp; Development team in Brisbane.</p><p>Rachel was instrumental in setting up a parents group for employees who are either on parental leave or have recently returned from parental leave in her office. Here are Rachel&#x2019;s top tips for ensuring new parents can stay connected with their organisation, build networks with other parents and enjoy a smooth transition when they return to work.</p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c8ef0527-b713-4031-a139-e31713e5671d.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c8ef0527-b713-4031-a139-e31713e5671d.jpeg\" style=\"font-size: 16px; text-align: center; height: 530px; width: 300px; margin: 10px; float: right;\"><p>Pictured from left to right; Rachel together with James Palmer (Asset President BMC presenting at one of the group sessions) Lauren Joubert and baby Jack and Ashley James -both ladies as well as Sally McLellan (not pictured) help organise the working parents network.</p><p><br></p><h4><strong>1. Create a local network</strong></h4><p>While most companies have a broad policy on staying in touch with staff on parental leave, ultimately this comes down to individual managers. Sadly, we often we hear of instances where staff on parental leave have trouble staying in the loop. This could because of a change in management, or tech issues such as email passwords expiring after a certain time.</p><blockquote><p>&#x201C;The idea for starting the Working Parents Network stemmed from a desire to create a support network for both women and men at <a data-cke-saved-href=\"https://www.dccjobs.com/clients/bhp\" target=\"_blank\" href=\"https://www.dccjobs.com/clients/bhp\">BHP</a>&#x2019;s Brisbane office,&#x201D; explained Rachel. &#x201C;We thought it would be nice to facilitate a forum for sharing experiences that are part of being a new parent and also to stay updated about the business.&#x201D;</p></blockquote><p>While Rachel attended a mother&#x2019;s group outside of work, she felt somewhat disconnected, as most other mums in the group were not planning to go back to work, whereas she was excited to.</p><p>&#xA0;&#x201C;The feeling of isolation can be very de-motivating,&#x201D; continued Rachel. &#x201C;I&#x2019;m pleased to have a network of my colleagues to reach out to, who might be experiencing similar challenges as a working parent.&#x201D;</p><p><br></p><h4><strong>2. Keep it inclusive and don&#x2019;t make assumptions</strong></h4><p>More often than not, staff who take parental leave are just as interested in the business as they were prior to having children, yet it&#x2019;s quite common for managers to assume that new parents prefer not to be &#x2018;disturbed&#x2019; while on parental leave. Worse yet, some managers assume women will not be returning to their role at all, especially when it&#x2019;s a non-traditional role. Rachel&#x2019;s advice is to never make assumptions, and simply ask questions such as &#x201C;how would you prefer to keep in touch?&#x201D; to understand the best methods of communicating.</p><blockquote><p>The Working Parents Group organisers send out monthly invitations, which mention children are more than welcome to come along. &#x201C;We are very specific with the wording used in the invites, to the point of saying children are expected to attend,&#x201D; Rachel told us.</p></blockquote><p>This creates a welcoming atmosphere for everyone and Rachel also touched on the need to shift the focus from &#x2018;mothers only&#x2019; groups&#x2019;. &#x201C;This is why we intentionally named our group &#x2018;Working Parents Group&#x2019;. The group is open to anyone and is attended by mothers, fathers, and even a proud uncle!&#x201D;</p><p><br></p><h4><strong>3. Leadership involvement is key</strong></h4><p>Even though policies around staying in touch while on leave may exist, a one size fits all may not be the answer. Rachel found hosting informal sessions for new parents was exactly what suited her colleagues. Adding the support from executive levels also a played a key part in the continuing engagement of these events.</p><blockquote><p>&#x201C;Our leadership team often attend our sessions, and provide a quick update on the business and the market,&#x201D; added Rachel. &#x201C;Their attendance demonstrates commitment to keeping communication lines open-it can be very daunting to come back after several months off without regular touchpoints with the business unit.&#x201D;</p></blockquote><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1e5b33ba-1a77-4a4e-9199-d37f5fd07aaf.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1e5b33ba-1a77-4a4e-9199-d37f5fd07aaf.jpeg\"></p><p style=\"text-align: center;\"><em>Session in progress- team members and listening to James give a business update.</em></p><p><br></p><h4><strong>4. Prepare for a smooth transition</strong></h4><p>Often there is a change in management while an employee is on parental leave, which can affect the communication flow. Rachel&#x2019;s advice is to have an alternative support framework in place, such as designated team member who can stay in touch with the employee on leave and update/invite them to relevant team meetings, morning teas, after work drinks and family picnics.&#xA0;</p><p>Preparing for a team member to return to the workplace is key. &#x201C;Managers need to communicate clearly around what projects the employee returning from leave would be involved in so that when they arrive on their first day back, there is no confusion, &#x201C; said Rachel. &#x201C;People love to know what they&#x2019;d be working on as the excitement starts to build up when they get ready to return.&#x201D; Rachel also spoke about little things, that are important but may sometimes be forgotten- &#x201C;Ensuring the returning employee has their laptop ready for them and can hit the ground running is something small, yet significant,&#x201D; concluded Rachel.</p><p><br></p><p><a data-cke-saved-href=\"https://www.dccjobs.com/flex-able-certification\" href=\"https://www.dccjobs.com/flex-able-certification\" target=\"_blank\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/47d9eac4-a59d-4e16-af53-f3fbc1e0b334.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/47d9eac4-a59d-4e16-af53-f3fbc1e0b334.png\" style=\"float: right;\"></a>&#x200B;</p><blockquote><p>Rachel&#x2019;s story is a great example of how your career does not have to miss a beat while&#xA0;balancing family responsibilities. Having the right kind of supportive employer certainly plays a big part- you can learn more about working with BHP<a data-cke-saved-href=\"https://www.dccjobs.com/clients/bhp\" target=\"_blank\" href=\"https://www.dccjobs.com/clients/bhp\">&#xA0;</a><a data-cke-saved-href=\"/clients/bhp\" href=\"https://www.dccjobs.com/clients/bhp\">here</a>. BHP is also Flex Able Certified meaning job seekers are encouraged to discuss flexible working already at the interview stage.</p><p>Apply for BHP jobs&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=bhp\" target=\"_blank\" href=\"https://www.dccjobs.com/job-search?client=bhp\">here</a>.&#xA0;</p></blockquote><hr><p>&#x200B;</p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/01","associated_company":"work180"}