{"url":"https://www.work180.com.au/blog/2016/12/four-tips-for-designing-a-flexible-challenging-and-rewarding-career","title":"Four tips for designing a Flexible, Challenging and Rewarding Career","author":"WORK180","body":"\n\t\t\t\t\t<p>While Nadia&#x2019;s official job title is Principal Landscape Architect at AECOM, her love of variety also sees her working in the operations team. Nadia&#x2019;s leading a team and managing challenging&#xA0;projects,&#xA0;while working a four-day week. Did we mention Nadia also has a&#xA0;two year old&#xA0;son and is going on maternity leave in two months? &#xA0;Her ability to drive her career forward,&#xA0;organise&#xA0;her time to juggle multiple priorities all the while enjoying her young family, is a skill we&#x2019;d all love to have!</p><blockquote><p>Here are Nadia&#x2019;s top tips for ensuring your career stays on track, remains interesting and rewarding:</p></blockquote><p><br></p><h4><strong>Seize the opportunity</strong></h4><p>Starting her career with EDAW (later acquired by AECOM) as a graduate over 10 years ago, Nadia&#x2019;s curiosity in people and systems outside of her department led her to show interest in what the Operation Manager, who sat next to her was working on. &#x201C;I ended up asking lots of questions, learning on the job and eventually fulfilling that role too,&#x201D; recalled Nadia. &#x201C;I&#x2019;m loving the balance between&#xA0;utilising&#xA0;my core skills in landscape architecture and adding business management into the mix.&#x201D;</p><p>While Nadia picked up the Operation Manager role by throwing herself in at the deep end, she has seen colleagues around her take advantage of AECOM&#x2019;s online University to broaden their expertise. &#x201C;There&#x2019;s a training course for everything you can imagine, with over 1,500 courses to choose from!&#x201D;</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9cbaef40-b823-4bd6-8c31-33098bca35b5.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9cbaef40-b823-4bd6-8c31-33098bca35b5.jpeg\"></p><h4><strong>Planning and staying focused is key</strong></h4><p>Nadia makes sure to plan out her week, either on Sunday evening or first thing on Monday. &#x201C;Although my running to-do list is regularly three pages long, I focus on accomplishing 3-5 critical and at least another 5 not so critical tasks on any given day,&#x201D; explained Nadia. &#x201C;This also helps me ensure everything important gets done first and can&#xA0;prioritise&#xA0;&#x201C;urgent&#x201D; requests from others.&#x201D;</p><p>Because Nadia works across two disciplines, she needs to be mindful of navigating busy periods as they arise. &#x201C;For example, towards the end of each month or particularly at the end of the financial year, I know I need to free up time for the Operations team, and vice versa when I need to&#xA0;prioritise&#xA0;project work I have the flexibility to adjust the balance between the two roles,&#x201D; said Nadia.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a685047a-e3f9-4e8b-abe7-85f602a5cd5a.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a685047a-e3f9-4e8b-abe7-85f602a5cd5a.jpeg\"></p><h4><strong>Find your balance when working flexibly&#xA0;</strong></h4><p>We certainly admire this level of&#xA0;organisation, and asked Nadia how on earth she manages such an exciting and challenging career in four days a week!</p><p>Through the recent technology upgrade, Nadia finds it easy to connect to everything she needs&#xA0;to,&#xA0;if she ever needs to work from home. &#x201C;Today is a great example,&#x201D; said Nadia. &#x201C;I&#x2019;m leaving the office at&#xA0;4pm&#xA0;to pick up my son, and I can easily make up that hour at home as it takes me under a minute to log in and access all the internal systems from my laptop. There is&#xA0;minimal&#xA0;difference&#xA0;to&#xA0;being in the office in terms of connectivity.&#x201D;</p><p>Nadia is surrounded by people who work flexibly, with managers leading by example.</p><p>&#x201C;Our team has been working flexibly for a long time, well before the company&#xA0;formalised&#xA0;flexible working arrangements for everyone,&#x201D; explained Nadia. &#x201C;And it&#x2019;s not just the women- it is&#xA0;common-place&#xA0;for men in the team to&#xA0;vary&#xA0;their working arrangements, whether it be working 4 days a week to share childcare responsibilities when children are young, or varying start and finish times to work around school drop-off and pick-ups.&#x201D;</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ff282866-6818-4c84-af6d-5301c30e74dd.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ff282866-6818-4c84-af6d-5301c30e74dd.jpeg\"></p><h4><strong>Parental leave does not signal the end of your career</strong></h4><p>&#x201C;My career is very important to me, and is still at the forefront of my mind, even when I&#x2019;ve taken time off to have children,&#x201D; said Nadia. &#x201C;I hear so many discouraging stories from women outside of AECOM- incidents where exciting projects seem to dry up as soon as they go on maternity leave, which is simply&#xA0;demoralising.&#x201D;</p><p>In Nadia&apos;s team, three women have just returned part time from maternity leave, one is currently on leave and another going on leave around the same time as Nadia. Nadia describes AECOM&#x2019;s culture as supportive and well structured-&#x201C;Through collaboration with our managers, and learning from previous experiences, the team has set up a successful process for handing over responsibilities ahead of time so we are not stressed before going on maternity leave. Then there is confidence that there will be no downtime on projects and tasks due to&#xA0;handovers.&#x201D;</p><p>While on maternity leave, or any leave for that matter, AECOM has a system in place for employees to stay connected. &#x201C;We have a buddy in the office, who provides regular updates, we are invited to all the team social functions, and given the opportunity to attend any important training while we&#x2019;re on leave,&#x201D; explained Nadia.</p><blockquote><p>Nadia&#x2019;s story is a great example of how your career does not have to miss a beat while balancing family responsibilities.</p><p>Find out more about AECOM and view their jobs <a data-cke-saved-href=\"/clients/AECOM\" href=\"/clients/AECOM\">here</a>.</p></blockquote><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/12","associated_company":"work180"}