{"url":"https://www.work180.com.au/blog/2018/05/from-dreams-of-being-a-spy-to-a-leap-of-faith-dot-dot-dot-in-it","title":"From dreams of being a spy to a leap of faith…in IT","author":"WORK180","body":"\n\t\t\t\t\t<p>Fresh out of university I started my career in the NSW Roads and Maritime Services (known then as the Roads and Traffic Authority) as a policy graduate. Having completed my Bachelor of International Studies with a double major in Italian and politics, I dreamt of becoming a diplomat, which appealed to me because I would get to travel to different countries every few years &#x2013; or something adventurous like a spy because of the possibility of dangerous locations and obscure countries.</p><blockquote><p><em>The thought of being a spy gave me quite the adrenaline rush and I love learning new languages.&#xA0;</em></p></blockquote><p>I went through the recruitment process and the real deterrent for me was actually the thought of moving to Canberra. I was told that where I would have to be based there for around three years until I would be assigned my first post as Intelligence officer (official title for spy) and being away from family and friends while I impatiently waited for my adventure to begin.</p><p>I am not afraid to admit that at the time, the RTA was not chosen because of its employee benefits or my passion for transport&#x2026;it was chosen because it was close to home and offered a guaranteed permanent job at the end of the graduate program. Bizarrely enough, I did not picture a career move in IT...so how have I ended up here is a good question!</p><h3><strong>Taking some risks &#x2013; step out of your comfort zone</strong></h3><p>During my time in the graduate program, I rarely selected &#x2018;safe&#x2019; placements where others could show me the incredible policies they drafted or the projects they had worked on &#x2013; instead I explored the unknown, placements other graduates had not been before.</p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4cc22519-adcc-4401-bd91-ec962a59f242.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4cc22519-adcc-4401-bd91-ec962a59f242.jpeg\" style=\"font-size: 16px; float: right; margin: 10px;\"></p><div><p>Attending a networking event where managers met us graduates was a great way for me to hear about placement options. Before we started to mingle, we all stood up, introduced ourselves, and stated our other completed placements along with something others may not know about us.</p><blockquote><p><em>I decided to tell everyone about my black belt in karate and how I had dabbled in samurai sword training. I seemed to draw a bit of attention and was bombarded by various managers.&#xA0;&#xA0;</em></p></blockquote><p>The placement that intrigued me was in the ministerial and correspondence team, which meant I would also have exposure to the Chief Executive&#x2019;s Office and Minister&#x2019;s Office, which was uncommon for graduates. It was a challenging role, high pressured, and yes I developed some unfavourable habits like a coffee addiction and caved into sugar cravings (both now under control), but the opportunities I was provided were unimaginable!</p><p>I was involved in the Budget Estimates process and attended the hearing &#x2013; where I also managed to end up breaking a high heel on the way and quickly had it nailed back on so I could run to Parliament (haha) &#x2013; Questions on Notice, providing reports to the Minister&#x2019;s office, and gained a strategic top-down view of the priorities and direction for the agency.</p><p>Another opportunity was working in one of our regional maintenance areas in Southern Region (Wollongong), while others relocated to Wagga Wagga, even Parkes or Grafton. Though I did not venture far from my home in the Sutherland Shire, it was still my first time living alone, which was part of the learning curve for me.</p><p>As the team&#x2019;s first policy graduate, it was testing at times because the word &#x2018;policy&#x2019; seemed to be almost alien to them. I had to prove my worth and value.&#xA0; This role gave me a firsthand view of what putting policy into practice looked like. It also showed me what could go wrong if it was developed in isolation in what was perceived as the &#x2018;ivory tower&#x2019;. I was often escaping the office and exploring different worksites to understand what the business and the teams were involved in. I gained a different perspective, met some incredible people along the way and learnt a lot about myself.</p><p>My supervisor could sense that I was eager and a very driven people person. She had me giving presentations to worksite supervisors, assisting with coordination and facilitation of &#x2018;Leadership on Worksites&#x2019; Training, and they also put me in charge of developing a business and marketing plan for the section. It was one of the most personally rewarding experiences and seven years later my supervisor who pushed me and supported me still remains a close friend.</p><p><br></p><h4><strong>Know your worth and value &#x2013; technical expertise does not guarantee you get the job</strong></h4><p>In my current role, I cannot say that I was successful because I have an extensive background in IT or academic qualifications in communications. The key reasons why come down to:</p><ul><li>My passion &#x2013; Having worked in various roles I managed to figure out that working closely with people and engaging and motivating them is something I am really passionate about. It is what gets me out of bed in the morning. <strong>Time to think about what makes you love going to work and harness that into your next career move</strong>.<br><br></li><li>My ability to turn technical language into plain English &#x2013; Through my time drafting correspondence and briefings to the Minister&#x2019;s office, and being secretariat for governance forums including for the previous RMS Chief Executive, I have learnt to be concise. <strong>Consider being clearer in communications, think about your audience and the purpose &#x2013; getting straight to the point saves your reader time. </strong><br><br></li><li>My &#x2018;can do&#x2019; attitude &#x2013; I enjoy learning and training and I will give most things a go. I believe we never stop learning and that teamwork is about supporting one another. Although I work within the boundaries of my Position Description I am not afraid of venturing a little outside of it if it means assisting others or taking my career to a new level. Before electronic workflows, electronic signatures and sufficient technology in place to work remotely, I agreed to spend two hours out of my day traveling in order to have an Executive sign a key document. At the time I had no idea that this would make such a long lasting impact. A year later, I was contacted for a secondment opportunity which was not one, but two roles above the role I was in. The manager recalled the scenario and mentioned how I said yes without question when someone else said no and believed it was basically beneath them. I was respected as someone who would take action, sometimes make sacrifices and step up where others wouldn&#x2019;t. <strong>Sometimes we need to demonstrate how we can contribute to the bigger picture in what may be perceived as a smaller way in order to show that we are willing and committed to supporting the team.</strong></li></ul><p>Looking back would I have done things differently? &#x2013; definitely not, because I have been in roles with some incredible, inspiring leaders, gone through a lot of growth and can happily say that even though it&#x2019;s early days...I am in a role I thoroughly enjoy and am surrounded by a team that is &#xA0;motivated, passionate and supportive &#x2013; and we treat each other more like family than only colleagues.</p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8628ad92-dff3-4d53-a303-8b28be60e2bb.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8628ad92-dff3-4d53-a303-8b28be60e2bb.jpeg\" style=\"margin: 10px;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/512e1f57-f791-49dc-9c43-f96e31dbf066.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/512e1f57-f791-49dc-9c43-f96e31dbf066.jpeg\" style=\"margin: 10px;\"></p><p><em>Superhero Daughter Day 2018 &#x2013; I dressed up as Wonder Woman to inspire the young girls. Pushing Diversity and Inclusion is a key passion and it starts from when we are young. Can&#x2019;t wait to be part of the event again!</em></p><hr><h3><strong>About the Author&#xA0;<a data-cke-saved-href=\"http://www.work180.com.au/clients/rms\" href=\"http://www.work180.com.au/clients/rms\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/06bfaae7-c80a-4a44-85df-59752033da72.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/06bfaae7-c80a-4a44-85df-59752033da72.png\" style=\"float: right; margin: 10px;\"></a></strong></h3><p>Constance Iannelli is the IT Stakeholder Relations Manager at Roads and Maritime (RMS) IT. RMS is an Endorsed Employer for Women.&#xA0;RMS offers many benefits including;</p><ul><li>14 weeks paid maternity, adoption and surrogacy leave</li><li>Only 10 Months minimum tenure to be eligible for paid parental leave</li><li>Staying Connected - parental leave program</li><li>Flexible Working</li><li>Discounted Fitness Passport &#x2013; access to over 400+ gyms/pools</li></ul><p>+ much more on their <a data-cke-saved-href=\"https://www.work180.com.au/clients/rms\" href=\"https://www.work180.com.au/clients/rms\">Best Employer page</a>&#xA0;and <a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=rms\" href=\"https://www.work180.com.au/job-search?client=rms\">apply for jobs</a> with RMS.</p><hr><h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.</p></div>\n\t\t\t\t","tags":["Employee Stories","Celebrating Women","Career Development"],"upload_date":"2018/05","associated_companies":["work180"]}