{"url":"https://www.work180.com.au/blog/2017/01/gender-equality-in-the-public-and-private-sectors-what-can-we-learn-from-each-other","title":"Gender Equality in the Public and Private Sectors: What Can We Learn From Each Other?","author":"WORK180","body":"\n\t\t\t\t\t<p>In anticipation of Queensland Women&#x2019;s Week, I wanted pay recognition to some wonderful initiatives by Queensland Government and private sector, particularly those which align to the&#xA0;<a href=\"http://www.communities.qld.gov.au/gateway/womens-strategy\" target=\"_blank\">Queensland Women&#x2019;s Strategy</a>. The Queensland Women&#x2019;s Strategy provides a framework for government, the private sector and the wider Queensland community to take significant action to achieve gender equality in Queensland.</p>\n\n<p>The strategy focuses on four priority areas. Through my work at&#xA0;DCC Jobs, I&#x2019;m exposed to incredible organisational initiatives every day. Below, you&#x2019;ll find a summary of some key initiatives, mapped out to each priority area with an outline of how gender equality directly effects each area. The education of today&#x2019;s business leaders on the critical role they need to play in order to advance women and girls is crucial for improving business, society and the economy.</p>\n\n<p><strong>1.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Participation and Leadership</strong></p>\n\n<p>Per&#xA0;Queensland Government&#x2019;s Strategy, the big issues for women in participation and leadership are:</p>\n\n<ul>\n\t<li>\n\t<p>women&#x2019;s access to male-dominated occupations and industries such as science, technology, engineering, mathematics, building, construction, mining and agriculture</p>\n\t</li>\n\t<li>\n\t<p>access to flexible work arrangements for everyone</p>\n\t</li>\n\t<li>\n\t<p>women&#x2019;s workforce participation</p>\n\t</li>\n\t<li>\n\t<p>women in leadership positions</p>\n\t</li>\n</ul>\n\n<p>To this effect, the QLD Government introduced&#xA0;<a href=\"http://www.communities.qld.gov.au/communityservices/women/women-boards\" target=\"_blank\">Gender Equity targets</a>&#xA0;of 50% of all new board appointees to Queensland Government bodies must be women; and 50% representation of women on the boards of Queensland Government bodies. The&#xA0;<a href=\"http://www2.deloitte.com/content/dam/Deloitte/au/Documents/Economics/deloitte-au-toward-gender-parity-women-on-boards-initiative-041016.pdf\" target=\"_blank\">Deloitte Access Economics Research Report</a>&#xA0;showed there could be productivity gains of over $87 million per annum should Queensland Government reach board parity.</p>\n\n<p>Here are some of the initiatives we&#x2019;ve seen implemented by DCC clients, which directly impact the issues above:</p>\n\n<ul>\n\t<li>\n\t<p>Bank of Queensland has publicly committed to 50% women in leadership roles by 2020, and in five short months, the&#xA0;<a href=\"http://blog.boq.com.au/boq-dcc-getting-more-women-in-finance/?__hstc=118090006.006a4cdb5c825375de95966f9eb884e5.1477478382612.1485423597922.1485426844156.319&amp;__hssc=118090006.2.1485426844156&amp;__hsfp=615223669\" target=\"_blank\">number of women in leadership rose from 27% to 32%</a></p>\n\t</li>\n\t<li>\n\t<p>Aurecon, one of the first companies in Australia to be awarded the&#xA0;<a href=\"/flex-able-certification\" target=\"_blank\">Flex Able Certification</a>, has made flexible work arrangements accessible for anyone, by removing the need to specify a reason for requesting flexible work1</p>\n\t</li>\n\t<li>\n\t<p>AECOM&#x2019;s&#xA0;<a href=\"http://www.diversecitycareers.com/aecom\" target=\"_blank\">successful m-Cirlces mentoring program</a>&#xA0;helped female employees gain access to senior male and female leaders, skill development and expand their professional networks</p>\n\t</li>\n\t<li>\n\t<p>Gender stereotypes are being challenged through not-for-profit events such as&#xA0;<a href=\"/superhero-daughter-day-2\" target=\"_blank\">Superhero Daughter Day</a>, to encourage girls that a career in STEM is for everyone. This is even more critical in light of the recent&#xA0;<a href=\"http://science.sciencemag.org/content/355/6323/389\" target=\"_blank\">study</a>, which builds on a growing body of research that suggests gender stereotypes can shape children&apos;s interest and career ambitions by the time they are 6 years old.</p>\n\t</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<p><strong>2.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Economic Security</strong></p>\n\n<p><a href=\"http://www.dpmc.gov.au/office-women/economic-security/womens-workforce-participation\" target=\"_blank\">The federal government</a>&#xA0;understands increased women&#x2019;s workforce participation is essential to support economic growth and Australia&#x2019;s future prosperity. Under Australia&#x2019;s G20 presidency, leaders agreed to work towards reducing the gender gap in workforce participation by 25 per cent by 2025. In Australia, this could result in up to 200,000 additional women in the labour force, above current employment projections.</p>\n\n<p>A 2012 report from the Grattan Institute,&#xA0;<a href=\"http://grattan.edu.au/wp-content/uploads/2014/04/Game_Changers_Web.pdf\" target=\"_blank\">Game-changers: Economic Reform Priorities for Australia</a>, estimated that increasing female workforce participation by around 6% would increase the size of the Australian economy by about $25 billion per year.</p>\n\n<p><a href=\"http://www.asx.com.au/documents/about/gsjbw_economic_case_for_increasing_female_participation.pdf\" target=\"_blank\">Australia&#x2019;s Hidden Resource: The Economic Case For Increasing Female Participation</a>&#xA0;compiled by Goldman Sachs JB Were, estimates that In Australia, equality would boost our GDP by 11%.</p>\n\n<p>One of the most innovative approaches we&#x2019;ve seen organisations such as AustralianSuper take to support the economy, include paying superannuation whilst their employees are on parental leave- whether the leave is paid or unpaid. There are many factors which contribute to women having less super than men, including the time taken off work after having children. On average, women also live longer than men, therefore combined with less superannuation, there are many women late in age living in poverty.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Safety</strong></p>\n\n<p>Gender inequality is consistently cited as an underlying determinant of violence against women. Per the South Australian Premier&apos;s Council for Women, social norms and gendered expectations shape the roles of men and women, defining what is considered appropriate behaviours for each sex. In many societies, women are viewed as subordinate to men and have a lower social status.</p>\n\n<p>In many cases this has led to domination over and discrimination against women by men. Violence against women is one way women are forced into lower positions of power.</p>\n\n<p>DCC Jobs&#x2019;&#xA0;criteria process&#xA0;for assessing organisations as employers of choice for women checks if the organisation has implemented a domestic violence policy. Currently 79% of organisations advertising roles on the DCC job board, including&#xA0;<a href=\"/clients/BHP\" target=\"_blank\">BHP</a>, Barwon Water and&#xA0;<a href=\"/clients/cbus\" target=\"_blank\">Cbus</a>&#xA0;have a domestic violence policy. This means that employees have access to support and therefore are safer than if they worked for an organisation which didn&#x2019;t help them or where they couldn&#x2019;t speak up.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Health and Wellbeing</strong></p>\n\n<p>The&#xA0;<a href=\"http://www.who.int/mental_health/prevention/genderwomen/en/\" target=\"_blank\">World Health Organisation</a>&#xA0;states that gender is a critical determinant of mental health and mental illness. If you look at inequality, women being less empowered than male counterparts can directly contribute to anxiety and depression. In addition to this, ensuring and supporting flexible work options has a significant impact on physical and mental health. This could be anything from ensuring you can fit exercise into a busy work schedule to spending more time with family for mental wellbeing.</p>\n\n<p><a href=\"/clients/commonwealth-bank\" target=\"_blank\">Commbank</a>&#xA0;is just one example of an organisation supporting their employees to be as healthy and happy as possible, and to lead balanced and productive lives. They offer private health insurance, wellbeing workshops, have their own sports club and provide online resources.</p>\n\n<p>In celebration of Queensland Women&#x2019;s Week and International Women&#x2019;s Day in March, DCC together with our corporate partners Deloitte and Aurecon are hosting several events you may be interested in:</p>\n\n<p><strong>Gender Equality in the Public and Private Sectors: What can we learn from each other?</strong></p>\n\n<p>Sydney: 23rd February 12-2pm</p>\n\n<p>Brisbane: 27th February 12-2pm</p>\n\n<p>DCC are fortunate to work with the most passionate HR &amp; D&amp;I practitioners in Australia. Their dedication to creating diverse and inclusive workplaces and advocacy work for gender equality outside of their organisations is achieving positive change in their industries.</p>\n\n<p>The DCC Cross- Industry Innovation Series is an exclusive, interactive roundtable discussion for those who want to accelerate gender equality within and outside of their organisations and learn from each other. Due to the nature of this event, seats are strictly limited. If you are interested in attending, please email&#xA0;<a href=\"http://mailto:dcc@diversecitycareers.com/\" target=\"_blank\">dcc@diversecitycareers.com</a>.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Superhero Daughter Day</strong></p>\n\n<p>Held in every capital city in Australia and in Auckland, this is an incredible opportunity for primary school girls, along with their parents or guardians, to learn why coding is cool!&#xA0;<a href=\"/superhero-daughter-day-2\" target=\"_blank\">Read more here</a>.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/55bb2abc-edbb-422f-a1ee-43d2db4b9ec7.png\"></p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/01","associated_company":"work180"}