{"url":"https://www.work180.com.au/blog/2015/12/gender-equality-the-highs-and-lows-of-2015","title":"Gender Equality - The highs and lows of 2015","author":"WORK180","body":"\n\t\t\t\t\t<p>2015&#xA0;has seen many &#x2018;firsts&#x2019; for individuals, countries and organisations. We&#x2019;ve compiled a few of our most memorable moments in history, both good and bad.</p><p><br></p><p><strong>Australia drops down in the Global Gender Gap Index</strong></p><p>Australia may boast some of the world&apos;s most liveable cities, a strong economy and a laid-back lifestyle, but when it comes to gender equality Australia doesn&apos;t even rank in the top 30. In fact, we&#x2019;ve continued to slide backwards, going from 15th in 2006, to 24th in 2014 and ranking 36th in 2015. At this rate gender equality will not be achieved until at least 2133.</p><p><br></p><p><strong>Slight progress in female leadership within ASX listed companies</strong></p><p>From the top 200 companies, 40 have reached the aim of having 30% of board being female which is up on 7 last year. But there are still at least 30 companies with no females at all.</p><p><br></p><p><strong>The Workplace Gender Equality Agency reports showed improvement in some areas</strong></p><ul><li>60.2% of companies reporting to WGEA introduced flexible work compared to 57.5% in 2014.</li><li>20.6% of companies have a gender equality strategy up from 18.3% in 2014.</li></ul><p><br></p><p><strong>Men continue to out-earn women in Australia</strong></p><p>World-leading data covering four million employees in Australia revealed pay gaps persist across industries, occupations and management categories.</p><p>The second year of data collected by the Workplace Gender Equality Agency covers 12,229 employers and represents over 40% of employees in Australia. It found an overall gender pay gap of 24.0% on average full-time total remuneration (including bonuses, allowances and superannuation), representing a difference of $27,254 a year.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2e11a7a1-c670-4a18-ad3e-10eabdebf335.png\">&#x200B;</p><p>Source: <a data-cke-saved-href=\"https://www.wgea.gov.au/media-releases/men-out-earn-women-27000-year-new-data\" href=\"https://www.wgea.gov.au/media-releases/men-out-earn-women-27000-year-new-data\">https://www.wgea.gov.au/media-releases/men-out-earn-women-27000-year-new-data</a></p><p><br></p><p><a data-cke-saved-href=\"http://www.diversecitycareers.com/news/the-importance-of-women-in-sport/9697/\" href=\"http://www.diversecitycareers.com/news/the-importance-of-women-in-sport/9697/\" target=\"_blank\">The importance of women in sports</a> is crucial to developing role models for the next generation of women- positive portrayal by the media and sporting associations is the key to driving this forward. We&#x2019;re pleased to see many advances in this area in 2015:</p><p><br></p><p><strong>Michelle Payne became the first&#xA0;woman&#xA0;to&#xA0;win&#xA0;Australia&apos;s 154-year-old&#xA0;Melbourne Cup</strong></p><p>Ecstatic to win in a sport she described as&#xA0;&quot;chauvinistic&#x201D;, Michelle had a message for anyone who thought a woman wasn&#x2019;t strong enough to ride a Melbourne Cup winner, which was simply to &#x201C;get stuffed&#x201D;.</p><p>But those two words would never be said to Darren Weir, the trainer who didn&#x2019;t care about the public bias and gave her the chance to shine. Darren also employed Michelle&#x2019;s younger brother Stevie, a Downs syndrome sufferer, as a strapper for the last decade.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8cc06536-d875-4e49-ba57-c29cd6ecd696.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8cc06536-d875-4e49-ba57-c29cd6ecd696.jpeg\"></p><p><br></p><p><strong>Two women&apos;s title fights headline UFC 193 in Melbourne for the first time in history</strong></p><p>A UFC record crowd of 70,000 were in attendance at Etihad Stadium in Melbourne, on November 15th, 2015. This was the first time two women&apos;s title fights headlined a UFC event. In addition to the Ronda Rousey vs Holly Holm match, Women&apos;s Strawweight Champion Joanna Jedrzejczyk defended her title against Valerie Letourneau.</p><p>We also saw Electronic Arts announce that its new mixed martial arts video game, EA Sports UFC 2, will feature Ronda Rousey on its cover. Fans will also be able to play as a female fighter in the game&#x2019;s Career Mode for the first time, which is a great shift in another male-dominated sport.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5f11bdda-d6fa-4503-bf6a-f3b5257a2a57.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5f11bdda-d6fa-4503-bf6a-f3b5257a2a57.png\"></p><p><br></p><p><strong>Serena Williams became the first woman in 32 years to be named Sportsperson of Year by Sports Illustrated</strong></p><p>Since the inception of the SI Sportsperson of the Year award in 1954, <a data-cke-saved-href=\"http://www.si.com/si-sportsperson-history-female-winners-serena-williams\" href=\"http://www.si.com/si-sportsperson-history-female-winners-serena-williams\">women have been included</a>&#xA0;in the honour ten times&#x2014;and only three of those winners were the sole honouree (e.g. not honoured along with male winner or as members of a team). Before Serena, the only other female winners who did not share the honor with someone else were tennis star Chris Evert in 1976 and runner Mary Decker in 1983.</p><p>Another barrier has been broken, too. Serena is the first sole African American woman to hold the honour. &#x201C;We are honouring Serena Williams too for reasons that hang in the grayer, less comfortable ether, where issues such as race and femininity collide with the games,&#x201D; said SI Managing Editor Chris Stone.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a84b9d8a-a1a4-4ed2-b62f-4dc95e961d94.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a84b9d8a-a1a4-4ed2-b62f-4dc95e961d94.png\"></p><p>Source: <a data-cke-saved-href=\"http://fortune.com/2015/12/14/serena-williams-sports-illustrated/\" href=\"http://fortune.com/2015/12/14/serena-williams-sports-illustrated/\">http://fortune.com/2015/12/14/serena-williams-sports-illustrated/</a></p><p><strong>We&#x2019;ve also seen some great initiatives both locally and across the world in a number of sectors:</strong></p><p><br></p><p><strong>Canada unveils its first equal cabinet with 15 men and 15 women </strong></p><p>The new Canadian Prime Minister, Justin Trudeau, has named his first ministerial cabinet - the first in the country&apos;s history to have gender parity. When questioned why he&#x2019;d chosen equal numbers on men and women, the PM replied &#x201C;because it&apos;s 2015&#x201D;.</p><h4 style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1d7d7f37-74c0-4ac1-8e00-8f3507c8c694.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1d7d7f37-74c0-4ac1-8e00-8f3507c8c694.png\"></h4><p><strong>Screen Australia announces $5m program to boost number of women in film and TV</strong></p><p>The program by the government agency for film and TV aims to address the underrepresentation of women in the Australian film and TV industry.</p><p>The imbalance is starkest in film, with women making up only a third of producers, a quarter of writers, and one in seven film directors.</p><p>The program offers incentives for projects that employ women as protagonists and in positions of creative control.</p><p>Source: <a data-cke-saved-href=\"http://www.abc.net.au/news/2015-12-07/screen-australia-program-to-boost-women-ranks-in-tv-film/7006068\" href=\"http://www.abc.net.au/news/2015-12-07/screen-australia-program-to-boost-women-ranks-in-tv-film/7006068\">http://www.abc.net.au/news/2015-12-07/screen-australia-program-to-boost-women-ranks-in-tv-film/7006068</a></p><p><br></p><p><strong>Australian Institutions embrace a successful initiative from the UK to improve gender equity in Australian STEMM organisations</strong></p><p>The program is based on the Athena SWAN Charter, an evaluation and accreditation framework from the UK that addresses the improvement of gender equity policies and practices in STEMM (Science, Technology, Engineering, Mathematics, and Medicine). Athena SWAN has been operating for 10 years and it has shown significant results in improving gender diversity, and bolstering women&#x2019;s leadership roles within STEMM institutions.</p><p>SAGE&#xA0;was overwhelmed by the response from the sector and has&#xA0;accepted applications from a total of&#xA0;<a data-cke-saved-href=\"http://www.sciencegenderequity.org.au/athena-swan-charter-members/\" href=\"http://www.sciencegenderequity.org.au/athena-swan-charter-members/\">32 institutions.</a> This includes half the university sector, with representation across the five university types (from Group of Eight to Unaligned), as well as medical research institutions and government research agencies. The pilot includes 24 (of 43) Australian universities, five medical research institutes and two publicly funded research agencies.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1325151d-f8c0-4342-9e89-59f7f14a54c8.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1325151d-f8c0-4342-9e89-59f7f14a54c8.jpeg\">&#x200B;</p><p>Commencing in September 2015, the pilot&#xA0;requires participants to collect, analyse and present data on gender equity policies and practices in STEMM departments, as well as identify gaps and opportunities for improvement. Participants will work towards an Athena SWAN Award at the Institutional Bronze level, which is a mandatory requirement for future Silver and Gold awards at the institutional and departmental levels.</p><p>Source: <a data-cke-saved-href=\"http://www.sciencegenderequity.org.au/science-in-australia-gender-equity-sage-pilot-2015/\" href=\"http://www.sciencegenderequity.org.au/science-in-australia-gender-equity-sage-pilot-2015/\">http://www.sciencegenderequity.org.au/science-in-australia-gender-equity-sage-pilot-2015/</a></p><p>We&#x2019;re proud to be working with <a data-cke-saved-href=\"http://www.diversecitycareers.com/flagshipgroup\" href=\"http://www.diversecitycareers.com/flagshipgroup\">companies</a> who are striving to gain gender equality within their workplaces and look forward to seeing more progress in 2016!</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/12","associated_company":"work180"}