{"url":"https://www.work180.com.au/blog/2017/01/goal-setting-is-so-2016-dot-dot-dot-why-fear-setting-is-the-way-of-the-future","title":"Goal Setting is so 2016…Why ‘Fear Setting’ is the Way of the Future","author":"WORK180","body":"\n\t\t\t\t\t<p>As a new year approaches, it&#x2019;s time to reflect on the year that was, set new challenges and list your goals&#x2026;</p>\n\n<p>*cue clich&#xE9;*</p>\n\n<p>How many times have you approached the new year, and thought to yourself &#x201C;OK, this is it, this will be the year I achieve my goals!&#x201D; Whether your goal is to get a promotion, become fitter and healthier, quit your job or start a business, there&#x2019;s a high chance you&#x2019;ve set this goal before, and haven&#x2019;t reached it.</p>\n\n<p>Don&#x2019;t get me wrong, goal setting is something I&#x2019;ve done for many years, sometimes successfully, sometimes not so much. This caused me to question the concept and research the factors which contribute to making a set goal successful, or not.</p>\n\n<p>There are several reasons which can cause someone to not achieve their goal, often this comes down to breaking the fundamental rules of SMART goals (you can view a blog post I wrote about <strong>SMART</strong> goals in March 2016 here). In essence, it means a goal should be the following:</p>\n\n<ul>\n\t<li>\n\t<p>Specific</p>\n\t</li>\n\t<li>\n\t<p>Measurable</p>\n\t</li>\n\t<li>\n\t<p>Accountable</p>\n\t</li>\n\t<li>\n\t<p>Realistic</p>\n\t</li>\n\t<li>\n\t<p>Time-bound</p>\n\t</li>\n</ul>\n\n<p>However, since becoming an entrepreneur and given my somewhat &#x2018;Type A&#x2019; personality, I realised I had to find a better way of setting and achieving goals, particularly those I identified as high risk.</p>\n\n<p>Upon reflection, I recognised I was doing something very different for the successful goals compared to the unsuccessful goals. For the goals I achieved, not only was I following the SMART principles, but I had no fear and the risk of failure seemed insignificant to the potential rewards.</p>\n\n<p>Tim Ferriss, creator of the&#xA0;<a href=\"http://fourhourworkweek.com/\" target=\"_blank\">4-hour work week</a>&#xA0;(a great read I highly recommend) came up with the concept of Fear Setting. As per the Business Insider article&#xA0;<a href=\"http://www.businessinsider.com.au/tim-ferriss-on-exercise-to-overcome-fears-2015-4\" target=\"_blank\">&#x201C;A simple 3-step exercise to overcome fears&#x201D;</a>:</p>\n\n<p>&#xA0;</p>\n\n<p>Begin by thinking of a goal that is important to you but that you&#x2019;ve kept yourself from attempting, and divide a piece of paper into three columns.</p>\n\n<ul>\n\t<li>\n\t<p>In the first column, write down all of the things that could go wrong should your attempt fail. Think of the most terrible things possible.</p>\n\t</li>\n\t<li>\n\t<p>In the second column, determine ways that you can mitigate the possibility of each of those bad consequences from happening.</p>\n\t</li>\n\t<li>\n\t<p>In the third column, think of how you would recover from each of the scenarios you imagined and wrote in the first column.</p>\n\t</li>\n</ul>\n\n<p>Here&#x2019;s an example of a row from the exercise, based on the hypothetical scenario of leaving a job to take another:</p>\n\n<p>&#xA0;</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7ed3f5f8-d54a-4b95-a37d-5d6368558b9d.png\"></p>\n\n<p>&#xA0;</p>\n\n<p>Richard Feloni/Business Insider</p>\n\n<p>&#x201C;You come away from that exercise realising, &#x2018;Wow, I was getting extremely anxious and all worked up over something that is completely preventable, reversible, or just not a very big deal,&quot;&#xA0;Ferriss says.</p>\n\n<p>This is by far the best and most effective advice I have come across for goal setting and ensuring you remove the fear and nervousness that can come with doing something new.</p>\n\n<p>From a personal perspective, I realised I followed a similar technique back in 2014, when co-founding the DCC Jobs social enterprise. I thought deeply about the risks involved in quitting a rewarding and secure job, compared to the rewards I would reap from following my dream and passion for supporting women&#x2019;s careers. This comparison encouraged me to take the leap, and it&#x2019;s the best thing I&#x2019;ve ever done.</p>\n\n<p>As you enter the new year, it&#x2019;s time to reflect not only on your goals, but more importantly, how you plan to achieve those goals. If you&#x2019;ve done the same thing every year, it&#x2019;s time to make 2017 different.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/01","associated_company":"work180"}