{"url":"https://www.work180.com.au/blog/2017/05/hackathons-in-2017","title":"Hackathons in 2017","author":"WORK180","body":"\n\t\t\t\t\t<p>Every year businesses are challenged to reinvent themselves. To keep up with the changing environments including globalisation, technology advancements and consumer behaviours organisations have looked at hackathons, 2-day events to a) look for fresh ideas b) create an innovative culture and c) create solutions which can be implemented in the long term.</p>\n\n<p>2016 was a year where hackathon communities formed. Annual hackathons including&#xA0;<a href=\"http://www.rhokaustralia.org/\">Random Hacks of Kindness</a>,&#xA0;<a href=\"https://startupweekend.org/\">StartupWeekend</a>,&#xA0;<a href=\"http://www.govhack.org/\">GovHack</a>,&#xA0;<a href=\"https://techfugees.com/\">Techfugees&#xA0;</a>and&#xA0;<a href=\"http://unearthed.solutions/\">Unearthed&#xA0;</a>helped form the basis of a lot of the newbie Hackathons. The health industry leads the charge with an abundance of hackathons including&#xA0;<a href=\"http://pharmhack.com.au/\">PharmHack</a>,&#xA0;<a href=\"https://cpahackathon.devpost.com/\">Chronic Pain Hackathon</a>,&#xA0;<a href=\"http://www.healthhack.com.au/\">Health Hack</a>,&#xA0;<a href=\"http://www.hackinghealthtech.com/\">Hacking Health Tech</a>&#xA0;and&#xA0;<a href=\"http://www.medhack.com.au/\">Med_Hack</a>. The busiest month was in April where there were 14 Hackathons in Australia. There was one week in particular where I attended 4 hackathons - 2 in Sydney and then 2 in Melbourne!! It&#x2019;s been quite hectic but things won&#x2019;t get any slower.</p>\n\n<p>In 2017 we&#x2019;ve seen an increase of corporate organisations tipping their toes into these highly pressurised events. What&#x2019;s interesting is that they are using Hackathons as part of a bigger picture. Schneider Electric&#x2019;s&#xA0;<a href=\"http://apcpacific.com/hackathon/\">Smart Cities Hackathon</a>, aimed at building smarter cities was held during their&#xA0;<a href=\"http://www.schneider-electric.com.au/en/work/events/innovation-summit.jsp\">Innovation Summit</a>. Cisco ran their&#xA0;<a href=\"http://ciscovirtualhackathon.bemyapp.com/\">global virtual hackathon</a>&#xA0;in January to launch their&#xA0;<a href=\"http://www.cisco.com/c/m/en_au/innovationcenter/australia.html\">Innovation Centres</a>&#xA0;internationally. The&#xA0;<a href=\"http://www.footballaustralia.com.au/article/ffa-launches-female-football-week-hackathon/1h47g62yv6q5b1j7uqxn0unhd1\">Football Federation of Australia</a>&#xA0;ran one during&#xA0;<a href=\"http://www.footballaustralia.com.au/article/ffa-launches-female-football-week/1jcm76q0ayxz5147c57apguz8b\">Female Football Week</a>, and the list goes on. It&#x2019;s important to highlight that Hackathons are one piece of an innovation puzzle. They are most powerful when linked with other events to create communities of people passionate about using technologies to build the future.</p>\n\n<p>As corporates are holding more Hackathons, the number of venues available will also skyrocket. Traditionally hackathons have been at co-working spaces. Venues such as&#xA0;<a href=\"http://fishburners.org/\">Fishburners</a>,&#xA0;<a href=\"http://stoneandchalk.com.au/\">Stone and Chalk</a>,&#xA0;<a href=\"https://www.bluechilli.com/\">Blue Chilli&#xA0;</a>have been generous in providing their space to Hackathons. Now organisations are more open to inviting external guests, showing them what the work culture, people and environment are like. A notable example is&#xA0;<a href=\"http://www.qantas.com/travel/airlines/hackathon/global/en\">Qantas&#x2019; Hackathon</a>&#xA0;where the set up was like as if you were on a flight! There are some pretty amazing workspaces out there and this could be great for participants who may look to work in that company, or recruiters wanting to receive more applicants.</p>\n\n<p>As we look at corporates and venues, we shouldn&#x2019;t forget the Hackathons which are held for the greater good. Organisers are getting smarter at the way they approach hackathons, using design thinking to consider all aspects of a participant. An excellent example is&#xA0;<a href=\"http://remarkable.org.au/\">Remarkable</a>&#x2019;s&#xA0;<a href=\"http://remarkable.org.au/events/\">Enabled by Designathon</a>&#xA0;this weekend which helps those with disabilities. They&#x2019;ve created experiences for participants to go through to help them understand what it&#x2019;s like to have an impairment. Consider what you want your participants to see, think, feel and do to make their projects more meaningful and sustainable.</p>\n\n<p>So which hackathons will you be participating in this year? Hop onto the innovation movement by attending the Hackathons Australia Sydney Social on &#x2018;How Hackathons Accelerate Innovation&#x2019; on Tuesday 23rd May 2017 at Blue Chilli. Register now:&#xA0;<a href=\"https://hackaussydneymay.eventbrite.com.au/\">https://hackaussydneymay.eventbrite.com.au</a></p>\n\n<p>If you&apos;re interested in learning and going to Hackathons, join 2000 other Australians on&#xA0;<a href=\"https://www.facebook.com/groups/hackathonsaustralia/\">Facebook&#xA0;</a>and subscribe to our monthly&#xA0;<a href=\"http://bit.ly/HackAUSNewsletter\">newsletter&#xA0;</a>to stay tuned with our meetups and hackathons. Head to our&#xA0;<a href=\"http://www.hackathonsaustralia.com/\">website</a>&#xA0;for more info.</p>\n\n<p>&#xA0;</p>\n\n<p>Angela&#xA0;is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/05","associated_company":"work180"}