{"url":"https://www.work180.com.au/blog/2017/05/have-you-childproofed-your-career","title":"Have You Childproofed Your Career?","author":"WORK180","body":"\n\t\t\t\t\t<p>We know that starting a family has a big impact on our career and financial position, and women in particular have some important considerations to make.</p>\n\n<p>The gender pay gap and superannuation gap are compounded in Australia because women take on the majority of primary caregiver responsibilities for children. Research has shown that in blind studies, female&#xA0;candidates with children are paid the least. It&apos;s called the &apos;<a href=\"https://hbr.org/2013/09/women-in-the-workplace-a-research-roundup\" target=\"_blank\">motherhood wage penalty</a>&apos;. This is due&#xA0;to stereotypical assumptions around their commitment, career ambition, and preference or ability to continue working after having children.&#xA0;There is also a prevailing and implicit unconscious bias around the male breadwinner model that creates&#xA0;workplace and social barriers to men taking part in sharing care for children.</p>\n\n<p>In Australia, women who become mothers do so typically at&#xA0;<a href=\"https://aifs.gov.au/facts-and-figures\" target=\"_blank\">age 25 to 34 years</a>. In 2012, the median age of women who gave birth to their first child was 29 years. For many&#xA0;women, this coincides with the first decade of their career, when&#xA0;they are starting to achieve recognition and career success.</p>\n\n<p>By making well-informed decisions on how you combine family and work, you can ensure that you are thriving in both. Here&#x2019;s some tips that can make a difference:</p>\n\n<p><strong>1. Share&#xA0;care</strong></p>\n\n<p>Men sharing care&#xA0;and taking on part-time work to do so is a growing trend. Some&#xA0;men still feel unsupported by workplaces in making this choice. They believe (often correctly) that this choice will&#xA0;negatively impact their career success. It&apos;s becoming more common for professional couples to share care through each combining a part-time work week with some day care. For dual career professionals&#xA0;there are a lot of benefits to this approach.</p>\n\n<p>It enables both people to continue their career progression, preserve&#xA0;the currency of their skills and experience, participate hands on in raising their children, and maintain&#xA0;their income and superannuation contributions.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Plan&#xA0;ahead</strong></p>\n\n<p>Communicate with your partner regarding your preferences about combining family and work. Make sure you are aligned&#xA0;in your views before children arrive.</p>\n\n<p>Also both research your employer&apos;s workplace policies and attitude towards working parents. Do they offer paid parental leave? Is there a supportive policy in place, but an unsupportive culture? If you are considering switching jobs or employers, also consider their parental leave offering and reputation.&#xA0;<a href=\"https://www.diversecitycareers.com/\" target=\"_blank\">Diverse City Careers</a>&#xA0;is an organisation that&#xA0;only advertise jobs with Australia&#x2019;s best employers for women. Companies who advertise on their job board have been vetted, and also publish their workplace policies on the site for prospective employees to review - before they apply!</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Have a financial strategy</strong></p>\n\n<p>Consider your current financial commitments and income, and how this may change based on your preferred method of combining work and children. Work out some different scenarios. It&apos;s a great idea to start saving early for the additional expense of children, potential time out of the workforce and&#xA0;figuring out where you may need to cut back on your household expenditure. How will you continue to make superannuation contributions so you don&apos;t fall behind? Will paying extra on your mortgage prior give you&#xA0;freedom to consider different options once the baby arrives?</p>\n\n<p>Have you considered diversifying your income stream so that you are not solely reliant on income from your employer?</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Stay current and continue learning</strong></p>\n\n<p>Factor continuous learning and skill development&#xA0;into your parental leave planning. If you are thinking of taking an extended absence from the workforce, maintaining currency of your professional skills will ease your re-entry to the workforce. Both because it will reassure employers, and you will feel more confident. We aren&apos;t necessarily suggesting taking on an MBA while you have your first child. But keeping abreast of&#xA0;professional journals, maintaining your professional networks and taking online course or short courses are all great options.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5. Consider a portfolio career</strong></p>\n\n<p>If you haven&apos;t heard the term before, a portfolio career means combining a number of different flexible work options. It&apos;s also a growing trend. People who choose it are combining part-time, freelancing, self employment, contract work and perhaps also some Board directorship roles. If this is something that appeals, consider the right mix for you and the types of experiences, skills or networks you may need to develop to help you achieve it. The benefits are flexibility, a diversified income stream, variety and the opportunity to expand your networks and transition to other industries.</p>\n\n<p>This article was originally published by&#xA0;<a href=\"https://www.womeninfocus.com.au/t5/Professional-Development/Have-you-childproofed-your-career/ba-p/20668\" target=\"_blank\">Women in Focus</a>.</p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/bf9725a6-aacf-423d-a116-77c5a372f3bf.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/05","associated_company":"work180"}