{"url":"https://www.work180.com.au/blog/2016/03/highlights-from-international-womens-and-girls-week","title":"Highlights from International Women’s (and Girls) Week!","author":"WORK180","body":"\n\t\t\t\t\t<p><br></p><p>Last week I was very excited to attend three IWD celebrations in 24 hours, all held in Sydney. There were so many highlights to mention but I won&#x2019;t turn this post into a novel, so here are my favourite moments:</p><p>A big thank you to Maddocks who organised a very inspiring evening on the IWD eve, centered around two incredible stories from women who defied all odds and carved out incredible careers for themselves.</p><p>First, Jamila Gordon shared her incredible story of escaping horrific conflict in Somalia and arriving in Australia on her own at 18 years old and subsequently enrolling in La Trobe University to study IT. Jamila eventually travelled the world and joined the leadership teams of some of the biggest global companies.</p><p>Dai Le, the woman behind&#xA0;<a data-cke-saved-href=\"http://dawn.org.au/\" href=\"http://dawn.org.au/\" target=\"_blank\">DAWN</a>, which is an organisation focused on cultural diversity in leadership shared her story next, which took our breath away. Dai and her family survived a trip across the sea while being attacked by pirates, storms and eventually rescued by a whale (yes, a whale!)</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/dba656fd-dfe6-4b99-9dfd-720114114588.png\"></p><p>Both women&#x2019;s passion to give back and help others is incredible inspiring, and I&#x2019;m thankful we have them as female role models to share their stories of building resilience.</p><p>The next day saw me attend our partner&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/page/partner-network/industry-alliances/tech-girls-are-superheroes/\" href=\"https://www.diversecitycareers.com/page/partner-network/industry-alliances/tech-girls-are-superheroes/\" target=\"_blank\">Tech Girls Movement&#x2019;s</a>&#xA0;launch of their book, &#x2018;Tech Girls are Superheros 2&#x2019; at Google. Both me and DCC co-founder Gemma are absolutely thrilled at being featured in this edition of the book, where we share the story behind DCC.</p><p>I must admit I teared up at times watching Dr Jenine Beekhuyzen&#xA0;&#x2019;s presentation. Jenine, who is TGM&#x2019;s founder and her team of superheroes have volunteered their time tirelessly for several years to support and promote tech as a career of choice to primary school girls. There is truly nothing like TGM in Australia and Jenine and her team deserve a massive round of applause from the industry. &#xA0;A big thanks must go out to Google, who have supported TGM to get a copy of their book to every school in Australia.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e4cd3bf2-cc67-44ab-97f7-bd53c5974fb1.png\"></p><p>Meeting some the teams who created solutions for social issues was certainly the highlight of the day- girls as young as 8 years old were developing apps! Some of these included apps to help with literacy, car pooling and helping children get more exercise.</p><p>Later that day, I had the pleasure of attending Avanade&#x2019;s IWD celebration, where Sarah Adam-Gedge shared some very impressive stats from within Avanade, including a 50/50 split within the new graduate intake. Dr Catherine Ball continued the theme of the day which for me was &#x201C;What is your superpower?&#x201D; Dr Ball&#x2019;s presentation on her fascinating work with drones along with educating us on women in science over the years made for a very interesting evening.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/57df2028-c88e-4706-978e-64856b98885b.png\"></p><p>We also heard from women in industries outside of IT such as Kathryn Gill, Player Relations Executive at Professional Footballers Australia, who shared some very sad facts about women in sports and called for support from the audience.</p><p>Last but not least, we finished the week on a high with the inaugural TGM &amp; DCC Superhero Day, held in Brisbane at Microsoft on Saturday 12th March. Over 120 girls attended with their parents, some as young as four years old! Everyone loved the day, complete with giving coding a go with&#xA0;<a data-cke-saved-href=\"https://elketeaches.wordpress.com/2016/03/14/superhero/\" href=\"https://elketeaches.wordpress.com/2016/03/14/superhero/\" target=\"_blank\">Microsoft Touch Develop</a>, sharing cupcakes and joining in a competition. A big thank you to our sponsors Microsoft and WiT Queensland!</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5786f758-983f-429f-b1c3-f0047aa62b05.png\"></p><p>This year at DCC Jobs we&#x2019;ve chosen to do something a little different for IWD and created our own #PledgeforParity campaign, where Australian leaders have shared challenges they see within their business and the industry along with their pledge to increase the rate of gender parity, which the World Economic Forum estimates won&#x2019;t be achieved for another 117 years. View the pledges&#xA0;<a data-cke-saved-href=\"/2016-international-womens-day-number-pledgeforparity\" href=\"/2016-international-womens-day-number-pledgeforparity\" target=\"_blank\">here</a><br>and we hope to see progress between now and next year&#x2019;s IWD!</p><p><br></p><h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["DCC News","Celebrating Women"],"upload_date":"2016/03","associated_company":"work180"}