{"url":"https://www.work180.com.au/blog/2015/07/how-to-stay-upbeat-when-your-job-hunt-search-pulls-you-down","title":"How to Stay Upbeat When Your Job Hunt Search Pulls You Down","author":"WORK180","body":"\n\t\t\t\t\t<p>Try as you may to sugarcoat it, losing your job is hard. And whether it had everything to do with your performance, or nothing at all, it can be a real kick to your self-confidence in addition to your bank account.&#xA0;</p><p>If you&#x2019;re out of work right now, you&#x2019;ll know staying positive in your job hunt can be easier said than done.&#xA0; If you&#x2019;ve been out of work over 6 months, even more so.</p><p>Repeated rejections can take a toll. But as challenging as it can be to stay positive when you&#x2019;re out of work, it&#x2019;s ultimately in your power to do just that. Here are 6 practical ways to help you use the extra time on your hands in a way that not only helps you emerge from it better off, but to one day be glad you had it. Besides, potential employers will be more attracted to people who have proven their ability to stay positive and confident despite a setback/job loss.</p><p><br></p><p><strong>1. Never be defined by your job status. Ever.</strong></p><p>It&#x2019;s the first question people will often ask you at a party, &#x201C;So, what do you do?&#x201D; Saying you are out of work can lead to an awkward silence. But here&#x2019;s the deal, who you are is not your job. Nor your salary. Or title. Or car. Or any of the stuff that props up our ego and sense of importance.&#xA0; So while losing your job can be a very personal experience, don&#x2019;t take it too personally. Who you are is not what you do. Never was. Never will be.</p><p>Psychologist Marty Seligman found that the biggest determinant between those who succeed after setbacks of any kind is how they interpret them. As I wrote in Stop Playing Safe, people who interpret losing their job as a sign of personal failure are less likely to &#x2018;get back on the horse&#x2019; in their job hunt than those who interpret it as an unfortunate circumstance that provided a valuable opportunity to grow in self-awareness, re-evaluate priorities and build resilience.</p><p>You get to define who you are - not your job or a company&#x2019;s decision whether or not to employ you. Don&#x2019;t take it as a personal rejection against you. It may well be due to economic forces far beyond your control that you found yourself out of a job.</p><p><br></p><p><strong>2.&#xA0; Up The Ante On Self-Care</strong></p><p>Being out of work can create even more stress than being in it and being stressed lowers your immune system making you more susceptible to all sorts of ills and ailments. So while there is never a good time to be sick, when you are in the job market (and your health insurance premium has increased because of that), it is a really lousy time to get sick. So make your health and wellbeing - body, mind and spirit -your top priority as it will affect all your other efforts.</p><p>Take time every day to do something that lifts your spirit, strengthens your body and that keeps your mind sharp. While there are some things that are outside your control, eating well, getting a good nights&#x2019; sleep and strengthening that body of yours are not.</p><p><br></p><p><strong>3. Treat Your Job Search Like A Job</strong></p><p>If there&apos;s one thing that most people in full time jobs complain about, it&apos;s not having enough time to do everything else they want to do outside the office. Now that you have time on your hands, don&#x2019;t treat it cheaply and waste the extra hours you have on your hands.&#xA0; Get up as you usually would and make looking for a job your new job.&#xA0;</p><p>Schedule time every day to do things that move you forward toward that goal, whether directly (by sending off an application, polishing your resume or making follow up phone calls) or indirectly by gaining skills that will make you a more attractive candidate.&#xA0; Keep a written log of jobs you&apos;ve applied for and leads you need to follow up on. Write down at the beginning of every week what you want to accomplish each day that week, and then each day prioritize the tasks to ensure they get done.</p><p>In short, get organized and make the most of each and every day! Your hours are no less precious just because you&#x2019;re not being paid for them.</p><p><br></p><p><strong>4. Work Your Network</strong></p><p>Most jobs are never advertised and nothing beats a personal recommendation.&#xA0; So the more people who know that you are looking for a new job, the more people who can help you land one.&#xA0; Most people really do want to help, but they need to know how they can help.&#xA0; Don&#x2019;t let fear of losing face or being judged get in the way of reaching out, asking for help and making specific requests of people.&#xA0; You can&#x2019;t overestimate the power of social networks when it comes to building your career, growing your business or finding new work opportunities.</p><p><br></p><p><strong>5. Upgrade Your Skillset</strong></p><p>The top ten jobs today didn&#x2019;t exist a decade ago. Likewise the skills that got you a job a decade ago, may simply be insufficient to land you a job in today&#x2019;s increasingly global job market place. So be proactive in learning new skills and getting up to date on new trends whether in social media, internet marketing, consumer behaviour, software and technology.&#xA0;</p><p>You never know what will set you apart from others so be sure you aren&#x2019;t complacent in relying on what got you your last job to get you your next one.&#xA0; As I wrote in my latest book Brave: 50 Everyday Acts of Courage to Thrive in Work, Love and Life, focus on what you can do rather than on what you can&apos;t.</p><p><br></p><p><strong>6. Don&#x2019;t Be Too Proud </strong></p><p>Personal and professional pride can be a good thing, but sometimes it can override our better judgment and keep us from being smart in our decisions.&#xA0; Sometimes opportunity can come in disguise, like in a job offer for a position that you are overqualified for or pays less than what you earned before. Don&#x2019;t let your pride trip you up from something that could lead to bigger and better things and pay the bills in the interim!</p><p>Likewise, you may need to adjust your budget as it&#x2019;s often hard to know how long it will be until you&#x2019;re back earning money.&#xA0; Just because you may feel you shouldn&#x2019;t have to cancel your cable account or annual ski trip doesn&#x2019;t mean it&#x2019;s not the smart thing to do.&#xA0; Again, don&#x2019;t let your ego and need to &#x2018;keep up appearances&#x2019; get in the way of being responsible and doing what will ultimately leave you better off.</p><p>There is always opportunity in adversity. Always. But those who find the opportunity will be those who are out there looking for it, persevering in the face of rejections and doing the preparation they need to do so that when opportunity arises, they are ready to seize it!</p><p><br></p><p>Margie&#xA0;is one of our contributors, read about them all <a data-cke-saved-href=\"https://www.dccjobs.com/contributors\" href=\"https://www.dccjobs.com/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click<a data-cke-saved-href=\"https://www.dccjobs.com/career-advice/become-a-contributor\" href=\"https://www.dccjobs.com/career-advice/become-a-contributor\">&#xA0;</a><a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a><a data-cke-saved-href=\"https://www.dccjobs.com/career-advice/become-a-contributor\" href=\"https://www.dccjobs.com/career-advice/become-a-contributor\">.</a></p><p><br></p><h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2015/07","associated_company":"work180"}