{"url":"https://www.work180.com.au/blog/2016/11/how-i-handled-a-workplace-bully-and-what-id-do-differently","title":"How I Handled a Workplace Bully and What I'd do Differently","author":"WORK180","body":"\n\t\t\t\t\t<p>Written by Gemma Lloyd</p>\n\n<p>&#xA0;</p>\n\n<p>This month is Human Rights Month* and a reminder of how we need to be protecting all human rights against violence, discrimination and abuse, regardless of where this occurs.</p>\n\n<p>I&#x2019;ve shared many stories of the challenges faced working as a female in mainly male dominated environments, to help inspire other women to build confidence and push back on different situations to accelerate their careers. However, due to the nature of this month, I wanted to share an experience I haven&#x2019;t publicly spoken about relating to a more serious workplace issue.</p>\n\n<p>Early on in my career, I worked in an open plan office, surrounded by my colleagues and manager. One morning, I came across an issue in the system, which was something I had mentioned to my manager a few days ago and nothing had been done about it. This issue affected a client and the fact that a few days had passed worried me. I didn&#x2019;t have the authority to fix this, and was reliant on my manager to assist, so I asked him about the issue and if there&#x2019;s been any progress. The manager responded by asking me to be quiet- he&#x2019;ll deal with it when he gets a chance. I politely reiterated the amount of time that had passed since initially raising the problem and that I felt due to client involvement, we should be looking at it immediately.</p>\n\n<p>He wasn&#x2019;t happy.</p>\n\n<p>&#x201C;Gemma&#x201D;, he began, &#x201C;come with me.&#x201D;</p>\n\n<p>I followed my manager through the open plan office and into a small meeting room. This room was just big enough to hold a small round meeting table with four chairs and that&#x2019;s all. He closed the door behind us and I began to feel slightly uneasy (the feeling you get when you&#x2019;re about to get into trouble). However, instead of the stern conversation I was expecting, he hurled into a fit of rage, yelling and screaming at me- how dare I disagree with him in front of the other employees! I was shocked and scared.</p>\n\n<p>I took a few steps back as anyone would do being screamed at, and my manager, who was a large, burly man in his 40&#x2019;s walked towards me, still in a fit of rage. I took a few more steps back and found myself in the corner of the tiny meeting room. The manager then put one arm to the left of me and one arm to the right to block me into the corner. All the while, still screaming at me while tears ran down my cheeks.</p>\n\n<p>Finally, I spoke, asking him to please let me out of the corner. I told him he was scaring me and this wasn&#x2019;t right. He didn&#x2019;t move a muscle. He kept yelling, blocking me in the corner. There&#x2019;s no doubt my colleagues in the office next door would have been able to hear what was going on.</p>\n\n<p>Feeling trapped and afraid, I ducked under one of his arms and bolted for the door. My manager ran around the other side of the table and put his arm in front of the door so I couldn&#x2019;t leave.</p>\n\n<p>The yelling lasted a few more minutes, which seemed like a lifetime, until finally he let me pass. I ran out of the door and straight to the lifts. As soon as I hit the ground floor I rang my parents, in tears telling them what had just happened.</p>\n\n<p>&#x201C;Right, we&#x2019;re coming down there now&#x201D;, they said.</p>\n\n<p>&#x201C;No, please don&#x2019;t get involved. This is my work and I need to handle it. What should I do?&#x201D; I cried.</p>\n\n<p>My parents rightfully advised me to call his manager and HR and make a complaint.</p>\n\n<p>Management of the company asked me if I&#x2019;d like my manager dismissed, and I said no it was OK, I didn&#x2019;t want him losing his job, just spoken to.</p>\n\n<p>Following that incident, every day in the office with that manager close by was extremely uncomfortable for me. Looking back, I&#x2019;m sure saying I just wanted him spoken to wasn&#x2019;t the right thing for me to do. Prior to this incident, this manager had repeatedly made inappropriate comments about the way I looked- both to my face and to my colleagues. He had also publicly ridiculed and sworn at other staff members.</p>\n\n<p>It&#x2019;s possible that if this previous behaviour had been called out, then I would never had experienced what I did in that small meeting room. I also reflect on how he would have behaved towards others following the incident- was being &#x2018;spoken to&#x2019; enough? Through&#xA0;<a href=\"http://www.diversecitycareers.com/\" target=\"_blank\">Diverse City Careers</a>, women have shared experiences with us of similar issues in the workplace, and often they are conflicted at the damage this could cause to their career if they were to complain. I wanted to share my story because I know there are so many other people going through what I went through right now. Often I think we try to trivialise these events at the time, when they are not trivial or OK at all. I encourage anyone who is experiencing similar to seek help- a good start is to seek anonymous advice from the local government agency overseeing human rights protection if you&#x2019;re unsure of next steps.</p>\n\n<p>Per the&#xA0;<a href=\"http://www.humanrights.gov.au/workplace-bullying-violence-harassment-and-bullying-fact-sheet\" target=\"_blank\">Australian Human Rights Commission</a>, workplace bullying looks like the following:</p>\n\n<ul>\n\t<li>repeated hurtful remarks or attacks, or making fun of your work or you as a person (including your family, sex, sexuality, gender identity, race or culture, education or economic background)&#xA0;</li>\n\t<li>sexual harassment, particularly stuff like unwelcome touching and sexually explicit comments and requests that make you uncomfortable&#xA0;</li>\n\t<li>excluding you or stopping you from working with people or taking part in activities that relates to your work</li>\n\t<li>playing mind games, ganging up on you, or other types of psychological harassment&#xA0;</li>\n\t<li>intimidation (making you feel less important and undervalued)&#xA0;</li>\n\t<li>giving you pointless tasks that have nothing to do with your job&#xA0;</li>\n\t<li>giving you impossible jobs that can&apos;t be done in the given time or with the resources provided&#xA0;</li>\n\t<li>deliberately changing your work hours or schedule to make it difficult for you&#xA0;</li>\n\t<li>deliberately holding back information you need for getting your work done properly</li>\n\t<li>pushing, shoving, tripping, grabbing you in the workplace&#xA0;</li>\n\t<li>attacking or threatening with equipment, knives, guns, clubs or any other type of object that can be turned into a weapon&#xA0;</li>\n\t<li>initiation or hazing - where you are made to do humiliating or inappropriate things in order to be accepted as part of the team.&#xA0;</li>\n</ul>\n\n<p>What can you do if you are being bullied at work?</p>\n\n<p>&#xB7;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Get informed, check your workplace policies and complaints procedure</p>\n\n<p>&#xB7;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Keep a diary, write down everything that happens and what action you&#x2019;ve taken to stop it</p>\n\n<p>&#xB7;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Talk to someone you trust or contact support services</p>\n\n<p>&#xB7;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Approach the bully if you feel comfortable and are in a safe environment. Ensure you raise their behaviour is inappropriate and unwanted</p>\n\n<p>&#xB7;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Tell someone at work. Make a complaint to the manager or human resources department</p>\n\n<p>&#xB7;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;Make a formal complaint to the state and territory workplace health and safety authority or to the Australian Human Rights Commission</p>\n\n<p>Addressing a bully in the workplace may seem uncomfortable and sometimes you feel it may be easier to just deal with them and pretend it isn&#x2019;t happening. However, these behaviours shouldn&#x2019;t be tolerated. We need to stand up and speak out for ourselves, and our colleagues.</p>\n\n<p>* Human Rights Month is a campaign of the Anti-Discrimination Commission Queensland that runs from 10 November to 10 December and culminates on International Human Rights Day (10 December) For more information visit&#xA0;<a href=\"http://www.adcq.qld.gov.au/resources/fair-and-inclusive-workplaces\" target=\"_blank\">https://www.adcq.qld.gov.au/resources/fair-and-inclusive-workplaces</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/11","associated_company":"work180"}