{"url":"https://www.work180.com.au/blog/2018/05/how-employers-can-ensure-gender-equality-in-the-workplace","title":"How Employers Can Ensure Gender Equality in the Workplace","author":"WORK180","body":"\n\t\t\t\t\t<p><strong>The past few years, indeed even the past few months, have seen huge changes in the way women are seen in the workplace. Gender equality has taken huge steps, and businesses around the world are beginning to take a long hard look at their own workplace practices. As an employer, it&#x2019;s up to you to make your business meet&#xA0;these expectations. So what should you be looking out for?</strong></p>\n\n<h2>Flexibility</h2>\n\n<p>The days of the rigid 9-to-5 are gone. The nuclear family is <a href=\"https://www.sbs.com.au/news/insight/article/2018/01/08/forget-norm-australian-family-changing\">no longer the most common form</a> of family in Australia. As such, more and more employees require a more flexible working life. Childcare commitments, working parents and the gig economy, and more changes mean businesses need to make allowances to make the most out of their staff.</p>\n\n<p>To that end, consider the needs of your employees and act accordingly. <a href=\"http://theconversation.com/counting-the-costs-of-caregiving-is-there-a-better-way-forward-33181\">Women are often the primary caregivers</a> for children, and so may require extra flexibility with their working hours. It doesn&#x2019;t necessarily need to come at the expense of your business though. The ability to work remotely means employees are able to work around their own schedule, whilst meeting the needs of their employer. Take into account the needs of all your staff and work together to reach mutually agreeable schedules.</p>\n\n<h2>Open salary&#xA0;</h2>\n\n<p>The news of late has been full of brands, corporations and businesses publicly declaring their employees&#x2019; salaries. Unfortunately, some of these have exposed huge discrepancies between male and female employees, as in the recent <a href=\"https://abcnews.go.com/Entertainment/pay-gap-men-women-hollywood-growing/story?id=49376405\">Hollywood pay gap scandal</a>. Australia too has had its fair share of pay gap controversy. Last year, Lisa Wilkinson quit her presenter role on Channel Nine&#x2019;s Today show, revealing she was paid less than her co-host Karl Stefanovic. Indeed, it&#x2019;s estimated that women in Australia earn an <a href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\">average of 15.3% less</a> than their male colleagues &#x2014; a shocking figure.</p>\n\n<p>Openness is the foundation for equality, and as such the first step towards gender equality is to publicly declare all your employees&#x2019; salaries. This will help foster trust between your staff, and will promote salary matching across the board. Of course, a business should first ensure that their staff are paid equally based on their role and experience. But making your pay scale public encourages you to strive to ensure these targets are being met across the board.</p>\n\n<h2>Think properly about equality</h2>\n\n<p>We usually think of equality in very black and white terms. One rule that applies to everyone, regardless of gender. However, it&#x2019;s not always the case. If one employee asks for something &#x2014; a change to their role, an earlier finish &#x2014; it shouldn&#x2019;t be dismissed out of hand immediately. You should consider the context for the request, and whether it is reasonable based on the circumstances.</p>\n\n<p>Rather than making allowances based on gender, make them on a case-by-case basis. This will show your business holds fair and considerate working practices for all of its employees.</p>\n\n<h2>Identify high performing women</h2>\n\n<p>A good way to demonstrate your commitment to gender equality is by <a href=\"https://www.work180.com.au/blog/2018/05/take-charge-and-self-nominate-for-awards\">awarding those women</a> whom you feel have made significant contributions towards your company. Make an employee recognition scheme part of your firm&#x2019;s CSR initiative, and celebrate those individuals who help make your business better.</p>\n\n<h2>Create an equality hub</h2>\n\n<p>To publicly let your staff know that you are dedicated to engendering gender equality in the workplace, create an online gender diversity hub. These microsites <a href=\"https://websitesetup.org/website-builders/\">can be easily made</a> with a good website builder, and should be accessible by employees at all levels. Update it with your firm&#x2019;s gender equality commitment ethos, as well as details on your salaries, male-to-female staff ratio, and equality initiatives. The hub can also serves as providing a resource for line managers to ensure they are meeting your business&#x2019;s gender requirements.</p>\n\n<h2>Don&#x2019;t pick managers, train them</h2>\n\n<p>Managers are often picked based on their individual performance, however performance isn&#x2019;t necessarily an indicator of a good manager. Consequently, it is worth implementing a management training scheme to ensure your candidates are prepared for the myriad responsibilities the role entails.</p>\n\n<p>To make management roles more accessible to staff of any gender, be sure to implement training courses that are accessible by all. This not only creates a roster of diverse, qualified managers, but it also ensures that the managers in place are equipped to deal with gender equality in rank-and-file employees.</p>\n\n<p>Your managers are your boots on the ground, running each component of your business. Consequently, they are also your employees&#x2019; first point of contact with issues, and a diverse array of senior staff will naturally create a more open workplace culture.</p>\n\n<h2>Be conscious of gender identity</h2>\n\n<p>Gender is an increasingly diverse and complex area, with more and more people identifying as trans, non-cis, genderqueer, and more rather than male/female. While detailed public data is hard to come by on the subject, it is estimated that individuals who identify as something other than cis make up around 11% of the Australian population.</p>\n\n<p>As such, you need to be aware of these terms and ensure your company caters to this diverse range of identities. You may need to alter your gender-specific facilities such as toilets or changing rooms to be gender-neutral, or make plans for HR considerations if someone is undergoing a sex change.</p>\n\n<p><strong><em>As the world&#x2019;s spotlight focuses more and more on gender equality in the workplace, pressure is being placed on businesses to ensure their workplace is up to scratch. Antiquated working practices are being jettisoned in favour of more progressive ways of working. There is </em></strong><a href=\"https://www.harpersbazaar.com.au/culture/13-statistics-that-prove-we-have-a-long-way-to-go-regarding-gender-equality-5984\"><strong><em>still a long way to go</em></strong></a><strong><em> though, and if you&#x2019;re an employer of a business of any size, small or large, the onus is on you to make sure you create a welcoming, egalitarian workplace. And ultimately, you will benefit from it too.</em></strong></p>\n\n<hr>\n<p><strong style=\"font-size: 16px;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e5bdfee0-85a5-47ed-9374-56d5a16d7cff.png\" style=\"float: right; margin: 10px; width: 70px; height: 70px;\"></strong></p>\n\n<p><strong style=\"font-size: 1.6rem;\">Kayleigh Alexandra</strong><span style=\"font-size: 1.6rem;\"> is a content writer for Micro Startups &#x2014; a site dedicated to spreading the word about startups and small businesses of all shapes and sizes. Visit the blog for the latest micro biz news and inspiring entrepreneurial stories. Follow us on Twitter @getmicrostarted</span></p>\n\n<p>&#xA0;</p>\n\n<hr>\n<h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\">Become an Endorsed Employer for Women!&#xA0;<a href=\"https://www.work180.com.au/advertisers/dcc-criteria-for-advertising-jobs?\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5e991e28-a1b5-45ee-ae8d-e6febb62ec88.png\" style=\"box-sizing: border-box; border-width: 0px; border-style: initial; vertical-align: middle; max-width: 100%; float: right; margin: 10px; width: 150px; height: 150px;\"></a></h4>\n\n<div style=\"box-sizing: border-box; font-family: Lato, sans-serif; font-size: 14px;\">\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem;\"><a href=\"https://www.work180.com.au/advertisers/dcc-criteria-for-advertising-jobs?\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\"><u style=\"box-sizing: border-box;\">Apply here to check if your organisation meets the&#xA0;criteria.</u></a></p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem;\">&#xA0;</p>\n\n<h4 style=\"box-sizing: border-box; font-family: inherit; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\">About WORK180</h4>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem;\">WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">one click</a>&#xA0;now.</p>\n</div>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2018/05","associated_companies":["work180"]}