{"url":"https://www.work180.com.au/blog/2018/05/how-to-get-simply-serious-about-gender-equality","title":"How to get simply serious about gender equality","author":"WORK180","body":"\n\t\t\t\t\t<p>Two major organisations that I worked for in my corporate career had safety as their number one value. &#xA0;One of those organisations sent workers out in vans and trucks, up poles, down pits, under houses, in roofs. The other organisation had workers out on mines, oil rigs, ships and working in manufacturing environments. Both organisations &#xA0;wanted all workers to be safe and to go home alive at night and as healthy as they left their families and their homes that morning.</p><p>The leaders of those organisations, myself included, were accountable to live and breathe safety as our number one value. How? Through deliberate, mindful, purposeful and process driven role modelling of the right behaviours.</p><h3 style=\"clear:both;\">Here&#x2019;s how it was done:</h3><ul><li>Safety was the first agenda item in all meetings;</li><li>All scorecards included a measure linked to safety performance;</li><li>Regular safety audits of workplace, including non-field environments, were conducted;</li><li>Recognition of best practice and celebration of great behaviours that led to safer workplaces.</li></ul><p>As a result of deliberate, mindful, purposeful&#xA0;and process driven&#xA0;actions by leaders, &#xA0;creating and maintaining safety work environments became entrenched behaviours, and as a result the safety performance lifted.</p><p>This is pretty basic stuff to any of you that have ever worked in an environment where particularly physical safety is paramount. But basic, simple, deliberate, mindful and purposeful actions work.</p><h3 style=\"clear:both;\">I love asking what if?</h3><p>So here goes again. Think about your workplace.</p><ol><li>What if&#xA0;<em>Gender Equality&#xA0;</em>was the number one priority and value in your organisation?</li><li>What if&#xA0;<em>Gender Equality</em>&#xA0;was the first agenda item for all your meetings, across the company?</li><li>What if all your company scorecards included a measure linked to&#xA0;<em>Gender Equality</em>&#xA0;performance?</li><li>What if regular&#xA0;<em>Gender Equality</em>&#xA0;audits of your workplace were conducted?</li><li>What if your workplace recognised, rewarded and celebrated great behaviours that led to&#xA0;a<em>&#xA0;Gender Equal&#xA0;</em>workforce?</li></ol><p><br></p><p>I wonder what your organisation would look like, feel like and perform like if there was &#xA0;deliberate, mindful, purposeful and process driven actions by all leaders, by all people in your organisation to achieve gender equality?&#xA0;Food for thought right?</p><h3 style=\"clear:both;\">Why Leaders Ask Me To Do What I Do</h3><p>This is pretty basic stuff to me. But I&#xA0;<a data-cke-saved-href=\"https://michelleredfern.com/michelle-redfern-advancing-women/\" href=\"https://michelleredfern.com/michelle-redfern-advancing-women/\" rel=\"noopener\" target=\"_blank\">work</a>&#xA0;every, single day of my life on inclusion, diversity and gender equality initiatives. Gender equality is of paramount importance to me. It&#x2019;s why leaders ask me to do what I do. To advise them how to start or accelerate&#xA0;basic, simple, deliberate, mindful and purposeful actions that are effective. And, by effective, I mean they are crystal clear they &#xA0;want to create workplaces that work, for everyone.&#xA0;</p><p>The old saying is that a fish rots from the head. Organisations can choose to rot or flourish from the head. &#xA0;When organisational leaders get as deliberate, mindful and purposeful about gender equality as they are about safety, financial performance and customer satisfaction, they&#x2019;ll start to reap the&#xA0;<a data-cke-saved-href=\"https://www.mckinsey.com/business-functions/organization/our-insights/why-diversity-matters\" href=\"https://www.mckinsey.com/business-functions/organization/our-insights/why-diversity-matters\" rel=\"noopener\" target=\"_blank\">benefits of a high performance, gender equal and inclusive workplace.</a></p><p><em>I&#x2019;d love to talk to more organisational leaders about how to get deliberate, mindful and purposeful about gender equality. (By the way, deliberate, mindful and purposeful is my polite code for get sh*t done about gender equality!)</em></p><p style=\"clear: both;\">To #GSD on gender&#xA0;equality in your organisation write to me: michelle@michelleredfern.com</p><p><br></p><h4>About Michelle Redfern</h4><p><img data-cke-saved-src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDMvMjcvMDUvMTMvNDUvMTg2L21yLWJhbm5lci1iaW8tcGljLWJ3LmpwZyJdXQ\" src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDMvMjcvMDUvMTMvNDUvMTg2L21yLWJhbm5lci1iaW8tcGljLWJ3LmpwZyJdXQ\" style=\"text-align: center;\"></p><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Workplace Gender Equality Agency"],"upload_date":"2018/05","associated_companies":["work180"]}