{"url":"https://www.work180.com.au/blog/2015/06/how-to-make-maternity-leave-the-defining-moment-of-your-career","title":"How to make maternity leave the defining moment of your career","author":"WORK180","body":"\n\t\t\t\t\t<p>Yes it&apos;s a full time plus job caring for a baby and you can pretty much forget all forms of intellectual pondering for the first 3-4 months. But after that, once your baby begins to nap more predictably, why don&apos;t you start to use the time to think about what you want your life to look like at work once you have a child in tow. No-one wants to give up precious time with their family to hump a job they don&apos;t like so how would work ideally look for you?</p><p><br></p><p><strong>Think Big...</strong></p><p>Maybe you used to sashay down the street in a killer suit and now you pound the pavement in your gym gear (despite your membership expiring somewhere around your third trimester). It probably doesn&apos;t feel like you&apos;ve gone up in the world. Maternity leave can sometimes feel like you&apos;ve been plucked out of the civilised world and dropped into obscurity. But, for better or worse, this does have the effect of removing us from the organisational hierarchy that defines many workplaces. This can help in broadening your thinking about the position waiting for you when you get back to work.</p><p>Think about where you&apos;d like to be and what you can do to get there as quickly as possible when you&apos;re ready to return. If there are no obvious promotions or career options for you, move on, it&apos;s easier to do it when you&apos;re not engrained in the day to day politics of the office and what better time to research new jobs and career opportunities when you&apos;re at home away from the watchful eye of colleagues?</p><p><br></p><p><strong>Pursue your creative interests &amp; see where it takes you</strong></p><p>Whether it&apos;s knitting, reading, writing, painting, thinking, talking or listening, there are many activities you can explore while you have housebound time on your hands. These activities might be a way of passing the time today but you may just stumble upon a new career or business idea.<br>Think about the things that make you happy. Do you seek to have full busy days or do you like taking the day slowly? Do you love being outdoors to the extent that the idea of sitting in an office day after day irks you? Or do you miss the buzz and stimulation of being surrounded with others? Really stop and think about what type of existence you want to have.</p><p><br></p><p><strong>Don&apos;t underestimate what you&apos;re doing &amp; learning</strong></p><p>You might assume your work skills have wittered away since the birth of your little munchkin but I can say, with total confidence, this is not the case. Chances are you have acquired a whole new set of skills - survival skills. Having a shower in under 5 minutes, the ability to completely prioritise your downtime ruthlessly and the ability to achieve more in ten minutes than you could ever have imagined was physically possible before kids. Being efficient won&apos;t just help you on the homefront.</p><p>So if you are just starting your maternity leave or, like me, you&apos;re returning to work don&apos;t undervalue what you will do, learn and discover in the time you spend home with a new baby. Instead, try and think about how it might make you the master of your destiny at work.</p><p><br></p><p>This article originally appeared in&#xA0;<a data-cke-saved-href=\"http://www.womensagenda.com.au/talking-about/opinions/how-to-make-maternity-leave-the-defining-moment-of-your-career/201506025838#.VW-ws2qJj7a\" href=\"http://www.womensagenda.com.au/talking-about/opinions/how-to-make-maternity-leave-the-defining-moment-of-your-career/201506025838#.VW-ws2qJj7a\">Women&apos;s Agenda&#xA0;</a>and was reposted with&#xA0;Catriona&apos;s permission.</p><hr><h4><font color=\"#a97fb1\"><b>&#xA0;</b></font></h4><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><font color=\"#a97fb1\"><b></b></font>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/06","associated_company":"work180"}