{"url":"https://www.work180.com.au/blog/2018/03/how-to-recover-from-an-epic-fail-at-work","title":"How to recover from an epic fail at work","author":"WORK180","body":"\n\t\t\t\t\t<p>Not a single week goes by without someone volunteering a firm example of how they have failed to speak up in a meeting at work, because they froze with intimidation of fear. This week was the same, with one major exception &#x2013; I heard about it from the most senior person in the room. She was chairing the meeting and observing a younger female colleague who, when asked to contribute, couldn&#x2019;t get a word out. Her summary of the situation truly saddened me: &#x201C;If she can&#x2019;t speak up in a meeting, I don&#x2019;t want her on my team.&#x201D; What now, I asked? &#x201C;It will take her a year to recover her reputation.&#x201D; A seriously harsh response, I know. I had no idea who this woman was, but I felt gutted for her. The harsher reality here though is that, like every top ASX listed business across Australia with thousands of employees &#x2013; when the CEO asks you a question in front of the executive team, she/he is entitled to get a short, sharp answer.</p><h3 style=\"text-align: center;\"><strong>&#x201C;The harsher reality here though is that, like every top ASX listed business across Australia with thousands of employees &#x2013; when the CEO asks you a question in front of the executive team, she/he is entitled to get a short, sharp answer.&#x201D;</strong></h3><p><br></p><p>The cruelty here is that if we fail to communicate with confidence &#x2013; it is interpreted as a lack of capability. It&#x2019;s a genuine career setback that highlights the need to continue developing our public speaking skills in parallel with the hard knowledge we develop about our field of expertise. If this has ever happened to you &#x2013; consider these three ways to regroup for the next opportunity.</p><p><br></p><h4><strong>1.</strong>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;<strong>Acknowledge the blunder.</strong></h4><p>Ok, we&#x2019;ve stuffed up. We&#x2019;re all a work in progress. What was it about the situation that caused you to respond/fail to respond? Was it an inability to think on your feet? If so, please see my previous article for specific advice on a framework to help you organise your thoughts. Find the cause and work on the solution.&#xA0;</p><p><br></p><h4><strong>2.</strong>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;<strong>Be transparent with your colleagues.</strong></h4><p>Who was in the room that&#x2019;s important to you? Call a short meeting with them and be candid about the situation. Demonstrate how you are working on the issue. Be clear about when they can expect to see an improvement.</p><p><br></p><h4><strong>3.&#xA0;&#xA0;</strong>&#xA0;&#xA0;&#xA0;<strong>Identify an ally for the next meeting</strong>.</h4><p>If you&#x2019;re anxious about walking into the next meeting, call for back up. Explain to an advocate or sponsor that you&#x2019;re overcoming a specific issue. Ask them to support you, which may mean they encourage you to speak up, or cue you so you have a chance to demonstrate that you&#x2019;ve learnt from the last time.</p><p>Even as a career television news reporter, I can assure you that I&#x2019;ve had my fair share of stuff ups in boardrooms. I&#x2019;ve consulted my mentor, processed the mishap over days and sometimes weeks, then, I&#x2019;ve stopped punishing myself and let it go. We are all a work in progress, so trust yourself to take more risks, more often and suddenly you&#x2019;ll be on.</p><p><img src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDMvMjUvMjMvMzcvMTcvNTc4LzFJTUdfMjU4OS5qcGciXV0\" data-cke-saved-src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDMvMjUvMjMvMzcvMTcvNTc4LzFJTUdfMjU4OS5qcGciXV0\" style=\"margin-top: 10px; margin-bottom: 10px;\"></p><h4>About Andrea Clarke</h4><p><a data-cke-saved-href=\"https://www.linkedin.com/in/andrealouiseclarke/\" href=\"https://www.linkedin.com/in/andrealouiseclarke/\">Andrea Clarke</a> is a former Washington D.C. correspondent and international aid worker, now helping women across corporate Australia reach their potential with her career development program, <a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/careerceo?\" href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/careerceo?\">CareerCEO</a>.&#xA0;</p><p><a data-cke-saved-href=\"http://careerceo.com.au/\" href=\"http://careerceo.com.au/\" target=\"_blank\">careerceo.com.au</a></p><h4><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/13d84a1b-5990-4eb4-9038-2d2404afa772.jpeg\" style=\"float: right; margin: 10px; width: 150px; height: 71px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/13d84a1b-5990-4eb4-9038-2d2404afa772.jpeg\">About CareerCEO</h4><p><a data-cke-saved-href=\"https://www.careerceo.com.au/\" href=\"https://www.careerceo.com.au/\" target=\"_blank\">CareerCEO is a&#xA0;program</a>&#xA0;with a very simple objective:&#xA0;to provide you with a blueprint for building confidence in the boardroom.</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["confidence","women work","succeeding"],"upload_date":"2018/03","associated_company":"work180"}