{"url":"https://www.work180.com.au/blog/2015/10/how-to-be-a-leader-regardless-of-your-job-description","title":"How to be a leader regardless of your job description","author":"WORK180","body":"\n\t\t\t\t\t<p>While running a women&#x2019;s leadership program recently I asked everyone in the room to put up their hands if they were a leader. Less than half the hands in the room went up.&#xA0; It provided me with a good indication of how everyone perceived themselves in terms of their power, influence and ability to effect change.</p><p>Of course it&#x2019;s easier to feel like you&#x2019;re a leader if you&#x2019;re in a designated leadership role. It can be harder to feel like a leader if you aren&#x2019;t. But the reality is that everyone, regardless of their position, power or personality type, has the ability to positively influence others. It begins by owning your power to affect change, then extending that power outwards to those around you. Too often women, more so than men, don&#x2019;t recognize that power or are simply too timid to use it.&#xA0;</p><p>I&#x2019;ve met and worked with many people in senior positions of leadership over the years &#x2013; both male and female. &#xA0;Some have been quite charismatic, with a special way of making everyone around them feel valued. Others have been more introverted and less at home in a crowd. Some have been visionaries; others happier in the details.</p><p>What sets the best leaders apart isn&#x2019;t their superior intelligence, charismatic charm, strategic mind or any of the other traits we often associate with leadership. It&#x2019;s been who they are as human beings: authentic, purposeful, trustworthy, unpretentious, reflective and courageous in their own way. Yes, they may have healthy egos, but they aren&#x2019;t run by them. And yes, they are ambitious, but they&#x2019;re never arrogant. And while they have all held positions of power, none have been changed by it except to be even more purposeful in how they use it.</p><p>Too often we surrender our leadership power because of the poor leadership we see in those above us. We don&#x2019;t feel that our efforts are being full valued, that our strengths properly nurtured or our ambitions adequately recognized.&#xA0; But you don&#x2019;t need to have a great boss to be a leader and you sure as heck don&#x2019;t need a title. You just need to take 100% responsibility for your success and have the courage to step up to the plate and lead.</p><p>You lead not by virtue of the <em>position </em>you hold, but by virtue of <em>who </em>you are. You lead every time you let your imagination off the leash and connect with a vision that truly inspires you. You lead every time you set a bold course despite your misgivings. You lead every time you speak up about what&#x2019;s important to you. You lead every time you venture onto new ground. You lead every time you stick your neck out for what you believe in. You lead every time you do what&#x2019;s right over what&#x2019;s easy, particularly when it costs you. And you lead every time you encourage another person to expand their own horizon&#x2014;to dare more, do more, give more and become more. And while people may not see you as a leader right away, when you consistently act like one you&#x2019;ll find they soon start to catch on.</p><p>Great leaders don&#x2019;t get to be where they are because of the power they&#x2019;ve been given, but because of how they used the power they&#x2019;ve always had. The same power lies in you. Don&#x2019;t get me wrong though. Not everyone has what it takes to be CEO of a large multinational. But then, the vast majority of people wouldn&#x2019;t want to be! That&#x2019;s because we rarely aspire towards that for which we have little natural disposition. But each of us, regardless of our age, position or the authority bestowed upon us, can be a catalyst for positive change in our workplace, family, community, society and beyond. You are no exception.</p><p>Whatever story you have about yourself and your ability to lead, know this: <em>It&#x2019;s just a story</em>. Within you lies the ability to achieve amazing things through the relationships you cultivate with others. But before you can lead others to higher ground, you must first lead yourself.</p><p>No-one will see you as a leader until you do. So don&#x2019;t wait to be made a leader; assume leadership. Not in an arrogant way. Not in a way that disrespects the position of others, but in a way that lets everyone know that you own your personal power, know your value and want to add more of it. Starting right now, park any old beliefs that limit your influence and admit to owning your innate power to effect positive change. Because, quite simply, that&#x2019;s what is at the heart of all leadership.</p><p>As I said to the group of women I mentioned at the start of this article: It doesn&#x2019;t matter who you work with or who you work for, from today onward, walk as a leader, talk as a leader, think as a leader and act as a leader. &#xA0;Repeat again tomorrow. Over time your influence will spread. Try it!</p><p><br></p><p>Margie &#xA0;is one of our contributors, read about them all <a data-cke-saved-href=\"https://www.dccjobs.com/contributors\" href=\"https://www.dccjobs.com/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/career-advice/become-a-contributor\" href=\"https://www.dccjobs.com/career-advice/become-a-contributor\">here</a>.</p><p><br></p><h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/10","associated_company":"work180"}