{"url":"https://www.work180.com.au/blog/2016/11/how-to-develop-your-personal-brand-as-a-team","title":"How to Develop your Personal Brand - as a Team!","author":"WORK180","body":"\n\t\t\t\t\t<p>We all have a Personal Brand, what is yours?</p>\n\n<p><br>\nEarlier in 2016, DCC Jobs ran an event focusing on practical ways to build your Personal Brand. Despite the common misconception that personal branding is reserved for celebrities, we all have one&#x2026;just ask Google!</p>\n\n<p>During the event, we shared some pointers and ran some fun activities to help determine some easy ways to begin building a strong personal brand. We also developed a Personal Branding guide and workbook, for participants to complete in their own time. If you&#x2019;d like to get your hands on a copy of the DCC Jobs Personal Branding Guide and Workbook, simply&#xA0;<a href=\"https://www.diversecitycareers.com/member/createjobalert.aspx\">create a job alert</a>.</p>\n\n<p>DCC Jobs received many emails around the ways women have built up their brands, and the success they are seeing as a result. Here are two stories from&#xA0;Wadzanai Nezou,&#xA0;Stephanie Yeo and Heylee Menzies.</p>\n\n<p>&#xA0;</p>\n\n<p>Wadzanai Nenzou from Herconomics uses her personal brand, every day.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d185d000-31b6-4db4-a8fb-4373d0fd6d4e.jpeg\" style=\"height:300px; width:300px\"></p>\n\n<p>&#xA0;</p>\n\n<p>Wadzanai Nenzou was a great example of using her brand to advance her career . She attended one of the DCC meetups in which&#xA0;<a href=\"https://www.diversecitycareers.com/about-gemma\">Gemma Lloyd</a>&#xA0;spoke about developing a Personal Brand to Advance Your Career.</p>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p>&quot;I&#xA0;learnt&#xA0;a lot that evening and applied these lessons&quot; &#xA0;Wadzanai told us.</p>\n\n<p>&quot;Since this meetup, I have put myself out there using social media, telling people what my passion is and what I plan to achieve and going to different events. This has really opened so many opportunities for me when it comes to my new business venture&#xA0;Herconomics. I have met amazing people who have given me opportunities to grow my business. By using the lessons from this Personal branding session that DCC ran I have totally shifted how I show up in my career and business life.&quot;</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p>Stephanie Yeo and Heylee Menzies created their personal brand - as a team.<br>\n<br>\nWe were also very excited to hear about how Stephanie Yeo and Heylee Menzies tackled their own personal brands- as a team! &#xA0;&#x201C;We found the questions to be engaging and thought&#xA0;provoking; a launch pad for us to identify our own personal brand. We both had the workbook for many months without fully completing it independently,&#x201D;&#xA0;said Stephanie.&#xA0;&#x201C;As a way to ensure we both completed the workbook, we got together to tackle the questions as a team, because we were more critical&#xA0;on&#xA0;ourselves it left us almost disheartened to complete independently. It was a very positive, empowering and engaging session,&#x201D;&#xA0;continued Heylee.</p>\n</blockquote>\n\n<p>At the end of the workbook, the pair set a deadline for what they would do with their findings; redevelop their LinkedIn profiles, update their CV&#x2019;s and continue to think about what they can do to further reinforce our brand.&#xA0;&#x201C;We essentially launched an &#x2018;accountability buddy&#x2019; style agreement,&quot;&#xA0;explained Stephanie.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>A week later, Stephanie and Heylee had both edited, proof read and completed their new LinkedIn bios.</p>\n\n<p>&#x201C;We felt reinvigorated and excited about our Personal Brands and the whole process was so much easier for us to complete together, rather than individually!&#x201D;&#xA0;summed up Heylee.</p>\n\n<p>&#xA0;</p>\n\n<p>Heylee and Steph have some words of advice for those looking to undertake the personal branding exercise:</p>\n\n<ul>\n\t<li>\n\t<p>Number one is to make time for yourself to complete it!&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Secondly, try to create a constructive and positive environment to complete &#x2013; that may mean asking a trusted colleague or mentor to help you in the same way Heylee and Steph did for ourselves.&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Also, remember, creating your personal brand is a work in progress, it doesn&#x2019;t necessarily get created and established overnight.&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Revisit once a year as your goals and experiences may have altered and your personal brand should reflect this!</p>\n\t</li>\n</ul>\n\n<p>We think this is a great way to manage a crucial aspect of your career development and would love to hear from others who have noticed a difference that building a personal brand can make!</p>\n\n<p>&#xA0;</p>\n\n<p>Get Your Copy of DCC Jobs Personal Branding Guide<br>\n<br>\nIf you&#x2019;d like to get your hands on a copy of the DCC Jobs Personal Branding Guide and Workbook, simply&#xA0;<a href=\"/dashboard/candidate\">create a job alert</a>&#xA0;on the DCC Jobs website- Australia&#x2019;s #1 Job Site for women!</p>\n\n<p>&#xA0;</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4c408695-1460-4978-a1a8-64a848978500.png\"></p>\n\n<h5>&#xA0;</h5>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2016/11","associated_company":"work180"}