{"url":"https://www.work180.com.au/blog/2018/11/how-arcadis-attracts-and-keeps-great-people","title":"How Arcadis attracts and keeps great people","author":"Arcadis","body":"\n\t\t\t\t\t<p>&#x2019;Flexible Working&#x2019;.</p>\n\n<p>That&#x2019;s the usual response when you ask someone what makes Arcadis a great place to work. In fact, 86% of respondents in their most recent employee engagement survey said that they were supported to work in a flexible way.</p>\n\n<p>More specifically, Arcadis team members described flexible working as:</p>\n\n<p style=\"margin-left:36.0pt;\">&#x201C;a highly valued aspect of my position in Arcadis and has increased productivity&#x201D;</p>\n\n<p style=\"margin-left:36.0pt;\">&#x201C;based on trust between the team members and the line manager&#x201D;</p>\n\n<p style=\"margin-left:36.0pt;\">&#x201C;practiced at senior levels&#x201D;</p>\n\n<p style=\"margin-left:36.0pt;\">&#x201C;unique in this company. It is not just talking about it but is actually implemented.&#x201D;</p>\n\n<p>Flexible work is an underlying strategy used to increase the number of women in key positions at Arcadis. As a result, Arcadis have attracted and hired a lot more women over the last six months, who see access to genuine flexible work arrangements as an incontrovertible benefit.&#xA0;</p>\n\n<p>They have successfully attracted women into senior roles within Client &amp; Operations as well as roles within Urban Development &#x2013; these areas have historically had trouble attracting women into.</p>\n\n<p>Flexible work has also enabled Arcadis to retain the top female talent they already have. In the last five months, five talented women in senior roles have transitioned to flexible work arrangements to enable them to balance work and life.</p>\n\n<p>Over the last six months, more and more potential employees have approached Arcadis. They&#x2019;ve heard what working for a great employer is like and are excited about their flexible work offering, and they want in.</p>\n\n<p>As part of the business model, Arcadis employees work closely with clients either on-site or at the clients office. Eighteen months ago, Arcadis managers started having up front discussions with their clients about the Arcadis work philosophy and how their people work. These days, issues are rare and resolved quickly between counterpart HR teams and managers. To help their teams understand what flexible working could mean for them, Arcadis developed a page on their intranet to house a central repository of information about flexible working so that it is available to everyone at anytime.</p>\n\n<p>Flexible work arrangements are a known lever for a number of key strategic goals such as: reducing the cost of re-recruitment and staff retention; reducing the gender pay gap; increasing the number of women into leadership positions; reducing mental health triggers; and wanting a work force that reflects their clients.</p>\n\n<p>Arcadis Group Executive &#x2013; Asia Pacific Greg Steele, who was also a Male Champion of Change, keeps flexible working high up on his strategy and continues to talk about flexible working. Not only does Greg actively promote flexible working within Arcadis but he is often found working flexibly, at home, in the office kitchen or alongside other Arcadians in various offices.</p>\n\n<p>Arcadis has a lot to be proud of when it comes to flexible working.&#xA0; They are a company that lives and breathes flexible working at all levels of the organisation.&#xA0;</p>\n\n<p>Congratulations Arcadis on continuing to be a Flex Able Certified Employer.</p>\n\n<p>&#xA0;</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About the Flex Able Certification</strong></h4>\n\n<p><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p>\n\n<p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p>\n\n<p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? WORK180&#x2019;s&#xA0;<a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">Flex Able</a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">&#xA0;Certification&#xA0;</a>helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p>\n\n<p>Learn more about the&#xA0;Flex Able&#xA0;Certification&#xA0;<a href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">.</a></p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["flexible working"],"upload_date":"2018/11"}