{"url":"https://www.work180.com.au/blog/2015/04/how-can-serving-others-help-you-become-a-better-leader","title":"How can serving others help you become a better leader?","author":"WORK180","body":"\n\t\t\t\t\t<p>&#xA0;</p>\n\n<blockquote>\n<p><strong><em>&#x201C;Life&#x2019;s most persistent and urgent question is, what are you doing for others?&#x201D;</em></strong> <strong>-</strong> Martin Luther King</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p>My working life began at 14, when I eagerly quit school to pursue a promising career at Hungry Jack&apos;s. Not sure if anyone remembers the tiny but busy Hungry Jack&apos;s on Flinders Street Station in Melbourne, now long gone&#x2026;</p>\n\n<p>Hungry Jack&apos;s had a strict policy on how long a burger could remain on the shelf before being sold. The limit was a few minutes and I made it my personal crusade to &#x201C;rescue&#x201D; each disqualified burger.</p>\n\n<p>Oh to have that kind of metabolism again!!</p>\n\n<p>Following that bold career move, I progressed to the Golden Arches. During my brief stint there, I was constantly berated for &#x201C;not mopping the floor properly&#x201D;.</p>\n\n<p>This lead to a move to a five star restaurant, where I claimed to be 16 years old to get the job.</p>\n\n<p>However, after spilling red wine on a white tablecloth at a function and dropping a plate into someone&#x2019;s lap <em>in one day,</em> I quit in a flood of traumatised tears.</p>\n\n<p>My teenage mind rationalised the situation in the following manner:</p>\n\n<p>Working in hospitality= serving people who are really mean when you f*%# up= I quit!</p>\n\n<p>Later on, at 15, I was hired as a trainee in the HR department of the Coles Myer Head Office. This opened up my eyes to the corporate world and a different kind of &#x201C;serving&#x201D;.</p>\n\n<p>Fast forward almost two decades and I&#x2019;ve now come to the conclusion that serving can be looked at in so many different ways.</p>\n\n<p>It also doesn&#x2019;t stop the higher you climb the ladder. In fact, it can be a catalyst for better performance and leadership.</p>\n\n<p>In his book Leadership from the Inside out, Kevin Cashman wrote,</p>\n\n<blockquote>\n<p><em>&#x201C;Ultimately a leader is not judged by how well he or she leads, but by how well he or she serves. All value and contribution is achieved through service.&#x201D;</em></p>\n</blockquote>\n\n<p>I find the notion of serving others is more about treating others as you&#x2019;d like to be treated. To me, it means treating each and every person I come across with respect.</p>\n\n<p>It doesn&#x2019;t matter if they are mopping the floor or are the king of a small country.</p>\n\n<p>The TV series &#x2018;Undercover Boss&#x2019; is a great example of how much closer to the business senior leaders can get when undercover.</p>\n\n<p>The thing is, truly great leaders get that kind of engagement and loyalty from their staff while donning the power suit, too.</p>\n\n<p>Another aspect of serving is paying it forward; doing things for people without expecting anything in return, and looking to be of service in every interaction.</p>\n\n<p>I&#x2019;ve worked for managers who took the intimidation approach and for ones who led by inspiration, from a place of genuinely caring about others.</p>\n\n<p>Just the other day, I was drawing on those experiences while explaining to my son the concept of &#x201C;attracting more bees with honey than with a stick&#x201D;.</p>\n\n<p>Well actually, I think that was a mash up of the bees/honey and carrot/stick proverbs but what the hey, he got the point.</p>\n\n<p>Human nature dictates that we put ourselves first, which is perfectly normal.</p>\n\n<p>However, the more you can focus on what you can do for others, the more effective you will be as a team member and leader.</p>\n\n<p>The nice feeling is a bonus.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/04","associated_company":"work180"}