{"url":"https://www.work180.com.au/blog/2017/10/how-to-ensure-staff-in-remote-locations-feel-like-part-of-the-team","title":"How to Ensure Staff in Remote Locations Feel Like Part of the Team","author":"WORK180","body":"\n\t\t\t\t\t<p>Working in a remote location in Western Australia&#x2019;s mining and industrial heartland can be a lonely job.</p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23ddfe48-5e40-437a-8470-8d5de50c8563.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23ddfe48-5e40-437a-8470-8d5de50c8563.jpeg\" style=\"font-size: 16px; float: right; width: 200px; height: 267px; margin: 10px;\"></p><div><p>It can be easy for companies with a larger head office in a major city to put their satellite staff on the backburner &#x2013; the old out of sight, out of mind scenario.</p><p>Even for someone such as Francheska Gobel who grew up in Port Hedland, 1600 km north of Perth, and knows what it&#x2019;s like living in an ore remote region could still feel a little on the outer.</p><p>Luckily, she landed a role at a company which keeps a laser focus on its goal of inclusion and flexibility.</p><h3><strong>An open an inclusive culture</strong></h3><p>Francheska is an account manager with construction materials giant Holcim, and when it was announced the business has been approved to join WORK180 (previously DCC Jobs) she <a data-cke-saved-href=\"https://www.linkedin.com/feed/update/urn:li:activity:6310750706995388417\" href=\"https://www.linkedin.com/feed/update/urn:li:activity:6310750706995388417\" target=\"_blank\">commented online </a>immediately:</p><blockquote><p>&#x201C;The inclusion Holcim offers to women in the workforce is very real. Within 6 months of embarking on a career with Holcim the level of support, inclusion and recognition I have received has been such a delight!&#x201D;</p></blockquote><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ebb3c5c6-832b-4e7d-bf3d-1556d5581518.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ebb3c5c6-832b-4e7d-bf3d-1556d5581518.png\" style=\"text-align: center; width: 60%;\"></p><p>Francheska, who moved to the construction materials industry after several years in waste management and after an initial stint as a qualified park ranger, says the level of encouragement she has experienced is unequalled in her career.</p><p>&#x201C;I don&#x2019;t feel isolated being in Port Hedland, a remote area in Northern WA,&#x201D; she says. &#x201C;In the last seven months I have been down to Perth six times. I&#x2019;ve participated in team building exercises and have been invited to training sessions.&#x201D;</p><p>&#x201C;There is an open dialogue between management and people on the ground. Everyone is really transparent in the company about where we are at, where we want to be and where we are headed for the future. It&#x2019;s been a breath of fresh air.&#x201D;</p><p>Professional feedback is also very forthcoming &#x2013; and Francheska says it has come from all areas. It has made her feel welcomed and supported into the larger team of around 100 in Perth compared to the seven or so employees across two facilities in Port Hedland.</p><blockquote><p>&#x201C;Everyone wants to work together<strong>.</strong> I have had a lot of support, encouragement and even recognition from people telling me I am doing a great job and to keep up the good work<strong>. </strong>It has been appreciable because it has not always been like that for me. I have experienced nearly the opposite in past stages of my career.</p></blockquote><p>&#x201C;The feedback is coming from everyone, not just my own direct manager but general managers and other divisional managers as well.&#x201D;</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c3f2c01e-47a2-4a26-978a-0642e209c233.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c3f2c01e-47a2-4a26-978a-0642e209c233.jpeg\" style=\"margin: 10px;\"></p><p><br></p><h3><strong>A focus on women</strong></h3><p>Holcim took gender diversity within its ranks to the next level in 2016 with the introduction of a Women&#x2019;s Task Force. Its goal is to investigate ways to increase female participation rates across the workforce, and has already clocked up several &#x2018;wins&#x2019; including:</p><ul><li>Providing workshops and networking opportunities for women at Holcim;</li><li>Hosting Diversity Days;</li><li>Improving imagery and communication voice used internally and externally;</li><li>Approving capital funds to improve facilities for females in operations;</li><li>Introducing a women&#x2019;s range of industrial workwear and personal protective equipment;</li><li>Changes to the Parental Leave Policy to include superannuation contributions to all employees on unpaid parental leave for up to 52 weeks and a Return to Work Bonus (4 weeks&#x2019; pay) for employees to pre-parental leave position.</li></ul><p>Francheska says she has already taken part in a series of workshops for women in business that were incredibly motivating and beneficial for skills development and networking.</p><p>&#x201C;We did a workshop on our strengths &#x2013; identifying what they were and how we could develop them further, or if we were overplaying or underplaying them and where to find that balance,&#x201D; she says. &#x201C;That&#x2019;s not something I have had explored before, especially in a workplace. It was really great, the level of inclusion and being encouraged to excel.</p><blockquote><p>There is a lot of gender diversity at Holcim, especially in this previously male dominating industry.&#x201D;</p></blockquote><p>She said that, although there is an imbalance of male and females within her industry, things are definitely changing.</p><p>&#x201C;I just got a phone call from our communications manager in NSW- I was recommended by our Executive General Manager of HR and Safety to be showcased on our own national website,&#x201D; she says. &#x201C;She is female and one of our state General Managers is female &#x2013; there&#x2019;s lots of female representation in higher levels.&#x201D;</p><h3><strong>Flexibility both in the position description and working style</strong></h3><p>Francheska was relocating back to the north of the state when she applied for a role in the North West.</p><p>Although that role had been filled internally, she was presented another opportunity &#x2013; the account manager role with Holcim.</p><p>&#x201C;I was already moving back up north and the job fit well with my previous experience in operations and sales throughout the mining, oil and gas sector, particularly in the northern WA region,&#x201D; she said. &#x201C;I am new to the concrete and aggregate industry so it has been a busy six months getting up to speed with a whole new dimension of products and industry.&#x201D;</p><p>Originally the role was to be based in Perth, but Holcim realised having someone on ground to manage key accounts &#x2013; including BHP and Rio Tinto whose operations are based mainly in that region &#x2013; was much more beneficial.</p><blockquote><p>Francheska says she was given the option of basing herself at one of two locations in Port Hedland and has the options of working from home if required.</p></blockquote><p>She&#x2019;s also on the road a lot visiting clients in Broome, Port Hedland, Karratha, Tom Price, Paraburdoo and Newman so it&#x2019;s less important where she physically is to do the work, than it is to meet her KPIs and targets. This, she says, is another example of how refreshing it is to work for a firm that values flexibility.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/04050fb7-db70-4c33-9537-f258d4b6954f.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/04050fb7-db70-4c33-9537-f258d4b6954f.jpeg\"></p><p style=\"text-align: center;\"><small>Photo from Francheska&apos;s last trip (close to Tom Price)- isn&apos;t this countryside beautiful?</small></p><p>&#x201C;We have multiple fixed concrete plants and quarries around the Pilbara region,&#x201D; she says. &#x201C;I live in Port Hedland at the moment so I base myself at our office in town, Holcim&#x2019;s concrete plant in the industrial area. It&#x2019;s is close to home &#x2013; about five minutes&#x2019; drive.&#xA0;</p><p>I could have been based in Port Hedland, Newman or Karratha. Things have been really flexible with my role and my bosses are happy as long as I fulfill my KPIs.&#x201D;</p><p style=\"text-align: center;\"><small><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2b840859-9d98-448e-b861-9cd15292b642.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2b840859-9d98-448e-b861-9cd15292b642.jpeg\"></small></p><p style=\"text-align: center;\"><small>Francheska enjoys exploring the outdoors on her </small><small>motorcross</small><small>.</small></p><hr><h4><strong>About Holcim<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/611270a0-f966-44ec-84d1-f3471e602053.png\" style=\"float: right; margin: 10px; width: 200px; height: 86px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/611270a0-f966-44ec-84d1-f3471e602053.png\"></strong></h4><p>Holcim is a WORK180 Endorsed Employer for Women.&#xA0; Did you know Holcim offers superannuation contributions to all staff on unpaid parental leave (up to 52 weeks!) and a return to work bonus equal to 4 weeks pay? These are just some examples of their commitment to create a better workplace, find out more on their <a data-cke-saved-href=\"https://www.work180.com.au/clients/holcim\" href=\"https://www.work180.com.au/clients/holcim\">Best Employer page.&#xA0;</a></p><p>Find jobs with Holcim <a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=holcim\" href=\"https://www.work180.com.au/job-search?client=holcim\" target=\"_blank\">here.</a></p><p><br></p><hr><h4><strong>About the author&#xA0;</strong></h4><p>Cathy Anderson is a Melbourne-based&#xA0;freelance journalist who specialises in small business writing and personality profiles. As one of the co-founders of HuffPost Australia&apos;s Small Business section and her own small business, Ginger Brown Digital Content, she has a passion for sharing stories of empowering and inspiring women.&#xA0;&#xA0;</p><hr><strong></strong><h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.&#xA0;</p></div>\n\t\t\t\t","tags":["Employee Stories","Photo from Francheska's last trip (close to Tom Price)- isn't this countryside beautiful?","","Francheska enjoys exploring the outdoors on her","motorcross","."],"upload_date":"2017/10","associated_companies":["work180"]}