{"url":"https://www.work180.com.au/blog/2018/08/how-the-beauty-of-maths-helped-discover-a-new-career","title":"How the beauty of maths helped discover a new career","author":"WORK180","body":"\n\t\t\t\t\t<p>At high school, Jennifer Bramwell loved creative subjects including art history, classical studies and fine art. So it was a surprise when she fell in love with what may seem to be the opposite &#x2013; mathematics.</p>\n\n<p>Her almost accidental romance with pure maths came after she became a finalist for the New Zealand International Mathematical Olympiad team, and was exposed to a different form of the discipline.</p>\n\n<blockquote>\n<p><em>&#x201C;The nice thing is that it is very similar to art, it is very beautiful and it is coming from within the human brain instead of observation of the real world,&#x201D; she explains. &#x201C;In some ways that is what is interesting. The math Olympiad showed me that maths was not as boring or as horrible as I was made to believe.&#x201D;</em></p>\n</blockquote>\n\n<p>Now an Analytics Manager and Data Scientist at consulting firm Accenture based in Perth, Jennifer says her exposure to pure maths changed her life and began to influence first her choice of further education, and then career roles.</p>\n\n<p>She continued her maths love affair through to university where she studied a joint Bachelor of Commerce and Bachelor of Science, then followed with a Masters of Science.</p>\n\n<p>The Commerce aspect was meant to be a career safety net &#x2013; Jennifer thought being an accountant would be a good career choice. A chance encounter with a member of the statistics department at the University of Auckland led to her taking on stats as her fourth major, but one soon took over the other.</p>\n\n<p>&#x201C;One of my majors was accounting but I was also doing a pure maths major and statistics major just for the fun of it,&#x201D; she says. &#x201C;I kept the commerce side of things because I thought I would need it to get a job &#x2013; but accounting really wasn&#x2019;t for me and I haven&#x2019;t used my commerce degree yet.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Moving to Accenture</strong></h4>\n\n<p>In her role at Accenture, Jennifer uses her data analysis and statistics skills to develop machine learning to problem solve future issues.</p>\n\n<p>&#x201C;A lot of it is predictive modelling, predicting what the future outcome will be for clients,&#x201D; she says.</p>\n\n<p>Jennifer spends a good part of her day-to-day coding, modelling as well as meeting with clients and working with her team. She says technology is changing so fast with cloud computing and data streaming, that modelling has now become very different as you need to build models to anticipate all kind of input, not just make it to work on your local dataset. Jennifer says her background has helped immensely in this regard.</p>\n\n<blockquote>\n<p><em>&#x201C;I feel as though my training in pure maths is actually really valuable,&#x201D; she says. &#x201C;In pure </em><em>maths</em><em> you are proving theorems, the different ways of proving theorems they are quite useful for </em><em>problem solving</em><em>. And you need to be absolutely correct. One small mistake and the proof is not valid.</em></p>\n</blockquote>\n\n<p>&#x201C;So in the sense that translates to making sure things are done to a high quality so that the model can be deployed many times.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Passion for learning</strong></h4>\n\n<p>Jennifer says other women interested in doing a role similar to hers do not need to obtain the same qualifications &#x2013; there are many degrees that will be appropriate. But she does advise that to be an effective data scientist or analyst you need to be dedicated to a lifetime of learning.</p>\n\n<p>&#x201C;You should only do it if you are passionate about it and willing to put the time in because it is one of those fields that changes very quickly, so you need to be willing to learn and have an open mind,&#x201D; she says.</p>\n\n<p>&#x201C;It&#x2019;s one of those fields where no one has the perfect answer and even if you have the perfect answer today, it might become irrelevant tomorrow. It is about being humble and trying to learn as much as possible.&#x201D;</p>\n\n<hr>\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7b99efaf-524a-47fa-8ac5-545477cf27a8.png\" style=\"color: rgb(169, 126, 179); font-size: 18px; font-weight: 700; float: right; margin: 10px; width: 162px; height: 170px;\"></p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About Accenture&#xA0;</strong></h4>\n\n<p><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:9332486\">Accenture is an Endorsed Employer for Women. Accenture&#xA0;</span><span id=\"ember6195\">&#xA0;is ready to discuss how your role may be done flexibly at the interview stage and support programs for girls learning tech. These are just some of the ways they foster women&#x2019;s careers. Read more about them on their<a href=\"https://www.work180.com.au/clients/accenture\">&#xA0;Best Employer page.</a></span></p>\n\n<p>Browse jobs with Accenture&#xA0;<a href=\"https://www.work180.com.au/job-search?client=accenture\">here.&#xA0;</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/08"}