{"url":"https://www.work180.com.au/blog/2015/08/how-to-push-back-without-being-pushy","title":"How to push back without being pushy","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;<em>Is fear of rocking the boat holding you back? </em>or <em>Are you too nice for your own good? </em></p>\n\n<p>When I look back on the not-so-pleasant experiences in my career and life, on every single occasion I can identify where I held back from confronting an issue when I shouldn&#x2019;t have because I was afraid someone might think I was being difficult, hard to get along with, uncooperative or pushy. I was trying to be a nice person&#x2014;agreeable, easy to work with. Alas, I was trying too hard.</p>\n\n<p>I like nice people. Who doesn&#x2019;t, right? But, like every virtue, too much niceness can become a vice. Of course, being agreeable, affable and amenable is often a great thing, helping you to build trusting and rewarding relationships. Likewise, no-one likes someone who is forever forcing their opinion, constantly argumentative and overly demanding. However, if you&#x2019;re not willing to push back from time to time, you can find yourself feeling increasingly resentful, frustrated and not accomplishing what you want. Or to put it simply - rocking the boat can be risky, but no less than being too agreeable.</p>\n\n<p>If all you ever do is &#x2018;go along to get along&#x2019; you will sometimes diminish yourself and deprive others of the impact you would make by speaking up and putting forward your opinion, even if it ruffles the odd feather. Sure, there&#x2019;ll be people who won&#x2019;t always agree with you. Some may think you&#x2019;re being a pain in the butt. Criticism and confrontation may ensue. However, in today&#x2019;s workplace where &#x2018;yes-people&#x2019; are plentiful, those who are willing to speak their mind&#x2014;courteously, but candidly&#x2014;not only add more value, but become more valued by those around them. As Margaret Thatcher once said, &#x2018;If you set out to be liked, you will accomplish nothing&#x2019;.</p>\n\n<p>There is both an art and a science to knowing how to push back without coming across as pushy. Here are a five ways to help you do just that.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. Don&#x2019;t make people wrong</strong></p>\n\n<p>If you&#x2019;ve ever had someone challenge your opinion, even gently, you&#x2019;ll have experienced how quickly it can raise your defenses, even when you know you aren&#x2019;t being personally attacked. Likewise, if what you have to say may be threatening to others, be very clear in distinguishing between the opinion you&#x2019;re pushing back against and the person who holds it.</p>\n\n<p>When people perceive that you&#x2019;re trying to put them down or lay blame, they instinctively go into combat mode. No one wins when either perceives that the other is out for blood. So instead of saying &#x2018;yes, but &#x2026;&#x2019;, say &#x2018;yes, and &#x2026;&#x2019; The former may come across as combative while the latter acknowledges their view as valid and invites further discussion.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Enquire before advocating</strong></p>\n\n<p>We all like to think our way of seeing things is the right way. So before you try to convince someone otherwise, take time to understand how they came to see things as they do. This moves you from advocating for your opinion to inquiring about theirs. When people sense you&#x2019;re genuinely trying to understand their perspective, they become more receptive to yours.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Start with what you both care about</strong></p>\n\n<p>Whether it&#x2019;s a mutual concern for the bottom line or the state of your relationship, make sure you frame your opinion in the context of what you both care about. That way, people won&#x2019;t see you as arguing against them as much as trying to work with them to create a better outcome. It can subtly shift the emotional space from being combative to collaborative.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Arm yourself with solutions, not complaints</strong></p>\n\n<p>It&#x2019;s easy to complain. It&#x2019;s why so many people excel at it. It&#x2019;s not so easy to find a practical solution that takes care of everyone&#x2019;s (not just your own) concerns. So whenever you can, come armed with a suggestion to address the issue along with examples of where your idea has worked for others. Since most people tend towards risk-averseness, sharing how others have been successful in similar situations can lessen misgivings and increase buy-in. If you have no solution, then enlist their support in finding one.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5. Know when to let it rest</strong></p>\n\n<p>You won&#x2019;t always get others to see things your way so know when it&#x2019;s time to let it go and move on. At least now people know where you stand and you can either accept things as they are or make other plans. Either way, you&#x2019;ll have built self-respect for making a stand and likely also earned the respect of those you challenged for the courage it took you to do so.</p>\n\n<p>Saying something that rubs against the consensus opinion can cause friction. However, as I wrote in <a href=\"http://www.trainthebrave.com/\">Brave: 50 Everyday Acts of Courage To Thrive In Work, Love and Life,</a> being too agreeable when you need to speak assertively can put your self-respect at risk. Where is your fear of rocking the boat (and being regarded as bossy, or pushy, or even difficult to get along with) keeping you from speaking up more bravely?</p>\n\n<p>&#xA0;</p>\n\n<p>Margie&#xA0;is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/08","associated_company":"work180"}