{"url":"https://www.work180.com.au/blog/2017/11/how-to-boost-self-confidence-in-your-child","title":"How to Boost Your Child's Self Confidence","author":"WORK180","body":"\n\t\t\t\t\t<p>Have you ever felt like you were not good enough? Felt ashamed about how you look, what others may think about you or felt the pressure of being judged?</p>\n\n<p>Unfortunately, the culture of shame or guilt has become ingrained in us, perpetuated by mass media and exposure to images of unrealistic #goals.&#xA0;</p>\n\n<p>For many, the sheer act of looking in the mirror has become about focusing on the imperfections and wishing that we could be something that we&#x2019;re not, stuck in an unattainable and self-depreciating cycle. There has always been a certain standard set by society for us to look and behave a certain way to be accepted, yet this standard is often not representative of the majority of the population. You can just look to the latest fashion catwalks or magazines to know that most people would not fit into its mould of desirable features or ideals of perfection.</p>\n\n<p>So we have all felt it at some point, that we are not good enough &#x2013; and this affects our self-worth, underselling ourselves because we don&#x2019;t feel that we deserve it; undeserving of that promotion, undeserving of kindness and undeserving of love.</p>\n\n<p>But just because you do not fit society&#x2019;s definition of a certain label, does not mean it should define you. You can be a man who loves ballet or a woman who loves contact sports. What makes us amazing is how unique we all are.</p>\n\n<blockquote>\n<p>So how do children feel in today&#x2019;s society?</p>\n</blockquote>\n\n<p>Children&#x2019;s author, Nathan Anderson believes in is that it is important to start shaping one&#x2019;s perspective from a young age.</p>\n\n<p><strong><em>I Am</em></strong> is a children&#x2019;s book with a difference. In a world that seems to be becoming more divided, it is a book that is promoting the human emotional connection.</p>\n\n<p><strong><em>I Am</em></strong>&#x2019;s illustrations are of children of the world, highlighting inclusion and diversity. It aims to represent a wider variety of people, evoking feelings of unity and belonging amongst those who read it and see themselves in the images. <strong><em>I Am </em></strong><em>us</em>es positive affirmations to instil powerful self-fulfilling statements, empowering and inspiring children.</p>\n\n<p>As children read this book, they connect with what they see and how they feel. They will learn essential values that will equip them in the years ahead. Reading and sharing this book will provide a framework for adults to have at times tricky conversations with children about how they are feeling and encourage them to express themselves. As they read and see other children they can relate to, this will allow them to feel they too are worthy of love, respect, happiness and all of the other positive messages in this book.</p>\n\n<p>From the beginning, Nathan wanted to align with like-minded charities and organisations to help spread the message of <strong><em>I Am</em></strong>. He has pledged to donate a percentage of profits from the book back to local charities that do such great work in the community.</p>\n\n<p><em>Together through love and connection can we create a brighter future<strong> - </strong><u>Nathan Anderson</u>.</em></p>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p>Nathan is launching I Am to the public on the 19<sup>th</sup> of November 2017, 10 am, at Where the Wild Things Are in West End Brisbane. You can pre-order copies now and find out more about <strong><em>I Am</em></strong> at <a href=\"http://www.iambook.org/\">www.iambook.org</a>.&#xA0;</p>\n</blockquote>\n\n<p style=\"text-align: center;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/556b5c7b-d3ed-45a3-a04e-6e25f8d83b8e.png\" style=\"margin: 10px; float: left;\"></p>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4><strong>Author bio</strong></h4>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/0d922c85-a06f-4395-954f-c8397d4be2b8.png\" style=\"float: right; width: 300px; height: 300px; margin: 10px;\">With over 10 years&#x2019; experience as a recruitment specialist in the Human Resources industry, Nathan C Anderson knows people. However, it is outside of this corporate light helping others reach their career potential, that he has found something even more rewarding.</p>\n\n<p>Through life&#x2019;s journey, Nathan has always been searching for a deeper meaning and purpose. Born to an Indo-Chinese mother and Australian father, growing up with two strong and loving sisters, and married to a smart and beautiful, Nepali wife, Nathan has experienced first hand the diversity of the world and particularly the important role that women play in all of our lives. Being privilege enough to travel to numerous countries across the world, Nathan has been inspired by the beauty and strength of people from different cultures but saddened by the disparity of poverty and inequality he has witnessed.</p>\n\n<p>Nathan has a strong sense of community, in connecting with others through service and giving back. He believes in giving time over money which has lead him to volunteer thousands of hours over the years through various organisations such as the St. John&#x2019;s Ambulance Service, Nepal Australia Friendship Association (NAFA); and you will currently catch him during his spare time engaged in a social enterprises or volunteering at the local Children&#x2019;s Hospital in Brisbane, Australia.</p>\n\n<p>I Am was born to help inspire the next generation for a brighter future no matter their background, to allow our children to fulfil their potential and help them become who they are destined to be.<br>\n&#x200B;</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/11","associated_company":"work180"}