{"url":"https://www.work180.com.au/blog/2015/05/how-to-build-a-more-gender-diverse-pipeline-entering-the-it-industry","title":"How to build a more gender diverse pipeline entering the IT industry","author":"WORK180","body":"\n\t\t\t\t\t<p>Last week, I was very excited to co-host the first Diversity Roundtable on behalf of FITT, alongside Victoria Keeys, Senior Manager of Culture and Diversity at CBA.</p>\n\n<p>The topic for the morning was &#x201C;How to build a more gender diverse pipeline entering the IT industry&#x201D;. We were fortunate to have a mix of HR and Diversity professionals, as well as Senior IT leaders from:</p>\n\n<ul>\n\t<li>\n\t<p>Canon</p>\n\t</li>\n\t<li>\n\t<p>CBA</p>\n\t</li>\n\t<li>\n\t<p>Cisco</p>\n\t</li>\n\t<li>\n\t<p>Dimension Data</p>\n\t</li>\n\t<li>\n\t<p>Fujitsu</p>\n\t</li>\n\t<li>\n\t<p>NICTA</p>\n\t</li>\n\t<li>\n\t<p>Oakton</p>\n\t</li>\n\t<li>\n\t<p>Optus</p>\n\t</li>\n\t<li>\n\t<p>Origin Energy</p>\n\t</li>\n\t<li>\n\t<p>Paxus</p>\n\t</li>\n\t<li>\n\t<p>Telstra</p>\n\t</li>\n</ul>\n\n<p>Nick Lewins, Executive General Manager of Architecture and Planning at CBA, started off the session and shared the importance of not just having a diverse organisation, but also an inclusive organisation. &#x201C;Individually, these elements fail to deliver the change in behaviour that is required,&#x201D; stated Nick.</p>\n\n<p>I was impressed by the number of diversity and inclusion initiatives implemented at CBA. I was also impressed by the environment of trust they have created with their employees, ensuring everyone feels like they have a voice and can contribute openly in internal discussions.</p>\n\n<p>We then heard from Stephen Baker, Culture and People Manager at Origin Energy. Stephen shared Origin Energy&#x2019;s journey to create a gender diverse organisation. It was inspirational to hear the statistics and how far Origin have come since 2009 when they began the diversity initiatives. For instance, since 2009, female participation has increased from 26% to 43% and female participation in senior roles has increased from 8% to 36%.</p>\n\n<p>Great ideas and strategies were shared around how we can increase the gender diverse pipeline coming into ICT. Some of the key points made were:</p>\n\n<ul>\n\t<li>\n\t<p>Increasing awareness of girls in both primary and high school &#x2013; make subjects such as Maths and IT interesting and approachable.</p>\n\t</li>\n\t<li>\n\t<p>Whilst promoting women, it&#x2019;s important not to alienate men. Language, tone and inclusion are key.</p>\n\t</li>\n\t<li>\n\t<p>When hiring for senior roles, identify if the focus should be on hiring people who already have technical skills or on the individual&#x2019;s potential, even if they don&#x2019;t have IT experience.</p>\n\t</li>\n</ul>\n\n<p>The Roundtable was highly productive and we made the commitment to regroup on a regular basis, and continue to share our progress on increasing diversity within ICT.</p>\n\n<p>I&#x2019;d like to thank all of the participants for their attendance and contribution to the discussion.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/05","associated_company":"work180"}