{"url":"https://www.work180.com.au/blog/2018/08/how-to-find-a-mentor-and-why-you-should-start-today","title":"How to find a mentor and why you should start today","author":"Gemma Lloyd","body":"\n\t\t\t\t\t<p>Earlier last month I had the pleasure of speaking at the <a href=\"https://www.work180.com.au/clients/ashurst\">Ashurst</a>&#xA0;Sydney Women&apos;s Internal Mentoring event on &quot;The Importance of Mentoring for Career Success&quot;.&#xA0; Mentoring has helped me significantly throughout my career both as an employee, as well as over the last three and a half years as an entrepreneur.</p>\n\n<p><span style=\"font-size: 16px;\">Mentoring is something I believe anyone can benefit from, whether it is being mentored or mentoring someone else. Starting out is often the hardest part but once you find a mentor, the hard work is worth it. Reflecting on the event and the discussions I had during the night, I thought I would summarise some of the key points&#xA0;to help those of you who are also interested in mentorships but weren&#x2019;t able to attend the event.&#xA0;</span>&#x200B;</p>\n\n<div><iframe allow=\"autoplay; encrypted-media\" allowfullscreen frameborder=\"0\" height=\"480\" src=\"https://www.youtube.com/embed/dHu6lTFtGqs\" width=\"100%\"></iframe></div>\n\n<p>&#xA0;</p>\n\n<p>Some of the key points covered:&#xA0;</p>\n\n<ul>\n\t<li>Initially, go through a goal-setting exercise- where would you like to get to and what skills gap do you have?</li>\n\t<li>Be specific in finding someone who can help with your goals or skills gaps</li>\n\t<li>Find a mentor who is compatible but not a clone (diversity is key!) You want a different perspective.</li>\n\t<li>Don&#x2019;t reach out to strangers (you can get onto a potential mentor&apos;s radar by networking or asking a mutual connection for an introduction. Try going out for a coffee first to see if you &quot;click&quot;)</li>\n\t<li>Be specific, tell them why you are asking them to be your mentor</li>\n\t<li>Make it clear you&#x2019;re looking for advice and guidance (not a tutor)</li>\n\t<li>A good mentor/mentee relationship will consist of being able to share reciprocal, honest and respectful feedback</li>\n</ul>\n\n<p>At&#xA0;WORK180, one of the 20 question criteria we pre-screen employers on is whether they offer mentoring programs to their employees.&#xA0; If you want to&#xA0;view which employers offer mentoring programs (plus other initiatives such as flexible working, their stance on pay equity and paid parental leave), then <a href=\"https://www.work180.com.au/clients/\">view the Best Employers page.</a></p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/08"}