{"url":"https://www.work180.com.au/blog/2017/12/how-aurecon-raised-the-bar-on-flexible-working","title":"How Aurecon Raised the Bar on Flexible Working ","author":"WORK180","body":"\n\t\t\t\t\t<p><a data-cke-saved-href=\"https://www.engineersaustralia.org.au/News/aurecon-leading-workplace-flexibility\" href=\"https://www.engineersaustralia.org.au/News/aurecon-leading-workplace-flexibility\">&#x2018;Yes Flex&#x2019;</a> was launched at Aurecon on 1 July 2016 and today, it is no longer something employees opt into because flexible working is now embedded in the engineering firm&#x2019;s culture; it&#x2019;s just how things are done these days.</p><p>There are many reasons to celebrate a workplace investing in ensuring their employees can manage their work and life responsibilities. With &#x2018;Yes Flex&#x2019;, managers no longer feel the need to ask permission to create initiatives that support flexible working and an inclusive workplace.</p><p>For example, Aurecon&#x2019;s Brisbane office recently opened a Kid Zone.&#xA0;</p><p>This space is designed for the days when day care arrangements fall through, but there is an urgent meeting in the office. Employees are now able to still drop into the office and bring their child along. There&#x2019;s also a Parent Space- available to new parents who may have a meeting with HR or their line manager to <a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/08/aurecon-launches-australias-first-shared-care-parental-leave-scheme-among-the-large-engineering-firms\" href=\"https://www.dccjobs.com/blog/2017/08/aurecon-launches-australias-first-shared-care-parental-leave-scheme-among-the-large-engineering-firms\">stay in touch while on parental leave</a> in a safe and supportive environment.</p><p>Giam Swiegers, Aurecon&#x2019;s Global CEO and William Cox, Managing Director Australia and New Zealand are both Male Champions of Change, and walk their talk on flexible work, by being open about how they use flexible work to allow them to balance their work and life responsibilities.</p><blockquote><p><em>Cultural change throughout any organisation is a journey, not a destination. </em></p></blockquote><p>Aurecon recently began rolling out Inclusive Leadership training for line managers which includes &#xA0;&#x2018;diversity walks&#x2019; - role playing different personas to walk in another person&#x2019;s shoes around the impact that access to flexible work has on a person and their mental health. The feedback from the line manager pilot groups has been incredibly positive.&#xA0; &#x201C;The activity got me thinking about the lived experience of people in my own team&#x201D;.</p><p>Inclusion Manager, Abbie Wright has invested heavily in coaching and supporting senior staff to become flexible work role models. This has allowed the &#x2018;Yes Flex&#x2019; culture to permeate throughout the organisation. &#xA0;Aurecon&#x2019;s leadership advancement programme for high potential women &#x2013; Ascend - was a catalyst for introducing Yes Flex.&#xA0; A year after commencement of Yes Flex and women no longer see flexible working as a barrier to career advancement within Aurecon.</p><p>There are three key wins for Aurecon from their investment in their people and &#x2018;Yes Flex&#x2019;:</p><ul><li>Increased staff retention especially for their high potential women;</li><li>Less time required by the HR team to answer questions about flexible working;</li><li>Employees who feel confident in sharing the benefits of their own flexible working arrangement in action on social media.</li></ul><p>Congratulations Aurecon on continuing to create a great workplace for your team!</p><p><strong>About Aurecon</strong><br>Aurecon is a DCC Endorsed Employer for Women and have also received the Flex Able Certication.&#xA0;&#xA0;</p><p><strong>About the&#xA0;Flex Able&#xA0;Certification</strong></p><p><a data-cke-saved-href=\"http://www.dccjobs.com/advertisers/flex-able-certification\" href=\"http://www.dccjobs.com/advertisers/flex-able-certification\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float:right;\"></a></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? DCC&#x2019;s&#xA0;Flex Able&#xA0;Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><p>Learn more about the&#xA0; Flex Able&#xA0;Certification&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">here</a>.</p><h4><strong>DCC&#xA0;Flex Able&#xA0;Certified Employers include:</strong></h4><p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/42e4490a-87ad-40a1-95c4-9233a10a88d6.png\">&#x200B;&#x200B;</p><h4><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2017/12","associated_companies":["work180"]}