{"url":"https://www.work180.com.au/blog/2016/02/how-do-you-create-a-diversity-advocate","title":"How do you create a diversity advocate?","author":"WORK180","body":"\n\t\t\t\t\t<p>Written by Andrea Smith.</p>\n\n<p>&#xA0;</p>\n\n<p>As a diversity practitioner, one question that&#x2019;s long captivated my interest is this: how do you create a diversity advocate?</p>\n\n<p>I&#x2019;m not talking about those people who naturally find their way to advocacy, too often as a result of a firsthand experience as part of the out-group. I&#x2019;m talking about how you win the hearts and minds of people who don&#x2019;t see the value of diversity and inclusion.</p>\n\n<p>We&#x2019;ve all worked with them at some point; leaders who think D&amp;I is a social agenda, a &#x2018;nice to have&#x2019; or worst of all - a waste of time and resources.</p>\n\n<p>So how do you change their view?</p>\n\n<p>Certainly, the business case for diversity and inclusion should factor into the conversation at some point. Conclusive organisational data goes a way to winning minds... but rarely hearts. Compelling your audience to not only believe, but actively lead, takes something extra.</p>\n\n<p>When it comes to success stories, what better example to draw upon than our newly appointed Australian of the Year, Lieutenant General David Morrison. With more than thirty years of service in arguably one of the most &#x2018;blokey&#x2019; organisational cultures in Australia, when Morrison took the helm as Chief of Army, gender advocacy was not high on the ADF agenda. After the 2011 &#x2018;Skype scandal&#x2019; made headlines for all the wrong reasons, then Sex Discrimination Commissioner, Elizabeth Broderick, was asked to investigate.</p>\n\n<p>By his own admission, Morrison rolled his eyes when he learned of &#x2018;another bloody review&apos;. Broderick described the initial reception from the ADF as &#x2018;defensive&#x2019;, &#x2018;passive aggressive&#x2019; and after her first meeting with Morrison concluded that she &apos;needed to find a lever of change that would have much more impact&apos;.</p>\n\n<p>And that she did. In a demonstration of what made her such an effective Sex Discrimination Commissioner, Broderick found three courageous women who were willing to share their stories of sexual harassment and assault in the ADF. She described them as &#x2018;women who loved the army but whose service had come at an unacceptable personal cost&#x2019;.</p>\n\n<p>Broderick contacted Morrison and asked him to make time to come and hear the women&#x2019;s stories - not as Chief as Army, but as David Morrison, human being.</p>\n\n<p>In plain clothes they met at the Human Rights Commission in Sydney and for six hours, David Morrison the person, listened.</p>\n\n<p>I had the privilege of hearing General Morrison speak at the AHRI Diversity and Inclusion Conference several years back. With Liz Broderick on stage alongside him, he recounted the story of this day. He said that he&#x2019;d been in the Army for more than 30 years, he&#x2019;d been to war, seen terrible, gut wrenching things in service. But nothing was as haunting as hearing the stories of the three courageous women on that day. In the Australian Story special, &#x2018;Boots and All&#x2019;, he described hearing &#x2018;stores that not just tore at my heart, but tore at the ideas that I had about an institution that reported to describe itself as one that gave everyone a fair go. They hadn&#x2019;t been given anything like a fair go.&#x2019; He left the meeting upset, but &#x2018;absolutely convinced that I needed to be even firmer in my approach to deal with this&#x2019;.</p>\n\n<p>By all accounts, it was a life changing moment.</p>\n\n<p>Clearly Morrison has long been a decisive, driven and compelling leader. But it was the courage of three women willing to share their stories, and Liz Broderick&#x2019;s understanding of the impact they&#x2019;d have, which created the impetus that would eventually make David Morrison into the incredible diversity advocate he is today.</p>\n\n<p>Now I can&#x2019;t name a HR professional who&#x2019;d wish a public sex scandal on their organisation, nor the discovery of a mass of marginalised employees.&#xA0;&#xA0;</p>\n\n<p>Yet unlike even the most artfully-crafted business case, or the most compelling data, there is something about sitting face to face with someone and listening to their experience which will always be hard to ignore.<br>\n&#xA0;<br>\nWhen it comes to winning hearts and minds, we need to connect leaders with the untold stories of our organisations&#x2026; and ask them to listen.</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/02","associated_company":"work180"}