{"url":"https://www.work180.com.au/blog/2015/05/how-i-get-it-all-done-passion-and-productivity","title":"How I get it all done - passion and productivity","author":"WORK180","body":"\n\t\t\t\t\t<h4>&#xA0;</h4>\n\n<p>I&#x2019;ve been asked a lot lately how I manage to get so much done in a day. For those of you that don&#x2019;t know me, I have taken on a lot. Not including keeping up with family and social activities, I&#x2019;m currently involved with the following:</p>\n\n<ul>\n\t<li>\n\t<p>Co-founded a company called Diverse City Careers</p>\n\t</li>\n\t<li>\n\t<p>Full time Business Development Manager for an IT Professional Services company</p>\n\t</li>\n\t<li>\n\t<p>Volunteer my time across two not-for-profit boards</p>\n\t</li>\n</ul>\n\n<p>Taking on all of this wasn&#x2019;t easy at first, but I&#x2019;ve learnt an incredible amount about being efficient to ensure that none of these things slip. Below I&#x2019;ve shared some of the key things that I&#x2019;ve learnt and hope they can help you:</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. The right apps</strong></p>\n\n<p>I can&#x2019;t promote these apps enough!</p>\n\n<p><a href=\"http://www.slack.com/\" target=\"_blank\">Slack:</a> Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go. Before I started using Slack, my life was a constant text messaging, emailing, and phone calling battle. When my business partner and I set up Slack, we were sceptical, but it didn&#x2019;t take long before we experienced huge time saving benefits and better communication.</p>\n\n<p><a href=\"http://www.trello.com/\" target=\"_blank\">Trello:</a> There is no way I could keep track of my action items and their progress without Trello.</p>\n\n<p><a href=\"http://www.umano.me/\" target=\"_blank\">Umano:</a> I am big into personal and professional development, as well as keeping up to date with business and tech news. Umano allows you to listen to trending news, articles and blogs. It&#x2019;s perfect for when I&#x2019;m getting ready for work or driving. It saves me the time trawling through different sites and reading when I can.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Healthy body, healthy mind</strong></p>\n\n<p>Taking on so much can be stressful and it&#x2019;s important for me to do various activities so that I can think clearly. I find the best thing for to do is wake up at 4.30am and go to the gym for at least 30minutes of cardio exercise. This clears my mind and sets me up, energised for the day ahead. It&#x2019;s great thinking time and allows me to mentally prepare for what I need to accomplish at work.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Focus on outcomes instead of to-do lists</strong></p>\n\n<p>Lists! At the start of each day, I write a list of everything that I want to achieve and make sure it&#x2019;s prioritised. Instead of writing down the standard &#x2018;to-do&#x2019; list, I write down an &#x2018;outcomes&#x2019; list. It&#x2019;s not about identifying the specific tasks that have to be done, it&#x2019;s about focusing on the results of those tasks.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Do what you love and love what you do</strong></p>\n\n<p>There is no way all of this could be done if I didn&#x2019;t enjoy all of it. Find work that you&#x2019;re passionate about and it won&#x2019;t even feel like work. As Simon Sinek has said:</p>\n\n<p><em>&#x201C;Working hard on something hard for something we don&#x2019;t care about is called stress. Working for something we love is called passion&#x201D;</em></p>\n\n<h4>&#xA0;</h4>\n\n<h4>&#xA0;</h4>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","Celebrating Women"],"upload_date":"2015/05","associated_company":"work180"}