{"url":"https://www.work180.com.au/blog/2018/01/how-powerful-men-can-create-gender-equality","title":"How Powerful Men can Create Gender Equality","author":"WORK180","body":"\n\t\t\t\t\t<p>I am a feminist and gender equality activist which is no surprise to anyone who knows me. This feminist and gender equality activist is hunting&#x2026;..for a few (million) good men.</p>\n\n<p>It may surprise some people that I am not hunting for male villains, an expression I am stealing with pride from the indomitable&#xA0;<a href=\"https://www.humanrights.gov.au/about/commissioners/sex-discrimination-commissioner-kate-jenkins\" rel=\"noopener\" target=\"_blank\">Kate Jenkins, the Australian Sex Discrimination Commissioner</a>. I was fortunate to MC an event for Carlton Football Club recently where Kate made it clear that our shared quest for gender equality is not about hunting villains, it&#x2019;s about finding, educating and encouraging good men to do more to create a society where women are equal, valued and included.</p>\n\n<p>One of the most concerning aspects of the work I do is that I&#x2019;m more often than not &#x201C;<em>preaching to the choir</em>&#x201D; because my audiences are 90%+ women. &#xA0;And thats not because men can&#x2019;t handle the truth, they just don&#x2019;t show up! So, when I am in a gender balanced, or predominantly male environment, I&#x2019;m going to enthusiastically embrace the opportunity to include the power base in the conversation to move the issue of gender inequality conversation to action.</p>\n\n<h3>Men Hold All the Power</h3>\n\n<p>Like it or not, with&#xA0;<a href=\"https://www.wgea.gov.au/sites/default/files/2016-17-gender-equality-scorecard.pdf\" rel=\"noopener\" target=\"_blank\">men representing</a>&#xA0;83.5% &#xA0;of CEO&#x2019;s, 70.3% of Key Management Personnel and 69.6% of Executives/General Managers &#xA0;in Australian business, there is no evidence to the contrary that men hold the power. Therefore, men are responsible to initiate transformation and are responsible to make the change,&#xA0;to be the change, that is needed to advance women and create a more prosperous society. For those of you who remain unconvinced that accelerating towards gender equality is a good thing, then imagine global GDP&#xA0;<a href=\"https://www.mckinsey.com/global-themes/employment-and-growth/how-advancing-womens-equality-can-add-12-trillion-to-global-growth\" rel=\"noopener\" target=\"_blank\">increasing</a>&#xA0;by $12 Trillion annually!</p>\n\n<p>I&#x2019;m very weary of these statistics though and am even wearier at having to demonstrate &#x201C;the business case&#x201D; ad-nauseum. I&#x2019;m also becoming highly intolerant of people who hold power agonising over or admiring the plethora of numbers, reasons and barriers for women not advancing into leadership positions. Knowing about this wicked problem and not acting is no longer acceptable and if you are a business leader, then the buck stops with you.</p>\n\n<h3>Make It Safe, For Where the Buck Stops</h3>\n\n<p>The buck&#xA0;<em>does</em>&#xA0;stop with business leaders for all measures of organisational success. However, the journey towards gender equality begins with realising how far we have to go. I&#x2019;ve written and spoken many times about my philosophy and mission to be an inclusive feminist&#x2026;..but what does that actually mean?</p>\n\n<ol>\n\t<li>Accept, without judgement, that men do not have my lived experience as a female in business and will benefit from the opportunity to understand more without feeling accused.</li>\n\t<li>Create a &#x201C;safe&#x201D; space for men to ask questions about what action they can take. Extend my hand and share my knowledge to those in power to accelerate action.</li>\n\t<li>Recognise awesome, inclusive behaviour by men. You catch more bees with honey than vinegar!</li>\n\t<li>Have the courage of my convictions to respectfully but assertively educate the errant few&#xA0;<a href=\"http://www.adelaidenow.com.au/lifestyle/parenting/elizabeth-broderick-says-genderequality-message-has-to-start-young/news-story/d339b91a3e0ade37c9868dff6bf962ca\" rel=\"noopener\" target=\"_blank\">men who still consider women second class citizens</a>. Like any outspoken feminist who is very active in social media, I attract my fair share of trolls&#x2026;so this is a value I have to keep myself accountable on!</li>\n\t<li>Keep advocating that gender equality is good for all humans! I strongly believe men are trapped in a one-dimensional paradigm of masculinity which is&#xA0;<a href=\"http://www.smh.com.au/comment/suicide-rate-we-need-to-stop-the-scourge-killing-our-men-20160309-gnf7un.html\" rel=\"noopener\" target=\"_blank\">killing them</a>. Just ask&#xA0;<a href=\"http://www.abc.net.au/tv/programs/man-up/\" rel=\"noopener\" target=\"_blank\">Gus Worland and the Man Up team.</a></li>\n</ol>\n\n<h3>Time to Get Tactical</h3>\n\n<p>McKinsey gave the issue of Tactics V Strategy airtime in their latest&#xA0;<a href=\"https://www.mckinsey.com/global-themes/leadership/time-for-a-new-gender-equality-playbook\" rel=\"noopener\" target=\"_blank\">update</a>&#xA0;on gender inequality. Like me, McKinsey is challenging business leaders to change the playbook.</p>\n\n<p>What does that mean? Leaders you must connect your organisations strategy to tactics and&#xA0;<a href=\"https://www.urbandictionary.com/define.php?term=GSD\" rel=\"noopener\" target=\"_blank\">#GSD</a>&#xA0;by demonstrating and&#xA0;<u>training</u>&#xA0;leaders at all levels, particularly male front line leaders. Train then on how to understand translate diversity &amp; inclusion policy into tactical processes that can be practically applied in the workplace. I observe this issue time after time and hear from women who are treated poorly by line managers who are not skilled enough. Your organisation may have a policy, perhaps even a process to deal with most of the barriers preventing women from advancing. However, your frontline managers may have little to no idea how to execute the process. &#xA0;I see frontline managers who do not know how to:</p>\n\n<p>1. Consistently recruit, engage and&#xA0;<u>retain</u>&#xA0;gender balanced teams;</p>\n\n<p>2. Consistently demonstrate accountability to inclusive leadership including challenging sexist behaviour towards women;</p>\n\n<p>3. Be open to discussing &amp; effectively managing flexible working arrangements with women and men;</p>\n\n<p>4. Manage pre-parental leave, during parental leave and return from parental leave conversations and arrangements;</p>\n\n<p>5. Understand how to sensitively raise awareness of and access domestic violence leave arrangements.</p>\n\n<p>As a leader, you can pulse check compliance to ANY of these policies in your workplace. My suggestion is that you use the&#xA0;5 x 5 model&#xA0;to do so. It&#x2019;s simple, book 5 coffee catch ups with 5 women from all levels in your organisation and ask them the 5 questions above. The answers may shock you, but hey, you&#x2019;re a leader so you can use your power and bias for action to do something about it.</p>\n\n<h3>Calling a Few (<em>Million</em>) Good Men.</h3>\n\n<p>I&#x2019;m calling on you few (<em>million</em>) good men who hold power, to use YOUR goodness, use YOUR power to move Australia&#x2019;s pace of change on gender inequality from glacial to accelerating. I&#x2019;m advising YOU to demonstrate you CAN hand the truth and that you should not forget strategy but that you should also get tactical, now.</p>\n\n<p><em style=\"font-size: 16px;\">This article published </em><em>by<a href=\"https://femeconomy.com/powerful-men-create-equality/\">&#xA0;Femeconomy.&#xA0;</a></em></p>\n\n<h4><strong>About Femeconomy</strong></h4>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ce943d5d-7fb6-447d-9d6c-c5ebf14c71e1.jpeg\"></p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2018/01","associated_companies":["work180"]}