{"url":"https://www.work180.com.au/blog/2017/12/how-to-juggle-sick-kids-and-your-job","title":"How to Juggle Sick Kids and Your Job","author":"WORK180","body":"\n\t\t\t\t\t<p>It&#x2019;s Monday morning and you&#x2019;re ready for a big week. Favourite dress is on, dinners are sorted, you even have a date night planned for Thursday. You settle into your Monday routine with a meeting, coffee break and emails. Then the phone rings, and of course it&#x2019;s daycare.</p><blockquote><p>&#x201C;Your child is vomiting and we now have had 3 reported cases of gastro,&#x201D; you hear. &#x201C;You will need to come immediately and unfortunately your son cannot return for at least five days.&#x201D;</p></blockquote><p>And just like that, your week is turned upside down. You now find yourself madly trying to juggle work, get extra help and care for your child. Not to mention you are still paying for daycare that you can&#x2019;t even use.</p><p>We have all been there and it&#x2019;s a constant battle, especially during the first year when children are starting daycare and picking up every bug going around.&#xA0;The juggle between balancing your sick kids and managing the perception in the office is real. While you&#x2019;re wondering if you have Hydralite and what your child&#x2019;s temperature is, you&#x2019;ll also be wondering what your colleagues and manager will say now you&#x2019;re off all week, and how your team will feel picking up your workload.</p><p>Just know that you are not alone. Millions of mamas around the world each day are juggling sick kids and a career.</p><p>In fact, we could replay hundreds of stories that have been shared with us. At the heart of them all is a feeling of stress and anxiety towards our job and career, especially when you&#x2019;ve just had 12 months out of the office, only to return and be off with a sick child &#x2026; again.</p><p>Kids fall sick and we can guarantee that daycare will throw plenty of sick days your way. Here&#x2019;s a few strategies to deal with it:</p><p>1. When you return to work, try and have a conversation with your manager about how you might manage sick days. Better to be upfront and have a rough plan as to how you will approach the inevitable sick days.</p><p>2. Always discuss your schedule with your partner the night before. Understand who has capacity should you need to pick up from daycare. Do this every night!</p><p>3. Think about splitting the day in half with your partner. Maybe you could you do the morning shift and they do the afternoon shift at home.</p><p>4. Continue with meetings and let your colleagues know you will dial in. Technology means this is perfectly acceptable these days.</p><p>5. Manage expectations with your team. Be clear with them as to what you can and can&#x2019;t do. Let them know when you will be available and when you won&#x2019;t. Be clear where you need help and how you will be managing your workload.</p><p>6. Always have a list of back up carers. Family, nannies and babysitters. Yes, it&#x2019;s a big cost but sometimes it&#x2019;s worth it if your day is full of important meetings that you need to attend.</p><p>Remember that first and foremost you are a parent and need to be there for your kids. It&#x2019;s not your fault they have fallen sick again. Most of the stress will be in your head and wondering what people are thinking and saying.</p><p>Stop that mama guilt and hold tight to the knowledge that the first year is the hardest. It will be over before you know it, and you&#x2019;ll then be able to help other mamas embarking on it.</p><p><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About the Author&#xA0;</strong></h4><p>Kate Pollard and Jodi Geddes are Co-founders of&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\" href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\">Circle In.</a>&#xA0;Circle In&#xA0;is a DCC partner and a free online career resource for working mothers. Circle In provides advice, real stories, podcasts, videos and resources to women across the entire parental leave journey - from thinking of having a baby to returning to work.&#xA0;</p><h4 style=\"font-family: Lato, sans-serif;\"><strong><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2704841f-951b-4e4d-a25e-32b0ef991521.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2704841f-951b-4e4d-a25e-32b0ef991521.jpeg\"></strong></h4><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/12","associated_company":"work180"}