{"url":"https://www.work180.com.au/blog/2017/12/how-to-share-the-load-and-outsource-without-guilt","title":"How to Share the Load and Outsource Without Guilt","author":"WORK180","body":"\n\t\t\t\t\t<p>Okay, so the mama guilt thing is a real thing. We all experience it from time to time and sometimes, every single day. When you have kids there are so many more shades of grey and so many more places and ways to feel guilty.&#xA0;Whether it&#x2019;s leaving your baby in the care of someone else as you trot off for your first day back at work or the uncontrollable laundry pile that seems to breed overnight, we have this knack as women of punishing ourselves with guilt.</p><p>Having 12 months away from work to look after my first child, I ended up taking on more of the domestic duties in our household by default. It just happens subconsciously when your new workplace is your home. Between feeding my baby and their nap times I seemed to be endlessly putting on another load of washing.</p><p>Before returning to work, it&#x2019;s especially important to set yourself up in a way that is sustainable and also allows you to enjoy your work and family life. Unfortunately, even in this day and age, women are still typically assuming the majority of domestic duties at home which is not only holding their careers back but also causing a heightened level of stress as they try to do everything. The 2016 census showed us that the typical Australian woman spends between five and 14 hours a week doing unpaid domestic housework, while for men it&#x2019;s typically less than five hours a week. I know, it&#x2019;s crazy right?!</p><p>There is no way of completely avoiding the dynamic juggle that comes with working and family life, but you can make it easier on yourself by planning ahead, sharing the load and outsourcing the less important things in your life (which are probably the things you also like doing the least.)</p><h4><strong>So here are my top tips:</strong></h4><p>1. The important things are important: start with an honest assessment of what the important things in your life are. Also, what are the things you enjoy doing the most? For me, I wanted to be around to spend regular and quality time with my kids. While daycare and a nanny were part of our regular weekly routine, this meant that I wanted to have a regular day at home with my kids and not be too tired and stressed out about work. So I negotiated working four days a week where I had the flexibility to leave at 4:30PM three days a week to pick them up from daycare and also work one day from home. Each week I looked forward to my one day at home with my kids where we would have some fun adventures together.</p><p>2. Outsource the less important and less enjoyable things: for the things that are not as important or you don&#x2019;t enjoy doing, look for ways to outsource them. I figured that working four days a week, I then didn&#x2019;t want to spend my weekends and precious time with my family cleaning the house. I understand that budget restrictions may prevent this being an option for a lot of people, but you can always reduce the frequency of a cleaner. For example, even a good monthly house clean will mean that you then only have a &#x2018;maintenance&#x2019; clean during the week. Heard of&#xA0;<a data-cke-saved-href=\"https://www.airtasker.com/\" href=\"https://www.airtasker.com/\" rel=\"noopener\" target=\"_blank\">Airtasker</a>? It makes outsourcing easy. According to Alexandra Aguirre, Brand Marketing Manager at Airtasker, young families are the most consistent outsourcers, with 23% regularly outsourcing. &#x201C;Cleaning is one of the most popular tasks on Airtasker. Our research also tells us that it&#x2019;s also one of the most disliked tasks&#x201D;.&#xA0;Other things to consider outsourcing are ironing, folding or anything else that you don&#x2019;t particularly enjoy doing. Online food shopping is also a good option for time poor parents, especially if you are organised and have your regular shop set up in advance.</p><p>3. Share the load: Parenting is the responsibility of both parents. If both parents are working, then ideally both should be contributing and sharing the domestic duties. Before returning to work, it&#x2019;s a good idea to have an open discussion with your partner about how you are going to divide up these responsibilities. If your child is in care, how can you share drop offs and pick-ups? Washing, folding, cleaning, food shopping, preparation, birthday present shopping &#x2026; the list goes on. Please don&#x2019;t try to do it all as a mama. And on top of working. It&#x2019;s just too much!</p><p>Free up more of your time by planning ahead: there are times when you might need to work back late. Or you want to fit in some regular exercise or time for yourself to pursue your passion project. A clever way to do this is organise a nanny to pick-up your kids from daycare a few nights a week. Or you could share the caring responsibilities with a friend. For example, one day a week they pick up your kids after daycare / preschool / school and then the next week you return the favour.<br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About the Author&#xA0;</strong></h4><p>Kate Pollard and Jodi Geddes are Co-founders of&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\" href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\">Circle In.</a>&#xA0;Circle In&#xA0;is a DCC partner and a free online career resource for working mothers. Circle In provides advice, real stories, podcasts, videos and resources to women across the entire parental leave journey - from thinking of having a baby to returning to work.&#xA0;</p><h4 style=\"font-family: Lato, sans-serif;\"><strong><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2704841f-951b-4e4d-a25e-32b0ef991521.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2704841f-951b-4e4d-a25e-32b0ef991521.jpeg\"></strong></h4><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/12","associated_company":"work180"}