{"url":"https://www.work180.com.au/blog/2018/05/4-tips-to-conquer-delegating-chores-to-your-kids","title":"How to Conquer Delegating Chores to Your Children","author":"WORK180","body":"\n\t\t\t\t\t<p>When we first developed the <a data-cke-saved-href=\"https://www.work180.com.au/blog/2018/05/a-mothers-day-gift-that-will-be-appreciated-all-year\" href=\"https://www.work180.com.au/blog/2018/05/a-mothers-day-gift-that-will-be-appreciated-all-year\">Family Checklist campaign</a>, I thought about what my checklist would look like. It really put things into perspective around how much we take on as single parents. I have just the one child and am in awe of women and men who balance several children, careers and other responsibilities.</p><p>When I filled out my checklist, I was happy to note that lots of the items are my son&#x2019;s responsibility. However, it&#x2019;s been a long journey getting to this stage and no smooth sailing by any means. I hope my learnings can help other parents get their children involved in chores, regardless of family size.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d570a73a-db2f-4ef4-9d57-4473f7cbf7a1.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d570a73a-db2f-4ef4-9d57-4473f7cbf7a1.png\" style=\"margin: 10px;\"></p><p style=\"text-align: center;\"><em><small>Download your own checklist and read how to use it <a data-cke-saved-href=\"https://www.work180.com.au/blog/2018/05/a-mothers-day-gift-that-will-be-appreciated-all-year\" href=\"https://www.work180.com.au/blog/2018/05/a-mothers-day-gift-that-will-be-appreciated-all-year\">here</a></small></em></p><p style=\"text-align: center;\"><br></p><h4><strong>You may be hindering, not helping</strong></h4><p>I was one of those parents who couldn&#x2019;t do the &#x2018;controlled crying&#x2019; routine, picked the baby up and fussed over him each time he squawked, fed him on demand and bent over backwards at every opportunity. With development delays, my son did not walk independently until he was four years old, which gave me some serious upper body strength from carrying him around, along with a massive nappies bill. It was also due to my son&#x2019;s disability that I felt like it was my duty to &#x2018;help&#x2019; as much as possible.</p><p>When I became a single parent, I found myself over compensating even more; from going overboard with Christmas presents, to pandering to his every wish and demand.</p><p>Encouraging children to contribute to the household is very important, however it&#x2019;s very difficult as a parent to enforce this. Quite frankly, it was a lot easier to do things myself- with no family support, I was working full time, had to do lots of therapy for my son and lacked patience at the best of times.</p><p>One day, my best friend pointed out that I was doing him a disservice and advice from his therapists was the same- not only would doing tasks around the house build independence, it would improve his fine motor skills</p><h4><strong>Pain is love</strong></h4><p>It will be painful, but you need to persevere. I still recall the first time I announced vacuuming was to be done weekly. My son was seven at the time, and he promptly locked himself in his room and cried. For over an hour. I came so close to walking into that room to comfort him and take that chore back. I am so glad I didn&#x2019;t! Fast forward a few years and he was doing the vacuuming without question or complaint. We even got to the stage where he would plan his day around the chores.</p><h4><strong>You may need to adjust expectations</strong></h4><p>While he was quite proficient at vacuuming from day one (after the crocodile tears), I was hesitant at first to add more chores, thinking they were too hard, or that the results would be below my military grade standards of cleanliness. It was difficult to let go to of the dusting to say the least. However, I was pleasantly surprised when after a few sessions, the dusting was done to my satisfaction. You&#x2019;d think I would have learned from that, however it took me several years to relinquish the mopping duties. I may have also taken them back at one stage (purely for therapeutic reasons.)</p><h4><strong>If you fail at first, try, try again</strong></h4><p>Dishes were the last frontier, where in the beginning, I suspected foul play. To this day I am not 100% sure if the sub-standard performance was deliberate to avoid that particular chore, or a rookie error. I was appalled at the &#x2018;clean&#x2019; dishes, and harsh words were exchanged. I tackled that beast again in a few weeks, where I patiently asked for dishes to be re-done as required. Soon after, the clean rate improved dramatically.</p><p>Of course, there was lots of hiccups and lapses, but overall, I have to say I am very pleased I persevered all those years ago.</p><p>I would strongly encourage everyone to complete the checklist, and if the children are old enough, see which chores they can take off your hands- trust me, it will pay off and one day, you may even get a thank you!&#xA0;</p><p><br></p><blockquote><p><big><span style=\"font-size: 19.2px;\">Download your checklist and read how to use it <a data-cke-saved-href=\"https://www.work180.com.au/blog/2018/05/a-mothers-day-gift-that-will-be-appreciated-all-year\" href=\"https://www.work180.com.au/blog/2018/05/a-mothers-day-gift-that-will-be-appreciated-all-year\">here</a></span></big></p></blockquote><hr><h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["gender equality","Download your own checklist and read how to use it here"],"upload_date":"2018/05","associated_companies":["work180"]}