{"url":"https://www.work180.com.au/blog/2018/06/how-to-use-flexible-working-as-a-competitive-advantage","title":"How to use Flexible Working as a Competitive Advantage","author":"Christina Smerdon, Chief Flex Enabler at WORK180","body":"\n\t\t\t\t\t<p>Building a business from the ground up gives the founders of a company the perfect opportunity to create a business where their own beliefs are front and centre.</p>\n\n<p>&#xA0;&#x201C;You don&#x2019;t change the status quo by tinkering at the edges. You take the model and turn it on its head&#x201D; says Simon Tyrell, Chief Product Officer at LiveTiles.</p>\n\n<p>For LiveTiles, flexible working was the only way they were ever going to set up and run their business.</p>\n\n<p>The founders recognised early on that to make great products, they would need a great team. And the people who make up their great team were going to be found in random places all over the world. These great people were unlikely to be living within the commute of one or two locations around the world.</p>\n\n<p>Whilst LiveTiles have office hubs in Hobart, New York and Ireland, they also have a globally dispersed team. Some of these people always worked 100% remotely. Others started in an office, and later moved to live elsewhere and work remotely.</p>\n\n<p>Ivy (Innovation &amp; Experience Analyst) for example, started out working in the New York office, then wanted to try living in Paris for a year. Of course the answer was YES, because it aligns with the LiveTiles values! Now, Evie works from her apartment in Paris in her own time zone.</p>\n\n<p>Unlike a traditional set of values, LiveTiles employees live by three simple values that guide every decision they make and it codifies their unique culture;</p>\n\n<ul>\n\t<li>First, we are&#xA0;<strong>decent human beings</strong>. We care about people and our world, and treat our colleagues, customers, and partners accordingly.</li>\n\t<li>Second, we&#xA0;<strong>get sh!t done</strong>. Getting work out the door is more important than endless process discussions.</li>\n\t<li>Finally, we&#xA0;<strong>create unforgettable experiences</strong>&#x2013;keeping our global family inspired and motivated, and on the platform we&#x2019;ve created.</li>\n</ul>\n\n<p>For people deeply indoctrinated in the Monday to Friday 9-5 paradigm, the idea that you are invited to do your work anywhere, anytime, anyhow could be confronting, and many may think that it would open the door to people problems. You have no doubt heard all the excuse before: how will I know what they are working on; how will I monitor my team; how will people feel included?</p>\n\n<p>LiveTiles believes that poor performance is a people and expectations management issue, not a flexible working issue. And I agree wholeheartedly.&#xA0;</p>\n\n<p>Creating simple solutions is part of the LiveTiles DNA. These are a few things that have been done to future-proof this way of working:</p>\n\n<ul>\n\t<li>Long recruitment cycles to ensure that new recruits will contribute positively to the culture, and also come with high quality skills;</li>\n\t<li>Regular, virtual team meetings and contact with team members irrespective of your physical location;</li>\n\t<li>Travel anywhere in the world to connect with your colleagues. To support this, LiveTiles has a dedicated apartment in New York available to team members to come and visit head office for a week at a time. It is all paid for by the company knowing that the cost of providing this perk is far less than the cost of recruiting over and again if a team member becomes disgruntled;</li>\n\t<li>An annual, whole of company gathering - this year it was in Hawaii. The difference between meeting someone face to face and getting to know a person in real life is very different to meeting on the other end of a keyboard!</li>\n</ul>\n\n<p>&#x201C;You will never leave a company if you know everyone and know their families. People are a worthwhile investment,&#x201D; Vanessa Ferguson, People and Culture global leader.</p>\n\n<p>Vanessa was employee #1. Once they reached employee #100 Vanessa put her hand up to start creating structures and policies to ensure that the values and culture that was created by the first 100 employees continues for the next 1,000 and beyond.</p>\n\n<p>Congratulations <a href=\"http://www.work180.com.au/advertisers/flex-able-certification\">LiveTiles on becoming </a><a href=\"http://www.work180.com.au/advertisers/flex-able-certification\">Flex Able</a><a href=\"http://www.work180.com.au/advertisers/flex-able-certification\"> Certified.</a></p>\n\n<p>&#xA0;</p>\n\n<hr>\n<p><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255); color: rgb(115, 207, 236); outline: 0px !important;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About the&#xA0;Flex Able&#xA0;Certification</strong></h4>\n\n<p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p>\n\n<p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? WORK180&#x2019;s&#xA0;Flex Able&#xA0;Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p>\n\n<p>Learn more about the&#xA0;Flex Able&#xA0;Certification&#xA0;<a href=\"https://www.work180.com.au/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a>.</p>\n\n<p>Flex Able&#xA0;Certified Employers include:</p>\n\n<p style=\"line-height: 30px;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/245a56b6-d30c-4a5b-b43f-8ebf5a79f335.png\"></p>\n\n<hr>\n<h4><strong>About LiveTiles<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b51b04ef-33d8-4e51-80d0-0ef3d160bb56.png\" style=\"float: right; margin: 10px; width: 200px; height: 133px;\"></strong></h4>\n\n<p>LiveTiles is an Endorsed Employer for Women and Flex Able Certified.&#xA0;&#xA0;LiveTiles offers flexible working conditions,&#xA0;flat organisational structure with the opportunity to be involved in many aspects of the business not just your day job and encourage employees suggest/recommend new ways of doing things and have them seriously considered. Learn more on their <a href=\"https://www.work180.com.au/clients/livetiles\">Best Employer page.&#xA0;</a><br>\n<br>\n<a href=\"https://www.work180.com.au/job-search?client=livetiles\">Browse jobs and join Livetiles here.&#xA0;</a></p>\n\n<hr>\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About&#xA0;the author&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/93df967a-d2b9-481e-9f4c-b87c45078a2e.jpeg\" style=\"float: right; margin: 10px; width: 205px; height: 200px;\"></strong></h3>\n\n<p>Christina Smerdon is the Chief Flex Enabler at WORK180. She certifies employers who wish to qualify for the&#xA0;<a href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">Flex Able</a><a href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">&#xA0;Certification.&#xA0;</a>She has a keen interest in driving the flexible work agenda and believe that it is the way of the future.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3>\n\n<p>WORK180 is&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">jobs board&#xA0;</a><span style=\"font-size: 1.6rem;\">with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;</span><a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">essential tool</a><span style=\"font-size: 1.6rem;\">&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;</span><a href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">one click</a><span style=\"font-size: 1.6rem;\">&#xA0;now.&#xA0;</span></p>\n\n<div>&#xA0;</div>\n\n\t\t\t\t","tags":["Career Development","job seeking tips","flexible working"],"upload_date":"2018/06"}