{"url":"https://www.work180.com.au/blog/2016/04/how-to-train-yourself-to-be-comfortable-with-taking-risks","title":"How to train yourself to be comfortable with taking risks","author":"WORK180","body":"\n\t\t\t\t\t<p><em>Originally posted on <a href=\"http://www.thebusinesswomanmedia.com/how-to-train-yourself-to-be-comfortable-with-taking-risks/\" target=\"_blank\">The Business Woman Media</a></em></p>\n\n<p>&#xA0;</p>\n\n<p>Let&#x2019;s be honest here, starting your own business is a risk, a huge risk. You risk losing money, your reputation and to the extreme, friends and family because the business can (and often does) consume your life.</p>\n\n<p>Due to the success of my own business DCC Jobs, people often ask me for advice on starting their own business. My first question to them is always the same &#x2014; &#x201C;why do you want to start this business?&#x201D; It probably won&#x2019;t surprise many people that the response is usually something along the lines of either &#x201C;I can&#x2019;t bear working for someone else&#x201D; or &#x201C;I want to make a lot of money.&#x201D;</p>\n\n<p>My response: &#x201C;Stop&#x2026; stop now!&#x201D;</p>\n\n<p>Jack Delosa from <a href=\"https://www.the-entourage.edu.au/\" target=\"_blank\">The Entourage</a> recently posted on LinkedIn (please excuse the language):</p>\n\n<blockquote>\n<p><em>&#x201C;With the heightened romanticism around &#x2018;starting your own business&#x2019; there&#x2019;s a lot of loose words flying around about why people shouldn&#x2019;t have a job or how &#x2018;you&#x2019;ll never become wealthy working for someone else&#x2019;. Absolute bullshit. Some of the most brilliant people I&#x2019;ve ever met, and some of my closest friends, aren&#x2019;t &#x201C;founders&#x201D; but are people who became really good at something over many many years and contribute brilliantly to whatever it is they do. There&#x2019;s no one size fits all. When what you do is fuelled by who you are, you will do your life&#x2019;s best work.&#x201D;</em></p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p>Agree Jack, absolutely agree.</p>\n\n<p>Starting a business isn&#x2019;t about making money, or not working for someone else, it&#x2019;s about making a change and following a burning passion inside of you that isn&#x2019;t or can&#x2019;t be fulfilled elsewhere. However, as per Jack&#x2019;s comments, you still can be brilliant and follow your life&#x2019;s best work, working for someone else.</p>\n\n<p>This article isn&#x2019;t about why you should or shouldn&#x2019;t start a business. It&#x2019;s about taking risks and stepping outside of your comfort zone. As I mentioned earlier, starting your own business is a huge risk (I&#x2019;d say one of the biggest you can ever take) and so I&#x2019;ve had to actively train myself to become comfortable with the idea of risk. I&#x2019;ve used various methods to mentally prepare myself for different situations including affirmation and visualisation, but there&#x2019;s one I learnt recently that has had a big impact on me.</p>\n\n<p>Some of you may be familiar with Tim Ferriss, creator and author of the &#x2018;4-hour work week&#x2019;. Tim has a Podcast which I&#x2019;ve been listening to for a while now called The Tim Ferriss Show &#x2014; I highly recommend it. Every so often, Tim has a reader who narrates two thousand-year-old letters from Seneca the Younger (an ancient philosopher &#x2014; some find him controversial &#x2014; but essentially a stoic).</p>\n\n<p>It was one of these episodes that made the impact, called &#x201C;How to Practice Poverty and Reduce Fear&#x201D;. Mindset is everything, and this episode went through a practical blueprint for optimising performance in high-stress situations. What I took out of it, was around adjusting your mindset to get comfortable with risk. It gave me ideas on how to train yourself to be comfortable with absolute worst case scenarios.</p>\n\n<p>For example, if you think about the risk of starting your own business, potentially you could lose all of your money, house and car. So how do we train ourselves to be comfortable with this? A tough thing to do, right? Not if you apply this technique; instead of driving to work or on the weekends, you may spend a fortnight or so getting public transport around. Instead of spending X amount on your weekly food shop, you might challenge yourself to reduce that to a quarter of the usual spend for a month. Instead of using your iPhone or Android, switch to an old Nokia. I promise you, once you do these things, you realise very quickly that if you had to take a step back in life, it wouldn&#x2019;t even be a big deal. Happiness levels remain very much the same as before. One of my favourite sayings at the moment is:</p>\n\n<blockquote>\n<p><em>&#x201C;The things you own end up owing you.&#x201D;</em></p>\n</blockquote>\n\n<p>By practicing such techniques, in everyday life when a potentially stressful situation arises, you think to yourself, what is the worst case scenario here (aside from things that may impact family or health) &#x2026;am I going to lose my home or my income? 99.99% of the time the answer is going to be no. But even if you did, if you had to scale back, would it be so bad?</p>\n\n<p>As I said before, mindset is everything. I&#x2019;m lucky to not be in a position where I may lose everything, but there have been times I&#x2019;ve let stressful or risky situations cloud my mind. Learning such techniques is about allowing ourselves to free our minds to be able to think creatively, strategically and pragmatically. Actively practice being comfortable in stressful or risky situations. No person will ever be as successful as they possibly can be if they remain focussed on the &#x2018;what-if&#x2019;s&#x2019;.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/04","associated_company":"work180"}