{"url":"https://www.work180.com.au/blog/2016/02/how-to-escape-the-comparison-trap","title":"How to escape the Comparison Trap","author":"WORK180","body":"\n\t\t\t\t\t<p>I&#x2019;d like to tell you that I was far too evolved and secure in my self-worth to compare myself against others; that, I&#x2019;d long since stopped engaging in such futile acts of self-sabotage.</p><p>Alas, I cannot.</p><p>It does give me some reassurance that I&#x2019;m not the only half-intelligent person who&#x2019;s fallen into the comparison trap. &#xA0;Comparing ourselves against those around is as human as it is ubiquitous.&#xA0;&#xA0;</p><p>I think it boils down to the fact that, deep down, we&#x2019;re all a bit insecure about our own worth and so we look around us for a frame of reference to assess how well we&#x2019;re doing &#x2013; in work, wealth, love and life.</p><p>Psychologists call it &#x201C;Social Comparison Theory.&#x201D; &#xA0;And while it can be helpful in motivating us to stretch and improve ourselves (E.g. to work harder at the gym or better manage our money), often it leaves us feeling like we&#x2019;re just not measuring up on some parameter.&#xA0;</p><p><em>Not accomplished enough.</em></p><p><em>Not attractive enough.</em></p><p><em>Not disciplined enough.</em></p><p><em>Not passionate enough.</em></p><p><em>Not smart enough.</em></p><p><em>Not wealthy enough.</em></p><p><em>Not worthy enough.</em></p><p>Of course if we only made comparisons that boosted our self-esteem all would be well. But if you&#x2019;re like me, you&#x2019;re more likely to compare your body to your marathon running friend over the latest contestants on the Biggest Loser. And you&#x2019;re more likely to compare your home to your neighbors who has just finished a stunning renovation than to your friend whose just had to move back in with their mother.</p><p>We can all fall victim to our ego&#x2019;s hunger for affirmation. Which is why you have to be super careful not to let your ego give you a bum steer right onto a treadmill that keeps ratcheting up the speed so that no matter how hard you run or desperately you try, it&#x2019;s never enough.&#xA0;<em>Ever</em>.&#xA0;</p><p>The truth is that if you base how you feel about yourself by how you rank against anyone else, you will always &#x2013;&#xA0;<em>always</em>&#xA0;- find someone who is doing better than you on some measure.&#xA0; Only when you decide the time has arrived to accept yourself for where and who you are &#x2013; for what makes you so uniquely and splendidly you &#x2013; will that treadmill ever let your rest.</p><p>So the question is how can you liberate yourself from the comparison trap and redirect your energy from beating up on yourself to bettering your life?&#xA0; &#xA0;Here&#x2019;s a few suggestions (though please don&#x2019;t compare my advice to Brene Browns lest I land back on that treadmill!)</p><h4><strong>Get off your own back</strong></h4><p>You may think you&#x2019;re the only person who ever struggles with feeling like you&#x2019;re enough and are forever falling short of expectations &#x2013; particularly your own.&#xA0; But the truth is that many people are their own worst critic, habitually focusing on what they haven&#x2019;t done well rather than on all that they have.&#xA0;&#xA0;</p><p>Just imagine the difference it would make if you focused on what you&#xA0;<em>did</em>&#xA0;do well? Imagine how much better you could channel your energy if you weren&#x2019;t always pulling yourself down and making yourself wrong.&#xA0; Likewise, don&#x2019;t beat up on yourself when you do catch yourself making comparisons. That only fans the &#x201C;I&#x2019;m not enough&#x201D; flames even higher and amplifies those pesky insecurities. Instead try being kinder to yourself, accepting your own humanity, fallibility and vulnerability. &#xA0;(The added bonus of doing that is it makes you more forgiving of others failings too!)</p><h4><strong>Recognize your biases</strong></h4><p>Each time I read a book from someone who&#x2019;s got a PhD in something, I find myself feeling deficient. If only I could cite such credentials.&#xA0; Likewise, whenever I see a speaker who&#x2019;s belly-laugh funny, I sometimes feel a little lacking in the comedic department. What a ridiculously stupid thing to do right?</p><p>But it points to a bias most of us make. That is that we tend to compare our weaknesses with others strengths; our insides with others outsides; and what we don&#x2019;t have with what other people do.</p><p>So whenever you notice yourself comparing, take a moment to remind yourself that you are good enough just as you are, even if you don&#x2019;t have something you see in those around you (lots of letters after your name.) Because odds are that you have someone equally valuable that they don&#x2019;t! (Oh, and just as an aside, I really am funny, just not really&#xA0;<em>really</em>&#xA0;funny!)</p><h4><strong>Avoid your triggers</strong></h4><p>There&#x2019;s a growing body of research showing that social media networks such as Facebook and Instagram can actually trigger depression in many people as they compare their lives with those of their increasingly expansive and superficial online network of &#x2018;friends.&#x2019;&#xA0; Yet as you already know, most of what we put online isn&#x2019;t a reflection of our life as it is. It&#x2019;s a reflection of our life as we want others to&#xA0;<em>think</em>&#xA0;it is.&#xA0;</p><p>Sure some of what people post online may be truthful. However just as we can filter the images we post, most of us also filter the reality we share &#x2013; highlighting the good and leaving out the less flattering bits.&#xA0; So if scrolling through your Facebook feed just leaves you feeling like a loser, then do yourself a really big favor and log off.&#xA0;</p><h4><strong>Focus on your own progress</strong></h4><p>Research shows that the happiest people aren&#x2019;t those who only make positive comparisons with others. They are those who don&#x2019;t make any! What they do instead is focus their efforts to improving themselves.&#xA0; Just imagine the difference it would make if you rechanneled all the energy you spend on comparing on developing yourself?&#xA0; You are your ultimate frame of references track yourself against yourself. Are you fitter than YOU used to be? Are you making progress toward YOUR goals?&#xA0;&#xA0;</p><p>We all have our own hurdles to scale, fears to conquer and paths to forge. So run your own race and let others run theirs. &#xA0;As my mother used to say to me, &#x201C;If God had wanted you to be like everybody else, He&#x2019;d have made you that way. &#x201C;</p><h4><strong>Admit your envy</strong></h4><p>Emotions that we don&#x2019;t own, will own us. So if you&#x2019;re wrestling with the green monster, the best way to loosen its vice like grip is to acknowledge and verbalize it.&#xA0; As I wrote in my latest book&#xA0;<a data-cke-saved-href=\"http://www.trainthebrave.com/\" href=\"http://www.trainthebrave.com/\">Brave</a>, &#x201C;you may feel a little foolish admitting that you&#x2019;re jealous of someone else&#x2019;s success, talents or attributes but having the courage to admit it will loosen envy&#x2019;s grip.&#x201D;</p><p>Not only that, but by having the courage to confide to the person you&#x2019;re actually envious of, you can forge deeper bonds in ways harboring hidden envy never can. &#xA0;</p><p>Many times after I&#x2019;ve laid my pride on the line and confided my envy to someone they&#x2019;ve reciprocated by sharing the &#x2018;underbelly&#x2019; of their success. &#x201C;I work out two hours a day,&#x201D; a woman told me in Bali after I complimented her on how fabulous she looked in her bikini (I stick to one piece these days.) Other times they will share something they admire about me (which, of course, I hate. Not.)</p><p>As I&#x2019;ve found on so many fronts in life, being open and honest ultimately helps us realize the futility of comparisons and the gifts in each other.&#xA0; Try it.</p><p>The truth is that we human beings are really &#x2018;human becomings.&#x2019; Sometimes two steps forward, one step backward. But if you trusted that you are more than enough just as you are right now, how might that liberate you from trap of negative comparisons? &#xA0;To live more authentically, more creatively, more bravely.</p><p>If there&#x2019;s one thing I&#x2019;ve learnt from my years of wrestling with comparisons, it&#x2019;s that it will.</p><p><br></p><p>Margie is one of our contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p><p><br></p><h4><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/02","associated_company":"work180"}