{"url":"https://www.work180.com.au/blog/2018/12/how-to-get-the-most-out-of-your-1-on-1-meetings","title":"How to get the most out of your 1 on 1 meetings","author":"WORK180","body":"\n\t\t\t\t\t<p>Are you just coasting in your career?&#xA0;In order to fulfill our potential, we need to be taken out of our comfort zone, we need advice and we need effective 1 on 1 meetings.</p><p>As well as being important for the development of your team, it&apos;s a fundamental rule of management that to lead others you need to engage in open communication. 1 on 1 meetings are an opportunity for managers and team members to build a strong rapport. However, both parties may not fully reap the benefits of these meetings if they shy away from prioritizing, creating an agenda and being honest.</p><p>Here&apos;s how to maximize this time to boost your career:</p><h3>Prioritise &amp; set a recurring schedule</h3><p>Catching up with your manager randomly will prove difficult due to their hectic calendar. Valuable 1 on 1&#x2019;s need to be scheduled and they need to be regular. It&#x2019;s important for your team to be committed and consistent, as does their meeting schedule. By making a commitment you will both be better prepared and take the meeting seriously.</p><div><br></div><section><section><p>If something does comes up, always ensure to rearrange the meeting rather than cancel. Cancelling meetings will cause issues to fester into larger problems if they go unaddressed.</p><h3>Be honest</h3><p>For team members in particular, 1 on 1&#x2019;s are critical to professional development. However, you will get out of the meeting what you put in.</p><p>Your 1 on 1 is a safe place to share your experiences and provide feedback. This is your opportunity to forge your dream career, but this can only happen if you are open and honest. Remember, no one can read your mind. You need to discuss career goals in specifics in order to eliminate the threat of miscommunication.</p><p>It&#x2019;s also important to share goals outside of work that create a sense of relatability. Are you trying to save for a deposit or quit caffeine? Sharing creates a personal relationship built on emotions. Don&#x2019;t forget that managers are people too.</p><p>Maybe you will feel more at ease to share outside of the conference room. Suggest getting out of the office or grabbing a coffee. A walk-and-talk is always a good idea for creative thinking.</p><h3>Plan ahead</h3><p>Effective 1 on 1&#x2019;s require an agenda and a framework. These are different to your average meetings and therefore depend upon a certain mindset.</p><p>Ask yourself:</p><blockquote><p style=\"margin-left:5rem;\">What can I achieve by having this meeting?</p></blockquote><p>Identify and write down key milestones, career goals and challenges for a certain time period. This is your time to request more responsibility, provide feedback and learn. You don&#x2019;t want to forget something important that could change the direction of your career.</p><h3>No more status updates</h3><p>Status updates are necessary. Managers need to spend time going over your deadlines, which affect their deadlines. But when it comes to 1 on 1&#x2019;s, they&#x2019;re just an excuse to fill the time. They&#x2019;re a familiar and comfortable conversation - the opposite of what your 1 on 1 meeting should be. Make sure to email your manager a status update before the meeting so that you can make your professional development the focus.</p><h3>Keep yourself accountable</h3><p>It&#x2019;s important to bullet point the conversation to wrap up your meeting. Make notes to ensure you are kept on track and don&#x2019;t forget anything discussed. Agreeing outcomes with action points and due dates will ensure you are kept accountable. Add reminders into your calendar to prompt you to follow up if deadlines aren&#x2019;t met. For your next meeting, you will be able to quickly review&#xA0;your notes and assess whether you have achieved what you planned.</p><div><hr><h3><strong>About WORK180</strong></h3></div></section><section><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></section></section><div><br></div><section class=\"ui about-us\" style=\"color: rgb(0, 0, 0); font-family: &quot;Open Sans&quot;, sans-serif; font-size: medium;\"><br></section>\n\t\t\t\t","tags":["prioritise","1 on 1","plan ahead","Career Development"],"upload_date":"2018/12","associated_company":"work180"}