{"url":"https://www.work180.com.au/blog/2018/02/how-to-explain-a-career-gap-in-your-resume","title":"How To Explain A Career Gap In Your Resume  ","author":"WORK180","body":"\n\t\t\t\t\t<p>You had a great career going and then you fell victim to downsizing, the job market was tough, and you couldn&#x2019;t find another position for quite a while. Or you did find one that turned out not to be a fit and you didn&#x2019;t stay long. Or you left your job to move cross country to take care of your ailing parents, or because you couldn&#x2019;t stand the heat/cold (pick one) where you were living, or because your partner/lover (pick one) was transferred, or because you wanted to stay home for the first year or two or more of your child&#x2019;s life, or simply because you wanted to&#xA0;follow a dream that didn&#x2019;t quite work out the way you&#x2019;d hoped.&#xA0;</p><h3><strong>Don&#x2019;t Wish it Away</strong></h3><p>When you start the job search<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">,</a> your first inclination may be to fudge on your resume and simply not acknowledge a gap in your employment history. You might think that you can explain it in an interview instead. But that unexplained gap may be the reason you never have the chance to be invited for that interview at all, and that would be a lost opportunity.</p><p>Don&#x2019;t think, either, that explaining a resume gap in your cover letter will be sufficient. It&#x2019;s a good idea to mention it in your letter, but cover letters can go astray and the person who ultimately receives your resume should be able to understand your story from that alone.</p><p>Of course we&#x2019;re talking about substantial gaps of anything from six months to a number of years. It&#x2019;s understandable that you can&#x2019;t always leave one job on a Friday and start the new one the following Monday, so there&#x2019;s no need to describe what you were doing for a few months between jobs unless it&#x2019;s helpful to your cause.</p><p>So how should you frame the gap when you write your resume?</p><h3><strong>Be Honest About it</strong></h3><p>People in HR have heard just about all the legitimate reasons &#x2013; as well as bad excuses -- that there are, so you&#x2019;re not likely to shock them or fool them. And everyone understands that life is unpredictable. So tell the truth. Just tell it in a way that makes a positive rather than negative impression.</p><p>Staying home with your children or getting settled after a big move are reasonable by themselves, but if you were just plain burned out and needed to take some &#x201C;me&#x201D; time, for example, describe it as a sabbatical that gave you a new perspective on the work that you do and gave you fresh resources to bring with you to a new position. If you can give a purpose to your time off, it shows that you&#x2019;re proactive and focused on the career you&#x2019;re now ready to engage in again.</p><h3><strong>Include Relevant Gap Accomplishments</strong></h3><p>If you did anything during your employment gap that contributed to your knowledge and skill set, by all means include it. Did you do any consulting or freelance work? Did you take a course or attend a seminar? Did you volunteer your services in a professional capacity? Absolutely mention it.</p><p>On the other hand, don&#x2019;t wear out thesaurus.com finding ways to describe the multitasking you did while simultaneously making breakfast, talking to a doctor on the phone, and putting your toddler in a snowsuit as somehow career-related.</p><h3><strong>Make Your Resume Shine</strong></h3><p>You do have a bit of a hurdle to overcome if your employment gap has been lengthy, so it&#x2019;s more important than ever to put your work history in the best possible light. Consider getting help from an experienced professional resume writer who will work with you to make the most of what you&#x2019;ve accomplished and what you have to offer. Surveys have shown that, on average, most hiring managers and executives spend as little as 15 seconds looking at a resume. They&#x2019;ll read the summary but only scan the rest unless you&#x2019;ve really interested them. You&#x2019;ve just got that one chance, so make the best of it and land your dream job.</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/02","associated_company":"work180"}