{"url":"https://www.work180.com.au/blog/2018/07/how-nbn-is-building-a-nationwide-network-this-naidoc-week","title":"How NBN Co is building a nationwide network this NAIDOC week","author":"WORK180","body":"\n\t\t\t\t\t<p>&#xA0;At NBN Co, we&#x2019;re rolling out Australia&#x2019;s new <strong>nbn</strong> broadband access network to connect all Australians and help bridge the digital divide.</p><p>Our vision for reconciliation is to help connect communities across Australia, enhancing connection and understanding between Aboriginal and Torres Strait Islander communities and broader Australian society. Our people here are as passionate about this as they are about technology and physically connecting the network.</p><p>NAIDOC week is an important celebration for our employees at NBN Co, as we take the time to celebrate the history, culture and achievements of Australia&#x2019;s First People.</p><p>This year, we&#x2019;re starting a new tradition by supporting the Australian Indigenous Mentoring Experience (AIME) deadly national &#x2018;Hoodie Day&#x2019;. AIME provides support for young First People to complete high school and transition to university via tutoring at school and workshops held on university campuses. On Hoodie Day, we ask our employees to make a donation using NBN Co&#x2019;s Workplace Giving site and wear a hoodie to work.</p><p>We will all celebrate together at events in nine of our offices around Australia and have invited First People from AIME, communities and within NBN Co<span style=\"font-size: 16px;\">&#xA0;</span>to speak.&#xA0; With this year&#x2019;s NAIDOC theme being &#x2018;because of her, we can&#x2019; &#x2014; recognising the important role that mothers, aunties, grandmothers and sisters play in First People communities &#x2014; all events have female speakers sharing their story and our male speakers talking about the impact that females have had on their lives.</p><p>This week is also very special to NBN Co as we launched our new First People brand that will be the focal point of our organisational commitment to supporting Indigenous culture internally and across Australia. It has been co-created with Indigenous staff, including <strong>nbn</strong>&#x2122; access network engineer Ryan Watson who helped finalise the name and our designer Marcus Lee.&#xA0;</p><p>We&#x2019;re also supporting community initiatives in Broome and we&#x2019;re working on cyber safety programs with remote schools in South Australia and the Northern Territory.</p><p>We&#x2019;re doing the hard yards to create real change that inspires more stories. Because the more stories we have in common, the more kinship we feel.</p><hr><h3 style=\"font-family: Lato, sans-serif;\"><br></h3><p><span style=\"font-size: 16px;\"><strong>About&#xA0;nbn&#xA0;</strong></span><span style=\"font-size: 16px;\"><strong> </strong><a data-cke-saved-href=\"https://www.work180.com.au/clients/nbn\" href=\"https://www.work180.com.au/clients/nbn\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3305186d-6fbc-4d79-b7c8-1e84793ccd69.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3305186d-6fbc-4d79-b7c8-1e84793ccd69.png\" style=\"float: right; width: 385px; height: 150px;\"></a></span></p><p><strong class=\"\">nbn</strong>&#xA0;is an Endorsed Employer for Women.&#xA0; They are&#xA0;joining other major Australian-based companies in committing to working towards the 40:40:20 gender balance target. They are committed to building championship teams made up of a diverse mix of people, styles&#xA0;and&#xA0;background to deliver the best business results, positive end-user customer experience and attract the best talent. Learn more about&#xA0;<strong class=\"\">nbn</strong>&#xA0;on&#xA0;their&#xA0;&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/nbn\" href=\"https://www.work180.com.au/clients/nbn\">Best Employer page</a>.&#xA0;&#xA0;Apply to join&#xA0;<strong><span style=\"font-size: 16px;\"><strong>nbn</strong></span></strong>.<a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=nbn\" href=\"https://www.dccjobs.com/job-search?client=nbn\">&#xA0;Browse their jobs here.</a><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=nbn\" href=\"https://www.work180.com.au/job-search?client=nbn\">&#xA0;</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><p><br></p>\n\t\t\t\t","tags":["NAIDOC","Celebrating Women"],"upload_date":"2018/07","associated_companies":["work180"]}