{"url":"https://www.work180.com.au/blog/2017/03/how-to-ensure-your-career-doesnt-stall-while-on-parental-leave","title":"How to Ensure Your Career Doesn't Stall While on Parental Leave","author":"WORK180","body":"\n\t\t\t\t\t<p>Since joining&#xA0;<a data-cke-saved-href=\"/clients/caltex\" href=\"/clients/caltex\">Caltex</a>, Rebecca Dessaix&#x2019;s love of a good challenge saw her experience six roles in eight years. Beginning in tax, she held multiple advisory roles before moving into a management reporting role focused on customer profitability. From there she took on successive consolidated accounting and reporting roles whilst building her position as a trusted finance business partner.</p><p>During this time, she also took parental leave, yet has managed to not miss a beat in her professional career. Just eleven months after returning to work, Rebecca was promoted to an exciting new role of Marketing Finance Manager, her biggest to date. During our conversation, I was eager to learn how Rebecca managed a transition to a senior leadership role, particularly while juggling work and home-life commitments.</p><p>Here are her top 3 tips:</p><p><br></p><h4><strong>1. Think More Broadly When Assessing Opportunities&#xA0;</strong></h4><p>Rebecca&#x2019;s passion to learn, set stretch goals and never get complacent played a huge part in her impressive career timeline1.</p><p>Throughout her career with Caltex, Rebecca was always on the lookout for different projects to further her professional development. &#x201C;In a large organisation like Caltex, you can get involved in a diverse range of projects. However, you need to be open to the challenge,&#x201D; Rebecca told me. When returning from maternity leave, Rebecca uncovered an opportunity to take on a maternity leave cover for the Financial Controller, applied for it and was successful.&#xA0;&#x201C;This move really extended me professionally,&#x201D;&#xA0;said Rebecca. &#x201C;I was exposed to ASX reporting, investor relations, along with exposure to key stakeholders. The role was a perfect fit-I saw it as amazing professional development and given the fixed time frame I was able to really focus on what I wanted to get out of the experience.&#x201D;</p><p>Rebecca&#x2019;s advice is to assess different roles based on expanding your knowledge of the business. &#x201C;You may only be in a role for a short period, and while you are aware it&#x2019;s not something you&#x2019;d necessarily do long term, broadening your experience and exposure should be your key focus.&#x201D;</p><p><br></p><h4><strong>2. The Importance Of Driving Your Own Professional Development</strong></h4><p style=\"text-align:center\"><img alt=\"\" data-cke-saved-src=\"https://www.diversecitycareers.com/media/diversecitycareers/images/Rebecca%20Caltex%206.jpg\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/images/Rebecca%20Caltex%206.jpg\"></p><p>I asked Rebecca how she managed professional development, both her own and across her team. &#x201C;Thanks to our supportive culture, I truly feel like I have ownership of my own career,&#x201D; explained Rebecca. Leveraging the structured element of performance appraisals, Rebecca always maintained a list of special projects she wanted to work on in addition to external professional development courses.</p><p>We also discussed the need for managers to develop the kind of relationship that encourages the team to drive their own professional development, and feel comfortable discussing their objectives. &#x201C;That way, everyone feels like they are entitled to have the conversation, and it takes away that fear of raising the request in the first place,&#x201D; said Rebecca.&#xA0;Tailoring each professional development plan is also crucial.&#xA0;&#x201C;I need to continuously remind myself that my team is not exactly like me, and there are different ways people prefer to learn and grow,&#x201D; explained Rebecca.</p><p><br></p><h4>3. &#xA0;Support For Working Parents Is Crucial&#xA0;</h4><p>Rebecca took a total of seven months&#x2019; parental leave, three of which was paid at full salary, in addition to the government entitlements. Caltex also provided extra support to help with childcare. &#x201C;The Baby Care Package offered by Caltex has been instrumental in me being able to return to work full time- which was something I really wanted to do&#x201D;, explained Rebecca. &#x201C;Up until my son turned two, Caltex paid 3% of my salary in quarterly instalments.&#x201D;</p><p>Rebecca used the Baby Care Package to offset the cost of sharing a nanny with another mum.&#xA0;&#x201C;Our kids got along, and we were both returning to work at the same time,&#x201D; continued Rebecca. &#x201C;The first two years of a child&#x2019;s life can be very expensive, especially once you start paying for childcare. The extra kick in of funds every quarter was really helpful.&#x201D; Rebecca also took advantage of Caltex&#x2019;s keeping in touch days, which provided 10 paid days to attend team meetings and conferences. &#x201C;Contrary to popular assumptions, some new parents want to maintain an active dialog with the business while on leave and have early discussion about returning to work,&#x201D; shared Rebecca. &#x201C;I was one of them.&#x201D;&#xA0;</p><p><br></p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d4043cfa-a176-406c-bd5d-0bf7637dddda.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d4043cfa-a176-406c-bd5d-0bf7637dddda.jpeg\"></p><p>Rebecca also considered which area of the business she&#x2019;d like to return to. A few months into her parental leave, Rebecca approached her manager to discuss her thoughts. &#x201C;I felt I had taken my previous role as far as I could, and I was looking to come back to something new,&#x201D; said Rebecca. &#xA0;Rebecca&#x2019;s manager has always been receptive to discussing his team&#x2019;s individual objectives, and Rebecca was upfront and open about what she was looking for.&#xA0;Upon her return, she applied for a new opportunity and is now enjoying working on one of the most exciting projects of her career,&#xA0;helping Caltex execute on their vision to deliver the Freedom of Convenience through innovative customer offers.</p><p>A supportive culture plays a huge, if not the biggest part in enabling employees to pursue both careers and outside commitments.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/03","associated_company":"work180"}