{"url":"https://www.work180.com.au/blog/2015/12/if-a-leader-is-better-than-a-manager-whats-better-than-a-leader","title":"If a Leader is better than a Manager, what’s better than a Leader?","author":"WORK180","body":"\n\t\t\t\t\t<p>DCC Jobs cofounder Valeria Ignatieva and I have been taking the last few weeks to discuss and strategize a lot about scaling our business in 2016. One particular discussion point really got me thinking- how we hire and ensure our employees are engaged, happy and we help them reach their full potential. During this discussion, I made a comment to Valeria-</p>\n\n<blockquote>\n<p>&#x201C;I never want to have &#x2018;managers&#x2019; in our business, I want our people to be empowered to make decisions and take ownership of their role- that&#x2019;s when you truly get the best out of someone&#x201D;.</p>\n</blockquote>\n\n<p>Valeria then came back with: &#x201C;Absolutely- it&#x2019;s all about outcomes not &#x2018;the how&#x2019; people do their jobs, but how do we do that and still ensure our people are supported? Particularly those at the start of their career&#x2026;they may need some more structure and guidance.&#x201D;</p>\n\n<p>Being a leader rather than a manager seems to have been a trendy concept over the last few years. A leader inspires, paves the way by setting a tempo and focusses on change and innovation. Whereas as a manager typically tells you how to do the job, looks at numbers and doesn&#x2019;t want to disrupt the status quo.</p>\n\n<p>Yes we want to be leaders and management to an extent is important to running a successful business, but how do we get the best of both of these? Then it hit me&#x2026; let&#x2019;s have each individual run with their role how they see fit but, let&#x2019;s have &#x2018;coaches&#x2019;.</p>\n\n<p>A coach is there to inspire and motivate, but also to help a person achieve their goals, provide guidance and support the person or team.</p>\n\n<p>Throughout most of my employment, I&#x2019;ve had mentors, which are essential to bounce ideas off of and provide career advice. However, since running DCC, I&#x2019;ve changed my view on what I know will get the best out of me and recently asked someone to be my coach. I&#x2019;ve found that having a coach keeps me accountable, but still allows me to completely own and take responsibility of my actions. When I see my coach, they talk to me about specific achievements and goals I set for myself, which is one step beyond having a mentor.</p>\n\n<p>Organisational hierarchy and bureaucracy is archaic, it slows innovation and in a world where agility and fast market responses are king, there&#x2019;s no room for the old-style of management if you want to survive. However, no matter what stage of our career we&#x2019;re in, we all need guidance and support.&#xA0; This is where I believe that in an organisation where we want to empower our people, but still ensure they are growing and developing, we need to have an entirely flat structure, but give our people coaches.</p>\n\n<p>We are already seeing this method successfully implemented across some companies we work with at DCC. They may not call the role a &#x2018;coach&#x2019; specifically but each employee is allocated another colleague to support and coach them. Flattening the hierarchy is certainly not an easy task, but companies that do have proven to thrive with higher productivity, employee engagement and lower turnover rates. After all, who wants to be &#x201C;managed&#x201D;?</p>\n\n<blockquote>\n<p>&quot;It doesn&apos;t make sense to hire smart people and tell them what to do; we hire smart people so they can tell us what to do.&quot; Steve Jobs.</p>\n</blockquote>\n\n<h5>&#xA0;</h5>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/12","associated_company":"work180"}