{"url":"https://www.work180.com.au/blog/2016/10/introverted-insights-into-thriving-in-the-group","title":"Introverted insights into thriving in ‘the group’","author":"WORK180","body":"\n\t\t\t\t\t<p>I&#x2019;m an introvert.&#xA0;This comes as a surprise to people who know me well and see me as confident and sociable. However, invite me to a networking workshop or a party and you&#x2019;ll glimpse the classic tell tale flash of horror that introverts experience at the prospect of attending big events.</p>\n\n<p>Now here&#x2019;s the thing. Contrary to popular mythology, being an introvert doesn&#x2019;t automatically make you shy or scared or aloof.</p>\n\n<p>The defining difference between introverts and extroverts lies in how we get our energy and inspiration.&#xA0;Extroverts draw energy from interacting with &#x2018;the group&#x2019; and from &#x2018;talking their thinking&#x2019;. Introverts need quiet reflective space and time to generate and review ideas and recharge after a busy day. Once we feel comfortable and connected to others we&#x2019;re great one to one or one to three style socialisers.</p>\n\n<p>Recently I&#x2019;ve become more aware of being an introvert.&#xA0;I&#x2019;ve decided to explore and note how introversion shapes my experiences whilst taking part in a 7 month course at&#xA0;<a href=\"http://www.csl.org.au/\" target=\"_blank\">The Centre For Sustainability Leadership</a>.</p>\n\n<p>The course involves weekly workshops and three long weekends away with my fellow course mates. &#xA0;Group weekends away are a daunting prospect and an intrepid journey destined to take me well outside my comfort zone. Before and during each trip my private, tranquillity craving self has been asking a lot of quite unnerving questions.</p>\n\n<p>I&#x2019;m sharing a room &#x2013; how will I get any personal space? Will I get any time to myself? Who are all these talkative, interesting people who want to get to know me? Why do I just want to go for a quiet walk instead of getting to know them?</p>\n\n<p>Four months into my course, here&#x2019;s what I&#x2019;ve learned about thriving as an introvert in a large and lovely, but predominantly extroverted, group.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>1. It&#x2019;s fine to take time out&#xA0; </strong></p>\n\n<p>Any time spent with a lot of other humans &#x2013; friends, strangers or colleagues can be exhausting. As an introvert I need solitary recharging time, which can be tough to find at organised events.</p>\n\n<p>Deprived of down time I soon feel like an alien who&#x2019;d been parachuted onto a planet inhabited by high-energy humans with so much to say they barely pause for breath.</p>\n\n<p>Knowing I needed to carve out some quiet space in a crowded schedule with a good dollop of pressure to socialise, I&#x2019;ve learnt to plan ahead.</p>\n\n<p>During a recent weeklong trip with the course I made sure I went to bed early with a book. When my mind called &#x2018;time out&#x2019; during the day I listened and walked away. I snatched a few quiet daytime moments by returning to my room to &#x2018;collect&#x2019; something or by taking a walk around the outside of the building.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Find your tribe</strong></p>\n\n<p>Humans have an uncanny knack for detecting like-minded souls. As a group facilitator I love to watch this in action. In a room of complete strangers I&#x2019;ve observed introverts, extroverts, dog lovers, Melbournians and chocoholics gravitate towards each other! Somehow we just &#x2018;know&#x2019;.</p>\n\n<p>The recent trip meant meeting 26 additional new faces from the Melbourne group of the course. At the first workshop I sat down next to a group of introverts. Subconsciously I must have sensed they were the calmer, quieter and least intimidating people in the room.</p>\n\n<p>Phew! I&#x2019;d found my (relative) comfort zone.</p>\n\n<p>I realised that at dinner I was sticking with an introvert group, as mustering the energy to chat to new faces was just a step to far after a full on day of workshop interactions.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Trust your insights and follow through</strong></p>\n\n<p>During a workshop where I had to comment on other people&#x2019;s five minute speeches I really wanted time to give reflective, private feedback to the speaker. This was especially true where a speech particularly touched me.</p>\n\n<p>As an introvert it&#x2019;s challenging for me to provide this sort of meaningful, supportive comment on the spot. It&#x2019;s not that I don&#x2019;t have useful insightful things to say, although these often come to me after &#x2018;the moment&#x2019; has passed.</p>\n\n<p>Sometimes I just want a bit longer to align my thoughts before I speak. However, the main reason I can be hesitant is that I prefer to connect and converse one on one. This is why I made a point of finding the speakers whose presentations had moved me to share my comments and insights with them individually.</p>\n\n<p>For the record, I&#x2019;m pretty sure I wasn&#x2019;t more or less nervous about speechmaking than any one else. There doesn&#x2019;t appear to be a correlation between introversion and fear of public speaking. Apparently public speaking ranks third after fear of death and spiders as a global source of anxiety and discomfort.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Join the quiet revolution</strong></p>\n\n<p>There is a significant cultural shift towards valuing introversion as an attribute in leadership and teamwork.&#xA0;</p>\n\n<p>Author and advocate&#xA0;<a href=\"https://www.ted.com/talks/susan_cain_the_power_of_introverts/transcript?language=en\" target=\"_blank\">Susan Cain&#x2019;s TED talk</a>&#xA0;takes a funny, insightful look at how historically undervalued &#x2018;shy&#x2019; and &#xA0;&#x2018;aloof&#x2019; introverts are stepping quietly out of the shadows in turbulent times.</p>\n\n<p>Having observed my introverted self in action in this lively, thoughtful group I&#x2019;m ready to join the quiet revolution.&#xA0;Like my<a href=\"http://www.jogreencoaching.com/blog/2016/7/12/putting-your-strengths-to-work\" target=\"_blank\">&#xA0;VIA strengths</a>- humility, leadership, fairness, kindness and judgment, introversion is at the heart of who I am. Developing my introvert&#x2019;s capacity for intuition and reflection is starting to feel like finding my superpower.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>Jo&#xA0;is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/10","associated_company":"work180"}