{"url":"https://www.work180.com.au/blog/2018/07/is-paid-parental-leave-taxable","title":"Is Paid Parental Leave taxable?","author":"WORK180","body":"\n\t\t\t\t\t<p>Yes, paid parental leave is taxable income. How much is taken out really depends on the circumstances of your leave arrangement and who is making your payments. In 2017-18, paid parental leave is $695 a week and paid through your normal payroll by your employer or directly through Centrelink.</p><h3><strong>Paid by your employer</strong></h3><p>If this is your only income during the 18 weeks from your employer then you should get $616 a week after tax. However everyone&#x2019;s situation is different and you may be receiving other leave payments at the same time such as annual leave or paid maternity leave. So keep in mind that your employer will take the amount of tax that is relevant to your situation so it may be different to someone else you know getting paid parental leave at the same time as you.</p><p>Also as it is paid through your employers normal payroll cycle, if you are only paid once a month then you will only receive your paid parental leave payment at this time. You should receive a pay slip with your payment from your employer similar to what you would have received if paid your normal salary.</p><p>I was fortunate to also receive paid maternity leave from my employer for 13 weeks. &#xA0;Therefore during my normal pay cycle each fortnight I was receiving my Paid Parental Leave plus my maternity leave pay from my employer. This meant that more tax was taken out of my fortnightly pay than if I was just receiving my PPL. For my second child I chose to have my 13 weeks of maternity leave pay spread out over 26 weeks at half pay. Therefore the amount taken out of my pay in tax would have been different again.</p><h3><strong>Paid by Centrelink</strong></h3><p>If you receive your Paid Parental Leave directly from Centrelink then your rate of tax is different again. This might occur if you are self employed or have not worked for your employer for longer than a year or even if you don&#x2019;t intend to return to that employer. In this case the rate of tax that Centrelink will take out of your payment is 15%. This reduced your payment down to $590.75.</p><h3><strong>Income Tax Return</strong></h3><p>What all of this also means is that your Paid Parental Leave taxable income needs to go onto your Income Tax Return. Your employer will still need to give you your annual PAYG Payment Summary which will include your Paid Parental Leave. This is included in your Gross Payment amount and the Total Tax Withheld amount. It doesn&#x2019;t need to be separately disclosed.</p><p>If you have received your payment from Centrelink, they will send you a PAYG Payment Summary directly which will include the Paid Parental Leave details for you to include in your tax return.</p><p>&#x200B;</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About the author&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/95b6ddf6-83fb-4c3c-a65d-1cb6aadf8bd6.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/95b6ddf6-83fb-4c3c-a65d-1cb6aadf8bd6.jpeg\" style=\"margin: 10px; float: right; width: 200px; height: 200px;\"></strong></h4><p>I&#x2019;m Lisa, an accountant and a mum of two. When my son was born I remember how stressed I was trying to submit my application for Paid Parental Leave. I couldn&#x2019;t understand why it was so difficult. I&#x2019;m an accountant &#x2013; surely I should find it simple! I&#x2019;ve discovered I&#x2019;m not alone.</p><p>By the time I went through the process with my second child I was a lot more on top of it. I had figured out what most things meant, and how to make it work for me &#x2013; especially the childcare payments.</p><p>I wrote&#xA0;<a data-cke-saved-href=\"https://yourfamilybudget.com.au/\" href=\"https://yourfamilybudget.com.au/\">Your Family Budget</a>&#xA0;to give everyone the use of my experiences and the benefit of the hours of research I have done. Either through the reading of legislation or all the detailed&#xA0;information provided by Centrelink. I&#x2019;ve put everything you need in one place.</p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><p><br></p>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/07","associated_company":"work180"}