{"url":"https://www.work180.com.au/blog/2018/05/never-a-more-pressing-time-for-progress","title":"It's never been a more pressing time for progress","author":"WORK180","body":"\n\t\t\t\t\t<p>About the time the Australian Government decided to create a national science agency over 100 years ago, the first International Women&#x2019;s Day was celebrated, commemorating the movement for women&#x2019;s rights.</p>\n\n<p>While both have come a long way over the century, we still haven&#x2019;t reached our destination of true diversity; a destination that nature recognises with abundance in the rich diversity essential to life.</p>\n\n<blockquote>\n<p><big><em>Nature is one of the best innovators there is. Nature loves balance and has done a great job of figuring out 50/50 is what works &#x2013; I think we could learn from that.</em></big></p>\n</blockquote>\n\n<p>The&#xA0;<a href=\"https://www.wgea.gov.au/sites/default/files/Stats_at_a_Glance.pdf\">WGEA&#x2019;s 2018 report card</a>&#xA0;found Australia has 47% women in the workforce but only 30% in leadership, and 29% of organisations have NO female leaders.</p>\n\n<p>The commonly used phrase about candidates for leadership roles exhibiting &#x201C;executive demeanour&#x201D; (whatever that means) has to change to embrace different styles of leadership that recognise a more diverse range of skills and talents.</p>\n\n<p>There is still much work to be done to address gender inequity in STEM (Science, Technology, Engineering and Mathematics), but maybe we can take a leaf out of nature&#x2019;s book.</p>\n\n<blockquote>\n<p><em>Before our current strategy, CSIRO had 39% women but only 25% in leadership, and none in our most senior science leadership roles as business unit leaders.</em></p>\n</blockquote>\n\n<p>So this year&#x2019;s theme for International Women&#x2019;s Day, #PressforProgress, was timely as I step up my deep personal commitment to gender equity as a strategic priority for CSIRO.</p>\n\n<p>I&#x2019;m a&#xA0;<a href=\"http://malechampionsofchange.com/welcome-to-the-stem-male-champions-of-change/\">Male Champion of Change</a>, and rather than focusing on what women can do to help address the gaps in gender equity, this program is about male leaders taking on that responsibility too, choosing to stand alongside women. MCC strives to shift the system by understanding and addressing systemic biases and barriers that limit women&#x2019;s advancement.&#xA0;</p>\n\n<p style=\"text-align: center;\"><img alt=\"Happy International Women&#x2019;s Day, and congrats on 15 years at CSIRO, to my colleague Philippa Eggerton, an essential part of our team and our daily dose of sunshine.\" data-attachment-id=\"33819\" data-comments-opened=\"0\" data-image-description=\"&lt;p&gt;Happy International Women&#x2019;s Day, and congrats on 15 years at CSIRO, to my colleague Philippa Eggerton, an essential part of our team and our daily dose of sunshine.&lt;/p&gt;\n\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"IWD\" data-large-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/IWD-927x1024.jpg\" data-medium-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/IWD-272x300.jpg\" data-orig-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/IWD.jpg\" data-orig-size=\"2584,2855\" data-permalink=\"https://blog.csiro.au/never-pressing-time-progress/iwd/\" sizes=\"(max-width: 484px) 100vw, 484px\" src=\"https://blog.csiro.au/wp-content/uploads/2018/03/IWD-927x1024.jpg\" srcset=\"https://blog.csiro.au/wp-content/uploads/2018/03/IWD-927x1024.jpg 927w, https://blog.csiro.au/wp-content/uploads/2018/03/IWD-272x300.jpg 272w, https://blog.csiro.au/wp-content/uploads/2018/03/IWD-768x849.jpg 768w, https://blog.csiro.au/wp-content/uploads/2018/03/IWD-863x954.jpg 863w\" style=\"border: 0px none; line-height: inherit; vertical-align: baseline; width: 350px; margin: 10px;\"></p>\n\n<p style=\"text-align: center;\"><small><em>Celebrating my colleague Philippa Eggerton who has been with CSIRO for 15 years.</em></small></p>\n\n<p><span style=\"box-sizing: border-box; color: rgb(51, 51, 51); font-family: Lato, sans-serif; font-size: 1.6rem; background-color: rgb(255, 255, 255);\">We know that women are severely under-represented in STEM&#xA0;</span>education,<span style=\"box-sizing: border-box; color: rgb(51, 51, 51); font-family: Lato, sans-serif; font-size: 1.6rem; background-color: rgb(255, 255, 255);\">&#xA0;and that women&#x2019;s lack of retention and progression in STEM signals persistent barriers and entrenched gender inequalities. As a group, the STEM MCCs are trying to address a lack of visibility of women in STEM by signing a pledge not to speak on any event panel that doesn&#x2019;t have a meaningful representation of women.</span></p>\n\n<p>At CSIRO, one of the biggest changes we&#x2019;ve implemented is in our culture, our idea of what leadership means and how we measure those attributes and ensuring language we use applies to all scientists regardless of gender &#x2013; it&#x2019;s a great lesson from nature.</p>\n\n<p>Our most successful program, borrowed from the idea of balance in nature, is called &#x2018;Balance&#x2019;, CSIRO&#x2019;s flexible work initiative, which we launched last year. Flexible work arrangements enhance the performance of CSIRO and underpin the delivery of our strategy, diversity, and long-term capability.</p>\n\n<p>It&#x2019;s important to note that many of the procedural elements of Balance were already there, but weren&#x2019;t being taken-up because of culture. The real progress comes from a cultural change within the organisation, making balance a cultural norm for everyone.</p>\n\n<blockquote>\n<p><em>This initiative is about making easier for both men and women in the organisation to be able to balance their work and personal lives. The way we treat our people determines how they treat our customers, so enabling them to bring their whole self to work, and know that they have equal opportunity for success is simply better business.</em></p>\n</blockquote>\n\n<p>Since we launched our Strategy 2020 two and a half years ago, the numbers I mentioned earlier have shifted. The percentage of women in Research Management roles has increased from 11% to 16%, Research Scientist/Engineers from 25% to 27%, and Management from 29% to 41%, including two women leading science business units. Other numbers across many other functional areas, roles and demographics are similarly encouraging, but it&#x2019;s not enough.</p>\n\n<div id=\"attachment_33821\" style=\"margin-left:auto;\"><img alt=\"Our leadership team celebrated diversity with Wear It Purple day last year.\" data-attachment-id=\"33821\" data-comments-opened=\"0\" data-image-description=\"\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Wearitpurple\" data-large-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple.jpg\" data-medium-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple-300x200.jpg\" data-orig-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple.jpg\" data-orig-size=\"600,400\" data-permalink=\"https://blog.csiro.au/never-pressing-time-progress/wearitpurple/\" sizes=\"(max-width: 600px) 100vw, 600px\" src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple.jpg\" srcset=\"https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple.jpg 600w, https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple-300x200.jpg 300w, https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple-299x200.jpg 299w, https://blog.csiro.au/wp-content/uploads/2018/03/Wearitpurple-130x87.jpg 130w\" style=\"border: 0px none; line-height: inherit; vertical-align: baseline; width: 400px; margin: 10px; float: right;\">\n<p>Our leadership team celebrated diversity with Wear It Purple day last year.</p>\n</div>\n\n<p>It&#x2019;s so important that our culture respects, values and actively pursues the benefits of diverse perspectives and insights. Not only is it the right thing to do, but it&#x2019;s integral to our success. It will allow us to fully unleash our true innovation capacity, support the excellence of our science and increase our delivery of impact for the nation. Without the right culture, strategy is just words on a page.</p>\n\n<p>Einstein was described as having no &#x201C;executive demeanour&#x201D;, but he said &#x201C;the definition of insanity is doing the same thing over and over again, but expecting different result&#x201D;. Having the courage to try new things knowing many will fail, is at the heart of modern leadership.</p>\n\n<p>So I was proud to see two years of CSIRO work through the&#xA0;<a href=\"http://www.sciencegenderequity.org.au/\">Science and Gender Equity (SAGE)</a>&#xA0;program result in a detailed Action Plan for CSIRO. SAGE takes an evidence-based approach to progressing gender equity; collecting and analysing organisational data across a range of key areas to identify the barriers to diversity.</p>\n\n<p>Our executive team will be reviewing the feasibility of the proposed actions this month &#x2013; but we will also be making sure the actions are bold, because we can&#x2019;t change our world without thinking different and must not do what we have done for years and expect to see different results.&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d595edfa-7e2d-42ef-92d1-da5ab745746c.jpeg\" style=\"margin: 10px; float: right;\"></p>\n\n<p>The actions range from significant changes, like equal periods of paid parental leave for all genders, aspirational targets, and meaningful diversity key performance indicators (KPIs) for leaders, through to smaller actions, like wearing diversity lanyards, rewriting our leadership courses, debating-free zones, practical strategies for how to work effectively in diverse teams, run inclusive meetings, and ensure that gender diversity work is done by all of us, not just women.</p>\n\n<p>We&#x2019;ll also be applying for entry level (Bronze) institutional accreditation with SAGE. And our SAGE project manager is even using aspects of this project to undertake her (second!) PhD, so we&#x2019;re drawing on our trademark scientific excellence to tackle the challenge.</p>\n\n<p>These steps are part of a long journey, and they must be in the forefront of our actions every day, not just on days of recognition. I&#x2019;m looking forward to joining CSIRO staff at our site-wide activities and celebrations today for International Women&#x2019;s Day, and continuing to work together so we can all press for progress.&#xA0;</p>\n\n<p>This post was originally published by&#xA0;<a href=\"https://blog.csiro.au/never-pressing-time-progress/\">CSIROscope.</a>&#xA0;</p>\n\n<hr>\n<h5><strong>About CSIRO</strong></h5>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9a621f96-faef-4269-bee5-83cd8b6ba56f.png\" style=\"font-size: 16px; float: right; margin: 10px; width: 200px; height: 200px;\"></p>\n\n<div>&#xA0;\n<p>WORK180 welcomed CSIRO to our list of #EndorsedEmployersforWomen in November 2017. With CSIRO, you&#x2019;ll use science to solve challenges and provide solutions. You&#x2019;ll enjoy a flexible working environment with all staff encouraged to embrace flex the way it works for them: job sharing, part time, flexible hours etc. Gain excellent development opportunities, scholarships, mentoring, financial study assistance, and the opportunity to represent CSIRO at national and international conferences and much more!</p>\n\n<p>Learn more about CSIRO on their <a href=\"https://www.work180.com.au/clients/csiro\">Best Employer page</a> &amp; apply for their jobs <a href=\"https://www.work180.com.au/job-search?client=csiro\">here.</a><a href=\"https://www.work180.com.au/job-search?client=csiro\">&#xA0;</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<hr>\n<h4><strong>About WORK180&#xA0;</strong></h4>\n\n<p>WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n</div>\n\n\t\t\t\t","tags":["women work","stem","gender equality","Celebrating my colleague Philippa Eggerton who has been with CSIRO for 15 years."],"upload_date":"2018/05","associated_companies":["work180"]}