{"url":"https://www.work180.com.au/blog/2016/10/id-love-to-get-a-mentor-how-do-i-find-one","title":"I’d Love to Get a Mentor, How Do I Find One?","author":"WORK180","body":"\n\t\t\t\t\t<p>Whether you&#x2019;re new to running a business or you&#x2019;ve been in this game for a while, you&#x2019;ll know the value of having a great sounding board! Here are some tips on how to find a mentor.</p>\n\n<p>Over the years, I have personally benefited hugely from the guidance of mentors. They&#x2019;ve proven invaluable from a professional development point of view and have helped greatly with expanding my networks. I passionately believe that everyone, no matter where they are at in their business journey, can benefit from the sounding board and advice that mentors provide. But I also know that being able to find a mentor who is suitable is something people really struggle with.</p>\n\n<p>With that in mind, I have five great tips on how to find a mentor:</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>1. Ask for one</strong></h4>\n\n<p>Crazy right? But as with anything in life, if you don&#x2019;t ask, you don&#x2019;t get. And you&#x2019;d be surprised at the number of people who&#x2019;d be flattered to be considered &#x2018;mentor material&#x2019;.</p>\n\n<p>If you have a mutual connection, ask that connection to introduce you. And when you ask, make it clear exactly why you feel they&#x2019;d be a good mentor for you, and what kind of commitment you are seeking from them (a monthly coffee catch up, the ability to run things past them via email or quick catch ups via social media).</p>\n\n<p>Just remember, the worst thing that could happen in this scenario is that they say no. But you just won&#x2019;t know if you don&#x2019;t ask. Well, worth the &#x2018;risk&#x2019; in my opinion and you may find a mentor this way.</p>\n\n<p>&#x201C;Look for a mentor outside of your field; for someone of the opposite sex; or for an individual who has a different background to yourself. &#x201C;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2. Join a mentoring program</strong></h4>\n\n<p>Many industries have formal mentoring programs you can join. There are also wider mentoring programs on offer for &#x2018;women in business&#x2019; or &#x2018;small business &#x2026; and there are many online mentoring programs out there too.</p>\n\n<p>These programs generally have a fee to join, but do your research, check out what people in the programs are saying about them, and determine whether they are worth it for you.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3. Shift into reverse</strong></h4>\n\n<p>The concept of &#x201C;reverse mentoring&#x201D; was popularised by Jack Welch, American business executive and former CEO of GE. Essentially reverse mentoring is when an older, more experienced professional is paired up with a younger person, (the younger person being the mentor).</p>\n\n<p>If you&#x2019;re operating in the online world, in particular, the younger crowd are energetic and often well ahead of the curve. They might provide you with much-needed inspiration as well as some insight into new ways of connecting with their generation.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>4. Go for diversity</strong></h4>\n\n<p>Look at ways to find a mentor outside of your field; for someone of the opposite sex; or for an individual who has a different background to yourself. Mentoring partnerships should not be limited to people who are similar to ourselves &#x2013;there is a lot we can learn from people who are different to us. This is particularly relevant if you are looking for advice on how to transfer your skill set to a new industry. Or perhaps you are trying into break into a new market. If you approach someone similar to you they might be your competitor &#x2013; go for someone different and gain some real insight!</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>5. Reciprocate &#x2013; offer to mentor someone yourself</strong></h4>\n\n<p>I recently volunteered to be a mentor for a program being offered through the university I graduated from 15 years ago. In turn, I was asked if I wanted a mentor myself. I was able to be both a mentor to a recent graduate and be mentored by a CEO in a market I was trying to break into. This was a wonderful experience. If more people offered to mentor others, I probably wouldn&#x2019;t need to write this post!</p>\n\n<p>So, go forth and seek out a mentor, and offer to mentor others along the way. Mentoring relationships will provide you with opportunities to learn and develop that you don&#x2019;t find within your own business while also extending your network and giving you insights you may never have thought of on your own.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>Originally posted on&#xA0;<a href=\"https://www.steelheels.com.au/\" target=\"_blank\">Steel Heels</a>. &#xA0;Find the original article&#xA0;<a href=\"https://www.steelheels.com.au/id-love-get-mentor-find-one/\" target=\"_blank\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2016/10","associated_company":"work180"}