{"url":"https://www.work180.com.au/blog/2017/05/job-hunting-done-right","title":"Job Hunting Done Right","author":"WORK180","body":"\n\t\t\t\t\t<p>The worst thing an employer wants to hear in an interview is you telling them the reason you are hunting for a new job is because you hate your old one...</p><p>Now they aren&apos;t dumb, they know if everything was glorious you wouldn&apos;t be sitting in front of them, but ideally - it should be because&#xA0;They&#xA0;are your dream company - and&#xA0;the job&#xA0;on the table is your ideal role. They want to hear that you have been looking for them like they have been looking for you. Because they have been looking, and it&apos;s been expensive, and they are about to invest a load of money in you - so you had better be the one.</p><p>Choosing who you work for, and the role you accept shouldn&apos;t be a careless task .</p><p>You should not be applying to everyone and willing to accept anything. If you do - neither you, nor the employer will be happy. This is a long term relationship you are committing to. You intend to give the employer more hours than you will give to your family. And they intend to compensate you for that with some significant dollars and other benefits.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/60a6f69b-3058-4acb-bc9d-2705ac5ace7f.png\">&#x200B;</p><p><strong>Find out what matters the most to you</strong></p><p>My most successful job hunts have been when I sat down first and did some real soul searching and decided what kind of company I wanted to work for. I drew a mind-map for each Company I would consider working at. I looked at Linkedin and studied each of the people I was connected to that worked at those companies. I looked at what they shared on social media. I read up about the Company, their products, their releases, their people.I asked myself;</p><p><strong>What type of people do I want to work with?<br>What type of role do I want to do?<br>What do I specifically like to do?<br>What am I passionate about?<br>What do I not like to do?</strong></p><p style=\"text-align:center\"><br></p><p>It&apos;s even easier these days to go deeper and find out more about a company. You can watch podcasts by the hiring manager. You can read blog posts by your potential team mates. You can go to events they will be attending (no it&apos;s not called stalking in a business context - it&apos;s networking, it&apos;s research). DCC also offer transparency of their employers on their website. You can&#xA0;<a data-cke-saved-href=\"http://www.diversecitycareers.com/bestemployers\" href=\"http://www.diversecitycareers.com/bestemployers\">find out what policies and support a company has in place&#xA0;</a>by looking at the workplace initiative grid (see example below) and it is placed at the end of each company profile. &quot;The information is not available anywhere else, not even Bing can give you these answers!&quot;</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/632753a1-8924-4ebb-a1b8-f05705cae2cb.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/632753a1-8924-4ebb-a1b8-f05705cae2cb.png\"></p><p>During this online journey - you should come to know the Company you are applying for really well. It should not be a surprise when you interview with them and you discover what they are really like. You should feel at home in those interviews - because you have researched and found a company that is perfect for you.</p><p>And when they offer you a job, you shouldn&apos;t be shocked - but you should be delighted... because at long last, you are coming home.</p><p><br></p><p>Michelle&#xA0;is one of our contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p><p style=\"text-align:center\"><br></p><h5><br></h5><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2017/05","associated_company":"work180"}