{"url":"https://www.work180.com.au/blog/2018/06/job-sharing-in-a-corporate-world","title":"Job sharing in a Corporate World?","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;<span style=\"font-size: 1.6rem;\">We sat down with two of&#xA0; Digital Marketing Executives at <a data-cke-saved-href=\"http://www.work180.com.au/clients/optus\" href=\"http://www.work180.com.au/clients/optus\">Endorsed Employer for Women Optus</a>, Bec&#xA0;and&#xA0;Julia, to learn their story of how they share a full-time job between the two of them. </span></p><blockquote><p><em><span style=\"font-size: 1.6rem;\">As we&#x2019;re starting to see a rise in job share roles and a shift towards flexible working, we thought&#xA0;we&#x2019;re share&#xA0;some of their insights as to what it&#x2019;s really like to job share in a corporate world.</span></em></p></blockquote><h4><strong>The story of Bec and Julia</strong><br></h4><p><strong></strong><strong></strong>Bec has been with Optus for 17 years, and Julia joined in 2012. Together, we share a full-time role working as a Digital Marketing Executive, particularly in the TV and Content space here at Optus. We&#x2019;d describe our role as being quite creative; whether it&#x2019;s pushing content in different ways or using different mediums to reach customers - every day is different.<br><br></p><h4><strong>How job sharing works</strong><br></h4><p>We&#x2019;re both seasoned job share experts, we&#x2019;ve been doing this for quite a while. Bec works Monday to Wednesday, and Julia works Wednesday to Friday. When we overlap on Wednesdays, it&#x2019;s our chance to do a proper handover and to work on projects together. We have a great system to keep projects&#xA0;organised&#xA0;and filed so that we can pick up projects when the other person isn&#x2019;t there.<br><br></p><h4><strong>Some tips for people looking to job share</strong><strong></strong><strong></strong><strong></strong><strong></strong><br></h4><ul><li>While we&#x2019;re both advocates for job sharing, we do recommend both people being really&#xA0;organised&#xA0;and strong communicators, this is critical for success.</li><li>It&#x2019;s important to set ground rules on how to operate together.</li><li>It&#x2019;s generally easier to pair up, then job search and interview for roles together. This is still quite a new concept for many managers, so being able to showcase the benefits and breaking down the logistics of how it would work is really important.</li><li>It works best if both professionals have the same experience and career ambitions.</li></ul><p><br></p><h4><strong>Tips for managers who&#x2019;ve never had a job share pair&#xA0;</strong><br></h4><p><strong></strong>You get two brains for the price of one! But in all honesty, you get a broader range of skills with one head count. The best part is we can bounce ideas off each other, plus, it&#x2019;s a great solution for people who want to work in a part-time role (which are often quite scarce in a corporate environment).<br><br></p><h4><strong>Our off-days</strong><br></h4><p><strong></strong>Both of us have children, so we just get each other. Working in a job share is a true&#xA0;work life&#xA0;balance because you have trust that the other person is holding down the fort when you&#x2019;re not there. It allows you to switch off.</p><p>On Bec&#x2019;s days off, she spends her spare time painting and doing graphic design. On the other hand, Julia does Reiki healing.</p><p>We are thankful to Optus for providing us with the opportunity to job share &#x2013; we look forward to seeing more flexibility initiatives roll out in the future.</p><p>Bec Moss and Julia Cox<br>Digital Marketing Executives</p><hr><h4><strong>Job</strong><strong> Share at an Endorsed Employer for Women!</strong></h4><p>WORK180 introduced &quot;Open to Job Sharing&quot; as a filter in the job search in 2017. Since then we&apos;ve seen an increased number of employers offering job sharing roles and seeing the benefits of doing so.&#xA0; Simply apply for a job share role on via the jobs board and the employer will handle the rest.&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/jobs/?custom_1=open-to-job-sharing\" href=\"https://www.work180.com.au/jobs/?custom_1=open-to-job-sharing\">Browse job sharing roles here.&#xA0;</a></p><hr><h3><strong>About Optus&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" style=\"float: right; width: 300px; height: 60px; margin: 10px;\"></a></strong></h3><p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p><p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p><p>Browse jobs with Optus and apply&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=optus\" href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p><hr><h3><strong>About WORK180</strong></h3><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Job Share","Career Development","job seeking tips","flexible working"],"upload_date":"2018/06","associated_company":"work180"}