{"url":"https://www.work180.com.au/blog/2018/09/kicking-diversity-goals-in-the-tech-industry","title":"Kicking diversity goals in the tech industry","author":"Optus Catalyst","body":"\n\t\t\t\t\t<p>Sam Mostyn got hate mail when she was appointed as the AFL&#x2019;s first female Commissioner. She also encountered negative responses from women. In the early days, she was sometimes seated at games with the wives of other commissioners and she often felt under a different kind of scrutiny because of her gender.</p>\n\n<p>With gender diversity coming to the fore of modern business environments, highlighted by the highly successful International Women&#x2019;s Day, we recently sat down with Sam to explore how she has helped shape a strong female presence within the AFL and what can be learned about breaking the &#x2018;boys&#x2019; club&#x2019; mentality.</p>\n\n<p>&#x201C;I&#x2019;d get these anonymous letters from men saying that my appointment was an abomination,&#x201D; she says. &#x201C;A number of very senior woman complained too, saying it should&#x2019;ve been an open process with men involved.&#x201D;</p>\n\n<p>This was 13 years ago as the AFL launched a push to integrate women into the future development of the game. Although there were a handful of women on club boards, there were no women in senior management or football departments. No pathway existed for female football players to represent an AFL club. Many talented teens deserted the sport and went to play basketball, netball or soccer. It was definitely a man&#x2019;s world.</p>\n\n<div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen frameborder=\"0\" height=\"370\" src=\"https://www.youtube.com/embed/UQlnb-fiIi0\" width=\"511\"></iframe></div>\n\n<p>Fast forward to today, two years after Mostyn finished an 11-year stint as Commissioner, and the game looks very different. We&#x2019;re now into the second season of the AFL Women&#x2019;s League. The number of women&#x2019;s clubs around the country has increased 100-fold since the national competition exploded onto the scene.</p>\n\n<p>Women are now represented on the boards of all of 18 AFL clubs. Richmond has appointed Peggy O&#x2019;Neal as its President. Women can be found in football departments and in more senior roles at the AFL. Young girls enthusiastic to find their feet in the game now have established role models for inspiration.</p>\n\n<p>There are clear lessons here for the technology industry, where the same boys&#x2019; club mentality is alive and well. Global industry leaders like Apple, Facebook, Google and Microsoft are all struggling to break the perception.</p>\n\n<p>The numbers speak volumes. Globally,&#xA0;<a href=\"https://www.cnbc.com/2017/05/22/women-take-up-just-9-percent-of-senior-it-leadership-roles-survey-finds.html\" role=\"link\">only 9 per cent of IT leaders were women</a>&#xA0;in 2017. In Australia, LinkedIn data from 2016 put that number at 14 per cent. But it&#x2019;s not just a game of percentages.</p>\n\n<p>In the #MeToo era, Silicon Valley is under increased scrutiny for its discriminatory attitudes towards women, the questioning of women&#x2019;s capabilities, harassment and, in its most extreme form, assault. So what lessons can be learned from the AFL example?</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>You&#x2019;ve got to start somewhere</strong></h4>\n\n<p>Mostyn&#x2019;s appointment was a deliberate decision by then AFL chairman, Ron Evans, to level the playing field. After inviting clubs to make female appointments of their own accord but finding they were reluctant, Evans invited 10 women to compete for a Commissioner&#x2019;s role.</p>\n\n<p>She&#x2019;s become a very vocal and high-profile advocate of targeted efforts to improve women&#x2019;s representation in traditionally male-dominated sectors. The way she sees it, it&#x2019;s not about doing away with merit in favour of quotas. It&#x2019;s about starting to undo the damage done by entrenched, unconscious biases.</p>\n\n<p>&#x201C;It was a classic quota appointment. We didn&#x2019;t go up against men but it was a very rigorous process,&#x201D; Mostyn says. &#x201C;Every quota appointment done well is based on merit. And if we&#x2019;d been living in a merit-based world, women would already be in these positions in big numbers.&#x201D;</p>\n\n<p>Getting that foot in the door was crucial to making the AFL the inclusive institution it is today and starting to build the talent pipeline. As a Commissioner, Mostyn became a powerful voice for women who played the game, giving them the chance to prove they could cut it at elite level, build a following and become role models for young girls playing grassroots footy.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Leading from the top</strong></h4>\n\n<p>Mostyn&#x2019;s appointment was the start of a long battle. Although she had the support of the AFL&#x2019;s senior leadership, convincing the clubs of her right to be involved was a whole other ball game.</p>\n\n<p>&#x201C;The Commission could see the need for women&#x2019;s input. It was in the broader football community that I was made to feel somewhat alien and like a bit of an outsider, or at best, a curiosity,&#x201D; she says.</p>\n\n<p>Now Commissioner of the Business and Sustainable Development Commission, Mostyn admits she had to fight to establish her credibility at the AFL by going above and beyond to deliver. Part of this involved bringing best practices from her broad experience across business sectors into the institution.</p>\n\n<p>Mostyn also made a point of seeking assurances that other female appointments would follow her own. That drive to create not just token female representation also holds a powerful lesson for tech. In the US,&#xA0;women working in science, technology, engineering and mathematics (STEM) are 45 per cent more likely than their male peers to leave the industry within their first year.</p>\n\n<p>Working with other women at board level helped Mostyn generate the focus, clarity and commitment needed to tackle a range of social and gender issues within the game. It was also pivotal in getting a national women&#x2019;s league established.</p>\n\n<p>But it&#x2019;s a fine balance. For women trying to find leadership positions in male-dominated sectors, it&#x2019;s critical to get involved in decisions that go far beyond the remit of women&#x2019;s issues.</p>\n\n<p>&#x201C;I engaged myself in everything to do with the game, not just the women&#x2019;s stuff. I was alive to the fact that there were certain things in the game that needed attention that hadn&#x2019;t been received simply because a woman hadn&#x2019;t been in the room,&#x201D; she says.</p>\n\n<p>Today, female involvement in the governance of the AFL Commission has been normalised. Its current crop of commissioners includes Simone Wilkie and Gabby Trainor.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Keeping an eye on the ball</strong></h4>\n\n<p>Even with these successes, Mostyn warns against complacency. Fears that the AFL could easily slip back into bad habits are amplified by what she sees in the broader business sector, where progress has stagnated. All too often, token female involvement at board level is put forward as evidence of a problem solved.</p>\n\n<p>&#x201C;It can&#x2019;t be a curiosity or a flash in the pan. It&#x2019;s going to require a huge amount of consolidation and the right commitment from the AFL to continue to build this in a sustainable way,&#x201D; she says.</p>\n\n<p>This means continuing to develop the physical infrastructure around the sport in a way that&#x2019;s welcoming for women and girls &#x2013; including female-friendly changing facilities &#x2013; and ensuring continued commitment to getting better media coverage for the women&#x2019;s games.</p>\n\n<p>In the technology industry, the lack of women in senior leadership positions does more than just perpetuate a male-dominated status quo. It&#x2019;s a matter of economic competitiveness that impacts everyone. Research has repeatedly shown that inclusive teams make better decisions.</p>\n\n<p>Recounting an anecdote about a group of male technologists unable to see the value of an application helping women manage their contraceptive pill regime, Mostyn says: &#x201C;Missing out on this market opportunity by failing to have women at the table showed the absurdity of the situation.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Daring to dream</strong></h4>\n\n<p>So why is tech an offender when it comes to gender equality? The primary answer to this question may well lie outside of the sector, in how the education system treats girls before they even get to the age where they&#x2019;re choosing a degree or looking for a job. At an age where lifelong expectations are set, too many girls are still being told that they&#x2019;re not naturally suited to maths, technology and science.</p>\n\n<p>Mostyn was thrilled to meet tennis legend Billie Jean King recently, finding the story of her early ambition to become world number one fascinating. For Mostyn, the takeaway was that the messages you receive in childhood are so formative.</p>\n\n<p>&#x201C;I asked her how she could&#x2019;ve known at the age of 12 that she wanted to be world number one in tennis,&#x201D; she says. &#x201C;She said that she had no idea at the time that it was a big statement.</p>\n\n<p>&#x201C;Her parents took her to those tournaments to see the top players, so she knew what &#x2018;number one&#x2019; looked like and went for it. We&#x2019;ve got to show young women what they can be whether they want to make an impact in sport, technology or any other chosen field.&#x201D;</p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong><a href=\"https://www.work180.com.au/clients/optus\" style=\"color: rgb(115, 207, 236); outline: 0px !important;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" style=\"float: right; width: 150px; height: 30px; margin: 10px;\"></a></strong></h4>\n\n<p>This post was originally published by <a href=\"https://www.optus.com.au/enterprise/accelerate/culture/kicking-diversity-goals-in-the-tech-industry\">Optus.&#xA0;</a></p>\n\n<h4>&#xA0;</h4>\n\n<h4><strong>About Optus&#xA0;</strong></h4>\n\n<p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p>\n\n<p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page&#xA0;<a href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p>\n\n<p>Browse jobs with Optus and apply&#xA0;<a href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;&#xA0;</p>\n\n\t\t\t\t","tags":["Sport & Recreation","diversity"],"upload_date":"2018/09"}