{"url":"https://www.work180.com.au/blog/2015/09/ladies-enough-with-the-apologies","title":"Ladies - Enough with the apologies!","author":"WORK180","body":"\n\t\t\t\t\t<p>We are women, hear us roar.&#xA0;</p>\n\n<p>Some days.</p>\n\n<p>Other days, well, you might hear us apologising for our opinion before we&#x2019;ve even voiced it, second guessing our decisions, doubting our capability, feeling undervalued but unwilling ask for what we want, or tip toeing around issues so as not to rock the boat.</p>\n\n<p>Okay, that&#x2019;s pretty harsh, I admit. There are plenty of women who don&#x2019;t shy from saying what they think (much less apologising for it), advocating for themselves and making bold requests. But from where I stand, there are many more who aren&#x2019;t. &#xA0;Smart women. Accomplished women. Fabulous women.&#xA0; Women like me and, perhaps, women like you also.</p>\n\n<p>Women have an immense amount to contribute to the world. &#xA0;Perceptive, compassionate, and collaborative, we make highly effective leaders with a huge capacity to manage the multiple priorities and intense demands leadership involves. &#xA0;Indeed a recent Harvard Business Review study found that a business group&#x2019;s collective IQ went up when there are women on the team. Closer to home in our local communities, we&#x2019;re creative, quick to lend a hand, thoughtful about how our actions impact group dynamics and sensitive to unspoken concerns.</p>\n\n<p>What&#x2019;s not to love?!</p>\n\n<p>Yet we often do ourselves - and others - a profound disservice by doubting ourselves too much and backing ourselves too little. &#xA0;We worry people will realise we <ins>aren&#x2019;t near</ins> as clever or capable as they thought. In the process, we undermine our ability to influence the change we want to make, and to stand our ground with those who may be threatened by our power.</p>\n\n<p>In <em>The Language of Female Leadership</em>, Dr Judith Baxter wrote about her study of how language is used in senior executive and boardroom meetings to understand power patterns. Focusing on the differences between how women and men use language, she identified a specific type of &#x2018;out-of-power&#x2019; language that women were more prone to use. This included what she called &#x2018;double-voice discourse&#x2019; which occurs when the speaker prejudges the audience&#x2019;s response (to be a negative one) and qualifies their initial statement accordingly. For instance,<em> &#x2018;Correct me if I&#x2019;m wrong &#x2026;&#x2019;</em> or <em>&#x2018;I know I&#x2019;m not the ultimate expert on this &#x2026;</em>&#x2019; Dr Baxter found that women were four times more likely to use double-voice discourse than their male counterparts.</p>\n\n<p>Certainly in my own corporate career and later coaching leaders around the globe, I&#x2019;ve found that women are far more likely to apologise if they think their opinion may contradict someone else&#x2019;s. &#xA0;I put this down largely to the fact that while we are brilliant at forging connections, we are reticent to say anything that may damage them.</p>\n\n<p>While writing Stop Playing Safe, I interviewed numerous successful women leaders. Every one of them shared a similar sentiment about the need for women to step into their power and be braver in going for what they want and making a stand for what they don&#x2019;t.&#xA0; Lori Garver, Deputy Director of NASA where I have run numerous leadership programs shared how vital it is for women not to allow themselves to be intimidated by other people, whether they be men or even other women in more senior roles.</p>\n\n<p><em>&#x201C;I share candidly and while sometimes my candour is difficult for people to hear, they have come to respect that I&#x2019;m open, upfront and transparent,&#x201D; </em>Lori shared as she reflected on her time leading a significant restructure at NASA. &#x201C;<em>When people can trust that you&#x2019;re not going to say one thing and then do another, it sets the stage for greater collaboration and better bottom-line results for the organisation.&#x201D;&#xA0; </em>Certainly to grow our influence and enjoy greater success we have to realize that it&#x2019;s more important to be respected that to be liked.</p>\n\n<p>Having more women in positions of power isn&#x2019;t just good for women; it&#x2019;s good for everyone. Yet while many external obstacles still exist for women, often the biggest one we face is in our own heads. Sure, unconscious bias and overt sexism can work against women in the workforce, but how women express themselves can undermine how they&#x2019;re perceived in terms of their ability to catalyse change, stand up to misogyny and lead effectively. &#xA0;</p>\n\n<p>For more women to move into senior positions of influence we need own the difference our difference makes, stop apologising for our opinions, second-guessing our decisions and underestimating the unique value we have to contribute.</p>\n\n<p>To own our power we don&#x2019;t need to be more like men. We simply need to be more ourselves. &#xA0;Strong. Capable. Creative. Brave.</p>\n\n<p>There&#x2019;s no better place to start that than by paying attention to what we say and how we say it.&#xA0; &#xA0;As more women start owning their power, our communities, organisations and society will benefit in ways that will serve everyone&#x2026;&#xA0; including the men, brothers, fathers and sons (including the four in my home) that we share our lives with.</p>\n\n<p>So enough with the apologies that undermine your value before you&#x2019;ve even shared it. It&#x2019;s past time we truly started to roar - not to scare, nor to intimidate, but because what we have to say needs to be heard.</p>\n\n<p>&#xA0;</p>\n\n<p>Margie<em> </em>is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.&#x200B;<em> </em></p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2015/09","associated_company":"work180"}