{"url":"https://www.work180.com.au/blog/2017/11/leading-to-inspire-strong-women","title":"Leading To Inspire Strong Women","author":"WORK180","body":"\n\t\t\t\t\t<p>Congratulations to DCC Endorsed Employer for Women <a href=\"https://www.dccjobs.com/clients/rabobank\" target=\"_blank\">Rabobank&apos;s</a> marketing manager <a href=\"https://www.linkedin.com/in/genevieve-mcaulay-175a4916/\" target=\"_blank\">Genevieve McAulay,</a> who&#xA0;was awarded a prestigious leadership award at the 2017 Queensland Rural, Remote and Regional Women&#x2019;s Network (the Network) gala dinner.</p>\n\n<p>Genevieve won the Leadership category of the 2017 Strong Women Leadership Awards in recognition of her role in promoting rural journalism. She kindly shared her reflections on what the prize meant to her.&#xA0;</p>\n\n<hr>\n<p>When I was a young girl living on my family&apos;s sheep property, a long way from major cities, I had two dreams&#xA0;&#x2013; one was&#xA0;to be the first female Prime Minister (that&#x2019;s gone now as Julia Gillard beat me to it) the second was to&#xA0;become a journalist and change the world. My dad would always say one person cannot change the world, and while it frustrated me then, I get it now, you need a leader with a collective of those who share your passion.</p>\n\n<p><img alt=\"Rabobank \" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d5f7a875-cd6a-4dc0-9802-3e7683ca8bce.jpeg\" style=\"float: right; margin: 10px;\">Last week I was honoured to receive the&#xA0;<strong>&#x2018;Leadership Award&#x2019;</strong>&#xA0;in the&#xA0;<em>Queensland Rural Regional and Remote Women&#x2019;s Network (QRRRWN) Strong Women Leadership Awards</em>&#xA0;at this year&#x2019;s State&#xA0;conference.</p>\n\n<p>Being put in the category of &#x2018;leader&#x2019; made me begin to think about what it means to be a leader, and more importantly as the recipient of this award what responsibility does that now bestow on me.</p>\n\n<p>John Quincey Adams said:</p>\n\n<blockquote>\n<p>&#x201C;If your actions inspires others to dream more, learn more, do more and become more, you are a leader.&#x201D;</p>\n</blockquote>\n\n<p>My recognition for this award has come more from what I do outside of my current profession,&#xA0;yet the knowledge and skills&#xA0;I developed from marketing&#xA0;was easily transferable and an added advantage. &#xA0;As a former journalist with a passion for agriculture and rural media, I was mentored on to the Rural Press Club Qld by the then president Jane Milburn. No longer able to influence with my pen after stepping into a corporate marketing role, this allowed me to be part of a dynamic committee that helped ignite debate and bring the issues of agriculture to the forefront.&#xA0;</p>\n\n<p>After&#xA0;five years on the committee,&#xA0;three as President, I received a life membership being only the seventh person in the clubs 40 year history.&#xA0;I was described at the time as being an icon and the creator and driving force behind many of the club&#x2019;s most successful and innovative programs.</p>\n\n<p>Today I am still giving my time freely to not for profits, in my fourth term as President of the Australian Council of Agricultural Journalists (ACAJ), the umbrella group for the nations&apos; State Rural Press Clubs. Again I am flanked by a committee of people who share my passion for agriculture and value relationships.&#xA0;&#xA0;They too, all leaders in their field and like me have chosen to give back, driven by a desire to make a difference.</p>\n\n<blockquote>\n<p>So that brings me to women in leadership &#x2013; when people think about leaders or someone to follow, do they see this person as non-gender specific? &#xA0;Or does society still hold those misogynist views that men make the best leaders and if this is true how do we make sure our daughters and our granddaughters don&#x2019;t face this inequality.</p>\n</blockquote>\n\n<p>Personally, like most women who have been in the workforce for a number of years,&#xA0;I have experienced gender&#xA0;inequality in the work place.&#xA0;I do think the world is changing and diversity in gender at least is being embraced by both corporate and private businesses.&#xA0;But it is still disheartening to learn that on average women earn $250 per week less than men.&#xA0;Which is a staggering $13,000 per year.&#xA0;Currently due to women&apos;s previous roles, with little or no superannuation, there is a new trend that women over 60 are becoming the new homeless.</p>\n\n<p>Despite efforts by the Queensland Government with its Office of Women and push for more women on boards there is still a disparity.&#xA0;Yet new research has shown that those boards who do champion gender diversity are 30 pc more profitable.</p>\n\n<p>As women many of us suffer from the &#x2018;imposter syndrome, or we put others before us.&#xA0;I am a great believer in mentoring, I have been inspired and assisted in my career by some amazing women.&#xA0;I also try to give my time freely mentoring others if someone reaches out to me, or if I see an opportunity to offer assistance.</p>\n\n<p>So to all women (and men)&#xA0; when you are at work this week if you have a female colleague that&#x2019;s doing a good job &#x2013; please tell her. Or on the flipside if you have a colleague who you think may be struggling &#x2013; help her.&#xA0;And for yourself if you are saying I don&#x2019;t have enough time to chase my passion and to do something for myself &#x2013; make the time, because you are as important as everyone else.&#xA0;</p>\n\n<p>And to my dad who is no longer with us &#x2013; I may not have changed the world, but I hope I have at least left a small dent.</p>\n\n<hr>\n<h4><strong>About the award&#xA0;</strong></h4>\n\n<p>QRRRWN&#x2019;s Strong Women Leadership Awards program exists to identify, acknowledge and applaud the leadership strengths of Queensland rural, regional and remote women. It recognises the women who are the invisible threads holding their local communities together and connecting them with the wider world. There are also several categories specifically focused on younger women, those still emerging and developing their leadership interests and capacities.</p>\n\n<h4><strong>About Rabobank&#xA0;</strong></h4>\n\n<p><a href=\"https://www.dccjobs.com/clients/rabobank\" target=\"_blank\">Rabobank Australia &amp; New Zealand Group</a> is a part of the global Rabobank Group, the world&#x2019;s leading specialist in food and agribusiness banking. Rabobank has nearly 120 years&#x2019; experience providing customised banking and finance solutions to businesses involved in all aspects of food and agribusiness. Rabobank is structured as a cooperative and operates in 40 countries, servicing the needs of approximately 8.6 million clients worldwide through a network of more than 1000 offices and 94 branches throughout Australia and New Zealand. Rabobank Australia &amp; New Zealand Group is one of Australasia&#x2019;s leading agricultural lenders and a significant provider of business and corporate banking and financial services to the region&#x2019;s food and agribusiness sector.</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Celebrating Women","gender equality"],"upload_date":"2017/11","associated_company":"work180"}