{"url":"https://www.work180.com.au/blog/2017/08/leaders-does-your-workplace-work-for-women","title":"Leaders: Does Your Workplace Work for Women?","author":"WORK180","body":"\n\t\t\t\t\t<p style=\"text-align:justify\">Jeff Immelt has some&#xA0;<a href=\"http://www.afr.com/business/lessons-from-jeff-immelt-on-why-people-are-turning-against-business-20170625-gwyec8#ixzz4l5AX5Ec9\" target=\"_blank\">advice</a>&#xA0;for the next generation of corporate leaders:&#xA0;<em>&#x2018;</em><em>spend more time in factories and less in Davos.&#x2019;&#xA0;</em>Immelt, CEO of General Electric, is challenging business leaders to get out of their ivory towers and get back in touch with the needs of their people and customers at ground level. He is claiming that business leaders have become distant from the needs of the &#x2018;real people.&#x2019;</p>\n\n<p style=\"text-align:justify\">I don&#x2019;t dispute that those who occupy the C-suite are busy (although I&#xA0;<a href=\"https://michelleredfern.com/2017/05/13/why-i-want-to-start-a-banbusy-movement/\" target=\"_blank\">loathe</a>&#xA0;the term busy). However I&#x2019;d question what they are busy doing if scandals such as those at&#xA0;<a href=\"http://www.abc.net.au/news/2017-06-21/uber-ceo-travis-kalanick-resigns/8639386\" target=\"_blank\">Uber</a>,&#xA0;<a href=\"http://fortune.com/2017/05/11/fox-news-45-million-sexual-harassment/\" target=\"_blank\">Fox News</a>, &#xA0;<a href=\"http://www.heraldsun.com.au/news/law-order/channel-7-sex-scandal-seven-west-media-ordered-to-mediate-amber-harrison-case-after-ceo-affair/news-story/851bed1bd8f231d74b39d21d0998f25f\" target=\"_blank\">Channel 7</a>,&#xA0;<a href=\"http://www.afr.com/business/accounting/calls-for-cpa-board-to-step-down-over-alex-malley-49m-payment-20170625-gwy0k5\" target=\"_blank\">CPA</a>&#xA0;Australia and the&#xA0;<a href=\"http://www.afr.com/leadership/workplace/exunion-boss-kathy-jackson-faces-164-charges-20170619-gwtxfi\" target=\"_blank\">Health Services Union</a> can go undetected, unnoticed or are swept under the carpet. Particularly when, in the case of Uber, Fox News and Channel 7, the transgressions are related to sexual misconduct and assault against women. Are those in the C Suite asleep at the switch? Or are they just not aware of the organisation they are really in charge of?</p>\n\n<p style=\"text-align:justify\">&#xA0;</p>\n\n<h4><span style=\"color:#a87eb1\"><strong>Culture eats strategy for breakfast every day</strong></span></h4>\n\n<p style=\"text-align:justify\">Peter Drucker got it right. &#xA0;Cultures does eat strategy for breakfast every day. Assuming it&#x2019;s the&#xA0;right&#xA0;culture. Because of course, culture is &#x2018;the way we do things around here,&#x2019; Imagine being a woman working at Uber, Fox and Channel 7? No thanks! Back to Jeff Immelt. His theory, which I agree with, is that business leaders are not aware enough of what it&#x2019;s like for workers in their organisation, because they are too distant from the coal face.</p>\n\n<p style=\"text-align:justify\">Leaders can be too distant, or delegate too much of their accountability for the issues that affect women. In her book,&#xA0;<a href=\"https://www.newsouthbooks.com.au/books/stop-fixing-women/\" target=\"_blank\">Stop Fixing Women</a>, Catherine Fox interviewed Martin Parkinson who was (then) head of Australian Treasury. Parkinson had commissioned an external review of Treasury to understand why women were not advancing. The output of the review was, predictably, poor and Parkinson was quoted saying to a colleague &#x2018;<em>we are not leading the organisation we thought we were</em>.&#x2019;</p>\n\n<p style=\"text-align:justify\">&#xA0;</p>\n\n<h4><span style=\"color:#a87eb1\"><strong>How did that happen?</strong></span></h4>\n\n<p style=\"text-align:justify\">I have observed this same behaviour in my many years in corporate Australia and now, in my gender diversity consulting work. I recall in the not so distant past presenting a visual diagram of the gender diversity statistics for every level in my organisation to a group of my predominantly male colleagues. Of the 5 levels represented, only the first (entry) level was balanced, the rest became progressively unbalanced, with the most senior level having only 11% female (which including me, was 2 women!) Two reactions from my colleagues surprised me. The first was &#x2018;how did that happen?&#x2019; The second was &#x2018;I had no idea!&#x2019; It was a #facepalm moment, but also an illuminating and defining one for me. I realised, that despite all the HR managers, HR systems, mandatory reporting, employee engagement surveys, unconscious bias training and the list goes on, that leaders were simply not in touch with what it was like to be a woman working in their organisation. They were not focussing on the metrics that matter to advance women.</p>\n\n<p style=\"text-align:justify\">&#xA0;</p>\n\n<h4><span style=\"color:#a87eb1\"><strong>What Great Leaders Do</strong></span></h4>\n\n<p style=\"text-align:justify\">Leaders, if your organisation was burning cash, had declining market share, had ballooning costs, you would take accountability, step in, understand the root cause, undertake remediation activity and begin the journey to set things right. Right? The same goes for creating an inclusive culture where women in your organisation can participate to their fullest potential and advance to more senior roles.&#xA0; Just like the head of Australian Treasury did, you need to ask yourself these difficult questions:</p>\n\n<ol>\n\t<li>Am I really leading the organisation I think I&#x2019;m leading? (how do we really do things around here?)</li>\n\t<li>Where are the women in my organisation structure? (junior, senior, in HR or shared services roles or running customer facing, P&amp;L businesses?)</li>\n\t<li>Does my workplace &#x2018;work&#x2019; for women? (If not, why not?)</li>\n\t<li>What resources (human &amp; financial) have I allocated to gender diversity initiatives? (And how many of the human resources are non-HR?)</li>\n\t<li>Who do I hold accountable to ensure women are advancing at the same rate as men?&#xA0;(Do I have gender targets or quotas at every management level?)</li>\n</ol>\n\n<p>&#xA0;</p>\n\n<h4><span style=\"color:#a87eb1\"><strong>I don&#x2019;t need to quote any more statistics</strong></span></h4>\n\n<p style=\"text-align:justify\">I don&#x2019;t need to quote any more statistics, however, I will. Global gender parity is 170 years away at the current&#xA0;<a href=\"http://www.ey.com/gl/en/issues/business-environment/women-fast-forward?utm_campaign=WFFlaunch&amp;utm_source=eycomPF&amp;utm_medium=web\" target=\"_blank\">rate</a>. Your organisation is foregoing revenue increases of up to&#xA0;<a href=\"https://www.forbes.com/sites/jackzenger/2017/06/22/3-reasons-to-recruit-and-select-more-female-leaders/#51158e6730b4\" target=\"_blank\">41%</a>&#xA0;if you don&#x2019;t do something about advancing women in your workplace. If that is not compelling you to act, then you may be headed the same way as some of the not so illustrious leaders of the companies at the start of this article!</p>\n\n<p style=\"text-align:justify\">I help business leaders and organisations begin their gender diversity journey, where it needs to begin, at the beginning! By diagnosing the status quo, I enable inclusive leaders to understand exactly what type of organisation they are leading, what the actual experience is for women in their workplace and how to develop strategies and tactics to build an inclusive, gender balanced workplace.</p>\n\n<p style=\"text-align:justify\">&#xA0;</p>\n\n<h5><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/08","associated_company":"work180"}