{"url":"https://www.work180.com.au/blog/2018/07/learning-is-an-experiential-journey-not-just-a-destination","title":"Learning is an experiential journey, not just a destination","author":"WORK180","body":"\n\t\t\t\t\t<p>Today I celebrated being a #deakingrad, receiving my law degree at Deakin University&apos;s Waterfront campus; almost 10 years since I started this learning journey.</p><blockquote><p><big><em>&apos;Wow, it took you 10 years to finish a law degree?!?&apos; I hear you say? Indeed, it took me 10 years to study law.</em></big></p></blockquote><p>And in that time, life (in all its volatility, uncertainty, complexity and ambiguity) happened - I uprooted home and moved interstate; I got married, had three kids and one angel baby; I side-shifted my career from a legal path and into the learning and development industry.</p><p>So whilst my polished graduation picture looks like this:</p><p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/247031ee-3827-4b50-be98-a56d8f048507.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/247031ee-3827-4b50-be98-a56d8f048507.jpeg\" style=\"margin: 10px;\"></p><p>What my graduation &apos;behind-the-scenes&apos; really looked like was this:</p><p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d09d38b7-420d-42ff-b4af-d9a01f7fa4d7.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d09d38b7-420d-42ff-b4af-d9a01f7fa4d7.jpeg\" style=\"margin: 10px;\"></p><blockquote><p><big><em>Messy? Yes. Complicated? Definitely. Uncertain? I can never predict what my three young kids will throw at me next (figuratively and literally!).</em></big></p></blockquote><p>But I wouldn&apos;t have my V.U.C.A life any other way.</p><ul><li>I&apos;ve learnt more than I anticipated along the journey and beyond the intended outcome of attaining my Bachelor of Law:</li><li>I&apos;ve learnt that my body is capable of amazing things when pushed out of my comfort zone - I&apos;ve sat through and passed 3 hour exams whilst 9 months pregnant (more than once!);</li><li>I&apos;ve learnt the importance of effective time management, especially when juggling work deadlines with assignment due dates and family commitments;</li><li>And while I&apos;ve learnt the importance of effective time management, it doesn&apos;t mean that I&apos;ve perfected the art of it - so when I&apos;ve failed dismally at trying to juggle everything at once and ended up a crying mess on the floor, I&apos;ve learnt to appreciate the awesome support I have in my family (special kudos to my husband, who pushed me when many a time I was on the verge of quitting);</li><li>I&apos;ve discovered that there are employers and educational institutions out there who have embraced flexible working and learning. For me, this has been an extra layer of support, being able to study and work flexibly.</li></ul><p>So today marks a significant outcome for me; one that I&apos;ve been working towards for a decade. And I know it&apos;s not the end; it&apos;s another step in a new direction in my learning journey.</p><p>I look forward to the next step I take towards my next destination.</p><hr><h4><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/624edddf-2dc3-47ec-b7a0-b26983d16407.png\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/624edddf-2dc3-47ec-b7a0-b26983d16407.png\" style=\"float: right; margin: 10px; width: 200px; height: 166px;\"></strong></h4><h4><strong>About</strong><strong> the author&#xA0;</strong></h4><p>Maria Zambrano is an Instructional Designer at <a data-cke-saved-href=\"https://www.work180.com.au/clients/cbus\" href=\"https://www.work180.com.au/clients/cbus\">Cbus Super Fund</a>.&#xA0; She is a Learning &amp; Development professional and certified ScrumMaster, with experience in concept-to-implementation of learning solutions, servicing both the public and private sectors of the finance and insurance industry. She is now also a proud law graduate!&#xA0;</p><p>Cbus is an Endorsed Employer for Women and Flex Able Certified. Cbus has become known for offering flexible working beyond the ordinary. Which also lead them to win the prestigious AHRI award for flexible working in 2017!<span style=\"font-size: 1.6rem;\">&#xA0;&#x200B;</span><a data-cke-saved-href=\"https://www.work180.com.au/clients/cbus\" href=\"https://www.work180.com.au/clients/cbus\" style=\"font-size: 1.6rem; background-color: rgb(255, 255, 255);\">Learn more on their Best Employer page.&#xA0;</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/07","associated_companies":["work180"]}