{"url":"https://www.work180.com.au/blog/2018/07/lessons-i-learnt-the-hard-way","title":"Lessons I learnt the hard way","author":"WORK180","body":"\n\t\t\t\t\t<p>I&apos;ve worked in Financial Markets for seventeen years. It is varied, fast-paced and, yes, male-dominated. I&apos;ve lived in Sydney, London and New York; I&apos;ve worked in trading and sales roles; I&apos;ve met some of my best friends along the way. If you had mapped out those highlights to me as a graduate I would have signed up to work for free, but you&apos;d be missing half the story.&#xA0;I learnt a lot of lessons the hard way and most of them took me longer to learn than I&apos;d care to admit. Hopefully by sharing some of them here I can save you some time.&#xA0;</p><h4><strong>Play to Your Strengths</strong></h4><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/bd578645-42ae-455e-ab05-f054cc821a91.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/bd578645-42ae-455e-ab05-f054cc821a91.jpeg\" style=\"font-size: 16px; float: right; margin: 10px;\"><div><p>It&#x2019;s tempting to think that the key to career progression is overcoming your weaknesses, but walking out of a career planning session thinking about what I can&apos;t do or what I&apos;m not good at leaves me deflated and overwhelmed. It is much more productive for me to leverage my strengths rather than try to fix my shortcomings. Plus, people who use their strengths every day are <u><a data-cke-saved-href=\"http://news.gallup.com/businessjournal/167462/employees-strengths-company-stronger.aspx\" href=\"http://news.gallup.com/businessjournal/167462/employees-strengths-company-stronger.aspx\" target=\"_blank\">six times more likely to be engaged</a></u> on the job. You can use a tool like <u><a data-cke-saved-href=\"https://www.gallupstrengthscenter.com/\" href=\"https://www.gallupstrengthscenter.com/\" target=\"_blank\">CliftonStrengths</a></u> to identify your strengths and, crucially, to get some tips on how to build on them.</p><p>My number one theme is communication, so how do I build on that in my role? I&#xA0;host client breakfasts to share insights on foreign exchange and foster dialogue between clients; I revamped our team&apos;s email communication to make our product explanations easier to understand; I publish weekly articles on LinkedIn to share what I&#x2019;m reading. I&apos;m&#xA0;playing to my strengths and enjoying my role more because of it.&#xA0;</p><p><br></p><h4><strong>Side Projects Have Side Benefits</strong></h4><p>Ticking off all your KPIs is great (and you should do that!) but if you want to progress your career, taking on a side project really opens doors. I spent a couple of years looking after our Markets graduate cohort and boy did I learn a lot. I gained a greater understanding of the talent management process, I&#xA0;delivered&#xA0;my first tough people leader conversation, I regularly presented to the executive team and I forged new relationships with colleagues in Rates, Treasury and HR.&#xA0;</p><p>Taking on extra responsibilities gives you ownership over business outcomes, naturally builds your network and demonstrates your leadership skills. By increasing your visibility and practising your strategic business skills you&#xA0;build a base for your next career move. For me, a side project can also be an energiser in my day-to-day role, as the thrill of contributing to something new and different has energy spillover effects.&#xA0;</p><p>In a world where organisations are increasingly moving towards a decentralised leadership model (hello, agile!), don&#x2019;t wait for a side project to be assigned by your manager. If you see an opportunity to make a difference or fix a problem, go for it!&#xA0;Don&apos;t ask for permission; ask for support instead.&#xA0;</p><h4><br></h4><h4><strong>Speak Up Before You Are Fed Up</strong></h4><p>There have been times when I felt like my career was stuck; when the next step wasn&#x2019;t clear; when my contribution wasn&#x2019;t valued. My advice? Speak up sooner than I did.&#xA0;</p><p>I was overlooked for a promotion in&#xA0;a year I had outperformed. I wasn&apos;t considered for a key opportunity and didn&apos;t even know it existed until too late. Both times I got to a point of maximum frustration before speaking up and the response was, &#x201C;Why didn&#x2019;t you come to us on this earlier?&#x201D; By speaking up constructively you can make sure your expectations are aligned with your employer&#x2019;s and clarify the path forward.</p><p>Even better, to avoid getting to breaking point in the first place, take control of your own career path. I&#x2019;m not one for five-year plans so I try to think in manageable steps. Ask yourself what your next role could look like. What can you do now to position yourself for it?&#xA0;Then, and this is where the &quot;speak up&quot; bit comes in, explicitly ask for support in reaching your goals. You, not your manager, need to drive regular&#xA0;personal development conversations because they aren&apos;t going to magically happen otherwise. Ask for advice (<u><a data-cke-saved-href=\"https://www.scientificamerican.com/article/asking-advice-makes-a-good-impression1/\" href=\"https://www.scientificamerican.com/article/asking-advice-makes-a-good-impression1/\" target=\"_blank\">it makes you look smarter!</a></u>), define measurable milestones,&#xA0;make sure you are clear on what success looks like so you can shout it from the rooftops when you achieve it and ask for introductions to people who could help you. No-one is going to be as invested in your career as you are, so you have to be the person to drive it.&#xA0;</p><p>Careers can be messy and probably will be. I still make mistakes; lots of them. All I can hope is that I continue to learn from them and it&apos;s even better if you can too.&#xA0;&#xA0;</p><hr><h4>About the Author</h4><p>Adrienne Neilson is a Director of Currency Solutions at ANZ. She works with a diverse range of corporations to tailor FX solutions that support their broader business goals. In more than 15 years in institutional foreign exchange, Adrienne built up her technical expertise in trading roles in Sydney, London and New York and now enjoys applying that knowledge with her clients. Adrienne is an enthusiastic experimenter in all things productivity, engagement and professional self-improvement.<br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/07","associated_companies":["work180"]}