{"url":"https://www.work180.com.au/blog/2018/07/Lessons-from-a-hero-malala-day","title":"Lessons from a hero","author":"WORK180","body":"\n\t\t\t\t\t<p>On October 9th 2012, 15-year-old Malala Yousafzai was shot in the head by the Taliban. She was targeted because she campaigned for the rights of Pakistani girls to go to school, in defiance of their attempts to outlaw education for girls. Malala survived and is now one of the most recognized and vocal change-agents when it comes to securing girls&#x2019; education rights.</p>\n\n<p>On her 16th birthday, The United Nations declared July 12 as Malala Day. &quot;My birthday wish this year is that we all raise our voices for those under oppression, to show our own power and courage is stronger than their campaign of fear&quot;.</p>\n\n<p>On her milestone 21st birthday, we celebrate Malala, her fearless campaigning and the lessons she has taught us.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>We need to be our own heroes</strong></h4>\n\n<p>&#x201C;There was a time when women social activists asked men to stand up for their rights. But, this time, we will do it by ourselves&#x2026; I am focusing on women to be independent to fight for themselves.&#x201D; &#xA0;Malala is from a community where women&apos;s opinions and skills are threatened and deemed meaningless. She has proven that girls rights are human rights and that women need to support women. Malala stresses the point that we cannot all succeed when half of us are held back.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Speak up &amp; advocate</strong></h4>\n\n<p>&#x201C;I tell my story, not because it is unique, but because it is not. It is the story of many girls.&#x201D; Malala speaks up for marginalised women and girls around the world and encourages us to do the same. Voicing your opinion is a right that we take for granted. It is crucial that we raise our voices by sharing our thoughts, ideas and passions. Activists such as Malala take tremendous risks when speaking up and fighting for what they believe in. We can never allow our voices to be silenced. &#x201C;When the whole world is silent, even one voice becomes powerful.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Education is freedom</strong></h4>\n\n<p>&quot;The extremists are afraid of books and pens. The power of education frightens them. They are afraid of women. The power of the voice of women frightens them.&quot;&#xA0;We forget that education is an essential human right and that freedom is a luxury.&#xA0;We need to be thankful that we have access to schools, books and teachers. Education is a tool that destroys poverty and is vital in the fight for women&apos;s rights.&quot;In Pakistan when women say they want independence, people think this means we don&apos;t want to obey our fathers, brothers or husbands. But it does not mean that. It means we want to make decisions for ourselves. We want to be free to go to school or to go to work. &#x201C;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Do something</strong></h4>\n\n<p>Malala teaches us not to focus on the circumstances in our lives that we cannot control. As long as we use our voice and appreciate the power of our mind, we can break down barriers and achieve the unachievable. &#x201C;They thought a bullet would silence us, but they failed. Nothing changed in my life except this: Weaknesses, fear and hopelessness died. Strength, power and courage was born.&#x201D;</p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["Malala Day","Celebrating Women"],"upload_date":"2018/07","associated_companies":["work180"]}