{"url":"https://www.work180.com.au/blog/2015/07/life-at-thoughtworks-saras-story","title":"Life at ThoughtWorks - Sara's story","author":"WORK180","body":"\n\t\t\t\t\t<p>We recently had the pleasure of chatting to Sara, who in her own words, found her dream job on DCC!&#xA0; Meet Sara Borgstrom, Business Analyst Consultant at ThoughtWorks/ Surfer Extraordinaire. Originally from Sweden, Sara studied Computer Science, moving to New Zealand a few years ago. In NZ she started her first role at a small IT company, in IT Service Management while completing the last year of her degree online.</p>\n\n<p><img src=\"https://www.diversecitycareers.com/media/diversecitycareers/client/Sara%20TW/11073493_10152892331448737_7460459477864320197_n.jpg\" style=\"height:auto\"></p>\n\n<h4>TELL US ABOUT YOUR JOURNEY INTO THE IT INDUSTRY</h4>\n\n<p>I always knew I wanted to study and as the middle kid I am I wanted to do something different.&#xA0;</p>\n\n<p>I didn&apos;t actually know much about what Computer Science involved before I started but I found the industry pretty fascinating and I saw it as a challenge, which it was. In the first year, with 35 students in my class, more than 60% dropped out before second semester started. It was really hard but I had great friends and we supported each other and got through it together.&#xA0;</p>\n\n<p>Although the coding part wasn&apos;t my thing, I got through it and I&apos;m so happy I did as it&apos;s really useful to have a bit of a technical background working as a BA.&#xA0;</p>\n\n<h4>WHAT DROVE YOU TO LOOK FOR ANOTHER ROLE?</h4>\n\n<p>I enjoyed my job in New Zealand, but was looking for a more challenging environment, where I could push through to the next level and work with a range of industries, expanding my knowledge. I also got involved in the local Lean In community, which got me interested in the gender diversity issues and how the Australian IT industry is affected. This was back in May 2015, when DCC was launched- I remember seeing their updates on LinkedIn, checking out their website, and the rest is history!</p>\n\n<p><img src=\"https://www.diversecitycareers.com/media/diversecitycareers/client/Sara%20TW/Sara%20Tweet.png\" style=\"height:auto\"></p>\n\n<h4>&#xA0;</h4>\n\n<h4>WHAT WAS THE INTERVIEW PROCESS WITH THOUGHTWORKS LIKE?</h4>\n\n<p>I had several phone interviews and one &#x2018;role-playing&#x2019; interview. What impressed me the most was that each interview was with one of my peers. It now makes sense how ThoughtWorks have created such a great culture. The &#x2018;role-playing&#x2019; interview was by far the best interview I&#x2019;d ever been part of. Very conveniently, there were two ThoughtWorks employees on a project in NZ, and I had a mock client requirements gathering interview with them. They were fantastic, and didn&#x2019;t break character once! Since I&#x2019;ve started, I&#x2019;ve been part of the interview process and really enjoyed it. It&#x2019;s not compulsory but it&#x2019;s great to help hire your future colleagues!</p>\n\n<p>I was so excited to get the job, and from day one ThoughtWorks impressed me with the way they on-board people. They looked after everything, from helping with my visa, relocation costs, accommodation to organising a driver to pick me up from the airport!<br>\n&#x200B;</p>\n\n<p><img src=\"https://www.diversecitycareers.com/media/diversecitycareers/client/Sara%20TW/sara%20profile%20photo.jpg\" style=\"margin:0px auto\"></p>\n\n<h4>WHAT DO YOU LOVE ABOUT WORKING WITH THOUGHTWORKS?</h4>\n\n<p>Hmm, where do I begin?! Most of all, I feel like I belong, I am valued and taken care of. I absolutely love the challenge- I&#x2019;m excited to come into work each day and am constantly learning. We have an incredible support network. Every new employee gets a &#x2018;buddy&#x2019; to take you through the induction period. After three months, you get to choose a sponsor, with whom you meet monthly to discuss both work and stuff outside of work. We also have a great BA community nationally and even though I&#x2019;m the only BA in Perth, I&#x2019;m surrounded by senior people with experience across a variety of roles.</p>\n\n<p>I also love the culture and the diversity we have. For example, I&#x2019;m currently part of a team with three women and two men. Not long ago, we actually had four women on the team! This is really unheard of in the industry. Our customers are great, the current one I am working with has been with ThoughtWorks for over 7 years and we get to work on some really cool projects!</p>\n\n<h4><strong>WHAT ARE YOUR FUTURE PLANS?</strong></h4>\n\n<p>I&#x2019;m really enjoying Perth, especially the great beaches here. But I&#x2019;m also looking forward to travelling the world, which is another great perk of working with ThoughtWorks- they have offices all over the world and provide plenty of opportunities to relocate!</p>\n\n<p><img src=\"https://www.diversecitycareers.com/media/diversecitycareers/client/Sara%20TW/1000329_10151592698038737_1667824247_n.jpg\" style=\"height:auto\"></p>\n\n<h5><strong>About DCC Jobs</strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0; <a href=\"http://dcc.staging.volcanic.net.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2015/07","associated_company":"work180"}