{"url":"https://www.work180.com.au/blog/2016/07/life-at-xero","title":"Life at Xero","author":"WORK180","body":"\n\t\t\t\t\t<p>Meet Nicki Curtis, a Product Owner at Xero. Nicki joined the Xero team in Melbourne in March 2015 and is is based in the Xero Business Edition Product team, with her focus on the onboarding experience.</p><h4>WHAT ARE THE REASONS YOU CHOSE TO JOIN XERO?</h4><p>Xero always struck me as being an innovative organisation that seemed to be a magnet for people who are really passionate about the product. Outside of Xero, I&#x2019;d met many people socially who were always quick to tell anyone what a great product it was, and those who I met who worked for Xero seemed to encompass this passion also, while also having a great balance between work and life. Joining an organisation that delivered on these enviable organisation traits was an opportunity I jumped at. And a year down the track the passion from users and colleagues is still something that astounds me daily.&#xA0;</p><h4>WHAT&apos;S THE BEST PART OF WORKING AT XERO?</h4><p>The opportunities to work with some amazingly clever people, I am constantly learning from their experiences and knowledge. Having the freedom to explore new technologies and solutions, and being given the chance to think outside the box has been fantastic.</p><h4>HOW WOULD YOU DESCRIBE YOUR TEAM?</h4><p>Each of the team bring their own skill set with them every day, these skills complement each other daily and culminate in a better solution being released to our users. The team has the ability to be presented with different challenges, and navigate through regardless of the hurdles we face &#x2013; it&#x2019;s reliance at its best.&#xA0;A sense of humour is commonplace in our team discussions &#x2013; the team are quick to have a laugh1&#xA0;and also share the wins, personally and on a group level.</p><h4>WHAT IS THE BEST THING ABOUT XERO&#x2019;S AGILE CULTURE?</h4><p>No two teams in the Melbourne office run the same way&#x37E; this allows each team to ensure that the uniqueness of the project or product area is reflected in the day to day &#x2018;getting stuff done&#x2019;.</p><h4>HOW WOULD YOU ARTICULATE THE GREAT OPPORTUNITIES FOR CAREER GROWTH AT XERO?</h4><p>The fact that Xero is a global organisation that communicates constantly with other regions enables you to have a greater appreciation for the world outside your own patch. New technologies and solutions are constantly being introduced also, which brings the opportunity to innovate globally. This global approach opens many doors. The accents present in any meeting is a testament to this, as well as hearing fellow Xero&#x2019;s give their own stories of growth and development, as well as some pretty amazing recruitment videos that seem to encapsulate this too.</p><h4>HOW WOULD YOU DESCRIBE THE CULTURE AT XERO IN THREE WORDS?</h4><ul><li><p>Focused: Having a clear vision of where the company aims to be in 3&#x2013;5 years helps to make the shorter term decisions more relevant.</p></li><li><p>Challenge: No two days are the same &#x2013; but the skills learned in the past assist in making the solution possible today.</p></li><li><p>Global: Any team anywhere is the world is willing to help, advise or collaborate on the projects that form part of our team&apos;s portfolio.</p></li></ul><h4>WHAT AUTONOMY DO YOU HAVE TO DETERMINE WHICH TECHNOLOGY CHOICES ARE USED IN SOFTWARE DEVELOPMENT?</h4><p>There are certain respects that need to paid to the code that was created in the past, but with the guidance and assistance from the Architectural &amp; Security teams, once the checks and balances are completed.</p><h4>WHAT ARE THE BEST PERKS OF WORKING AT XERO?</h4><p>Being a Mum of two, I&#x2019;d have to say the flexibility around work hours is a definite benefit, not just in terms of work hours, but also the ability to work from home when required. What&#x2019;s more, the ability to have access to tools like Puralsight has been an unexpected perk, in addition to the coffee machine, yoga sessions, lunchtime visits from Mr Burger and a great social network.</p><h4>WHAT DO YOU ENJOY DOING OUTSIDE OF WORK?</h4><p>I volunteer at a social running weekly event called &#x2018;Parkrun&#x2019;. Saturday mornings see me running 5kms with the family. When we&#x2019;re not doing that, catching up with friends and socialising in addition to travelling is where I spend most of my time.</p><h4>IF MONEY WAS NO OBJECT, WHAT WOULD YOU DO?</h4><p>Definitely travel around Australia, and then the world.</p><p>Xero is one of DCC&apos;s Endorsed Employers of Choice for Women- If you&#x2019;d like to find out what it&#x2019;s like to work with Xero, click&#xA0;<a data-cke-saved-href=\"/job-search?client=xero\" href=\"/job-search?client=xero\">here</a>.</p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2016/07","associated_company":"work180"}