{"url":"https://www.work180.com.au/blog/2018/06/making-flexibility-work-in-a-consulting-environment","title":"Making Flexibility Work in a Consulting Environment","author":"WORK180","body":"\n\t\t\t\t\t<p>Myself and my team are so grateful that our customers enable us to work from where we are most productive. That to me is what flexible work is all about- it&#x2019;s about finding what works best for you. Where you find you are able to do your best work- that could be from home, it could be from the office, it could be a coffee shop, the great outdoors, a co-working space and it could and should be a combination of places and spaces that work for you.&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4780e8f3-2fc0-4c1d-a28f-a8b7f2e78ca9.jpeg\" style=\"float: right; margin: 10px; width: 200px; height: 200px;\"></p>\n\n<p>When I started SixPivot, I had an idealistic vision to enable my staff the flexibility to work how they wanted. I wanted to create a feeling of family and that people had both a sense of purpose and belonging. I wanted them to be able to live their fullest life and to be able to share more time with their family and loved ones or pursuing their favourite exploits outside of work but still giving them the opportunity to do professional, challenging work. This included flexible working hours, additional leave and being able to work from home or a location of choice.</p>\n\n<p>People said it couldn&#x2019;t be done in a startup where our work was centred so heavily on consulting, daily rate billing and working on projects that while technology based are game changing for our customers and their teams. A professional services consultancy where much of our work was leading teams and highly collaborative within a business, could not work off site or flexibly, that customers would not trust and buy into it. Well three years in, it&#x2019;s working.</p>\n\n<blockquote>\n<p><em>Our customers have come on the journey and we work with them to help build more flexible work conditions for their teams as well as ours. The first question I am always asked by a potential new customer is where is your office?</em></p>\n</blockquote>\n\n<p>I love this question as it sets up the conversation right from the start as to how we work. Our admin, sales, product engineers, developers and consultants all work from home as their base. We have co-working spaces in Melbourne and Brisbane when we need them but most of the time you will find us anywhere but in an office.&#xA0;</p>\n\n<p style=\"text-align: center;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/213e6934-1618-4bad-b6b0-55b90a7224dd.jpeg\" style=\"margin: 10px;\"></p>\n\n<p>My &#x201C;Everything Manager&#x201D;, Jayne looks after HR administration, payroll, accounts payable, invoicing, social organiser and the list goes on does all of this working from home and often from her Campervan. Her and her partner Rose take the opportunity whenever they can to go camping and we get all sorts of happy snaps from Jayne working from the camper.&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b2fdb42e-5285-42db-b69f-27dc018a4486.jpeg\" style=\"float: right; margin: 10px;\"></p>\n\n<p>Our customers are curious as to how we make this work both from our own internal perspective and with clients. They are often amazed that we have such a strong and aligned culture as a company given we are early in our journey and rarely see each other. We discuss upfront how we work and we look at how that can work in with our customers, their projects and their people.</p>\n\n<p>We may spend some time on site &#x2013; either a few weeks at the start of a project or a couple of days per week, we may change hours to adapt to suit both parties. I leave it to my team member and my customer to work out what is going to work for each scenario and ensure that both are happy with the relationship. Largely if a potential customer doesn&#x2019;t support our values then we choose to not engage with them.</p>\n\n<p>I do love seeing the small changes in their own behaviours where after working with our team they start to be more flexible with their own teams. Ultimately our customers find that we are more productive, achieve outcomes more quickly and cut out a lot of unnecessary noise, meetings, travel and internal politics.</p>\n\n<p>So how do we make it work? Below are some pointers that we find work but ultimately it comes down to Communication, Trust and Tools.</p>\n\n<ul>\n\t<li>Tools that enable trust, transparency and communication &#x2013; Both internally and with our customers we use #Slack. Slack enables us to stay connected both for work and socially, we have channels for everything. As we are developers we also use tool sets like Atlassian and VSTS etc. to create reporting and transparency for our customers.</li>\n\t<li>Provide your staff with the technology they need to be highly mobile. We are paperless and are cloud first.</li>\n\t<li>Celebrate occasions- all the wonderful things that should be celebrated.</li>\n\t<li>Get together face to face both socially and for work internally and with your customers</li>\n\t<li>The same rules apply when it comes to office etiquette &#x2013; let people know when you are available and unavailable. Treat people with respect.</li>\n\t<li>Recruit people who are capable, who you trust, give them the tools they need and then trust them to do their job. Flexible work means:</li>\n\t<li>Alternate start and finish times</li>\n\t<li>Part time work</li>\n\t<li>Work from home or alternate places</li>\n\t<li>Providing Additional annual leave</li>\n\t<li>Being extra gracious with personal leave, We&#x2019;d like to get to:</li>\n\t<li>Compressed working weeks and reduced hours for same pay</li>\n</ul>\n\n<hr>\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3>\n\n<p>WORK180 is&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">jobs board&#xA0;</a><span style=\"font-size: 1.6rem;\">with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;</span><a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">essential tool</a><span style=\"font-size: 1.6rem;\">&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;</span><a href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">one click</a><span style=\"font-size: 1.6rem;\">&#xA0;now.&#xA0;</span></p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips","flexible working"],"upload_date":"2018/06","associated_companies":["work180"]}