{"url":"https://www.work180.com.au/blog/2018/06/meet-the-women-shaping-our-future","title":"Meet the Women shaping our future in Science","author":"WORK180","body":"\n\t\t\t\t\t<p>We&#x2019;ve all read the stats and we see it every day in the office and on the streets. We want progress, especially in science, technology, engineering and maths (STEM), to get more women in these roles and leading the charge. And we are making progress. Women&#xA0;are changing the world. We&#x2019;re lucky enough that some of these incredible women work right here. They&#x2019;re changing the world every day not because they&#x2019;re women, but because they&#x2019;re working on curing diseases, saving the environment, exploring the skies, and developing new technology and industries.</p><p>But before we meet some of these amazing women who are helping shape our future, we also want to acknowledge that to shape Australia&#x2019;s future in with science, we need to consider the next generation and how we can encourage more young girls to consider STEM as a viable career option for them.</p><p>Many young girls still think that STEM subjects are for boys and they couldn&#x2019;t succeed in these careers. This is because you can&#x2019;t be what you can&#x2019;t see. We need more role models for the future generation so they too can shape our future and press for progress.</p><h2>Anna Cresswell</h2><h3>PhD Candidate, CSIRO Oceans and Atmosphere</h3><p style=\"text-align: center;\"><img alt=\"Anna cresswell underwater in scuba gear pushing an imaginary button\" data-attachment-id=\"33824\" data-comments-opened=\"0\" data-image-description=\"\" data-image-meta=\"{&quot;aperture&quot;:&quot;5&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;E-PL1&quot;,&quot;caption&quot;:&quot;OLYMPUS DIGITAL CAMERA&quot;,&quot;created_timestamp&quot;:&quot;-62169984000&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;14&quot;,&quot;iso&quot;:&quot;200&quot;,&quot;shutter_speed&quot;:&quot;0.00625&quot;,&quot;title&quot;:&quot;OLYMPUS DIGITAL CAMERA&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Anna Cresswell\" data-large-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-1024x768.jpg\" data-medium-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-300x225.jpg\" data-orig-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell.jpg\" data-orig-size=\"2168,1626\" data-permalink=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/olympus-digital-camera-95/\" sizes=\"(max-width: 954px) 100vw, 954px\" data-cke-saved-src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-1024x768.jpg\" src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-1024x768.jpg\" srcset=\"https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-1024x768.jpg 1024w, https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-300x225.jpg 300w, https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-768x576.jpg 768w, https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-954x716.jpg 954w, https://blog.csiro.au/wp-content/uploads/2018/03/Anna-Cresswell-400x300.jpg 400w\" style=\"border: 0px; line-height: inherit; vertical-align: baseline; margin: 10px; width: 300px; float: right; height: 225px;\"></p><p><strong>What are you working on that&#x2019;s shaping our future?</strong></p><p>The world&#x2019;s oceans are critical for the health of the planet, yet are in state of accelerated change, associated with increases in the intensity and frequency of disturbances to natural systems. Understanding the dynamics of change is necessary to manage for the future. This is the focus of my PhD research. I take several key components of coral reef marine ecosystems, one of the most diverse ecosystems in world, and consider both coral and fish groups, investigating how their future is linked to climatic and anthropogenic disturbances.</p><p>I use multiple different methods &#x2013; fieldwork, statistical analyses and statistical and simulation modelling &#x2013; to investigate how coral reef ecosystems respond to acute changes in environment and to chronic pressures.</p><p><strong>What do you love about your job?</strong></p><p>What&#x2019;s most important to me is that the research I do is working towards new understanding of natural systems and new ways to create more sustainable interactions between humans and the natural world. My PhD research is part of the BHP-CSIRO Ningaloo Outlook Marine Research Partnership and my research takes me to Western Australia&#x2019;s Ningaloo Reef at least once a year. Visiting this beautiful place is always the best reminder of the importance of our natural world, and how the science we do can contribute to the preservation of places like Ningaloo, and the health and balance of our oceans.</p><p>A lot of my work is also computer based. I really enjoy using different types of mathematical modelling to investigate ecological theories. Mathematical approaches can bring new insight when investigating big global issues.</p><p><strong>Why did you choose this career path?</strong></p><p>I have always been fascinated by the ocean and the life it supports. There is an infinite amount of new things to discover and learn. I wanted to be part of making a positive change for a better future for the ocean and therefore for the planet.</p><p><strong>Did you face any barriers in your career and how did you overcome them?</strong></p><p>I am still very early in my career in marine science. So far I haven&#x2019;t encountered any major barriers and have been fortunate to have had many good opportunities including the opportunity to work with both the University or Western Australia and CSIRO.</p><p><strong>Who do you look up to?</strong></p><p>My mum is a marine scientist and while I think I found my own way to marine ecology, she has always been a key mentor for my journey through science, and clear evidence of how women can reach the top and make a positive difference.</p><p><strong>What do you think needs to happen to help more women progress in STEM and in management careers?</strong></p><p>Firstly, recognition of the biases towards women in STEM that still exist, and discussion of how we can break down these biases to allow women to progress to high level research. In my experience this is already starting to happen, and things are already changing for the better. With many inequality issues there is a strong associated inertia, and to break this requires a lot of people to work together in shifting outdated views. I think women role models and mentors can play a key role in inspiring more women to progress to STEM and management careers.</p><p><strong>What advice would you give to young girls who are thinking about a career in STEM?</strong></p><p>If it&#x2019;s something you are passionate about, that passion can take you a long way. Work towards being the best in your field. While it&#x2019;s not an easy pathway, I think women can make a real difference by following a career in STEM.</p><h2>Jane Bowen</h2><h3>Research Dietitian/Scientist, CSIRO Health &amp; Biosecurity</h3><p><strong>What are you working on that&#x2019;s shaping our future?</strong></p><p>I work in the Nutrition and Health program at CSIRO, and we&#x2019;re working to improve the health and wellbeing of Australians. This includes research in specific areas like diets and weight loss, diabetes, and cardiovascular disease, but we&#x2019;re also expanding into broader definitions of health and wellbeing to benefit the health of all Australians.<img alt=\"Jane Bowen pressing an imaginary button\" data-attachment-id=\"33839\" data-comments-opened=\"0\" data-image-description=\"\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Jane Bowen\" data-large-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-1024x683.png\" data-medium-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-300x200.png\" data-orig-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen.png\" data-orig-size=\"5472,3648\" data-permalink=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/jane-bowen/\" sizes=\"(max-width: 954px) 100vw, 954px\" data-cke-saved-src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-1024x683.png\" src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-1024x683.png\" srcset=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-1024x683.png 1024w, https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-300x200.png 300w, https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-768x512.png 768w, https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-600x400.png 600w, https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-954x636.png 954w, https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-299x200.png 299w, https://blog.csiro.au/wp-content/uploads/2018/03/Jane-Bowen-130x87.png 130w\" style=\"vertical-align: baseline; text-align: center; line-height: inherit; margin: 10px; width: 400px; float: right; height: 267px;\"></p><p>During my PhD, I was able to contribute to writing the Total Wellbeing Diet book, which became a worldwide bestseller (selling more than a million copies) and led to an online weight management program. It&#x2019;s been a huge resource to help the Australian community with weight management and healthy eating.</p><p><strong>What do you love about your job?</strong></p><p>In my work in nutrition and dietetics, I see food as the perfect vehicle for health &#x2013; it&#x2019;s something everybody can relate to. One of the things I&#x2019;ve really relished is that my career&#x2019;s in a field that everybody understands and can relate to, and can easily have a chat to me about (as opposed to something like quantum physics).</p><p><strong>Why did you choose this career path?</strong></p><p>My family has a bit of a health background &#x2013; my Dad was a chemist, and my sister wanted to be a doctor &#x2013; and I didn&#x2019;t really fit into the artistic stream at school, so health seemed like a natural fit for me. I chose to study nutrition and dietetics at university, partly because I love food, and through my training I saw huge scope for impact in research in the field.</p><p><strong>Did you face any barriers in your career and how did you overcome them?</strong></p><p>Without sounding cheesy, one challenge has been that I&#x2019;ve had three children and I&#x2019;ve not given up my career. I think it is difficult to balance those activities and I&#x2019;m always in awe of all the working mums who do it. While I think we&#x2019;re making loads of progress with dads and grandparents helping out, the burden does still come back to women primarily. The challenge when you stop and have a career break for children is that it can limit your career progression. So I&#x2019;m glad I&#x2019;ve hung in there and tolerated a flat spot in terms of progressing my career; I&#x2019;ve persisted, and now that my children are a little older I can return a bit more focus to my career.</p><p><strong>Who do you look up to?</strong></p><p>My life has been filled with positive female role models who showed me what was possible for a woman to achieve. My Mum, who didn&#x2019;t ever get to go to university, always insisted that I and my sisters get qualifications, and my sisters were always very high achievers, so I had that working and professional role modelling from day one. I had women lecturers at university who I looked up to as well, and I&#x2019;ve met many really impressive women within CSIRO and the nutrition field that have shown me the potential of a workplace with women leaders.</p><p><strong>What do you think needs to happen to help more women progress in STEM and in management careers?</strong></p><p>Workplaces can embrace flexible working arrangements to accommodate people working part-time benefits both men and women, so everyone can take care of their families and maintain their careers. Having female leaders is really important too as it adds to diversity of thought in leadership teams and helps support younger women in their careers. And I think we need to find a way to help women maintain the necessary metrics in academics and science, such as publications and competitive funding, even if they&#x2019;re working part-time.</p><p><strong>What advice would you give to young girls who are thinking about a career in STEM?</strong></p><p>It&#x2019;s a really exciting time to have a career in science and it&#x2019;s not just a linear pathway into a job with a lab coat and writing academic papers. For Australia to be a leader in science and innovation we need a diverse range of people involved, who understand problems and can come up with creative solutions. So to young women I&#x2019;d recommend exploring a science career, even if you don&#x2019;t think you&#x2019;re a traditional fit!</p><h2>Jo Watkins</h2><h3>Chief Executive Officer, Earth Science Western Australia</h3><p><strong>What are you working on that&#x2019;s shaping our future?</strong></p><p>I work with students and teachers to support earth sciences education across WA and the rest of Australia from Kindergarten to Year 12.</p><p><img alt=\"\" data-attachment-id=\"33782\" data-comments-opened=\"0\" data-image-description=\"\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Jo Watkins\" data-large-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-1024x768.jpg\" data-medium-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-300x225.jpg\" data-orig-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins.jpg\" data-orig-size=\"1417,1063\" data-permalink=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/jo-watkins/\" sizes=\"(max-width: 954px) 100vw, 954px\" data-cke-saved-src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-1024x768.jpg\" src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-1024x768.jpg\" srcset=\"https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-1024x768.jpg 1024w, https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-300x225.jpg 300w, https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-768x576.jpg 768w, https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-954x716.jpg 954w, https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins-400x300.jpg 400w, https://blog.csiro.au/wp-content/uploads/2018/03/Jo-Watkins.jpg 1417w\" style=\"vertical-align: baseline; font-size: 16px; text-align: center; line-height: inherit; margin: 10px; width: 400px; float: right; height: 300px;\"></p><p><strong>What do you love about your job?</strong></p><p>I get to work with so many people, to share my passion for earth science and to influence others to consider this great career pathway.</p><p><strong>Why did you choose this career path?</strong></p><p>I always loved science so headed to uni to complete a biological and environmental science degree. From there I went into teaching and loved it! After several years as a lower school science and maths teacher I started teaching Year 11/12 earth and environmental science and found my other great passion &#x2013; earth science. When the opportunity came up to work with Earth Science Western Australia and I jumped at it, I love this job!</p><p><strong>Did you face any barriers in your career and how did you overcome them?</strong></p><p>It has been challenging to juggle so many things at once, especially when I decided to formalise my earth science education by studying a Graduate Diploma in Mineral Exploration Geoscience while working full time. Although challenging, I was lucky to have the support from the organisation to do this and I really loved the course which made the late nights and weekends spent worth it.</p><p><strong>Who do you look up to?</strong></p><p>For many years I worked with Julia Ferguson at Earth Science Western Australia. She became a geologist back when very few girls became geologists and after many successful years took this passion into teaching and then to Earth Science Western Australia.</p><p><strong>What do you think needs to happen to help more women progress in STEM and in management careers?</strong></p><p>I think girls need to be told that these careers are for them too and to see others in these roles. I also think workplaces need to be more flexible to allow great people to progress in a range of roles.</p><p><strong>What advice would you give to young girls who are thinking about a career in STEM?</strong></p><p>Go for it! There are so many interesting things to learn, great people to meet and wonderful places to visit. STEM careers open so many doors for an amazing life.</p><h2>Ellen Gorissen</h2><h3>Commercialisation Director, CSIRO</h3><p style=\"text-align: center;\"><img alt=\"Ellen Gorissen pushing an imaginary button\" data-attachment-id=\"33757\" data-comments-opened=\"0\" data-image-description=\"\" data-image-meta=\"{&quot;aperture&quot;:&quot;1.8&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;HTC 2PS6200&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1520262841&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;4.58&quot;,&quot;iso&quot;:&quot;167&quot;,&quot;shutter_speed&quot;:&quot;0.03030303030303&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Ellen Gorissen\" data-large-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-1024x768.jpg\" data-medium-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-300x225.jpg\" data-orig-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142.jpg\" data-orig-size=\"4000,3000\" data-permalink=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/imag03142/\" sizes=\"(max-width: 954px) 100vw, 954px\" data-cke-saved-src=\"https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-1024x768.jpg\" src=\"https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-1024x768.jpg\" srcset=\"https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-1024x768.jpg 1024w, https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-300x225.jpg 300w, https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-768x576.jpg 768w, https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-954x716.jpg 954w, https://blog.csiro.au/wp-content/uploads/2018/03/IMAG03142-400x300.jpg 400w\" style=\"border: 0px; line-height: inherit; vertical-align: baseline; margin: 10px; width: 300px; float: right; height: 225px;\"></p><p><strong>What are you working on that&#x2019;s shaping our future?</strong></p><p>My role is all about ensuring that our great science has impact through adoption and commercialisation. Many great ideas never make it to market which is a real shame so my role is all about advising, facilitating and negotiating the process of commercialisation which could be through a licence or spin out or joint venture. I like to think that many of the deals we do will end up shaping our future!</p><p><strong>What do you love about your job?</strong></p><p>I love the variety and intellectual stimulation as well as the thrill of closing a deal and seeing a technology transferred out of the lab and into the real world.</p><p><strong>Why did you choose this career path?</strong></p><p>My background is in chemical engineering so I worked in technical fields initially. I also did an MBA and worked in investment banking. Then I discovered tech transfer and commercialisation which is a great blend of technical, financial and deal making.</p><p><strong>Did you face any barriers in your career and how did you overcome them?</strong></p><p>Yes, there are barriers. I worked in the oil and gas industry which was very male dominated and there was this assumption that all women were secretaries. I had my qualifications printed on my business cards and made sure the blokes knew who they were dealing with.</p><p><strong>Who do you look up to?</strong></p><p>Unfortunately female role models can be few and far between in this industry but I have met (and continue to meet) some amazing women along the way.</p><p><strong>What do you think needs to happen to help more women progress in STEM and in management careers?</strong></p><p>I think many of the industries that employ people with STEM skill sets are still quite male dominated and there a high attrition rate amongst women. We need to fundamentally change the ground rules and be more accepting of workers with different needs, work styles and personal circumstances. I think the flexible working arrangements at CSIRO is an awesome initiative that goes some way to addressing this (at least the hours bit).</p><p><strong>What advice would you give to young girls who are thinking about a career in STEM?</strong></p><p>Do a STEM degree.&#xA0; Even if you never work in the field, you will never regret it. It teaches you how to think and STEM plus business is even more powerful.</p><h2>Xiwei (Sherry) Xu</h2><h3>Research Scientist, Data61</h3><p><strong>What are you work on that&#x2019;s shaping our future?</strong></p><p><img alt=\"Sherry Xu pushing an imaginary button\" data-attachment-id=\"33753\" data-comments-opened=\"0\" data-image-description=\"\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Sherry Xu\" data-large-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-1024x768.jpg\" data-medium-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-300x225.jpg\" data-orig-file=\"https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu.jpg\" data-orig-size=\"2592,1944\" data-permalink=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/sherry-xu/\" sizes=\"(max-width: 954px) 100vw, 954px\" data-cke-saved-src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-1024x768.jpg\" src=\"https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-1024x768.jpg\" srcset=\"https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-1024x768.jpg 1024w, https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-300x225.jpg 300w, https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-768x576.jpg 768w, https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-954x716.jpg 954w, https://blog.csiro.au/wp-content/uploads/2018/03/Sherry-Xu-400x300.jpg 400w\" style=\"vertical-align: baseline; font-size: 16px; text-align: center; line-height: inherit; margin: 10px; width: 400px; float: right; height: 300px;\"></p><p>I work on software system design. Currently my focus is on blockchain which is one of the hottest topics at the moment. A common view is that blockchain is a panacea that can solve all the world&#x2019;s problems. My work is to tell people when and where to use blockchain and also how to use it from a technical perspective.</p><p><strong>What do you love about your job?</strong></p><p>My job gives me many opportunities to improve myself to become a better me.</p><p><strong>Why did you choose this career path?</strong></p><p>I like doing research. I like having ownership of my research work.</p><p><strong>Did you face any barriers in your career and how did you overcome them?</strong></p><p>Yes. One example is stage fright. I don&#x2019;t think I have fully overcome it, but I am getting much better. I think first I need to face the problem rather than hide from it. I also ask for people&#x2019;s advice, and then create more opportunities for me to talk publicly.</p><p><strong>Who do you look up to?</strong></p><p>My mum. Of course, every kid thinks his/her mum is a hero in the early stages of his or her life. But my mum is always a very good example for me to learn, especially, her attitude to her career. She changed her career paths for several times. She used to own her own business. Although she&#x2019;s never been at very high position in any company or earned a lot of money from her business, she is always happy and open to new opportunities. Even after she retired, she changed career again to a new industry, and passed a test to get certificate within the industry with other people that are much younger than her. She follows her heart to do whatever interested her. And at the same time, she also manages my family well. She spent a lot of time with me. I enjoy the time being with my mum, and I believe she does as well.</p><p><strong>What do you think needs to happen to help more women progress in STEM and in management careers?</strong></p><p>I think we need create more opportunities for young girls to realise the beauty of STEM. They are not boring subjects at all.</p><p><strong>What advice would you give to young girls who are thinking about a career in STEM?</strong></p><p>In my opinion, STEM is a good choice. But it depends on your interests, personality and capability. For me, I think I&#x2019;m good at science and engineering, basically logic thinking in general, compared with other disciplines like management or art. I think STEM helps us know more about how the world works, how nature works, which again interested me. Currently there are less females doing STEM than males, so we&#x2019;re a limited resource and we need more diversity.</p><p>This post was originally published by&#xA0;<a data-cke-saved-href=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/\" href=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/\">CSIROscope</a><a data-cke-saved-href=\"https://blog.csiro.au/never-pressing-time-progress/\" href=\"https://blog.csiro.au/never-pressing-time-progress/\">.</a><a data-cke-saved-href=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/\" href=\"https://blog.csiro.au/international-womens-day-meet-the-women-shaping-our-future/\">&#xA0;</a>&#xA0;</p><hr><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9a621f96-faef-4269-bee5-83cd8b6ba56f.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9a621f96-faef-4269-bee5-83cd8b6ba56f.png\" style=\"float: right; margin: 10px; width: 200px; height: 200px;\"></p><h5 style=\"font-family: Lato, sans-serif;\"><strong>About CSIRO</strong></h5><div><br><p>WORK180 welcomed CSIRO to our list of #EndorsedEmployersforWomen in November 2017. With CSIRO, you&#x2019;ll use science to solve challenges and provide solutions. You&#x2019;ll enjoy a flexible working environment with all staff encouraged to embrace flex the way it works for them: job sharing,&#xA0;part time, flexible hours etc. Gain excellent development opportunities, scholarships, mentoring, financial study assistance, and the opportunity to represent CSIRO at national and international conferences and much more!</p><p>Learn more about CSIRO on their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/csiro\" href=\"https://www.work180.com.au/clients/csiro\">Best Employer page</a>&#xA0;&amp; apply for their jobs&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=csiro\" href=\"https://www.work180.com.au/job-search?client=csiro\">here.</a><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=csiro\" href=\"https://www.work180.com.au/job-search?client=csiro\">&#xA0;</a></p></div><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["stem","gender equality"],"upload_date":"2018/06","associated_companies":["work180"]}