{"url":"https://www.work180.com.au/blog/2018/03/people-behind-nbn-network-Carolyn-Phiddian-International-Womens-Day","title":"Meeting the people behind the nbn™ network: Carolyn","author":"WORK180","body":"\n\t\t\t\t\t<h3><strong>One of the biggest changes to Australia&#x2019;s telecommunications infrastructure requires hard working humans out in the field. </strong></h3>\n\n<p>Every day, more than 23,000 women and men from all walks of life work on the&#xA0;nbn&#x2122; broadband access network. When you&#x2019;re looking to complete one of the biggest technological feats in the country&#x2019;s history, you need an army of smart, enthusiastic workers.</p>\n\n<p>A large percentage of NBN Co&#x2019;s workforce remains hard at work on the completion target of helping to provide nationwide access to fast broadband by 2020. Meanwhile, new initiatives continue to bring fresh opportunities to team members. This includes&#xA0;exciting upgrades,&#xA0;innovative new teams&#xA0;and&#xA0;educational opportunities.</p>\n\n<p>Our &#x2018;Meet the People&#x2019; series is about having a chat with some of the talented Australians driving these projects. NBN Co is committed to not only delivering a gender-equal workplace &#x2013; employing as many women as men &#x2013; but also employing people from across our culturally diverse population.</p>\n\n<p>So, in celebration of International Women&#x2019;s Day, we&#x2019;re chatting with General Manager of Technology Strategy, Carolyn Phiddian.</p>\n\n<h3><strong>Meet Carolyn, General Manager of Technology Strategy</strong></h3>\n\n<p><img src=\"https://www.nbnco.com.au/content/dam/nbnco2/images/blog/meetthepeople-carolyn-desk-1043.jpg\" style=\"height:auto;\"></p>\n\n<p>When you&#x2019;re working on a telecommunications operation of this scale, few roles are as vital as General Manager of Technology Strategy. Having the right technology strategy in place, and being able to execute it effectively across an entire country (and tens of thousands of staff), requires plenty of talent and dedication. And Carolyn loves it!</p>\n\n<blockquote>\n<p><big><em>&#x201C;I work in the Chief Technology Office, and I have a really interesting and exciting job,&#x201D; says Carolyn. &#x201C;I get to study upcoming technologies and convergence in new technology. I work with technology experts all over the world so I can understand what&#x2019;s around the corner and what it might mean for NBN Co.&#x201D;</em></big></p>\n</blockquote>\n\n<p>Although Carolyn has been in the role for two years, she&#x2019;s been at NBN Co for eight.</p>\n\n<p>&#x201C;I was here from the beginning, so I&#x2019;ve seen all the different incarnations of the company from its first 100 employees to now.&#x201D; When Carolyn reflects back on how she ended up being involved with the rollout, it feels like a natural progression.</p>\n\n<blockquote>\n<p><em><big>&#x201C;Your future is my today. I&#x2019;m a strategy architect, so my career has been seeing the future long before it comes into the present. My role is very much helping people understand the future so I can then help people figure out how they can play in that space. It&#x2019;s very much about bringing the technological future into the operational present.&quot;</big></em></p>\n</blockquote>\n\n<p>&#x201C;I was one of those rare beasts who did engineering after I finished school. &#x2018;Rare&#x2019; because, at that stage, only about eight per cent of the students in the type of engineering I did were female. That was below average at the time. So, it was hard to have a target for hiring female engineers when there wasn&#x2019;t the pool of trained female engineers to draw from.&#x201D;</p>\n\n<p>But that didn&#x2019;t stop Carolyn from getting ahead in her chosen field.</p>\n\n<p>&#x201C;I have a long career in telecommunications and have always enjoyed it. I started my career providing radio telephones to remote parts of Australia. I&#x2019;ve done really interesting things like help introduce voice over IP (VoIP) to the country. I&#x2019;ve also worked internationally, looking for a fresh challenge in the UK for a few years, and later helping to modernise telecommunications in New Zealand.</p>\n\n<p>&#x201C;I even did some &#x2018;first&#x2019; internet products for Telstra, so working at NBN Co is a natural home for me &#x2013; a government-owned business trying to provide the best communications to Australia is really right where I started my career.&#x201D;</p>\n\n<h4><strong>An average working day for Carolyn</strong></h4>\n\n<p>So, what does Carolyn get up to on a typical work day?</p>\n\n<p>&#x201C;My day involves a lot of meetings. However, I also get a lot of time to do investigation. I spend a lot of time talking with my team, talking across the business, talking to suppliers. I talk about our plans to investigate technologies, test or implement different solutions, and explore how they relate to our business and offer opportunities for NBN Co.&#x201D;</p>\n\n<p>But it&#x2019;s the opportunity to learn about the next big advancement that really excites Carolyn. &#x201C;I love learning about new technologies. My interaction with global experts and being able to be at the leading edge of global developments is fantastic. NBN Co has such an important presence in the Australian market, so we get great insights shared with us from our overseas suppliers.</p>\n\n<p>&#x201C;Your future is my today. I&#x2019;m a strategy architect, so my career has been seeing the future long before it comes into the present. My role is very much helping people understand the future so I can then help people figure out how they can play in that space. It&#x2019;s very much about bringing the technological future into the operational present.</p>\n\n<p>&#x201C;I&#x2019;m particularly excited about automation in the future. We really want to have a high level of automation of activity &#x2013; always on, limitless capacity &#x2013; but my challenge is to ensure it makes the&#xA0;nbn&#x2122; access network high-performing, but at as low a running cost as possible.&#x201D;</p>\n\n<h4><strong>Asking the right questions</strong></h4>\n\n<p>It&#x2019;s not without its challenges, of course. Carolyn says that many people are surprised by some of the obstacles she needs to overcome. &#x201C;There&#x2019;s a lot of ambiguity in these emerging technologies, with so many concepts and acronyms. Trying to get to common understanding across stakeholders and picking the right things for the business &#x2013; things that will have a big impact on the country &#x2013; is a real challenge. It&#x2019;s very complex problem-solving: you&#x2019;ve got to make sure you&#x2019;re doing the right thing for the future.&#x201D;</p>\n\n<p>But Carolyn doesn&#x2019;t burden herself by trying to be an expert in everything. &#x201C;If I don&#x2019;t know something, I ask others who do. I believe that you need to give yourself permission to not know and not understand everything. Knowing what you don&#x2019;t understand is really important and lets you draw on others.</p>\n\n<div><img src=\"https://www.nbnco.com.au/content/dam/nbnco2/images/blog/meetthepeople-carolyn-colleague-1043.jpg\" style=\"height:auto;\"></div>\n\n<div>Carolyn (left) working with a colleague.</div>\n\n<p>&#xA0;</p>\n\n<p>&#x201C;It might surprise people that strategy is not about finding answers &#x2013; it&#x2019;s about asking the right questions and being open to new information. It&#x2019;s much more about developing options for a way forward than it is about having all the answers.&#x201D;</p>\n\n<p>Carolyn knows just how important her role is and the broad implication of access to fast broadband on the nation. &#x201C;The&#xA0;nbn&#x2122; access network itself is not an outcome. It&#x2019;s so important that we help to reduce the digital divide and make sure people have access to education and health in their homes. We provide a big platform to help make that happen.</p>\n\n<p>&#x201C;We also need to shift our economy towards different industries. The type of economy we can have with broadband available is very different to the one you have if you don&#x2019;t. We need to give Australia the ability to really participate in a digital future.&#x201D;</p>\n\n<h4><strong>Carolyn&#x2019;s advice for other women</strong></h4>\n\n<p>Despite her impressive r&#xE9;sum&#xE9;, Carolyn admits that throughout much of her career, female representation hasn&#x2019;t been as strong as it is now. &#x201C;The engineering and technology fields I&#x2019;ve worked in have been male-dominated. It&#x2019;s never been a personal issue for me in the professional ranks I&#x2019;ve worked in, but these environments can be hierarchical. One of the things I have brought to these workplaces is a desire to collaborate. I&#x2019;ve also built resilience, which is what everybody needs.&#x201D;</p>\n\n<p>Now firmly entrenched at NBN Co and leading the charge on new technologies, Carolyn has no hesitation in backing other women to reach for their dreams. &#x201C;I encourage women to follow their strengths, their interests and to reach their potential. It is absolutely necessary that they do so. The work we do in engineering or telecommunications is just as readily done by men or women. There is no reason one is better than the other. Don&#x2019;t be put off.&#x201D;</p>\n\n<p>In fact, Carolyn believes the&#xA0;nbn&#x2122; access network couldn&#x2019;t be what it is today without the input of female employees.</p>\n\n<blockquote>\n<p><em><big>&#x201C;I encourage women to follow their strengths, their interests and to reach their potential. It is absolutely necessary that they do so. The work we do in engineering or telecommunications is just as readily done by men or women. There is no reason one is better than the other. Don&#x2019;t be put off.&#x201D;</big></em></p>\n</blockquote>\n\n<p>&#x201C;I think the female perspective is critical in the technology industries. Intel has an anthropologist working for them. &#x2018;Why does a company like Intel have an anthropologist?&#x2019; you may ask. It&#x2019;s particularly important in coding. When you code the technology of the future, you code your ethics into it. You may think you don&#x2019;t, but you do.</p>\n\n<p>&#x201C;It&#x2019;s critical that we get people from all backgrounds into the technology space and develop technology-based careers they can be part of. We need a diversity of perspectives so that the technology of the future will serve everyone that it should serve. The more diversity we have, the better we will be.&#x201D;</p>\n\n<p>So, what does Carolyn see in store for the near-future? &#x201C;We are on the cusp of another technology revolution. There have been a couple in my lifetime. The mobile phone completely revolutionised telecommunications. Then there was the internet; we knew it would be big. We thought it was ridiculous at the time that people would do their banking on it.</p>\n\n<p>&#x201C;Automation and artificial intelligence is the next revolution and will be powered by fast broadband. It will change our relationships with technology. It&#x2019;s really important we demystify the technology and understand how to make machines work for us in the near future.</p>\n\n<p>&#x201C;It&#x2019;s why I feel absolutely great about contributing to one of Australia&#x2019;s biggest infrastructure projects. It is absolutely about the future of the country.&#x201D;</p>\n\n<hr>\n<h4><strong>NBN Co commits to 40:40:20 gender balance target</strong></h4>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c9aa6754-62ea-4567-9eb1-1c3360e45ec2.png\" style=\"font-size: 16px; float: right; margin: 10px; width: 200px; height: 198px;\"></p>\n\n<div>&#xA0;\n<p>NBN Co is joining other major Australian-based companies in committing to working towards the 40:40:20 gender balance target.</p>\n\n<p>We are committed to building championship teams made up of a diverse mix of people, styles and background to deliver the best business results, positive end-user customer experience and attract the best talent.</p>\n\n<p>Executive teams with these gender balances are ones made up of 40 per cent men and 40 per cent women, with the remaining 20 per cent unspecified to allow for flexibility. These figures are set out by the&#xA0;Workplace Gender Equality Agency, an Australian Government statutory agency charged with promoting and improving gender equality in Australian workplaces.</p>\n\n<p>At NBN Co, we are introducing this target down through three layers of our senior management, and will work towards a 40:40:20 gender balance workplace target for our Executive Committee, Executive General Managers and their teams by 2022.</p>\n\n<h3><strong>About </strong><strong>nbn</strong></h3>\n\n<p>nbn is an Endorsed Employer for Women. Learn more about nbn on their <a href=\"https://www.dccjobs.com/clients/nbn\">Best Employer page</a>.&#xA0;</p>\n\n<p>Apply to join nbn.<a href=\"https://www.dccjobs.com/job-search?client=nbn\"> Browse their jobs here.</a>&#xA0;</p>\n\n<hr>\n<h3><strong>About DCC Jobs</strong></h3>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n</div>\n\n\t\t\t\t","tags":["gender equality","Celebrating Women"],"upload_date":"2018/03","associated_company":"work180"}