{"url":"https://www.work180.com.au/blog/2018/11/arup-engineering-top30","title":"Meet Kaitlin Langdon, Top 30 innovative Engineer in 2018","author":"WORK180","body":"\n\t\t\t\t\t<p>People tend to pause and reflect on their careers at major milestones, looking back on their achievements after 10, 25, 40 years in an industry.&#xA0;</p><p><br>This year I was humbled to be named one of Engineers Australia &#x2018;Top 30 Innovative Engineers for 2018&#x2019; at age 30 and as a result I find myself stopping to reflect on my career to date after a mere 7 years in the industry.&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5f055a47-cf34-4371-a782-46bf7cae7750.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5f055a47-cf34-4371-a782-46bf7cae7750.png\" style=\"float: right; margin: 10px;\"></p><p><br></p><p>I started work with Arup as a graduate engineer in 2012 and being a goal driven person, I initially struggled with the transition from university to work. I no longer had assignments, tutorials and exams to delineate my progress throughout the year. I suddenly found myself in charge of my own development for the most part and had no clue where to start.</p><p><br></p><p>The Arup graduate program and working toward Chartered Status with Engineers Australia offered some structure and guidance in the first few years. On reflection however, I would attribute my early success to the opportunity to work on a wide range of projects and working with some fantastic people, who have been wonderful mentors and supporters in the development of my career. I have also had a few influential role models at work, who provided me with a good idea of the sorts of things I wanted to achieve in my own career.</p><p><br></p><p>Being able to work on inspirational projects, provided me with the real drive for success. I found myself setting interim career goals, making plans to achieve them and working as hard as I could to make them happen. I said yes to all the opportunities I was given and showing initiative to learn and develop where ever possible. Most importantly, I learnt that being myself was ok and pushing myself beyond my comfort zone was where I really learnt and grew, personally and professionally.&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/dcb61f2e-43d0-4411-b8cd-35f9e710730a.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/dcb61f2e-43d0-4411-b8cd-35f9e710730a.png\" style=\"float: right; margin: 10px;\"></p><p><br></p><p>This culminated in the opportunity to work on the design of a new type of bridge girder. Working on this project offered a &#x201C;once in life time&#x201D; experience, which was immensely challenging and rewarding. It is my work on this project that led to my inclusion on Engineers Australia&#x2019;s list of &#x2018;Top 30 Innovative Engineers for 2018&#x2019;.</p><p><br>Reading through the list of fellow recipients (which included two Arup colleagues) made me immensely grateful the opportunities I have been given so far in my career, to reach this level of recognition so early.</p><p><br></p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About Arup&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8ef148cd-2e8e-4931-9c33-3d2df7127624.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8ef148cd-2e8e-4931-9c33-3d2df7127624.png\" style=\"float: right; width: 300px; height: 119px;\"></strong><br><br></h4><p>Offering 16 weeks paid parental leave at full salary after only 3 months employment, Arup also pays superannuation whilst staff are on unpaid parental leave up to the first year - working to close the gender&#xA0;supergap.<a data-cke-saved-href=\"https://www.work180.com.au/clients/arup\" href=\"https://www.work180.com.au/clients/arup\"> <br>&#x200B;Learn more about why Arup became an&#xA0;endorsed employer for women here.</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p>\n\t\t\t\t","tags":["Career Development","Engineering"],"upload_date":"2018/11","associated_companies":["work180"]}