{"url":"https://www.work180.com.au/blog/2015/06/men-have-it-tough-too-dot-dot-dot-wait-what","title":"Men have it tough too…wait, what?","author":"WORK180","body":"\n\t\t\t\t\t<p>As awareness of diversity and inclusion gains momentum and many of us are taking an active role in spreading the word, it&#x2019;s worth taking time to pause and reflect on what we are trying to achieve.&#xA0; Seeking to improve gender equality by championing the cause means we also need to avoid stereotyping gender roles and specific behaviour.</p>\n\n<p>For example, the other day I was explaining what my new company is all about to a male friend. After rambling excitedly for ages about helping women find great jobs, and in particular, helping women negotiate salaries, he politely pointed out that <em>&#x201C;blokes I work with struggle to ask for a pay rise too, you know.&#x201D;</em></p>\n\n<p>Working in the construction industry, he relayed stories that completely blew the whole &#x2018;male&#x2019; stereotype out of the water for me. Besides confessing that the gossip levels at work are on par with high school cafeterias, he spoke about many challenges that traditionally, we usually associate with women.</p>\n\n<p>Looked down upon when leaving work a bit early to pick up the kids and struggling to negotiate some flexibility on the school holidays were some of the issues he faced as a single dad.</p>\n\n<p>On another occasion, I was on my soapbox yet again, this time going on about how senior leaders can support women who are the minority in meetings by actively seeking their input.</p>\n\n<p>Another male interjected my speech and made a good point;</p>\n\n<p><strong><em>&#x201C;The trait of being less outspoken is not gender specific.&#x201D;</em></strong></p>\n\n<p>This stopped me in my tracks and I completely agreed with him. While women tend to display certain traits more than men, there are so many occasions where I&#x2019;ve unnecessarily thrown someone in a stereotypical basket because of their gender.</p>\n\n<p>I&#x2019;m now making an effort to address this unconscious bias.</p>\n\n<p>In a recent <a href=\"/diversity-whats-the-point\" target=\"_blank\">article</a>, DCC Advisory Board member Matt Lee writes,</p>\n\n<p><strong><em>&#x201C;Diversity is not about giving jobs to women, it&#x2019;s about creating a team or group that contains diversity of culture, gender and life experience,&#x201D; </em></strong></p>\n\n<p>I couldn&#x2019;t agree more. My personal view and crusade is angled at helping organisations implement the right policies to enable people, (majority happen to be women) to have careers and be attentive carers at the same time.</p>\n\n<p>Origin Energy Chairman Gordon Cairns summed up my sentiments exactly in this <a href=\"https://www.youtube.com/watch?v=TSjEFgVcIsI#t%3D151\">video</a>, where he shared his thoughts on the struggle women face with having interesting and significant careers yet still looking after their families. &#xA0;<em>&#x201C;We need to be able to provide the support systems, the infrastructure and the sponsorship to enable more women to do both.&#x201D;</em> said Mr Cairns.</p>\n\n<p>However, the same initiatives will also enable men to spend more time with their families, and hopefully we can pull away from the traditional male and female stereotypes more and more.</p>\n\n<p>The Workplace Gender Equality Agency&#x2019;s recent project, <a href=\"http://equilibriumchallenge.com.au/site/\">Equilibrium Man Challenge</a> raises awareness around flexible working. It&#x2019;s a perfect example of companies taking a step in the right direction and shattering the common perception of &#x201C;flexibility is just for women who want to work from home.&#x201D;</p>\n\n<p>An ex colleague shared her current predicament with me recently- she is about to have her first baby and asked her husband (who works in the legal sector) if he&#x2019;d consider approaching his employer to ask to work a four day week. This would have made her return to work after maternity leave a lot easier. <em>&#x201C;Sure&#x201D;</em> was his response at the time, but after asking if he&#x2019;d raised it with his manager, his response was &#x201C;<em>oh, you were serious?? I&#x2019;d get laughed out of the office, I can&#x2019;t do that!&#x201D;</em></p>\n\n<p>My hope for the future is that one day, this wouldn&#x2019;t be seen as a &#x2018;crazy&#x2019; request for both men and women.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/06","associated_company":"work180"}