{"url":"https://www.work180.com.au/blog/2016/05/men-can-code-just-as-well-as-women","title":"Men can code just as well as women","author":"WORK180","body":"\n\t\t\t\t\t<p>Last week, I attended an IT industry event. It was fantastic, and unlike most tech events, there was almost a 50/50 gender split between the guests.</p>\n\n<p>I was thoroughly enjoying speaking with the other guests and discussing the work I do with WORK180 along with the reasons for co-founding the company. Having come from 9 years in ICT, I developed a passion for encouraging women to choose careers in ICT, and other industries under-represented by women such as engineering or mining.</p>\n\n<p>At one stage, I was speaking with a male attendee (male #1) about our careers- he thought WORK180 was an awesome initiative- a reaction I&#x2019;ve grown used to seeing. But then, I was faced head on with a healthy dose of unconscious bias and pure ignorance.</p>\n\n<p>We were joined by another male (male #2), who initially, only introduced himself to male #1, barely even looking at me. Male #2 asked male #1 all about his business, IT background and why he was at the event, almost with his back turned at me. I could tell male #1 was feeling awkward about me being excluded and politely interrupted male #2 to introduce me into the conversation.</p>\n\n<p>I proceeded to tell male #2 what I did and all about WORK180. This was his reply;</p>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p>&#x201C;Great initiative, I met a girl who could code once. We hired her on a project of ours, I couldn&#x2019;t believe it, but she could actually code just as well as the boys on the team.&#x201D;</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p>I could not believe my ears! Without a second thought, I responded with:</p>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p>&#x201C;Wow, I&#x2019;m surprised that was your first experience of a woman who can code given the tenure you&#x2019;ve had in the industry. What you&#x2019;ve just said there is exactly what we&#x2019;re trying to change, I hope that one day we can live in a society where it&#x2019;s not a surprise if a girl can code as well as a boy.&#x201D;</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p>I was so shocked by his comment that I completely forgot to point out that the first ever programmer was a woman - does that mean men can code just as well as women?</p>\n\n<p>He looked embarrassed to say the least. This was a classic example of <strong>unconscious bias</strong> - referring to the bias we have, but are unaware of. Every second, humans take in huge amounts of information and our brains can only consciously process a fraction of this data. Therefore, we rely on &#x201C;auto-pilot&#x201D; for the majority of our thoughts and actions.</p>\n\n<p>At WORK180 we&#x2019;ve seen a number companies combat unconscious bias, such as removing the names from CVs to ensure the candidate&#x2019;s background is evaluated based solely on merit. Companies are also looking beyond the one-off training session and thinking out of the box when it comes to implementing strategies moving forward. For example, one organisation in an industry under-represented by women has appointed C-level female mentors for senior male managers after their initial training session. These managers are now looking at everyday situations through a very different lens.</p>\n\n<p>If you&#x2019;ve had any experiences with unconscious bias, I&#x2019;d love to hear about it- likewise if you&#x2019;ve rolled out unconscious bias training in your organisation with positive results.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects employers with the very best female talent. We engage with everyone from small independent companies to large multinationals, growing and future-proofing businesses through smart policy and process improvements.&#xA0;</p>\n\n<p>But we don&apos;t stop there. We drive engagement between organisations and the people who share their values by combining traditional job advertisement techniques with proactive employer branding initiatives.</p>\n\n<p>Then we talk about it. Developing gender diverse workplaces is both fair and good for business, so we make sure everyone knows when a business is actively improving the way it supports women in the workplace.</p>\n\n<p>Our mission (hopefully yours too)</p>\n\n<p>To finally put an end to workplace discrimination, so that women are valued equally and businesses can enjoy the benefits of a gender diverse workforce.</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p><a href=\"http://www.work180.co/\">Visit the UK WORK180 website</a></p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/05","associated_company":"work180"}