{"url":"https://www.work180.com.au/blog/2017/08/merit-vs-quotas","title":"Merit vs Quotas","author":"WORK180","body":"\n\t\t\t\t\t<blockquote><p>At the current rate of progress, I will not see gender equality achieved in my lifetime.</p></blockquote><p>Nor will my daughter&#x2019;s granddaughter. According to the World Economic Forum&#x2019;s global index we won&#x2019;t see gender equality achieved until 2186. That&#x2019;s 5 generations away.</p><p>The case for quotas has been recently given another airing. Prominent Australian business leaders and politicians including RBA Non-Executive Director Carol Schwartz, AICD Chairman Elizabeth Proust and Shadow Treasurer Chris Bowen have all recently spoken out supporting quotas to advance gender equality.</p><p>It&#x2019;s an acknowledgement that voluntary efforts, including companies setting gender diversity targets are not moving the dial fast enough. &#x201C;Targets with teeth&#x201D; is how Carol Schwartz referred to quotas in a recent podcast on the topic by&#xA0;<a data-cke-saved-href=\"https://pursuit.unimelb.edu.au/podcasts/to-quota-or-not-to-quota\" href=\"https://pursuit.unimelb.edu.au/podcasts/to-quota-or-not-to-quota\" target=\"_blank\">The Policy Shop</a>.</p><p>This is starkly obvious in the slowing rate of female directors&#x2019; appointments to ASX200 Boards during 2017. In their recent&#xA0;<a data-cke-saved-href=\"http://aicd.companydirectors.com.au/advocacy/board-diversity/30-per-cent-by-2018-gender-diversity-target-slipping-out-of-reach\" href=\"http://aicd.companydirectors.com.au/advocacy/board-diversity/30-per-cent-by-2018-gender-diversity-target-slipping-out-of-reach\" target=\"_blank\">quarterly gender diversity progress report</a>, the AICD revealed that the possibility of achieving their target of 30% female directors on ASX200 boards by 2018 is slipping out of reach.</p><blockquote><p>Mentioning quotas immediately evokes the spectre of merit based appointments.</p></blockquote><p>The strongest resistance brought to bear against quotas is via the merit argument. This argument that quotas will lead to not having the best person appointed for the job, presupposes that there is a supply deficit of qualified and experienced women. It also assumes &#xA0;a robust, well defined and collectively understood definition of what constitutes &#x2018;merit&#x2019;. In most cases, there is neither.</p><p>The&#xA0;<a data-cke-saved-href=\"http://aicd.companydirectors.com.au/membership/the-boardroom-report/volume-14-issue-6/addressing-the-merit-myth\" href=\"http://aicd.companydirectors.com.au/membership/the-boardroom-report/volume-14-issue-6/addressing-the-merit-myth\" target=\"_blank\">assumption of merit</a>&#xA0;based appointment is contrary to the research that has repeatedly disproven it. It also relies on extreme confidence that unbiased recruitment and selection processes are in place.</p><p>It&#x2019;s also often raised that women who are appointed to roles in organisations where quotas are in place may have cause to wonder whether they were appointed based on ability, or merely to meet a diversity key performance indicator. For this reason, many women and men are vehemently opposed to the implementation of quotas.</p><blockquote><p>In 2005, Norway was the first country to introduce gender quotas for boards of directors.</p></blockquote><p>Italy, Iceland, Belgium, France and Germany followed. But it remains a contentious and divisive strategy. An attempt by Sweden&#x2019;s government to introduce gender quotas for company boards was dropped in early 2017 with staunch opposition within Parliament meaning the proposed bill wouldn&#x2019;t succeed.</p><p>The question remains of how best to disrupt the entrenched status quo to advance gender equality more rapidly. There are many levers of change already at play in Australia. AICD and company targets, Male Champions of Change, women&#x2019;s professional development programs.</p><blockquote><p>Gender equality initiatives are becoming increasingly more pointed.</p></blockquote><p>An example is the Australian Council of Superannuation Investors (ACSI)&#xA0;<a data-cke-saved-href=\"https://www.acsi.org.au/images/2017WomenonBoardsVotingPolicy.pdf\" href=\"https://www.acsi.org.au/images/2017WomenonBoardsVotingPolicy.pdf\" target=\"_blank\">voting policy</a>&#xA0;for ASX200 companies with poor gender diversity in 2017. In a breathtaking demonstration of shareholder activism, the Superannuation funds&#x2019; peak investor body have developed a coordinated policy to oppose the re-election of male board members in organisations that have failed to respond to ACSI&#x2019;s 2015 goal of 30% female directors by end 2017.</p><blockquote><p><em>&#x201C;On a case</em><em>&#x2010;</em><em>by</em><em>&#x2010;</em><em>case basis, ACSI may recommend to vote against the re</em><em>&#x2010;</em><em>election of directors in those companies which perform poorly in terms of board gender diversity, where:</em></p><p><em>a) Attempts by ACSI to engage at a senior level have been ignored.</em></p><p><em>b) The board cannot articulate a strategy to address board gender diversity in the near term.&#x201D;</em></p></blockquote><p>Their August 2016 voting policy goes further, targeting boards with no women, and recommending orchestrated voting against Chairmen of those boards. A target with teeth indeed. This underscores the reality that targets without accountability, or consequences for non-achievement are useless. These gargantuan funds wield the immense power of our collective superannuation savings. And they are using it to decisively remove male board directors who are ignoring or thwarting efforts to advance gender equality. Against this backdrop of wrath by institutional investors, gender quotas seem comparatively innocuous.</p><p>For the next 4 generations, are we content to squander the full potential of our talent pool, despite the fact that decades of&#xA0;<a data-cke-saved-href=\"http://aicd.companydirectors.com.au/advocacy/board-diversity/research-and-reports\" href=\"http://aicd.companydirectors.com.au/advocacy/board-diversity/research-and-reports\" target=\"_blank\">research</a>&#xA0;has proven that gender diverse leadership produces better organisational outcomes? Or are quotas worth considering.</p><p>This article was <a data-cke-saved-href=\"https://femeconomy.com/merit-vs-quotas/\" href=\"https://femeconomy.com/merit-vs-quotas/\">originally published</a> by Femeconomy.<br><br></p><h4><strong>About Femeconomy</strong></h4><p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/about/\" href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/category/female-leaders/\" href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse. Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p><p>Female leaders will&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/the-femeconomy-effect/\" href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p><p style=\"text-align:center\"><a data-cke-saved-href=\"https://femeconomy.com/submit-a-brand/\" href=\"https://femeconomy.com/submit-a-brand/\" target=\"_blank\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f76a4cc-ab81-479a-999f-7c5c4b7e7ecb.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f76a4cc-ab81-479a-999f-7c5c4b7e7ecb.jpeg\"> </a></p><h4><strong>About WORK180</strong></h4><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"www.dccjobs.com/clients\" href=\"www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/08","associated_companies":["work180"]}