{"url":"https://www.work180.com.au/blog/2017/05/mums-the-word-what-i-learned-from-bias","title":"Mum’s the Word: What I learned from Bias","author":"WORK180","body":"\n\t\t\t\t\t<p>Australians love their mothers.&#xA0;There is no question about it.&#xA0;&#xA0;Historically, over the last few years, the Australian Retailers Association have forecasted spending at around $2 billion dollars for products and services purchased for Mother&#x2019;s Day.</p>\n\n<p>This special day prompted a seemingly casual conversation between myself and a friend.&#xA0;I enquired what she was planning to do for Mother&#x2019;s Day this year. &#xA0;Her story provided a lightbulb moment for me&#xA0;-&#xA0;and revealed the unsettling truth&#xA0;&#x2013; of how pervasive unconscious bias is. &#xA0;</p>\n\n<p>My friend recounted that her children&#x2019;s school was coordinating an event for Mother&#x2019;s Day this year.&#xA0;The event was going to be held during school hours (the assumption was that most mothers don&#x2019;t work).&#xA0;&#xA0;A make-shift beauty parlour would be set up by the teachers. &#xA0;The children would then &#x201C;beautify&#x201D; their mothers, by painting their nails, putting make-up on and doing their hair. &#xA0;&#xA0;As Mothers&#x2019; Day gifts, the children would make beauty products for the mothers to take home.</p>\n\n<p>Last year, the school celebrated Father&#x2019;s Day with an event too.&#xA0;The Father&#x2019;s Day was held on a Saturday morning, outside of school hours (because fathers work full-time).&#xA0;The Father&#x2019;s Day event was to be a BBQ.&#xA0;But here&#x2019;s the rub.&#xA0;The school sent out a notice to all families, requesting for mothers to volunteer to do two things; help the school coordinate the event and; cook the BBQ and serve food on the day to the men. &#xA0;As gifts, the fathers would receive business ties made by the children.</p>\n\n<blockquote>I am a woman and a mother.&#xA0;And I love being pampered. &#xA0;However, through these school events, the unconscious subtext about how men and women are valued in society was made very clear.&#xA0;I found it unsettling. &#xA0;Unconscious bias is habitually reinforced &#x2013; albeit often unintentionally -&#xA0;making it hard for us to recognise it in our daily lives.</blockquote>\n\n<p>The thing is, everyone is predisposed to&#xA0;implicit biases. We all use stereotypes, every day, without consciously even realising it.&#xA0;</p>\n\n<blockquote>From very early on, we learn the undertone of our culture&apos;s messages. &#xA0;Margo Monteith, a professor of psychology at the University of Kentucky, has stated that children form definite and entrenched stereotypes of social groups by the age of five. &#xA0;<a href=\"https://www.psychologytoday.com/articles/199805/where-bias-begins-the-truth-about-stereotypes\">By the age of five!</a></blockquote>\n\n<p>My friend ended up having a courageous conversation with the school Principal. &#xA0;It wasn&#x2019;t about political correctness.&#xA0;It was simply about raising awareness and asking the school to develop a more mindful approach to school events in order to address the impact of unconscious bias with the primary school students.&#xA0;</p>\n\n<p>Clearly, Australians love and value their mums. So why tell this story?&#xA0;I know stories start conversations.&#xA0;Conversations invite awareness and questioning.&#xA0;As we buy products and services for Mother&#x2019;s Day, I hope this story can begin courageous conversations between people to ask &#x201C;which biases are ours&#x201D;?&#xA0;And &quot;how can we do something about it&quot;?</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/05","associated_company":"work180"}