{"url":"https://www.work180.com.au/blog/2016/09/my-biggest-return-to-work-mistakes","title":"My Biggest Return to Work Mistakes","author":"WORK180","body":"\n\t\t\t\t\t<p>I thought preparing for my return to work after maternity leave included organising a start date with my employer, negotiating work days and hours, start and finish times, finding suitable daycare and work clothes that actually fit.</p>\n\n<p>Wrong!</p>\n\n<p>My return to work was an emotionally charged and stressful experience that I would love to help other new mums avoid. So if you&#x2019;re a new mum or soon to be mum with plans to return to your career this is for you. If you know any new mums preparing to return to work please share this with them too.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Mistake #1: My first day back at work was also my son&#x2019;s first full day of daycare.</strong></p>\n\n<p>Even though I had been gradually settling him into daycare with some short playdates I had underestimated how he would react without me. Although I had expected an emotional drop off for both us I hadn&#x2019;t anticipated him being so inconsolable that he would need to be picked up before lunchtime on his first day. Since it was only my first day in the office my husband went to collect him.</p>\n\n<p>You can probably imagine how awful I felt for the rest of the day. I was working with a new manager and some new colleagues on my first day back at work and they didn&#x2019;t see the best of me that day. They saw an emotional mother rather than the confident ambitious career focused professional I used to be.</p>\n\n<p>In hindsight I recommend starting your child in care at least a couple of days before you return to work. One of the reasons I combined our first days was to save money. Again in hindsight that seems silly now. Finances were not so tight that I couldn&#x2019;t have delayed starting work for an extra week while my son started daycare. I would rather have been an emotional mess and more available to my son on his first full day of daycare, from the comfort of home and without the added stress of having returned to my corporate career.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Mistake #2: I underestimated the importance of mindset.</strong></p>\n\n<p>I was so focused on settling my son into daycare and ticking the other items off my to do list, that I completely forgot about myself and my own needs (besides a corporate wardrobe).</p>\n\n<p>So when nothing went to plan in my first few months back at work I was an emotional mess. During this time I learnt that the mindset required to be a working mum is unique. Another thing we&#x2019;re not taught when they put that beautiful baby in our arms!</p>\n\n<p>Things really started to improve for me and feel a whole lot easier when I worked one on one with a coach. She helped me understand how to embrace my new role as a working mum.</p>\n\n<p>Motherhood had changed me so much and I had to spend some time getting to know and understand myself again. So much about me had changed (other than my body!). My values, priorities and how I defined my success changed after I became a mum. Once I understood the &#x2018;new me&#x2019; I was able to make decisions and choices that aligned with my core values, without feeling guilty, stressed, overwhelmed or doubting myself. Most of the time.</p>\n\n<p>With the right mindset and understanding the &#x2018;new you&#x2019;, you can enjoy being a working mum without the guilt, self doubt, stress and overwhelm. You can make decisions that align with your core values and feel confident and empowered as a working mum.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>Kim is one of our contributors, read about them all <a href=\"/contributors\">here</a>.&#x200B;</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2016/09","associated_company":"work180"}