{"url":"https://www.work180.com.au/blog/2018/11/my-life-as-a-female-engineer-at-laing-orourke","title":"My life as an engineer at Laing O'Rourke","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x201C;I have my dream job!&quot;&#xA0;</p><p><strong>Nicole Waterman discusses life as an engineer in construction and how Laing O&apos;Rourke&apos;s parental leave policy is changing the game.&#xA0;&#xA0;</strong></p><p>Nicole Waterman always planned to be an architect, until some good advice from her university lecturer shifted her sights to engineering. Since then, she has built a fulfilling international career which combines her creativity, technical skills and an enduring passion for the built environment. After 10 years developing her skills and experience in design roles overseas, she joined Laing O&#x2019;Rourke in 2012 and hasn&#x2019;t looked back.&#xA0;&#xA0;</p><p>So why design engineering? And why construction?</p><p>&#x201C;I love that my work combines engineering solutions, amazing architecture and effective construction techniques. My favourite architect - Santiago Calatrava - is actually also an engineer. That combination creates some beautiful built environment. It has also enabled me to pursue some fantastic roles around the world.&#x201D;</p><p>Indeed, Nicole spent 10 years working in Europe, the Middle East and Asia. She describes her experiences as &#x2018;fabulous&#x2019;.</p><p>&#x201C;My time overseas was about always wanting to push myself. I&#x2019;ve continually looked for that new challenge&#x2026; for something different to get my teeth into. I&#x2019;ve always tried to be open to new opportunities... to put myself out there and see what comes back.&#x201D;&#xA0;</p><p>Nicole has no regrets about returning to Australia but she explains that it wasn&#x2019;t an easy path.</p><p>&#x201C;I learned so much from my time working on diverse and challenging engineering projects across the globe but a lot of recruiters in Australia didn&#x2019;t understand it and saw it as a gap! Fortunately, as an international company, Laing O&#x2019;Rourke absolutely understood my background and offered me a design position in Construction. It was a new industry to me and the change has been fantastic. After an initial 18-month design project, I got to actually build an Oil and Gas plant that I designed. The satisfaction of that is huge!&#x201D;</p><p>Nicole continued to progress, moving into a Regional Principal Engineer role that she loved.</p><p>&#x201C;It was my dream role! The technical risk sits with you so you need to ensure people follow the processes and procedures. But my favourite piece is &#x2018;know your people&#x2019;. That&#x2019;s about training, career guidance and engagement. You&#x2019;re a support function and a networker, connecting people across projects and ensuring the engineers have everything they need to deliver well. It was incredibly rewarding.&#x201D;</p><p>In 2016, Nicole initiated a move to her current role as Design and Engineering Manager preparing a major project in Sydney. Unsurprisingly, she grabbed the opportunity with both hands.</p><p>&#x201C;It was another new challenge and I&#x2019;ve loved it. From selecting consultants, to working up the strategy, then working on the bid. We&#x2019;ve now had the contract awarded, so we&#x2019;re right in the thick of it. This project brings together everything I&#x2019;ve always dreamed of doing, and everything I&#x2019;ve studied. I can&#x2019;t say too much at this stage but the built environment here is going to be so vastly improved by what we&#x2019;re building.&#x201D;</p><p>When asked about attracting other women into engineering, Nicole&#x2019;s response is clear:</p><p>&#x201C;The number of women pursuing an engineering degree is actually dropping! Laing O&#x2019;Rourke is doing a lot to help change that, including Inspiring STEM+, a brilliant school engagement program I&#x2019;ve supported. But there&#x2019;s also a challenge around retaining women in this field. We have a paid parental leave policy for the primary care giver and it&#x2019;s great to see a lot of men taking up the opportunity. This enables their partners to return to work early and also gives them a better appreciation of the challenges faced by primary care givers in their teams. These things are really important to our business and our people.&#x201D;</p><hr><h4><strong>About Laing O&apos;Rourke</strong><img alt=\"Laing O&apos;Rourke\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d1cf6fc0-6ec2-4c9a-aa49-8c31f693c55e.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d1cf6fc0-6ec2-4c9a-aa49-8c31f693c55e.jpeg\" style=\"width: 300px; height: 137px; float: right; margin: 10px;\"></h4><p>Laing O&apos;Rourke is an Endorsed Employer for Women.&#xA0;<span data-entity-hovercard-id=\"urn:li:fs_miniProfile:ACoAABK3y-4BqR3FrxbVGqRtpENOC8yesMjZ3mI\">Their Managing Director Cathal O&apos;Rourke</span><span id=\"ember10370\">&#xA0;is a WGEA Pay Equity Ambassador. Named twice as Australia&#x2019;s Top 10 most innovative businesses, Laing O&#x2019;Rourke offers generous paid parental leave (26 Weeks), competitive pay, flexible work arrangements and career progression working on exciting projects. Building the future pipeline of women in STEM is also a priority. Their &#x201C;Inspiring STEM+&#x201D; is a school program designed to encourage more girls into STEM courses at university and ultimately careers in construction and engineering.</span></p><p>Learn more about the company&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/laing-orourke\" href=\"https://www.work180.com.au/clients/laing-orourke\">here.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=laing-orourke\" href=\"https://www.work180.com.au/job-search?client=laing-orourke\">Apply for jobs</a>&#xA0;with Laing O&apos;Rourke today.&#xA0;</p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p>\n\t\t\t\t","tags":["laing o'rouke","Career Development"],"upload_date":"2018/11","associated_company":"work180"}