{"url":"https://www.work180.com.au/blog/2017/10/my-top-5-tips-for-live-tweeting-an-event-even-remotely","title":"My Top 5 Tips for Live-Tweeting an Event (even remotely!)","author":"WORK180","body":"\n\t\t\t\t\t<p>Commentating on an event, live, is an exhilarating experience. And it really puts your organisation in the thick of things. Events usually have a dedicated hashtag for the event, so using that hashtag during the hive of activity of an event, will get you noticed and increase your engagement.</p><p>Media tweets (those with graphics, photos, video) will generally perform much better than those without media, and for my industry (scientific service provider), that&apos;s very true. It&apos;s therefore important that the media that you post is engaging, attention-grabbing and informative in some way.</p><p>Last week, I live-Tweeted and live-Facebook-ed the University of New South Wales Eureka Prizes in Sydney, from the comfort of my living room in Melbourne. The organisation I work for is partnered with one of the finalists and they invited my CEO and one of our lead Scientist to attend the gala dinner.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1e9d25c0-5987-4a27-abde-2b029c71f4d8.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1e9d25c0-5987-4a27-abde-2b029c71f4d8.jpeg\"></p><p>The event photographer was able to send photos as they were being taken, so we had them send those directly to me. I was driving home from work when the first photo arrived with a ding on my phone at 6:15pm. At the same time, my colleagues were taking photos with their phones and sending those through to me as well.</p><p>Once I arrived home, I quickly popped some rice in the microwave rice cooker and took my dog out for a mad dash around the block, before racing back upstairs to give her some dinner, while I threw some frozen leftovers in the microwave for myself.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7cdc6fe8-db6a-4827-a3f6-e6e8561206e8.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7cdc6fe8-db6a-4827-a3f6-e6e8561206e8.jpeg\"></p><p>I posted the guest arrival photos on Twitter as soon as I got back, with some appropriate 140-character-long text and kept monitoring the Eureka Prizes Twitter feed and Event Hashtag - liking, replying, re-Tweeting, on behalf of my organisation.</p><p>What a rush! I wasn&apos;t at the event, but I almost felt like I was part of it by being so involved in the social media side. I am the sole social media person for my organisation, so it was just me at the helm. People at the event were interacting with my posts as well as the general scientific community as a whole.</p><p>The photos from the event photographer were beautiful, but the phone photos from my colleagues were not great quality. Also, with the number of institutes and organisations that I needed to tag, it was difficult to say anything meaningful in just 140 characters.</p><p>So, leftovers forgotten, I created some super-fast graphics in&#xA0;<a data-cke-saved-href=\"http://www.canva.com/\" href=\"http://www.canva.com/\">Canva</a>, using photos and some relevant text and I was thrilled with the results. Engagement was high and we grew our total number of followers by almost 3% on the night.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/72bc3cab-895a-497b-88f7-a6b8520d4f0f.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/72bc3cab-895a-497b-88f7-a6b8520d4f0f.jpeg\"></p><p><strong>So, what are my top 5 tips for live-Tweeting an event?</strong></p><ol><li><p>Obtain a copy of the program prior to the event - that way you will have full names, titles, institutes for the speakers or guests when photos are sent to you. You&apos;ll also know the order of proceedings and have an idea of when the big things will be happening.</p></li><li><p>Save the Twitter handles that you will be using in an App or document for quick reference or copying. Better still, create keyboard shortcuts for them so that you only have to type a couple of letters in order for a full 20-character handle (or series of handles) to appear.</p></li><li><p>Photos from your colleagues&apos; phones are probably not going to be of great quality. They will generally be shooting in poor light, they&apos;ll be grabbing quick snaps whenever they can, so composition and focus may not be high on their list of priorities. So, I recommend that you have Lightroom or another editing platform open in the background for some quick tidying up. You can do some good editing on your phone instead if you know what to look out for.</p></li><li><p>Using a tool like Canva can really up your media game. You can create beautiful graphics with ease, adding your company&apos;s branding (logo and colours) to the graphics, to help grow your presence. People are going to see these Tweets because they&apos;re following the Event Tag - it makes sense to take advantage of the situation and highlight your brand.</p></li><li><p>Have some text copy and graphic pre-prepared. Something generic works really well and you can easily replace the photo with one from the event if something works with the graphics. For an event where you might win, it&apos;s good to have two versions ready - &quot;yay, we won!&quot; as well as &quot;congrats to the winners&quot;. just in case.</p></li></ol><p>Oh and make sure you enjoy the ride. It can be quite an adrenaline rush. Ride the wave! But bring some water, because if you&apos;re anything like me, you could be stuck to Social Media for 4 hours without a break!</p><p>Have you live-Tweeted an event before? Any other tips you want to share?</p><p><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/10","associated_company":"work180"}