{"url":"https://www.work180.com.au/blog/2018/05/national-reconciliation-week-a-time-to-celebrate-learn-and-act","title":"National Reconciliation Week: A time to celebrate, learn and act","author":"WORK180","body":"\n\t\t\t\t\t<p>This week we celebrate National Reconciliation Week from 27 May &#x2013; 3 June. These dates commemorate two significant milestones in the reconciliation journey - the successful 1967 referendum and the High Court Mabo decision respectively. This year&#x2019;s theme, Don&#x2019;t Keep History A Mystery, invites all Australians to learn more about Aboriginal and Torres Strait Islander cultures and histories, to share that knowledge and to explore how each of us can contribute to achieving reconciliation in Australia.</p><p>Back in December, <a data-cke-saved-href=\"http://www.work180.com.au/clients/microsoft\" href=\"http://www.work180.com.au/clients/microsoft\">Microsoft Australia</a> took an important step in our reconciliation journey with the launch of our Indigenous cultural competency training provided by Arrilla Digital. CEO of Arrilla Digital, Shelley Rays AO, is an Indigenous woman of the Djiribul people and one of the most experienced Indigenous cultural competency providers.</p><blockquote><p><em>I first met Shelley three years ago when our Senior Leadership team participated in a day of Cultural Competency training at the National Centre of Indigenous Excellence (NCIE). This training was led by Shelley and it made a significant impact on me personally, as I realised just how little I had been taught of Aboriginal and Torres Strait Islander history, culture and people, and how much more there is to learn.&#xA0;</em></p></blockquote><p>Since then, Shelley has guided Microsoft on the importance of reconciliation and the steps we can take as an organisation &#x2013; and as individuals &#x2013; to contribute to achieving reconciliation.&#xA0;</p><p>Already 86% of Microsoft Australia&#x2019;s employees have completed the Arrilla Digital cultural competency training and it has been incredibly rewarding hearing from employees across the business about the profound impact it has made on them personally and professionally.</p><p>The training sits at the heart of Microsoft&#x2019;s dedication to inclusiveness but we also know that there is so much more to learn about Aboriginal and Torres Strait Islander cultures and histories in order to contribute to achieving reconciliation in Australia.</p><blockquote><p><em>At Microsoft Australia, we have been fortunate to be working with a couple of incredible organisations who are using technology to showcase and preserve Aboriginal and Torres Strait Islander histories and cultures</em>.</p></blockquote><p>Mikaela Jade, founder of Indigital and one of Microsoft&#x2019;s Reconciliation Action Plan (RAP) Advisors, uses&#xA0;mixed and augmented&#xA0;reality&#xA0;to translate the history and culture of some of the oldest communities in the world, ensuring the authenticity and cultural heritage are preserved. Mikaela sees new technologies &#x201C;as a way to be able to bridge that gap and give people an opportunity to learn about Indigenous culture.&#x201D;</p><p>Brett Leavy, Managing Director of Bilbie, is merging traditional knowledge with&#xA0;3D virtual landscapes&#xA0;to present pre-colonisation Australia, and represent the arts, cultural stories, heritage, traditional knowledge and histories of First Nation people using new, immersive and interactive technologies.</p><p>We have spent the last 18 months primarily in listening and learning mode and were recently challenged by our External Advisory Board to think about not only how we can partner with communities to share, preserve and celebrate Aboriginal and Torres Strait Islander cultures and histories right now, but also how can we create change and lasting impact for generations to come.</p><p>This last thought &#x2013; the desire to create lasting change - is something that we are committed to. We look forward to partnering with Aboriginal and Torres Strait Islander communities and our networks to celebrate Aboriginal and Torres Strait Islander cultures and histories, to share that knowledge and to explore how each of us can contribute to achieving reconciliation in Australia.</p><hr><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e772ee07-0593-416a-8da1-554bae051d0e.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e772ee07-0593-416a-8da1-554bae051d0e.jpeg\" style=\"font-size: 16px; float: right; margin: 10px; width: 200px; height: 200px;\"></p><h4><strong>About the Author</strong></h4><p>Steven Worrall is the Managing Director at Microsoft Australia.&#xA0;Steven is a senior technology industry leader who lives and breathes client success through the application of technology. He believes high calibre, motivated people who focus on helping clients achieve their outcomes are the ones who achieve the most. Before taking on the role of Managing Director, Microsoft Australia, Steven was Director of Microsoft&apos;s Enterprise and Partner Group, where he brought together business know-how, technology and people to deliver innovative solutions for Australia&#x2019;s largest companies. He is now responsible for Microsoft&#x2019;s overall business in Australia, ensuring the company meets the needs of all its customers and the 11,000 plus partners who sell or build on the Microsoft platform.</p><hr><h4><strong>About Microsoft<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=microsoft\" href=\"https://www.work180.com.au/job-search?client=microsoft\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a96f3b87-9e22-4ec3-bcf4-d44823f41f5a.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a96f3b87-9e22-4ec3-bcf4-d44823f41f5a.png\" style=\"float: right; width: 300px; height: 110px; margin: 10px;\"></a></strong></h4><p>Microsoft is an Endorsed Employer for Women. They have passed WORK180&apos;s 20 pre-screening criteria and offer&#xA0;20 weeks paid parental leave,&#xA0; flexible working, no minimum tenure to be eligible for paid parental leave and is a Workplace Gender Equality Agency Pay Equity Ambassador.</p><p>Read more about their workplace on their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/microsoft\" href=\"https://www.work180.com.au/clients/microsoft\">Best Employer page.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=microsoft\" href=\"https://www.work180.com.au/job-search?client=microsoft\">Browse jobs&#xA0;and apply</a> to join Microsoft.&#xA0;</p><hr><h4 style=\"font-family: Lato, sans-serif;\">About WORK180</h4><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.</p>\n\t\t\t\t","tags":[],"upload_date":"2018/05","associated_companies":["work180"]}