{"url":"https://www.work180.com.au/blog/2017/05/never-settle-for-second-best","title":"Never Settle For Second Best","author":"WORK180","body":"\n\t\t\t\t\t<p>We spoke to Lisa Farquhar just days before her nine year anniversary with MSD, which actually falls on Valentine&#x2019;s Day, and during the interview, it quickly became obvious that Lisa is in as much love with her job as the day she started. These days, it&#x2019;s rare to see people stay with the same company for that long, however Lisa has ensured her career remains challenging, rewarding and flexible.</p><p>At DCC Jobs, we often hear from women who resign themselves to less senior roles, after having children and feeling like they can&#x2019;t be &#x2018;choosy&#x2019; and settling for less rewarding careers. Lisa herself is a strong believer in never settling for second best and shared her tips on achieving a rewarding career and paying it forward to support other women.</p><p><br><strong>Don&#x2019;t Let Lack of Industry Experience Limit Your Options</strong></p><p>Lisa started her sales career at 18 years old, selling Foxtel door to door. With a career spanning over 20 years, Lisa worked in account management, Business Development roles and ran a retail recruitment firm. Looking for a change, Lisa researched the pharmaceutical industry and applied for a sales representative role at MSD. Traditionally, sales reps would have a clinical background such as nursing, or a science degree. Lisa had neither, but instead leveraged her cross transferrable skills developed across her career. Over the years, Lisa progressed within the business, and is now a Senior Sales Manager, leading the Cardiovascular and Portfolio Team at MSD. Lisa manages a team of six in addition to a team of five at home. Flexibility plays a big part in achieving a balance between the two, with Lisa currently trialling a compressed week arrangement. &#x201C;I&#x2019;ll admit, at first I was reluctant to take on a senior management role,&#x201D; confessed Lisa. &#x201C;I worried about the business doubting my ability to find a balance.&#x201D; Lisa challenged her own thinking, and realised the company had deep trust in her. &#xA0;This was four years ago, and Lisa hasn&#x2019;t looked back ever since, executing the senior role with exceptional results over the years.</p><p><br></p><p><strong>Fly Your Own Flag</strong></p><p>&#x201C;Our own language should be empowering,&#x201D; emphasised Lisa. &#x201C;Often, I hear women make statements that are full of self-doubt, when they are fully capable. I&#x2019;m also a strong believer in the &#x2018;Growth Mindset&#x2019;, and knowing your abilities are not fixed.&#x201D;</p><p>&#x201C;People ebb and flow between high growth periods and we all hit roadblocks along the way,&#x201D; continued Lisa. &#x201C;As long as you are eager and willing, the best lessons learnt can come from the process and effort you put in, as opposed to outcomes.&#x201D; Lisa is such an advocate of the &#x2018;Growth Mindset&#x2019; mentality, she with the help of one of her peers has introduced a training concept based on the principle to train the sales team on mindset across the Australian business.&#xA0;Lisa&#x2019;s favourite books on the topic are;&#xA0;<a data-cke-saved-href=\"https://www.amazon.com/Mindset-Psychology-Carol-S-Dweck/dp/0345472322/ref=sr_1_sc_1?s=books&amp;ie=UTF8&amp;qid=1488094230&amp;sr=1-1-spell&amp;keywords=phsycoloogy+of+success\" href=\"https://www.amazon.com/Mindset-Psychology-Carol-S-Dweck/dp/0345472322/ref=sr_1_sc_1?s=books&amp;ie=UTF8&amp;qid=1488094230&amp;sr=1-1-spell&amp;keywords=phsycoloogy+of+success\">Mindset: The New Psychology of Success</a>&#xA0;by Carol Dweck and&#xA0;<a data-cke-saved-href=\"https://www.amazon.com/Playing-Big-Practical-Wisdom-Create/dp/1592409601/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1488094206&amp;sr=1-1&amp;keywords=playing+it+big\" href=\"https://www.amazon.com/Playing-Big-Practical-Wisdom-Create/dp/1592409601/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1488094206&amp;sr=1-1&amp;keywords=playing+it+big\">Playing Big: Practical Wisdom for Women Who Want to Speak Up, Create, and Lead</a>&#xA0;by Tara Mohr.</p><p><br></p><p><strong>Pay it Forward</strong></p><p>&#x201C;As a global company, MSD is an extremely large global company, yet what resonates with me the most are the ethics and integrity about how we do our business,&#x201D; said Lisa. &#x201C;Over the years, the company has evolved, with a big focus on diversity and inclusion, and gender equity. To be part of this is extremely rewarding.&#x201D;</p><p>The company&#x2019;s focus on developing people and its focus on gender equality, enabled Lisa to develop a very successful career through both training and guidance. &#x201C;The support is fantastic, and I&#x2019;m very blessed to have fantastic managers.&#x201D; One of Lisa&#x2019;s managers, Nirelle, played an integral role in her career journey. &#x201C;Back when I was a sales representative, Nirelle saw capabilities within me that I didn&#x2019;t see myself. Her insights shaped my development plan,&#x201D; Lisa told us.</p><p>Lisa is now paying it forward to others in the business, by identifying potential in those who may otherwise not put themselves forward and developing their leadership skills. Working with the MSD Aspiring Sales Managers program, has been an eye opener for Lisa. In talking to the Aspiring Sales managers Lisa discovered &#x201C;It&#x2019;s all about uncovering personal barriers that women have about leadership roles and their readiness,&#x201D; explained Lisa. &#x201C;The sentiment of &#x2018;I have to be a perfect a coach prior to becoming a manager&#x2019; is a good example. My answer to that is &#x2018;I haven&#x2019;t had any coaching experience at all, yet here I am! These types of conversations and story telling are very powerful.&#x201D;</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6c625f29-5b43-448d-ac05-dadf2007d52b.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6c625f29-5b43-448d-ac05-dadf2007d52b.jpeg\" style=\"margin: 10px;\" alt=\"MSD Lisa Farquhar DCC Jobs\"></p><p style=\"text-align:center\"><em>Lisa (left) and Naomi Jardine. Lisa has been working with Naomi to help advance her career with MSD.</em></p><p><br></p><p><strong>Does Your Company&#x2019;s Leadership Team Walk the Talk on Gender Equality?</strong></p><p>MSD recently engaged Mercer to deliver training on Unconscious Bias and facilitate a candid discussion with their leaders. The workshop identified the need to be more proactive in the business, and training on this subject filtered down to leadership team and was rolled out to the sales representatives.</p><p>&#x201C;One of the more prominent discussions that arose in the workshops was questioning if we did have an unconscious bias around gender in the business,&#x201D; recalled Lisa. &#x201C;As it stood, overall women made up approximately 60 per cent of the business in a sales representative role, however at sales management level, this wasn&#x2019;t being reflected.&#x201D;</p><p>MSD explored why this could be the case - was it due to the hiring managers, unconscious bias at play or other, unidentified blockers existing for women? After an internal survey and on the ground discussions, it became apparent there was some disconnect between how sales representatives, in particular women, understood the roles and what the roles actually involved. &#x201C;We decided we had to get better at storytelling with managers in those roles being authentic. We asked them to speak about their personal challenges and how they managed their roles through flexibility and support,&#x201D; said Lisa.</p><p>Through the MSD Men and Women&#x2019;s &#xA0;Network (MWN), both women and men are invited to share their personal experiences. &#x201C;For example, we are hearing from men who are working flexibly to be more involved in their children&#x2019;s lives, which is paying a key part in flexibility being the norm for everyone,&#x201D; highlighted Lisa.</p><p>Global leaders must also be driving this change and at MSD there is support from the top. &#xA0;Australian and New Zealand Managing Director Riad El-Dada, recently shared his commitment to creating an inclusive workplace in the DCC campaign for International Women&#x2019;s Day and has taken the WGEA Pay Equity Ambassador Pledge.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5e8a3575-f0a7-4a43-bb37-e53b7947a365.png\" alt=\"MSD IWD pledge\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5e8a3575-f0a7-4a43-bb37-e53b7947a365.png\" style=\"margin: 10px;\"></p><p><br></p><p>In Australia, MSD were recognised an Employer of Choice for Gender Equality by The Workplace Gender Equality Agency along with becoming a DCC Endorsed Employer for Women.</p><p><br></p><h4><strong>About MSD</strong></h4><p>MSD is a DCC Endorsed Employer for Women. Learn more about their company <a data-cke-saved-href=\"https://www.dccjobs.com/clients/merck-sharp-and-dome\" href=\"https://www.dccjobs.com/clients/merck-sharp-and-dome\">here</a>.<br><br>Find jobs with MSD <a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=merck-sharp-and-dome\" href=\"https://www.dccjobs.com/job-search?client=merck-sharp-and-dome\">here.&#xA0;</a></p><p><br></p><h4><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.&#xA0;<span style=\"font-size: 16px;\">Set up your job alert with&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">1 click</a><span style=\"font-size: 16px;\">&#xA0;now.&#xA0;</span>&#x200B;</p><p><br></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/05","associated_company":"work180"}