{"url":"https://www.work180.com.au/blog/2018/03/new-to-plumbing-5-interesting-technologies-you-should-know-about","title":"New to Plumbing? 5 Interesting Technologies You Should Know About","author":"WORK180","body":"\n\t\t\t\t\t<p>Plumbing is a great field to be in. As long as there are drainage systems, there will be a need for qualified plumbers. Not to mention, you can train while you work and gain experience to increase your earning potential. Salaries range all throughout the country, but the&#xA0;average&#xA0;experienced plumber is reported to earn&#xA0; <a data-cke-saved-href=\"https://www.bls.gov/ooh/construction-and-extraction/plumbers-pipefitters-and-steamfitters.htm\" href=\"https://www.bls.gov/ooh/construction-and-extraction/plumbers-pipefitters-and-steamfitters.htm\">$51,450</a>, according to the Bureau of Labor Statistics. If you would like to earn the median wage or more, here are interesting plumbing technologies to learn about:</p><h4>Newer Trenchless Technologies</h4><p>Just a few years ago, a failed pipe meant that you were going to have to dig a trench. Not only does trench digging take up a lot of time, it is also very inconvenient for the homeowner. With newer trenchless technology, plumbers are able either burst or seal the pipe with a relining method. As long as the pipe is wide enough, plumbers can use a camera and their special hydraulic tools to complete the job.</p><h4>Tankless Technologies</h4><p>Efficiency has always been a major concern in the plumbing industry. Fortunately, with new developments in the engineering of appliances comes greater efficiency. New tankless water heater technologies are able to heat the water up that is being used at the moment, eliminating the need for a tank. These appliances are high in demand because of how efficient they are.</p><h4>Draining Systems</h4><p>There are a variety of different types of draining systems that are appropriate for use in light traffic and heavy duty traffic areas. Since the water flow that must be drained is very dependent on the area, the region, and the climate, it&#x2019;s important for plumbers to know which drain technologies to recommend, from PointDrain and polymer sumps to concrete and fiberglass catch basins.</p><h4>New CrossLinked Polyethylene Piping</h4><p>Piping material matters. When you are repairing piping systems and you see that the materials are cracked and corroded, you can see why the material choice is important. Copper piping has been popular for decades. This piping is popular but very expensive. With the development of PEX cross-linked polyethylene piping materials, homeowners will enjoy more flexibility and durability at a cheaper price. It even costs less to install because there&#x2019;s a need for fewer connectors.</p><h4>Home Automation</h4><p>Home automation has been making homes and the systems inside much smarter. You can control lights and temperature in the home, and now with new smart pipes, it&#x2019;s possible to monitor and control pipes and faucets via your phone. While it is not popular yet, smarter water management apps make it possible for homeowners to detect pipe leaks early. They also can gauge whether or not the lawn needs to be watered with recycled grey water.</p><p>Some technologies used today have been around for years and others are just being developed. Staying on top of different technologies that you will hear about in the industry will get you noticed by other plumbers who are looking for good new additions to their respective teams.<br>&#x200B;</p><h4><strong>About the Author</strong></h4><p>Dixie Somers is a freelance writer and blogger for business, home, and family niches. Dixie lives in Phoenix, Arizona, and is the proud mother of three beautiful girls and wife to a wonderful husband. Dixie got information for this piece from <a data-cke-saved-href=\"https://rapidfirstplumbing.com\" href=\"https://rapidfirstplumbing.com\">Rapid First Plumbing</a>.&#xA0;</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180&#xA0; is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/03","associated_companies":["work180"]}