{"url":"https://www.work180.com.au/blog/2018/10/new-report-helping-companies-attract-the-best-talent-now-and-in-the-future","title":"New report helping companies attract the best talent now and in the future","author":"WORK180","body":"\n\t\t\t\t\t<p>A new, first of its kind report and HR Health Check released today by Work180, enables Australian&#xA0; companies&#xA0;to benchmark themselves against the most progressive companies in their industry for policies on flexible working, equal pay, parental support, career development, and&#xA0;employee assistance. The Work180 Report and HR Health Check are resources for employees and employers alike, giving companies an opportunity to&#xA0;future proof&#xA0;by understanding how to secure the best talent available.</p><p>&#x201C;We&#x2019;ve researched Australia&#x2019;s most progressive companies and found a quiet revolution is taking place. These companies are changing and developing policies that promote positive outcomes for employees and employers with greater support than often archaic and rigid workplace policies,&#x201D; says Valeria Ignatieva, co-founder and CEO, Work180.&#xA0;</p><p>&#x201C;Employees are the most valuable intangible asset for a company. It makes sense for smart companies to invest in their employees and help attract the very best people,&#x201D; says Valeria.</p><p>The Work180 Report references an EY global study that states by 2025 millennials will make up more than 75 per cent of the workforce. And for millennials, a healthy work-life balance isn&#x2019;t just a nice-to-have, it&#x2019;s a deal-breaker.&#xA0;</p><p>&#x201C;Employees will talk with their feet and walk out of their job into one that supports and considers their needs if organisations are not listening. Gone are the days where work is only about the 9-5, companies need to switch the focus to how employees deliver outcomes and the best way to do this, or fear being left behind.</p><p>&#x201C;Work180 has been working with Australia&#x2019;s best employers for the past four years, holding them accountable to workplace policies if they want to advertise jobs on the Work180 platform. Our business has grown as more and more companies are committed to supporting and rewarding employees,&#x201D; says Valeria.</p><p>The anonymous online HR Health Check takes less than 10 minutes to complete and by providing details of your employers&#x2019; HR policies, the data is compared to companies that are similar in terms of size and industry. Comparison is also drawn from publicly available information on Australian businesses from the Workplace Gender Equality Agency (WGEA).</p><p>On completion of the Health Check you are provided with a rating, based on industry standards and the employee benefits offered by those setting the highest benchmarks.</p><p>The Report highlights the stark difference between conditions offered by Australian businesses noted in the WGEA, Leaders, those companies working with Work180 that are supporting and rewarding employees, and Pacesetters, the best performing companies.&#xA0;For example, of those Australian businesses that offer paid parental leave for a secondary carer, only 1.4 weeks is offered while 2.33 weeks is offered by Leaders and 18 weeks is offered by Pacesetters.</p><p>Covering workplace policies that are often available such as parental leave and employee assistance programs, the report also includes policies for stillbirth or domestic violence that are often only considered by the Pacesetters.</p><p>&#x201C;The Report is a great resource for employers to understand what other companies are offering employees, and for employees it is an opportunity or even a discussion point, to go to their employer with the kind of workplace arrangement that they would like to be part of,&#x201D; says Valeria.</p><p>&#x201C;We see this as an ever-evolving benchmarking tool so as companies improve, benchmarks will raise.&#x201D;</p><p>HR expert and academic with research interests in gender, work and organisations, Dr Janine Pickering from Swinburne University of Technology explains, &#x201C;There has been major progress with a cohort of employers offering flexible work. But there is still a long way to go for flexible work options to be normalised, especially part-time management work. It is often difficult to find part-time roles at senior management level or above and many employees still endure a career penalty if they choose to work part-time or non-standard business hours.</p><p>&#x201C;The Work180 Report highlights those companies that are successfully providing work conditions that benefit both the employee and the employer, and for those companies not there yet, what they could be considering.&#x201D;</p><p>Construction firm Laing O&#x2019;Rourke is committed to building a workforce that reflects today&#x2019;s diverse society. &#x201C;It&#x2019;s hard to say exactly how many people work flexibly at Laing O&#x2019;Rourke and that&#x2019;s because it&#x2019;s part of our culture. People will work with their manager and their team to decide if they&#x2019;re going to come in a bit later, do childcare pick ups or whether they might work from home&quot; says Helen Fraser, General Manager, Human Capital, Laing O&#x2019;Rourke.&#xA0;</p><p>The Work180 Report and the HR Health Check provides employers and employees with a valuable resource that will help them make decisions about their place of work or where they may want to work.</p><p>The Work180 Report can be downloaded at <a data-cke-saved-href=\"https://work180report.com/\" href=\"https://work180report.com/\">https://work180report.com/</a> and the HR Health Check is available at <a data-cke-saved-href=\"https://work180report.com/hr-health-check\" href=\"https://work180report.com/hr-health-check\">https://work180report.com/hr-health-check</a>.</p><p><br></p><h4><strong>About WORK180</strong></h4><p>Launched in 2015 in Australia by Gemma Lloyd and Valeria Ignatieva, Work180 is a <a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board</a> with a difference. Every company on the Australian and New Zealand website is pre-screened against a set of 20 criteria, including pay equity, flexible working, women in leadership and paid parental leave. Work180 is the only website to make this information publicly available. Work180 caters to a wide variety of occupations and includes a strong presence in traditionally male-dominated industries, championing and effecting change in the workplace. <a data-cke-saved-href=\"http://www.work180.com.au/\" href=\"http://www.work180.com.au/\">www.work180.com.au</a></p>\n\t\t\t\t","tags":["WORK180 Report","WORK180 News"],"upload_date":"2018/10","associated_companies":["work180"]}