{"url":"https://www.work180.com.au/blog/2018/08/no-internal-emails-or-meetings-heres-my-assessment-of-working-in-the-cloud","title":"No internal emails, or meetings. Here’s my assessment of working in the cloud.","author":"WORK180","body":"\n\t\t\t\t\t<p>Having worked at KeyPay for a year, I never thought I&#x2019;d learn as much as I have in such a short time. Having previously worked at large corporates with thousands of employees, joining KeyPay and its small team of 19 people (now 31) was quite a change.</p><p>My role was created to build a marketing department to support KeyPay&#x2019;s international expansion plans and help grow the business. What I didn&#x2019;t expect was how much personal growth was about to happen!</p><p>These are my thoughts on different ways of working and the importance of finding the right environment where you feel like you belong.</p><h4><strong style=\"font-size: 1.6rem;\">You&#x2019;d be surprised at how adaptable you can be.</strong></h4><p>The KeyPay team doesn&apos;t just talk about the cloud, they live and breathe it in every aspect of their work. No internal emails. no meetings and a largely remote workforce. Having come from from large, highly matrixed organisations, this was quite a shock to me.</p><p>My first few days consisted of constantly refreshing on my inbox. Was something wrong with the server? I knew KeyPay didn&#x2019;t operate on emails internally, but my inbox habit was so ingrained, it took a few days before I realised I&#x2019;d only ever need it for communicating externally.</p><p>As time went past, I&#x2019;ve found that work just gets done a lot faster without internal emails. Collaboration is key, and collaboration in real time via Slack, is even better. Once I stopped hitting refresh, I had this feeling of being liberated from the chains of email dependence. I learned that mixing up the &#x2018;normal way of doing things&#x2019; really encourages you to keep at it, and try new tools and systems all the time.</p><h4><strong>The best employers hire well, and trust their people.</strong></h4><p>Having the flexibility to work where I want is a benefit built on trust. I love heading into the office to see my colleagues, but sometimes I just need to really focus without any distractions. Because the company is largely remote based, it&#x2019;s no issue whatsoever. We simply post a message in Slack when we&#x2019;re off for lunch or done for the day. While this isn&#x2019;t possible for all jobs, I found that having the option really does add value to workplace happiness.</p><h4><strong>Are you truly being heard?</strong></h4><p>KeyPay hires based on cultural contribution rather than experience, believing you can learn the rest on the job. I feel like I am truly shaping the business through my contributions and others share this feeling. Twice yearly the team comes together to meet new faces, discuss the business and new opportunities, as well as actively contributing to the direction of the company.</p><p>We feel empowered to do our best work, without the shackles. This extends into how we serve our customers too, and truly wanting to change the way our customers work and pay their staff.</p><h4><strong>Culture trumps process</strong></h4><p>Being completely honest, at first, the thought of having so much freedom and not much process was quite daunting. Coming from larger organisations where process is drummed into employees from day one, it was quite a big change. But once I got used to this new way of working, I felt completely liberated by it. Following rules that have been around for a long time can cause you to become stagnant and the unknown can seem unsettling. The beauty of KeyPay is that you have the freedom to shape your own processes and follow your most effective path.</p><p>They say that when you join KeyPay, you won&#x2019;t ever want to go back to conventional ways of working. I can say from my own experience (and our incredibly low churn) that this is definitely true!</p><hr><p><strong>Abo</strong><strong>ut Sarah</strong><br><br>Sarah leads the marketing team at <a data-cke-saved-href=\"https://www.work180.com.au/clients/keypay\" href=\"https://www.work180.com.au/clients/keypay\">KeyPay</a>, one of Australia&#x2019;s leading payroll providers. Prior to KeyPay, Sarah established the marketing communications plan for the United Nations Defeat-NCD Partnership and held positions at Intuit and Accenture. Sarah&#x2019;s passions include people, equality, culture&#xA0;and&#xA0;technology.</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/08","associated_companies":["work180"]}