{"url":"https://www.work180.com.au/blog/2018/06/no-timesheets-no-6-minute-increments-how-this-law-firm-is-challenging-its-own-profession","title":"No timesheets. No 6-minute increments. How this Law Firm is Challenging its Own Profession","author":"WORK180","body":"\n\t\t\t\t\t<p>Buckminster Fuller once said &#x201C;You never change things by fighting the existing reality. To change something, build a new model that makes the existing model obsolete&#x201D;.</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5c7ec4ec-e55b-4e74-8efb-492515eddb85.png\" style=\"float: right; margin: 10px; width: 100px; height: 100px;\">Building a new legal model is exactly what Construction and Infrastructure lawyer Janelle Kerrisk set out to achieve when she created Helix Legal in 2016. It has been built on a foundation whereby flexible working is the cornerstone of everything they do, and <a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">they are now proudly a </a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">Flex Able</a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\"> Certified Employer.</a></p>\n\n<blockquote>\n<p><em>After 14 years in a traditional law firm, Janelle reviewed every single &#x2018;reason&#x2019; that flexible working &#x2018;just doesn&#x2019;t work for law firms&#x2019;, and set out to remove every single speedbump. </em></p>\n</blockquote>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1f01c767-35e3-4f02-a58f-76bf814042e5.jpeg\" style=\"float: right; margin: 10px;\">Operating from a tech savvy co-working space in Brisbane has demonstrated where the world of work is going, how much is possible virtually, and how many people live and play globally, along-side their local team.</p>\n\n<p>Every person at Helix Legal is doing something that matters to them outside of work: studying to become a lawyer; competing in triathlons; having babies; or wanting to spend more time with family members. When you put flexible working and accommodating the needs of human beings at the forefront in business, it becomes a winning formula.</p>\n\n<p>&#x201C;There is a misconception that flexible working costs money. I want to prove that flexible working increases the bottom line. When people are 100% committed to their work and personal goals, and you help them reach those goals, they are committed like nothing I have ever seen before.&#x201D; says&#xA0;founder Janelle Kerrisk.</p>\n\n<p>The way the Helix Legal team work is not a secret from their clients. In fact, it is a key selling point. It is win : win!</p>\n\n<blockquote>\n<p><em>No timesheets for their staff to complete.&#xA0; </em></p>\n</blockquote>\n\n<p>The focus is on giving the right advice and solutions on time, every time.</p>\n\n<blockquote>\n<p><em>No 6 minute increments for client billing. </em></p>\n</blockquote>\n\n<p>Helix Legal know their industry inside out and know the limits of their legal expertise. This enables them to accurately quote, and eliminate price-shock risk for their clients.</p>\n\n<p>Rather than look at traditional staff retention rates, Janelle accepts that no-one stays in a job forever. Instead, retention is viewed through the lens of &#x2018;positive lifelong advocacy&#x2019;.&#xA0; Happy staff and clients will tell everyone about you, not necessarily stay with you forever.</p>\n\n<blockquote>\n<p><em>&#x201C;You just don&#x2019;t churn and burn </em><em>people</em><em>&#x201D; says Janelle.</em></p>\n</blockquote>\n\n<p>There is a big element of trust at play, and the team are expected to communicate and deliver on what needs to be done each day. They use a group calendar, talk every day about what they are working on, use video conferencing and chat instead of walking to someone&#x2019;s desk, and every Wednesday every person works in the same office for staff meetings and face to face catch ups.</p>\n\n<p>In the same way that Monday to Friday 9-5 doesn&#x2019;t work for everyone, flexible working from a co-working space won&#x2019;t work for everyone either. However, this new paradigm for working in the legal profession is certainly the new model that may just make the existing model obsolete.</p>\n\n<p>Congratulations Helix Legal on becoming a Flex Able Certified Employer.</p>\n\n<hr>\n<p><strong>About the&#xA0;Flex Able&#xA0;Certification</strong></p>\n\n<p><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p>\n\n<p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p>\n\n<p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? WORK180&apos;s&#xA0;Flex Able&#xA0;Certification helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p>\n\n<p><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">Learn more about the&#xA0;</a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">Flex Able</a><a href=\"https://www.work180.com.au/advertisers/flex-able-certification\">&#xA0;Certification&#xA0;here.</a></p>\n\n<p style=\"font-family: Lato, sans-serif;\"><strong>Flex Able&#xA0;Certified Employers include:</strong></p>\n\n<p style=\"font-family: Lato, sans-serif;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/245a56b6-d30c-4a5b-b43f-8ebf5a79f335.png\"></p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects employers with the very best female talent. We engage with everyone from small independent companies to large multinationals, growing and future-proofing businesses through smart policy and process improvements.&#xA0;</p>\n\n<p>But we don&apos;t stop there. We drive engagement between organisations and the people who share their values by combining traditional job advertisement techniques with proactive employer branding initiatives.</p>\n\n<p>Then we talk about it. Developing gender diverse workplaces is both fair and good for business, so we make sure everyone knows when a business is actively improving the way it supports women in the workplace.</p>\n\n<p>Our mission (hopefully yours too)</p>\n\n<p>To finally put an end to workplace discrimination, so that women are valued equally and businesses can enjoy the benefits of a gender diverse workforce.</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p><a href=\"http://www.work180.co/\">Visit the UK WORK180 website</a></p>\n\n\t\t\t\t","tags":["WORK180 News","flexible working"],"upload_date":"2018/06","associated_companies":["work180"]}