{"url":"https://www.work180.com.au/blog/2016/05/notes-from-the-wimnet-chair","title":"Notes from the WIMnet Chair","author":"WORK180","body":"\n\t\t\t\t\t<p>I write this late at night after a long day at site, sitting on a single bed in an unfamiliar room.</p>\n\n<p>I am in temporary accommodation in a town near the mine I manage a project at. This town is not only a long drive from my family and friends, but after the drive I must then catch two flights to get home. Although this is the case, I don&#x2019;t think I would change the way it is.</p>\n\n<p>Yes, I have a husband, a dog and an 18 month old son at home. Yes, I would like to spend more time with my family and friends and not be on such friendly terms with airport staff or the inside of a hire car. But I love what I do. I like that my role allows me to make a significant difference to the organisations I work with as well as a chance to develop myself professionally. I can show the world what I am capable of, while providing for my family in a way that the roles often put aside for working mums such as myself probably couldn&#x2019;t. It&#x2019;s also a hell of a lot of fun! Because of this, both I and my husband are quite happy with me working in the way that I do. As a partnership and as individuals, it works for us.</p>\n\n<p>The more I talk to those within the industry, I seem to be one of the lucky ones. Unfortunately, many women are not given the opportunity to step up in their organisations. Many are not even considered for a promotion or different role, particularly if they have children or are of &#x2018;child-bearing age&#x2019;. Often this is not because employers do not want mothers in those roles, but because they assume women want to be closer to their families and want to work less hours with more flexibility. This may be true in some cases, but as shown in a <a href=\"https://hbr.org/2016/03/why-so-many-thirtysomething-women-are-leaving-your-company\" target=\"_blank\">recently published report</a> on why women in their thirties leave a job, the top four reasons had nothing to do with flexibility. Women are leaving because of remuneration, limited development opportunities, and a lack of interesting and meaningful work.</p>\n\n<p>To employers out there, male and female, I ask you to expand your thinking about how to support women within your teams. Broaden your focus from offering predominantly flexible work options to a holistic strategy that recognises women are just like men. They are keen to work hard so they can succeed, even if the roles in your business may have long hours, extensive travel and difficult responsibilities. At least give them to chance to say no instead of making that decision for them. Without access to career-building roles, the number of women in senior roles is never going to improve.</p>\n\n<p>Being my first bulletin as the national Chair, I would like to take this opportunity to thank the men and women who volunteer their time to help WIMnet. They are a critical element in our ability to provide support to women working within the industry as well as enabling WIMnet to be a credible resource for those men and companies keen to a see an improvement in diversity in the workforce.</p>\n\n<p>WIMnet and its associate groups now have mentoring programs in four states dedicated to the elevation of women within mining and resources. It has professional development and networking events occurring on almost a weekly basis. WIMnet is increasing female representation at conferences (including on organising committees) and on a number of occasions this year already, WIMnet members have played a critical role in promoting and enhancing the diversity programs of companies within our industry.</p>\n\n<p>With recent study results published in the <a href=\"https://hbr.org/2016/03/women-and-minorities-are-penalized-for-promoting-diversity\" target=\"_blank\">Harvard Business Review</a> showing that &#x2018;women and minorities are penalised for promoting diversity&#x2019;, such individuals really do deserve our thanks. It&#x2019;s unsurprising but still disappointing to hear that those making a difference are the ones on the receiving end of unconscious (and conscious) bias within society. So take note, ladies and gentlemen; try to understand why you&#x2019;re thinking the way you do before you act and make sure you support those who support others.</p>\n\n<p>Before I sign off, if you would like to speak at or attend a conference but need some help to do so, make sure you take a look at our new <a href=\"https://www.ausimmbulletin.com/news/women-in-mining-wimnet-conference-grants/\" target=\"_blank\">WIMnet Conference Grant guidelines</a>.</p>\n\n<p>Until next time, stay safe and keep doing what makes you whole!</p>\n\n<p>Kate</p>\n\n<p>&#xA0;</p>\n\n<p>This article was originally posted the <a href=\"https://www.ausimmbulletin.com/\" target=\"_blank\">AusIMM Bulletin</a>. &#xA0;The original can be viewed<a href=\"https://www.ausimmbulletin.com/news/notes-from-the-wimnet-chair/\" target=\"_blank\"> here</a>.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/05","associated_company":"work180"}