{"url":"https://www.work180.com.au/blog/2018/01/paid-parental-leave-should-include-the-parents-of-stillborn-children","title":"Paid parental leave should include the parents of stillborn children","author":"WORK180","body":"\n\t\t\t\t\t<p>It&apos;s the right thing to do. They are parents too.</p>\n\n<p>Stillbirth is one of the most traumatic events that a parent can face. Unfortunately, it is an event that is far too common, with&#xA0;<a href=\"http://stillbirthfoundation.org.au/\" rel=\"nofollow\" target=\"_blank\">six babies a day</a>&#xA0;being stillborn in Australia. Yet despite its relatively common occurrence, too many employer parental leave policies are not clear about what support is offered to the parents of a stillborn child.</p>\n\n<div id=\"entry_paragraph_1\">\n<div>&#xA0;</div>\n</div>\n\n<p>Today is International Pregnancy and Infant Loss Remembrance Day and we are calling on all business leaders to join us in committing to ensuring parents are covered by paid parental leave in the event that they lose a child.</p>\n\n<div id=\"entry_paragraph_2\">\n<div>&#xA0;</div>\n</div>\n\n<p>Corporate parental policies need to be reviewed to ensure that a company extends paid parental leave in the case of stillbirth for the following reasons:</p>\n\n<ul>\n\t<li>It removes additional financial pressure from the family during an already traumatic period as they would have anticipated having paid leave had it been a live birth.</li>\n\t<li>Accessing paid parental leave recognises the birth of a child and the role of the parents.</li>\n\t<li>It allows time for the female employee to physically and emotionally recover from the experience of birth.</li>\n\t<li>A company would (or at least should) have already factored in the cost of parental leave for a live birth, so it does not effectively add to the company&apos;s costs.</li>\n\t<li>The employee would not be fully effective if she had to return to work for financial reasons (a Stillbirth Foundation/PwC study into the economic cost of stillbirth indicates that productivity after a stillbirth is only at 26 percent after 30 days).</li>\n\t<li>It is simply the right thing to do.</li>\n</ul>\n\n<p>Today, we are asking business leaders to make the following commitment: To review company parental leave policy to ensure that employer funded paid parental leave is available in the circumstance of stillbirth.</p>\n\n<div id=\"entry_paragraph_3\">\n<div>&#xA0;</div>\n</div>\n\n<p>Company policies should adopt the Australian definition of stillbirth, which is defined as the death of a baby before or during birth, from the 20th week of pregnancy onwards -- or 400 grams or more birth weight.</p>\n\n<p>Making paid parental leave available when stillbirth occurs during the pregnancy is essential, regardless of whether the employee has already started their parental leave. After all, a parent is legally required to register the birth of a stillborn baby and yet also has to contend with organising a funeral for their own child, a burden that no parent should face. Access to paid parental leave is a way for a company to acknowledge their employee&apos;s loss, be it at 20-weeks gestation, full term of pregnancy or after birth.</p>\n\n<p>Enshrining access to paid parental leave in the case of stillbirth into an employer&apos;s policy is key rather than relying on the discretion of managerial staff dealing with such a complex emotional issue. Given that paid parental leave is often cast as solely about caring for a baby, some managers might interpret paid leave not applying in the case of stillbirth, despite the best intentions of the employer. Having it clear in policy removes any doubt and sends a message that an employer recognises stillbirth as a social issue.</p>\n\n<p>Such a change would also bring employer funded paid parental leave schemes in line with the Federal Government&apos;s Paid Parental Leave Act of 2010. Section 31(3) of this Act makes explicit that a person is eligible for the government funded paid parental leave scheme if they were to be the primary carer of the stillborn child.</p>\n\n<p>Each of us in different ways has been touched by stillbirth. We are proud to support organisations like the Stillbirth Foundation, which invests in invaluable research into the causes of stillbirth and supports initiatives that will hopefully reduce the incidence of stillbirth. We are united in our view that it is critical to have policy initiatives such as this one to support parents facing one of life&apos;s most traumatic events.</p>\n\n<hr>\n<p><em>This post was co-authored by:</em><br>\n<br>\n<em>Andrew McBride, who is the father of baby Hope and a manager at PwC.</em></p>\n\n<p><em>Julie McKay, who is a Partner and Chief Diversity and Inclusion Officer at PwC.</em></p>\n\n<p><em>Lynne Pezzullo, who is mother to heavenly daughter Gabrielle, the Lead Partner, Health Economics and Social Policy for Deloitte Access Economics and Managing Partner Canberra, Deloitte Touche Tohmatsu.</em></p>\n\n<p><em>Diane Smith-Gander, who is Robert&apos;s aunty, a Non-Executive Director and Immediate Past President of Chief Executive Women.</em></p>\n\n<p>If you would like more information or wish to participate in this campaign contact the <a href=\"http://stillbirthfoundation.org.au/corporate-recognition/\">Stillbirth Foundation Australia</a>.</p>\n\n<p><em>It was originally published by <a href=\"http://www.huffingtonpost.com.au/victoria-bowring/paid-parental-leave-should-include-the-parents-of-stillborn-children_a_23241984/\">Huffington Post.&#xA0;</a></em></p>\n\n<hr>\n<h4 dir=\"ltr\"><strong><span id=\"docs-internal-guid-6efef3e6-025c-47b2-65cf-8bf4dc5d6628\">What are employers doing to support their staff? </span></strong></h4>\n\n<p dir=\"ltr\"><span>WORK180 has been in discussion with our <a href=\"https://www.dccjobs.com/clients\">Endorsed Employers for Women</a> about their parental leave policies. Most of the time it&apos;s something that has not been thought of, yet with 6 babies being stillborn each day, there are so many families affected.</span></p>\n\n<p dir=\"ltr\"><span id=\"docs-internal-guid-6efef3e6-025b-e4f5-bced-8a4508a98124\">WORK180 is collaborating with the Stillborn Foundation who are creating a webpage to list the companies which have adjusted their parental leave policies to support all parents. </span></p>\n\n<p dir=\"ltr\"><span id=\"docs-internal-guid-6efef3e6-025b-e4f5-bced-8a4508a98124\">We are excited to tell you that <a href=\"https://www.dccjobs.com/clients/john-holland?\">John Holland has now re-written their paid parental leave policy to include stillbirth</a>. Their D&amp;I Advisor Rachel Lawlor is open to chatting to others about their journey, please don&apos;t hesitate to reach out if you or your HR leaders would like some insights around making this happen so that no parent needs to worry about this during the most difficult time of their lives. </span></p>\n\n<p dir=\"ltr\"><span>We are also pleased to announce that <a href=\"https://www.dccjobs.com/clients/xero\">Xero</a> has now updated their policy along with <a href=\"https://www.work180.com.au/clients/microsoft\">Microsoft</a>&#xA0;and <a href=\"https://www.work180.com.au/clients/buildkite\">Buildkite</a><a href=\"https://www.work180.com.au/clients/buildkite\">.</a>&#xA0;</span></p>\n\n<p dir=\"ltr\"><span id=\"docs-internal-guid-6efef3e6-025b-e4f5-bced-8a4508a98124\">With six stillborn babies a day in Australia, we need to reach as many employers as we can to provide the necessary support. Please share this with your network and contact&#xA0; <a href=\"mailto:hello@work180.co\">WORK180&#xA0;</a></span><a href=\"mailto:hello@work180.co\">(hello@work180.co)</a> if you would like to be involved in this important change.</p>\n\n<hr>\n<div>\n<h4>&#xA0;</h4>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n</div>\n\n\t\t\t\t","tags":["gender equality","WORK180 News"],"upload_date":"2018/01","associated_companies":["work180"]}