{"url":"https://www.work180.com.au/blog/2017/09/part-time-no-that-wont-work","title":"Part-time? No, That Won't Work","author":"WORK180","body":"\n\t\t\t\t\t<p>I had a phone call from a recruiter a few weeks ago seeking an update on whether I was in the market looking for a new role. She took a little time to understand more about my skills and spoke openly about some exciting roles she had available. When I told her that I would only be able to work part-time, she silently gasped, the excitement in her voice faded and she ended the phone call.</p><p>Over the course of the next two weeks I would hear this same story from three other people. One was returning to work after having her second child, one was looking to embark on some study that was important to her future and one wanted to balance out his responsibilities at home, support his parents and to contribute further to the community. None of us were given the opportunity to have a mature discussion about our needs, the company&#x2019;s needs and a possible working solution. None of us.</p><p>When did our recruiters and businesses become so inflexible? I acknowledge some roles need to be full time and often the return on investment for an individual requires the roles to be full time but a great worker is a great worker and accommodating life is part of your role as a recruiter and a hiring manager.</p><p>When did it become ok to not even have the conversation? Neither me, nor my three colleagues even had the opportunity to discuss why part time was important to them. They did not have the opportunity to discuss how challenging the availability of daycare is, they did not have the opportunity to discuss that their wife had been promoted and would be travelling two weeks every month and the children needed to get to sport and they did not have the opportunity to suggest their study was going to really beneficial to the organisation in the long term but they needed some extra time to study in the short term and I did not have the opportunity to tell the recruiter I was in my last three months of practical work one day a week and there was a possibility things might change after that.&#xA0;</p><p>Lets at least try and have the conversation. Lets understand our employee needs in the short term and support their lives. And employees, lets ensure we are transparent and we speak up about what is going on for us and why the changes are important. As tough as the conversation may seem, transparency and motivations of each side can often collide in a very workable way.</p><p>So lets be clear about what part time work actually is. Part time work is a role that fits effortlessly into an agreed number of hours, across an agreed number of days. Flexible working is not part time working. Not providing flexibility because someone is working part time is just not fair and equal. Squeezing a five-day role into four or three days is not part time working. By reducing a full time role into fewer days, you are setting an employee up for failure. And thinking the person will pick up the phone or even have the opportunity to actually think about work on their days off is an unfair assumption.</p><p>So have the conversations from both perspectives, ask for what you want and need. Be mindful of how you structure the role and communicate to the rest of the team. Use technology to manage emails, availability and urgent situations. Also be mindful of your language around part time working. Using language such as &#x201C;he only works 3-days&#x201D;, &#x201C;she unfortunately is not here on Monday&#x2019;s&#x201D; or &#x201C;your contribution is only 0.6 of a role&#x201D;, is demeaning to part time employees. Be definite about your decision, positive in your language and encourage your employee to succeed.</p><p>As the hiring manager and colleague of many part time workers, I am a huge advocate. So if you need to discuss how to approach part time work for yourself or your employees, please reach out for a coaching session.</p><p>Part time? Yes please!</p><p><br></p><p>Louise is one of our contributors, learn more about her and our other contributors&#xA0;<a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>.</p><p><br></p><h4><strong>About WORK180</strong></h4><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/09","associated_companies":["work180"]}