{"url":"https://www.work180.com.au/blog/2018/03/pauline-nguyen-lessons-from-an-entrepreneur","title":"Pauline Nguyen: lessons from an entrepreneur ","author":"WORK180","body":"\n\t\t\t\t\t<p>Here at <a data-cke-saved-href=\"https://www.dccjobs.com/clients/optus\" href=\"https://www.dccjobs.com/clients/optus\">Optus</a>, we regularly host &#x2018;Women in Leadership&#x2019; sessions which typically involve a guest speaker sharing their story to our employees, aimed at empowering women in the workplace. Recently, we welcomed&#xA0;Pauline Nguyen to our Sydney campus as one of our guest speakers. I&#x2019;ll be honest, it&#x2019;s rare that I come out of a session and feel like I&#x2019;m on the verge of tears, but don&#x2019;t worry, these weren&#x2019;t tears of sadness, instead they were tears of inspiration.</p><p>In case you haven&#x2019;t heard of Pauline Nguyen, she is the owner and co-founder of Red Lantern, the most awarded Vietnamese restaurant in the world. She&#x2019;s also an award-winning author and international speaker.</p><p>Pauline opened by asking the audience &#x201C;do you mind if I get personal?&#x201D; adding &#x201C;I can&#x2019;t just share the good stuff; I also have to share the bad stuff&#x201D;.&#xA0;Pauline&#x2019;s engaging scan of the room left you with an amazing sense of being the only person within her presence. Pauline shared her story passionately; escaping Vietnam on a homemade boat with her family when she was just three years old;&#xA0;being driven by her father, often through force, to achieve top grades in school; and&#xA0;raising her brothers while her parents managed their local store in NSW&#x2026; her childhood was far from simple. But whilst many could have chosen to resent such early life challenges, Pauline believes strongly that life is a journey and obstacles are an opportunity to create success. Furthermore, Pauline&#xA0;has been able to translate this wisdom into not only her personal life, but also in her day to day life as a leader in business.</p><p>From a leadership prospective my key takeaways include Pauline&#x2019;s view&#x2019;s that&#xA0;<strong>strong leadership is directly correlated to embracing change</strong>&#xA0;(check out her tips below) and the&#xA0;<strong>power of a growth mindset</strong>.</p><ol><li>As a leader we must be flexible, calm, and understand that change is the only constant.</li><li>We need to embrace change and learn to expect change.</li><li>We have to be the change.</li><li>We are courageous; we feel fear but proceed anyways.</li><li>We are resilient. We can fail fast and get up again &#x2013; keep swinging that bat.</li><li>We feel grit, passion and perseverance for long term goals. We understand that life is a marathon not a sprint.</li></ol><p>No strong leader got anywhere by being set in their ways, and saying &#x201C;we&#x2019;ve always done it this way&#x201D;. As much as change can make most of us uncomfortable, it&#x2019;s also critical to explore those emotions and find out what&#x2019;s on the other side. Chances are; it&#x2019;ll leave you better off than if you hadn&#x2019;t been curious. It&#x2019;s up to us, as leaders, to initiate, support, and lead change as businesses (especially the technology industry) continue to evolve.</p><p>It&#x2019;s only natural that humans feel truly happy when they are making progress, a &#x2018;growth mindset&#x2019;. As soon as we become stagnant, it&#x2019;s easy to lose motivation, focus, or passion. Pauline shared&#xA0;the following ways that she keeps herself on track:</p><ol><li>Read a lot and always listen to new voices. Don&#x2019;t just read things once, read it over and over; let the information sink in.</li><li>Be present in the moment. Especially with your family.</li><li>Never feel guilty. This has the same vibration as shame. Stand up for the choices you&#x2019;ve made and stick to them.</li><li>Don&#x2019;t spread yourself too thin. Focus your energy on people and areas that bring you the most joy. Energy management is one of the greatest assets of a leader.</li><li>Be consistent. Professional leaders aren&#x2019;t moody, they show up consistent every time. The quality of our emotions is the game of life.</li><li>Be authentic. Stop caring what other people think, this keeps us imprisoned. Instead, find what brings you joy and have the courage to build your life around that.</li><li>Meditate &#x2013; and meditate often (2-3 times a day). Many studies show that meditation is a shared trait across many successful CEO&#x2019;s.&#xA0;</li></ol><p>Pauline talked about her attitude and mindset around dealing with times of&#xA0;stress and difficult situations. Rather than playing the victim card and saying, &#x201C;why me?&#x201D;, instead, choose to see obstacles as an opportunity to overcome the challenge. When you overcome it, the pot of gold is yours for the taking.</p><p>As a female leader here at Optus, I was thankful for the opportunity to hear&#xA0;Pauline&#x2019;s story, her insights, and have a fresh perspective on what it means to be a great female leader. I look forward to taking her tips and executing them in my personal and professional journey.</p><hr><h4><strong>About Optus&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f6d99f98-06c3-4cac-b4a3-4650787b4d8e.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f6d99f98-06c3-4cac-b4a3-4650787b4d8e.png\" style=\"float: right; margin: 10px; width: 200px; height: 53px;\"></strong></h4><p>Optus is a DCC Endorsed Employer for Women.</p><p>Learn more about why DCC approved Optus&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients/optus\" href=\"https://www.dccjobs.com/clients/optus\">here.</a></p><p>Apply for jobs with Optus&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=optus\" href=\"https://www.dccjobs.com/job-search?client=optus\">here.&#xA0;</a></p><hr><h4><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p><p><br></p>\n\t\t\t\t","tags":["Celebrating Women","Career Development"],"upload_date":"2018/03","associated_companies":["work180"]}