{"url":"https://www.work180.com.au/blog/2016/11/paving-your-own-career-path-in-construction","title":"Paving your own Career Path in Construction","author":"WORK180","body":"\n\t\t\t\t\t<p>With both her Uncle and grandfather running their own construction businesses, Laura Davidson had an interest in the industry from a very young age. Laura has worked on site for 10 years, transferring to the corporate environment and now back to on site, where Laura is the happiest. Currently, Laura is a Contract Manager with AECOM&#x2019;s newly created Construction Services team. We caught up with Laura to hear about her interesting journey and lessons learnt along the way.</p>\n\n<h4><strong>Leverage your learning style</strong></h4>\n\n<p>&#x201C;I&#x2019;ve always wanted to work in the industry, but absolutely hated studying full time at Uni,&#x201D; shared Laura. &#x201C;I wanted to learn by doing, and applied for both a Quantity Surveying position and a Concrete Technician, both of which were day release to Uni. Laura got the Quantity Surveying role, and worked four days a week with one study day. She thoroughly enjoyed the hands on learning component and after five years and graduating with a BSc (Hons), went for a TAFE Higher Education National diploma in Building Services Engineering, also through the company she worked with. This provided Laura with the ability to specialise in Services.</p>\n\n<h4 style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7a3437eb-6604-4fad-8098-63f04cf7fd79.jpeg\"></h4>\n\n<h4><strong>Plan your own career progression</strong></h4>\n\n<p>When Laura first moved to Australia from the UK, she worked with a small Services team in a Consultancy company. She thoroughly enjoyed the role, however after a few years, found herself outgrowing the role, and looked to move back into Construction. Laura began the hunt for a new job by searching for an interesting project. &#x201C;After meeting with two directors from AECOM, I was intrigued with the company and its projects- I&#x2019;m glad I followed my gut when I knew it was time to move on,&#x201D; recalled Laura. &#x201C;At AECOM, I&#x2019;ve had the opportunity to grow and and take a different path. I&#x2019;ve worked on some complex projects in Australia, from hospital sites to the airport and now I&#x2019;m working in completely new business unit and trying to help expand the business unit.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>If you want something, go for it</strong></h4>\n\n<p>After a few years working as a Building Services Cost Manager at AECOM, Laura was eager to get back on site, and project manage specialist contracts. &#x201C;I approached the Director of Construction Services and discussed my previous experience, and she was really supportive of me making the switch.&#x201D; Codenamed Elsa (from the Disney movie Frozen) Laura is now a Contract and Project Manager on a brand new project, a first for AECOM&#x2019;s newly stablished Construction Services department. &#x201C;We&#x2019;re building a new cold distribution centre, a fully automated freezer, which is the first fully automated freezer in Australia and also a fully automated chilled warehouse. I&#x2019;ve loved being involved with this huge project from day one, having done the estimating, cost planning and now leading the contract management and project managing the specialist contractors, such as the O2 reduction system and refrigeration and racking.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Find somewhere where you feel like you belong</strong></h4>\n\n<p>&#x201C;I&#x2019;ve only worked with four companies, but have seen a variety of leadership styles within those companies and on different projects,&#x201D; said Laura. &#x201C;What I love the most about AECOM, is that the leaders here are not &#x2018;old school&#x2019;. They thank you for your efforts, making you feel like you belong. The business is all about flexibility and work-life balance. Outside of the culture, we have really good benefits - corporate health care and super, AECOM awards, discounts for a variety of retail stores, movie tickets and social clubs.&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<p>Read more about AECOM and view their jobs <a href=\"/clients/AECOM\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/11","associated_company":"work180"}