{"url":"https://www.work180.com.au/blog/2017/10/penny-locaso-founder-bkindred-and-dcc-meetup-speaker","title":"Penny Locaso, Founder BKindred and DCC Meetup speaker","author":"WORK180","body":"\n\t\t\t\t\t<p>Penny Locaso, Founder&#xA0;<a data-cke-saved-href=\"http://bkindred.com.au/\" href=\"http://bkindred.com.au/\" rel=\"noopener\" target=\"_blank\">BKindred</a>&#xA0;left her 16 year executive career to focus on being happy, rather than &#x2018;successful&#x2019;. She continually pushes and challenges herself to be vulnerable, uncomfortable and by doing so to contagiously spread happiness throughout the world. Penny has attained the highly sought after, but elusive goal of self acceptance that so many of us strive for. Referring to herself as a &#x2018;Happiness Hacker&#x2019;, she is passionate about teaching others to live a happier life in increments, by embracing small changes in life and work.</p><p>She&#x2019;s had to dig deep and be brave to connect with her true purpose, and now she&#x2019;s infecting others with her brand of happy, internationally. I personally find her tagline of &#x201C;Happiness Looks Good On You&#x201D; to be irresistible.</p><h4><strong>YOU HAVE A GOAL&#xA0;TO TEACH 1 MILLION WOMEN HOW TO FUTURE PROOF HAPPINESS IN WORK AND LIFE BY 2020. HOW ARE YOU PRACTICALLY GOING ABOUT ACHIEVING THIS?</strong></h4><p>The intent when I started 3 years ago was to set a really challenging goal to push myself outside of my comfort zone and try and positively impact the lives of as many women as possible. The number started at 10,000 went to 100,000 and now it&#x2019;s 1,000,000. Why? Because the more action I take the more I realise what&#x2019;s possible.</p><p>In terms of practicality I can&#x2019;t achieve this on my own. I collaborate with community leaders, educational providers, teams and corporations to maximise the reach of my work both in Australia and next month internationally starting with San Francisco. Working with others to realise a big goal not only broadens your reach but improves your ideas. I&#x2019;m a firm believer in the more you share an idea the more it grows.</p><h4><strong>TELL US ABOUT WHY THIS YEAR YOU PRESENTED A PROFESSIONAL KEYNOTE TO OVER 100 WOMEN WEARING JUST YOUR BATHING SUIT (AND FILMED IT!).&#xA0;</strong></h4><p>It was&#xA0;<a data-cke-saved-href=\"http://www.misscollective.com/\" href=\"http://www.misscollective.com/\" rel=\"noopener\" target=\"_blank\">Level Up 2017</a>, a conference for professional women to learn tools and tactics to take their careers to the next level.&#xA0;My keynote, on Tactics For Happy Change, was allotted to the graveyard shift 2.30pm.&#xA0;Years of facilitation experience had taught me that energy levels would be waning. A bold strategy to engage the audience would be required to embed my message.</p><p>I had spent the past three years turning my life upside down in pursuit of happiness, a life and work with meaning and positive impact, post my exit from sixteen years as an executive within a global giant.&#xA0;I&#x2019;d arrived at a point where I had never earned less, yet never been happier. My definition of success was now defined by me not a societal norm or the expectation of others.</p><p>I knew from the hundreds of change seekers I&#x2019;d worked with in the past year that happiness in life and career was considered the Holy Grail.&#xA0;Highly sought, however, hard if not impossible to attain due to fear of failure, what others will think, overwhelm and no clear path to get there.</p><p>I wanted my keynote message to be real, raw and awaken curiosity.&#xA0;I realised that the most powerful message I could deliver to evoke change was that&#xA0;breakthrough moments come when we surrender the need for control and allow ourselves to get comfortable in discomfort. But how?</p><p>As a woman who has always struggled with her weight and a negative body image, I knew I wasn&#x2019;t alone.&#xA0;So at forty one years of age with a body that was built for comfort, I decided to start my keynote getting half #nakedforchange.&#xA0;I stripped down to my bathing suit. And proceeded to tell the audience that I could not think of a better way to convey my first tactic for happy change&#x2026;learn to get comfortable with being uncomfortable.&#xA0;I then went on to say that I doubted that there would be a woman in the room that could not relate to how uncomfortable I felt in that moment, and that this is what if feels like to move through change worth having. To which the audience responded with a huge roar of cheering and applause.</p><h4><strong>WHAT WAS YOUR KEY TAKEAWAY FROM THAT EXPERIENCE?</strong></h4><p>That moment would have to have been one of the most liberating in my life.&#xA0;I had finally learnt through facing fear and allowing myself to be truly vulnerable that I had let go of who I should be and allowed myself to be who I am.</p><p>The self acceptance was profound and created a platform of courage beyond expectation.&#xA0;I let go of seeking the acceptance of others to validate my success, and realised that the only validation I seek is from myself.&#xA0;Allowing myself to be completely vulnerable opened a door to possibility.&#xA0;It somehow gave others permission to feel a little braver and stop holding back on changes that they were seeking.</p><h4><strong>A FEW YEARS AGO, ALL WITHIN A 6 MONTH PERIOD YOU MADE THE DECISION TO LEAVE YOUR 16 YEAR EXECUTIVE CAREER, RELOCATE INTERSTATE, LEAVE AN 18 YEAR RELATIONSHIP AND START YOUR OWN COMPANY. HOW DID YOU SUCCESSFULLY MANAGE SO MANY SIGNIFICANT LIFE TRANSITIONS ALL AT ONCE?</strong></h4><p>By embracing vulnerability and learned to get comfortable with discomfort. I accepted that it wouldn&#x2019;t be easy, but it would be worth it. And I surrounded myself with people who elevated me and gave me energy, to ensure I had the support I needed. I did a lot of work defining my purpose which provided a north star and the confidence to say no to things in life that no longer served me or my happiness.</p><h4><strong>YOU ARE DESCRIBED AS A &#x201C;HAPPINESS HACKER&#x201D;. WHAT DOES THE TERM MEAN TO YOU?</strong></h4><p>I teach individuals and teams how to make impactful and positive change in bite sized pieces. Simple hacks (change practices) that enable you to weave more happiness into your work and life.&#xA0;</p><p>Many of us are resistant to change because we are already overwhelmed by what we have going on in life, we&#x2019;re afraid of the unknown and don&#x2019;t have the perfect plan to start. I&#x2019;ve learnt that small simple steps towards happy change provide the confidence and momentum to incrementally increase the level of change one feels capable of making over time.</p><h4><strong>WHAT HAS BEEN YOUR GREATEST CHALLENGE?</strong></h4><p>Shifting my mindset away from money. I was raised to believe that money = success. I had spent years accumulating wealth and material items to appear successful. It took me till the age of 39 to realise that for my whole life I had lived by a societal definition of success and never considered my own definition.</p><p>When I turned my life upside down in 2014 I had to go on a journey to define what success (I now call it happiness not success) truly meant to me. Success for me now is about positively impacting the lives of others through my work, experiences, being present and human connection. Money for me has become a by-product of doing the work I love. It&#x2019;s no longer the driver of my destiny and it&#x2019;s liberating.</p><h4><strong>WHAT ARE YOU MOST PROUD OF?</strong></h4><p>Showing my seven year old son that you can do what you love and create a sustainable business that positively impacts the lives of others. I don&#x2019;t believe there is anything more impactful on our children&#x2019;s lives than leading by example.&#xA0;</p><h4><strong>WHAT&#x2019;S ONE PIECE OF ADVICE FOR FUTURE FEMALE LEADERS?</strong></h4><p>Breakthrough moments occur when we surrender the need for control and allow ourselves to get comfortable in discomfort. Fear is the biggest barrier to women stepping into what they are truly capable of. Learning to dance with fear is&#xA0;where&#xA0;the magic happens personally and professionally.</p><p>This interview was originally published by Femeconomy and can be found <a data-cke-saved-href=\"https://femeconomy.com/female-leader-penny-locaso-founder-bkindred/\" target=\"_blank\" href=\"https://femeconomy.com/female-leader-penny-locaso-founder-bkindred/\">here.&#xA0;<br>&#x200B;</a></p><p><strong></strong><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\"><strong>Join our next round of Meetups in November!</strong>&#xA0;</span><br></p><blockquote><p><span>Are you at a crossroads or looking to level up the next stage of your career? We are excited to have</span>Penny Locaso founder of<a data-cke-saved-href=\"http://bkindred.com.au/\" href=\"http://bkindred.com.au/\"> BKindred</a>, who is on a mission to teach 1 &#xA0;million women how to future proof happiness in work and life by 2020 host our next round of Meetups. &#xA0;Join us as we explore what&#x2019;s possible and learn 6 proven tactics that you can use to step into opportunity.</p></blockquote><p dir=\"ltr\"><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\">Tickets are $15 and donated to charity. </span></p><p dir=\"ltr\"><strong><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\">Choose your city: </span></strong></p><p dir=\"ltr\"><a data-cke-saved-href=\"http://https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-brisbane\" target=\"_blank\" href=\"http://https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-brisbane\"><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\">Brisbane Nov 2</span></a></p><p dir=\"ltr\"><a data-cke-saved-href=\"https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-melbourne\" target=\"_blank\" href=\"https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-melbourne\"><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\">Melbourne Nov 9</span></a></p><p dir=\"ltr\"><a data-cke-saved-href=\"https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-sydney\" target=\"_blank\" href=\"https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-sydney\"><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\">Sydney Nov 16</span></a></p><p dir=\"ltr\"><a data-cke-saved-href=\"http://https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-perth-1\" href=\"http://https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-perth-1\"><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\">Perth Nov 17</span></a></p><p dir=\"ltr\"><a data-cke-saved-href=\"https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-canberra\" target=\"_blank\" href=\"https://www.dccjobs.com/events/how-to-future-proof-happiness-in-your-career-dcc-meetup-canberra\"><span id=\"docs-internal-guid-5561de96-ef0c-5183-359f-9e38df49875c\">Canberra Nov 22</span></a></p><div><br></div><h5><strong>ABOUT FEMECONOMY</strong></h5><p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/about/\" href=\"https://femeconomy.com/about/\" rel=\"noopener noreferrer\" target=\"_blank\">Femeconomy</a>.&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" rel=\"noopener noreferrer\" target=\"_blank\">Shop brands</a>&#xA0;with&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/category/female-leaders/\" href=\"https://femeconomy.com/category/female-leaders/\" rel=\"noopener noreferrer\" target=\"_blank\">female leaders</a>&#xA0;to create&#xA0;<a data-cke-saved-href=\"https://femeconomy.com/the-femeconomy-effect/\" href=\"https://femeconomy.com/the-femeconomy-effect/\" rel=\"noopener noreferrer\" target=\"_blank\">gender equality</a>. The&#xA0;power is in your purse. Sign up to&#xA0;<a data-cke-saved-href=\"http://eepurl.com/ccpbuD\" href=\"http://eepurl.com/ccpbuD\" rel=\"noopener noreferrer\" target=\"_blank\">our monthly enews</a>&#xA0;to stay&#xA0;informed.</p><p><br></p><p style=\"text-align: center;\"><a data-cke-saved-href=\"http://femeconomy.com/about/\" target=\"_blank\" href=\"http://femeconomy.com/about/\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9008d37d-2e27-4ddc-8889-97f95e3e971f.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9008d37d-2e27-4ddc-8889-97f95e3e971f.jpeg\"></a></p><h4><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/10","associated_companies":["work180"]}