{"url":"https://www.work180.com.au/blog/2016/05/professional-development-dont-ask-dont-get","title":"Professional development – don’t ask, don’t get!","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;You&#x2019;d love to attend the program or workshop, but you are dreading the conversation with your manager, director or Board &#x2013; whoever it is who approves your professional development.</p>\n\n<p>If you are a woman, our experience at Integral Development shows that you&#x2019;d rather offer to pay for yourself or split the cost with your employer. Or that you will prioritise the training needs of your team or colleagues, or the urgent work assignment over your own development. In our history as a training organisation, none of the above have ever have been raised as issues by a man undertaking professional development.</p>\n\n<p>Not asking for your professional development to be paid for by your organisation is symptomatic of a larger issue at play. In their book &#x2018;Women Don&#x2019;t Ask&#x2019;, Linda Babcock and Sara Laschever outline the evidence for the many other areas where women don&#x2019;t negotiate for themselves &#x2013; from starting salary, to prestigious positions and their professional needs and rewards.</p>\n\n<p>So to take a step towards asking the even bigger questions, allow us to give you a few tips to help make the professional development conversation a success:</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Be direct and don&#x2019;t use qualifying words</strong></p>\n\n<p><em>&#x201C;I was wondering what you would think if I maybe attended this course in September, if that&#x2019;s ok?&#x201D;</em> is definitely not an effective way to convince someone to support your professional development. Think carefully about what you will say before the conversation, and make sure you link it to any agreement about your development that you already have with your manager, as well as organisational performance outcomes. For example:</p>\n\n<blockquote>\n<p><em>&#x201C;I&#x2019;ve found the perfect program to address the development challenges we identified in my last performance review. It will assist me to develop stronger negotiation skills and a clearer sense of my career direction, as well as teach me some new skills to deal with conflict. As a result, I feel confident that I will be able to better manage my team and also deal more effectively with difficult customers.&#x201D;</em></p>\n</blockquote>\n\n<p>That sounds much more convincing, doesn&#x2019;t it?</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Predict the most likely questions and have a response prepared</strong></p>\n\n<p>Hopefully you have done enough so far to convince your manager that this professional development opportunity might be worth considering. But they may have a few questions. How much will it cost, and is it good value for money? How do you propose we manage the time you are out of the office?</p>\n\n<p>Again, the key here is to be prepared. Compare what is include in the professional development that you want to undertake with other similar programs &#x2013; what is it that specifically appeals to you about this program? What do you get for your money, for example is a 360 feedback survey and coaching included in the price? What have previous participants said about the program? Much of this information may be available online, but otherwise most professional development providers will be happy to provide it to you to assist you to make the case.</p>\n\n<p>You should also have looked at the dates and if there are any likely concerns with you being unavailable on those days. If there is something important scheduled at or around that time, be prepared with a contingency plan, for example another person who can look after your duties (perhaps providing them with a development opportunity as well!)</p>\n\n<p>Finally, if cost is the major issue, you could offer to try and negotiate a discount or payment plan. You could also outline how your improved skills may actually reduce other costs, like wasted time.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>After the professional development, deliver the results</strong></p>\n\n<p>Assuming your request is successful take time to enjoy your professional development! But remember, the most important part is yet to come. Your employer wants to know that their outlay of time and money has been worth it.</p>\n\n<p>Once you return from the professional development, it is critical to:</p>\n\n<ul>\n\t<li>report back to your manager the benefits you received and the changes you plan to implement;</li>\n\t<li>make those changes, and if necessary rely on the support network you hopefully gained from the professional development to help you along the way; and</li>\n\t<li>at your next development review, discuss the longer term impact of the professional development.</li>\n</ul>\n\n<p>If you can do all of this, the next time you request professional development, it will be an easy &#x2018;yes!&#x2019;</p>\n\n<p>&#xA0;</p>\n\n<p>Originally posted on <a href=\"https://www.steelheels.com.au/\" target=\"_blank\">Steel Heels</a>. The article can be viewed <a href=\"https://www.steelheels.com.au/professional-development-dont-ask-dont-get/\" target=\"_blank\">here</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/05","associated_company":"work180"}