{"url":"https://www.work180.com.au/blog/2018/12/programmeds-domestic-violence-stance","title":"Programmed's domestic violence stance","author":"WORK180","body":"\n\t\t\t\t\t<p dir=\"ltr\"><span id=\"docs-internal-guid-8217d2df-7fff-6b34-fb16-3a71efe84638\">Programmed supports the elimination of violence against women, and all other forms of domestic and family violence. Our policy includes up to 10 days domestic violence paid leave for all permanent employees and eligible casual employees, all other casual employees are entitled up to 10 days unpaid domestic violence leave. Employees also have access to counselling available through our Employee Assistance Program and emergency accommodation and financial support. &#xA0;</span></p><p dir=\"ltr\"><span id=\"docs-internal-guid-8217d2df-7fff-6b34-fb16-3a71efe84638\">For a number of years Programmed has been participating in initiatives to raise awareness for domestic and family violence. With a large proportion of the workforce male, Programmed think it is important to educate male employees about the scope and magnitude of the problem, encouraging them to take a stand. This year Programmed participated in White Ribbon Day morning teas across our network to encourage open conversation channels and encourage all employees to stand up and speak out against violence against women.&#xA0;</span></p><p dir=\"ltr\"><a data-cke-saved-href=\"https://work180.com.au/clients/programmed\" href=\"https://work180.com.au/clients/programmed\">Click here to l<span>earn more about </span></a><span><a data-cke-saved-href=\"https://work180.com.au/clients/programmed\" href=\"https://work180.com.au/clients/programmed\" class=\"\">Programmed.</a></span></p><hr><p>&#x200B;</p><div><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div>\n\t\t\t\t","tags":["DV policy","Domestic violence","white ribbon"],"upload_date":"2018/12","associated_company":"work180"}