{"url":"https://www.work180.com.au/blog/2018/10/promoting-gender-diversity-and-inclusion-in-our-workplace","title":"Promoting Gender Diversity and Inclusion in Our Workplace","author":"WORK180","body":"\n\t\t\t\t\t<p>The modern workforce is fast-changing, competitive, and complex &#x2013; a challenging environment for anyone to work in. For women working in traditionally male-dominated industries like technology, these challenges can be even greater.&#xA0;</p><p>The state of workplace gender equality, diversity and inclusion in Australia has a long way to go &#x2013; and with far-reaching effects on everything from employee wellbeing and retention to innovation and business outcomes, it is undoubtedly something organisations should give the utmost importance.</p><p>While women comprise about&#xA0;<a data-cke-saved-href=\"http://www.abs.gov.au/AUSSTATS/abs@.nsf/DetailsPage/6202.0Dec%202017?OpenDocument\" href=\"http://www.abs.gov.au/AUSSTATS/abs@.nsf/DetailsPage/6202.0Dec%202017?OpenDocument\" role=\"link\">47 per cent</a>&#xA0;of all employees in Australia, they make on average&#xA0;<a data-cke-saved-href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\" href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\" role=\"link\">$251.20 less</a>&#xA0;than men each week. Australian women are also over-represented in insecure forms of work, and continue to be&#xA0;<a data-cke-saved-href=\"https://data.gov.au/dataset/australian-public-service-statistical-bulletin-snapshot-at-december-31-2016\" href=\"https://data.gov.au/dataset/australian-public-service-statistical-bulletin-snapshot-at-december-31-2016\" role=\"link\">underrepresented in leadership</a>roles in the private and public sectors.</p><p>It&#x2019;s not all bad news &#x2013; progress is being made in some areas. The number of women on the Boards of ASX-listed companies, for example, grew from 8.3 per cent in 2009 to&#xA0;<a data-cke-saved-href=\"http://aicd.companydirectors.com.au/advocacy/board-diversity/statistics\" href=\"http://aicd.companydirectors.com.au/advocacy/board-diversity/statistics\" role=\"link\">26.2 per cent in 2017</a>, driven by a diversity policy implemented by the ASX Corporate Governance Council in 2010.</p><p>But if we are to increase and maintain positive progress, more must be done. Consistent efforts need to be made on a daily basis, underpinned by strong strategy and mindful leadership.</p><p><br></p><p><strong>What </strong><strong>does</strong><strong> diversity and inclusion really mean?</strong></p><blockquote><p>&#x2018;Having a diverse, inclusive culture means creating an environment where people can feel free to be their authentic selves at work,&#x2019; says Veronica Lakin, Organisation Development Manager of Diversity and Inclusion at Optus.</p></blockquote><p>Lakin&#x2019;s role is dedicated to designing and driving Diversity and Inclusion (D&amp;I) Strategy initiatives across Optus. Gender Diversity is a key focus area within the D&amp;I Strategy, which is committed to the empowerment of women. Our overall D&amp;I Strategy also focuses on strengthening our LGBTIQ+ community, harnessing our cultural diversity, supporting our multigenerational workforce and being an accessible workplace for everyone.</p><blockquote><p>&#x2018;We&#x2019;ve always had a focus on D&amp;I, but we needed a whole strategy to tie it together, supported by our Executive Leadership Sponsors,&#x2019; she says.</p></blockquote><p>Sue Bailey, Vice President of Future of Yes, and Simon Vatcher, Head of Delivery, are both Executive Sponsors for Diversity and Inclusion. As Executive Sponsors, they are committed to building&#xA0;diverse&#xA0;teams and creating environments that enable people to feel comfortable being themselves.</p><blockquote><p>&#x2018;For me, this role is about ensuring everyone&#x2019;s voice is heard, acknowledging the achievements of women more often, and creating opportunities for women to be more visible in higher levels of the organisation,&#x2019; says Bailey.</p></blockquote><p>For Vatcher, being a D&amp;I sponsor means using his leadership to provide solidarity and support. He and Bailey both emphasise that the effort to drive change shouldn&#x2019;t fall solely on the shoulders of the minority, but receive equal attention from all sides.</p><blockquote><p>&#x2018;Historically IT has been blocked by gender imbalance,&#x2019; Vatcher says. &#x2018;Industry leaders need to focus more on a person&#x2019;s capabilities, and be very wary of unconscious bias. Equality and diversity benefits everyone and should be a key priority.&#x2019;</p></blockquote><p><strong></strong><br></p><p><strong>Driving innovation through an inclusive culture</strong></p><p>There is inherent strength in a vibrant, diverse and inclusive workforce that challenges traditional structures and embraces new opportunities.</p><blockquote><p>&#x2018;At Optus, we believe the backgrounds, perspectives and life experiences of our people help us build strong customers connections and make better business decisions,&#x2019; says Lakin. &#x2018;Encouraging diversity of thought helps to avoid &#x201C;group think.&#x201D;&#x2019;</p></blockquote><p>The benefits for achieving gender equity in the workplace are&#xA0;<a data-cke-saved-href=\"https://www.dca.org.au/research/project/mckinsey-2017-delivering-through-diversity\" href=\"https://www.dca.org.au/research/project/mckinsey-2017-delivering-through-diversity\" role=\"link\">well documented</a>&#xA0;by research agencies, government and leading organisations. Increasing the number of women in corporate leadership positions, for example, has been shown to&#xA0;<a data-cke-saved-href=\"https://www2.deloitte.com/content/dam/Deloitte/au/Documents/Economics/deloitte-au-toward-gender-parity-women-on-boards-initiative-041016.pdf\" href=\"https://www2.deloitte.com/content/dam/Deloitte/au/Documents/Economics/deloitte-au-toward-gender-parity-women-on-boards-initiative-041016.pdf\" role=\"link\">significantly increase</a>&#xA0;financial returns for companies.</p><blockquote><p>&#x2018;The more our organisation is representative of the wider community, the better we can provide products and services that are relevant to our customers,&#x2019; says Bailey.</p></blockquote><blockquote><p>&#x2018;When people of different perspectives and experiences come together to solve a common problem, that&#x2019;s when creativity and innovation flourish.&#x2019;</p></blockquote><p><strong></strong><br></p><p><strong>So what is Optus doing?</strong></p><p>A number of programs designed to empower women at work are in place at Optus, and are constantly evolving to suit the changing needs of their people.</p><blockquote><p>&#x2018;We have a series of initiatives dedicated to Diversity and Inclusion,&#x2019; says Bailey. &#x2018;These include new recruitment standards, mentoring and networking opportunities, and leadership education.&#x2019;</p></blockquote><p>From a gender pay perspective, Optus has had a strong focus on this area for a number of years and has effectively closed the salary gap in like for like roles.&#xA0; Our immediate focus now is on increasing the number of women at Optus.</p><blockquote><p>&#x2018;Right now about a third of our employees are female, and we know we can do better,&#x2019; says Lakin. &#x2018;We&#x2019;re putting a very concerted effort into increasing that number.&#x2019;</p></blockquote><p>Under the Gender D&amp;I strategy, Optus has four main areas of focus:</p><h4>1.&#xA0;&#xA0;&#xA0; Increasing female candidates for key role short lists</h4><p>Lakin says even seemingly small things, like the wording of an external job ad, can make a big difference in encouraging more women to apply for roles.</p><p>New recruitment standards &amp; processes have been introduced and we have a new partnership with&#xA0;<a data-cke-saved-href=\"http://work180.com.au/\" href=\"http://work180.com.au/\" target=\"_blank\" role=\"link\">WORK180</a>, a job platform that pre-screens companies to ensure they support women&#x2019;s careers.&#xA0;</p><h4>2.&#xA0;&#xA0;&#xA0; Increasing the capability of ALL Leaders:</h4><blockquote><p>&#x2018;The nature of heirachy can be dangerous,&#x2019; says Vatcher. &#x2018;Leaders can have a big influence on workplace culture &#x2013; so they need to hold themselves accountable in being accessible and mindful.&#x2019;</p></blockquote><p>Leadership education covers topics like inclusive leadership and unconscious bias, while networking events such as International Women&#x2019;s Day and the Diversity Council Australia Debate are helping drive discussion and awareness.</p><h4>3.&#xA0;&#xA0;&#xA0; Improving learning opportunities</h4><p>We have introduced a number of initiatives, programs and educational resources to build the leadership capability of our female leaders. These include mentoring and coaching, leadership development and networking opportunities.</p><p>Bailey is particularly passionate about the Women in Leadership talk series. The series has featured a range of inspiring female speakers, including Pauline Nguyen, co-founder of Red Lantern, the most awarded Vietnamese restaurant in the world, and social entrepreneur Genevieve Clay-Smith.</p><blockquote><p>&#x2018;The series gives women at Optus the chance to hear from and identify with a wide variety of women in leadership, of different cultures, ages, industries, and business experience,&#x2019; says Bailey.</p></blockquote><h4>4.&#xA0;&#xA0;&#xA0; Return to Work initiatives</h4><p>Flexible working options play a key role in gender equality. From Return to Work mentoring and Parental Leave workshops and educational resources for parents to a coaching program designed for returning female executives.</p><p><br></p><p><strong>Keeping up </strong><strong>positive</strong><strong> momentum</strong></p><blockquote><p>&#x2018;There&#x2019;s a very strong momentum around the D&amp;I strategy,&#x2019; says Lakin. &#x2018;It&#x2019;s about making a daily effort, and not getting side-tracked. We&#x2019;re continually getting feedback to see what more we can do &#x2013; there&#x2019;s been a really positive response.&#x2019;</p></blockquote><p>She says if this is to continue, inclusive behaviour needs to extend beyond internal teams. &#x2018;At Optus, we work with a lot of third parties. When you make a decision on who you partner with, you need to think about how to have open conversations that help spread awareness. We all need to play a part in that.&#x2019;</p><p>Bailey believes that while there&#x2019;s still work to do, the organisation is moving in the right direction.</p><blockquote><p>&#x2018;Our D&amp;I inititaves are not only the right thing to do, they are vital to drive innovation and business outcomes,&#x2019; she says.</p></blockquote><p>Technology and globalisation are rapidly transforming the workplace as we know it. To succeed &#x2013; and succeed with integrity &#x2013; we must constantly rethink the way talent, culture and values are developed and deployed within our organisations.</p><hr><p>This article was originally published by <a data-cke-saved-href=\"https://www.optus.com.au/enterprise/accelerate/culture/promoting-gender-diversity-and-inclusion-in-our-workplace\" href=\"https://www.optus.com.au/enterprise/accelerate/culture/promoting-gender-diversity-and-inclusion-in-our-workplace\">Optus.&#xA0;</a></p><p><br></p><h4><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c28a6991-a5ab-49d8-955d-3a5f595463be.png\" style=\"float: right; width: 200px; height: 40px; margin-left: 10px; margin-right: 10px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c28a6991-a5ab-49d8-955d-3a5f595463be.png\">About Optus</strong></h4><p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p><p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p><p>Browse jobs with Optus and apply&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=optus\" href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["gender diversity","inclusion","optus"],"upload_date":"2018/10","associated_companies":["work180"]}