{"url":"https://www.work180.com.au/blog/2017/10/qinetiqs-journey-to-becoming-a-dcc-endorsed-employer","title":"QinetiQ's journey to becoming an endorsed employer","author":"WORK180","body":"\n\t\t\t\t\t<p>Global employer QinetiQ have set the standard around inclusive policy to allow a broad scope of employment opportunity and become an Endorsed Employer for Women.&#xA0;</p>\n\n<p>Experts in global aerospace, defence and security, QinetiQ Australia is part of a global company with over 6,000 employees worldwide. In Australia, the company specialises in program delivery, engineering and advisory services with over 350 employees country-wide.</p>\n\n<p>Earlier this year, Jessica (General Manager People &amp; Capability at QinetiQ) reached out to WORK180 to complete the pre-screening process to become an Endorsed Employer for Women. This endorsement enables employers to advertise job roles on the WORK180 platform. The company was reviewed on their policies including paid parental leave, pay equity and flexibility.</p>\n\n<p>&#xA0;&#x201C;Most of our policies in these areas were implemented several years ago, and at the time were considered quite progressive,&#x201D; explained Jessica. &#x201C;Through the WORK180 pre-screening process, we realised we were no longer leading the way. The Australian D&amp;I agenda has moved forward so rapidly in the last couple of years, and it was eye-opening to see how fast it was changing and how quickly organisations like ourselves could fall behind without continued focus. Through our discussions with WORK180 we realised we&#x2019;d become complacent in regularly reviewing our policies and it was definitely time to up our game.&#x201D;</p>\n\n<blockquote>\n<p>Initially QinetiQ did not pass the WORK180 criteria however, Jessica made a promise to work on the areas identified as needing attention and come back with some updates in a few months. In August 2017, QinetiQ joined the WORK180 group of Endorsed Employers.</p>\n</blockquote>\n\n<p>This is an account of the next steps Jessica took in addressing some identified shortfalls and a summary of QinetiQ&#x2019;s outstanding achievements in just a few short months.</p>\n\n<p><strong>A team effort</strong></p>\n\n<p>Though QinetiQ&#x2019;s small People and Capability team Jessica lead a crowdsourcing approach to drive change both from top down and bottom up across the business.</p>\n\n<p>The first step was setting up a Diversity &amp; Inclusion Committee. Once its purpose and strategy were outlined, all staff were invited to self-nominate for consideration by the MD and GM People and Capability. After reviewing the applications, individuals were selected and a Chair was appointed to the group.</p>\n\n<p>&#x201C;Initially we found we didn&#x2019;t have enough representation on the committee to adequately reflect the diversity and geography of our workforce, so we approached individuals within the business whom we thought would be great to join the committee,&#x201D; recalled Jessica. &#x201C;We ended up with a great mix of people the key to the group&#x2019;s success was that they were all equally as passionate across a range of areas, and truly invested in improving D&amp;I across our workforce. We will continue to get far better outputs with this approach rather than HR deciding on these policies and strategies alone&#x201D; said Jessica.</p>\n\n<p>In their first few meetings, the committee members chose an area of D&amp;I they were passionate about and began conducting research and returned to the group with their findings, benchmarks and suggested potential focused areas. The committee subsequently developed a survey which would help them better understand the organisations diversity demographics and performance. This helped them to benchmark their performance, develop more focused goals and measure progress more effectively.</p>\n\n<p><strong>1.&#xA0;</strong><strong>Family Friendly Policies</strong></p>\n\n<p>&#x201C;Our paid parental leave entitlements may have been progressive 4-5 years ago, but it was quickly apparent to me this was no longer the case,&#x201D; said Jessica.</p>\n\n<p>Jessica began building a business case and gathered information on both competitor&#x2019;s policies and looked companies outside of the industry, to get a broad view of what best practice looked like.</p>\n\n<blockquote>\n<p>&#x201C;My first stop was the WORK180 website, as majority of the policy information displayed on their Best Employers section was not available anywhere else,&#x201D; said Jessica. &#x201C;We came up with a suggested framework to a more family friendly workplace to attract and retain more female talent</p>\n</blockquote>\n\n<p>Jessica sought buy in from QinetiQ Australia Managing Director Greg Barsby and the executive team, to accommodate all caring arrangements as opposed to having just one policy and better supporting new parents regardless of gender.</p>\n\n<p>As a result, the company increased its graduated paid parental leave for primary carers from 4 weeks to 12 weeks all the way to 16 weeks (depending on tenure) and introduced up to 3 weeks paid parental leave for secondary carers.</p>\n\n<p>Another huge step forward was to remove the minim tenure required to qualify for paid parental leave, with primary care-givers who have worked with the company for less than 12 months now eligible for 6 weeks of paid parental leave for primary caregivers.</p>\n\n<p>Around the establishment of these policies, Jessica explained that &#x201C;there is some risk in this, but having a no minimum tenure to be eligible for parental leave will show your employees you value them, support them as new parents and hopefully build loyalty to retain them.&#x201D;</p>\n\n<p><strong>2.&#xA0;</strong><strong>Pay Equity</strong></p>\n\n<p>&#x201C;We have not conducted a pay equity analysis since 2014,&#x201D; continued Jessica. &#x201C;Again, seeing what others in the industry were doing in this space prompted us to revisit this. We also didn&#x2019;t realise Greg (our MD) could sign up as a Pay Equity Ambassador with the Workplace Gender Equality Agency (WGEA) prior to going through the WORK180 criteria. Greg already mentored female talent through the TFTC Cross Industry (Defence) Mentoring program and was really involved in supporting the P&amp;C team on its existing diversity and inclusion initiatives. Greg is truly passionate about creating better and more diverse and inclusive workplaces.</p>\n\n<p>After evaluating staff salaries and analysing the data, QinetiQ refined their strategy around gender pay equity to enable a process where pay equity analysis is done right before salary reviews to ensure any gaps which may appear are quickly rectified. &#xA0;Greg was also announced as a Pay Equity Ambassador and has become more involved with the WGEA ambassador community.</p>\n\n<p><strong>3.&#xA0;</strong><strong>Flexible working</strong></p>\n\n<p>Greg is also a great role model for flexible working. Both Greg and his wife balance family commitments, travel and leadership roles. For example, Greg regularly commits to school pickups for his children.</p>\n\n<blockquote>\n<p>&#x201C;We have a lot of consultants working on client sites, which naturally makes flexibility more challenging compared to situations when you have all your people working in your own offices. This means we need to be more proactive in challenging industry practices and thinking to improve flexibility for all employees,&#x201D; explained Jessica.</p>\n</blockquote>\n\n<p>As far as Jessica is concerned, the whole industry&#x2019;s perception needs to continue to evolve to achieve improved flexibility for all employees. With Greg&#x2019;s profile as a Gender Pay Equity Ambassador he can continue to drive the conversations around flexible working in the industry where QinetiQ operate.</p>\n\n<p><strong>Continuous feedback &amp; improvement</strong></p>\n\n<p>With some ambitious goals in place, the next steps for QinetiQ is to continue the education process internally and externally.</p>\n\n<p>&#x201C;This will be an ever-evolving project,&#x201D; said Jessica. &#x201C;For us it&#x2019;s about changing the workforce perception that these policies and the committee are just for women or about gender diversity; it&#x2019;s about improving the workplace for a broader range of employees.&#x201D;</p>\n\n<p>The D&amp;I Committee has developed multiple staff surveys, to be conducted 3-6 months apart to gather data about their workforce demographics to help feed into their strategy and identify key areas of focus.</p>\n\n<p>&#x201C;It&#x2019;s important for us to understand and benchmark employee perception of the initiatives we are introducing,&#x201D; said Jessica. &#x201C;Whilst the first survey was voluntary we had an overwhelming response and are really pleased to have some great data and information which we can now work with&#x201D; Jessica explained.</p>\n\n<p><em>This article was originally published by Engineers Australia and can be found <a href=\"https://www.engineersaustralia.org.au/News/qinetiqs-journey-becoming-dcc-endorsed-employer\" target=\"_blank\">here.&#xA0; </a></em></p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About QinetiQ&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b3d03946-94fc-452e-b2b4-9a31b0636640.png\" style=\"float: right; margin: 10px; width: 200px; height: 42px;\"></strong></h4>\n\n<p>Qinetiq is an Endorsed Employer for Women. Qinetiq is&#xA0;also a FTSE250 company with over 6,000 employees worldwide; their scientists and engineers solve some of the world&#x2019;s most challenging problems.</p>\n\n<p><a href=\"http://www.dccjobs.com/job-search?client=qinetiq\">View jobs and apply to join QinetiQ&#xA0;</a><a href=\"https://www.dccjobs.com/job-search?client=qinetiq\">here</a><a href=\"http://www.dccjobs.com/job-search?client=qinetiq\">.</a><br>\n&#xA0;</p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["gender equality","WORK180 News"],"upload_date":"2017/10","associated_companies":["work180"]}