{"url":"https://www.work180.com.au/blog/2018/09/r-u-ok-how-often-do-you-ask-people-that-question","title":"R U OK? – how often do you ask people that question?","author":"WORK180","body":"\n\t\t\t\t\t<p>How often do you ask people if they are doing okay? And when you do ask, do you really listen to the answer? It is such a simple question and as research shows, can be powerful enough to stop that individual from ending their life.</p>\n\n<p>The statistics around suicide are alarming. The Australian Bureau of Statistics states that on average 8 people die by suicide in Australia every day. For every death it is estimated 30 people will attempt to take their life.</p>\n\n<p>Being a Health and Safety Leader these statistics impact me deeply, as they do on my role as a mother, a wife, a daughter and friend. &#xA0;I&#x2019;m committed to being part of the movement to reduce suicide. Life is too precious and the loss of a life through suicide not only impacts the individuals in their closest circles it sends shock-waves throughout their wider circles of contacts also.</p>\n\n<p>I love working for Lion as they are passionate about the wellbeing of their people, and provide a workplace that is inclusive, diverse, flexible, and fun to work in. Wellbeing is a key element of everything we do at Lion and is part of our core purpose to &#x201C;Enrich our world everyday by championing sociability and helping people to live well&#x201D;.</p>\n\n<p>Every day we bring our whole self to work, and it is our opportunity to help our people to be the best they can be.</p>\n\n<p>Leading the Beer Safety &amp; Wellbeing team I can say we have been focusing on Wellbeing at Lion for several years and have a comprehensive Wellbeing model covering Work, Social, and Personal elements. These all work together to provide a holistic approach to helping people to live well.</p>\n\n<p>Last year we decided we needed to do more in the area of mental and emotional wellbeing and launched our Best M.E. framework focusing on how you can be the best version of yourself. The program was focused on breaking down the stigma associated with mental health by creating more dialogue on the topic and opportunities to talk openly and freely about it. Our aim is to provide an environment where everyone feels safe and free to bring their whole selves to work every day and to share with those around them how they are going.</p>\n\n<p style=\"text-align: center;\"><img src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMTIvMDQvMzIvMjUvMjUxLzQuanBnIl1d\" style=\"margin: 10px; width: 600px; height: 600px;\"></p>\n\n<p>This year I wanted to continue to build on these programs so I did some research about R U OK? Day. I learnt about the founder and how he built the National movement on suicide prevention. The aim is to create a community where people feel connected and this dramatically reduces the likelihood of suicide.</p>\n\n<p>I was interested to learn about why suicide is occurring and that the combination of three factors dramatically increases one&#x2019;s chance of doing so. These are; feeling isolated; believing you are a burden on others; and having the means to take your life.</p>\n\n<p>I learnt that by asking the simple question of R U OK? really helps. Just by having a conversation with someone and asking them about how they are feeling and what&#x2019;s happening in their life, you are making them feel more connected and supported, reducing the risk of them ending their life. Also by investing more time in those around you, your relationships grow stronger, and you are more likely to notice when someone is feeling down or struggling, meaning you can make more of a difference to them when they need you.</p>\n\n<p>This connected with me in many ways as it was so simple, everyone can be part of it and do it with little coaching and guidance. You just need to ask the question, listen, and provide the individual with support and care. 5 minutes taken for the conversation could gift a lifetime.</p>\n\n<p>Recently our Lion team suffered the loss of someone close to us leaving this world too soon. This loss has impacted many of our Leaders and teams and we are all supporting each other through this difficult time. So today we are engaging in &#xA0;R U OK? Day in all of our Lion sites and offices. The belief in this movement is present throughout the business and further promoted in our leadership team. Below you can see our Lion Beer Leadership Team promoting R U OK? Day.</p>\n\n<p style=\"text-align: center;\"><img src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMTIvMDQvMzMvMjkvODgvMy5qcGciXV0\" style=\"margin: 10px; width: 600px; height: 400px;\"></p>\n\n<p>We all have bad days and good days and if we feel connected we are able to tackle those bad days easier than when we don&#x2019;t feel connected.</p>\n\n<p>Being a mum of three kids and working four days a week, I know the importance I place on work-life balance. Taking time for family, friends, and those around me is important. Life is passing us by so quickly that we need to make sure we are investing our time every day into those people and activities we care for.</p>\n\n<p>So to help make a difference that could last a lifetime I urge you to pick up the phone and connect with someone you know, have the courage to tap someone on the shoulder, ask them how they are, and show them support and care. You could help save someone&#x2019;s life with that simple question&#x2026; R U OK?</p>\n\n<p style=\"text-align: center;\"><img src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMTIvMDQvMzQvNDQvMTAvNS5wbmciXV0\"></p>\n\n<hr>\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e753caa1-90c0-4755-9077-8595ef361191.jpeg\" style=\"float: right; width: 100px;\">About&#xA0;Lion</strong></h4>\n\n<p><a href=\"https://www.work180.com.au/clients/lion\"><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:1069260\">Lion</span></a><span id=\"ember1575\"> employs 7000 people across 34 sites and in 2017 was one of only six FMCGs to be named a </span><span aria-controls=\"ember2748\" aria-expanded=\"true\" data-entity-hovercard-id=\"urn:li:fs_miniCompany:2896967\">Workplace Gender Equality Agency</span><span id=\"ember1583\"> Employer of Choice for Gender Equality. They also offer flexible working</span>&#xA0;and have a target to achieve 50% female leadership by 2026. <a href=\"https://www.work180.com.au/clients/lion\">Learn more!&#xA0;</a></p>\n\n<p>&#xA0;</p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0; &#xA0;&#xA0;</p>\n\n\t\t\t\t","tags":["mental health","RUOK"],"upload_date":"2018/09","associated_companies":["work180"]}