{"url":"https://www.work180.com.au/blog/2018/08/remembering-our-queen-of-soul","title":"Remembering our Queen of Soul","author":"WORK180","body":"\n\t\t\t\t\t<p>On August 16th 2018, Aretha Franklin, the &apos;Queen of Soul&#x2019; died aged 76.</p>\n\n<p>Aretha signature songs, &apos;Respect&apos; and &apos;Sisters Are Doin&apos; It For Themselves&apos;, are veritable feminist anthems. Her powerful lyrics resonate with women all around the world. Aretha&apos;s was unapologetic, intelligent, sophisticated and a full-fledged diva. These are some of the lessons that she taught us.<br>\n&#xA0;</p>\n\n<p><strong>Stand up for marginalized women</strong></p>\n\n<p>Aretha taught us to use our voice. She was the first woman to ever be inducted in the Rock &amp; Roll Hall Of Fame in 1987. She was the most charted female in history with over one hundred singles hitting the US Billboard chart. &#xA0;Aretha used her success to shine a light on the issues that she advocated for - the rights of women, especially women of color. &quot;Respect&quot; became a feminist anthem, celebrating women from all walks of life. Aretha was a symbol of hope for women and the respect we all deserve.</p>\n\n<p>&#xA0;</p>\n\n<p>Barack Obama said in 2015: &#xA0;</p>\n\n<blockquote>\n<p><em>&#x201C;Nobody embodies more fully the connection between the African-American spiritual, the blues, R&amp;B, rock </em><em>and</em><em> roll &#x2013; the way that hardship and sorrow were transformed into something full of beauty and vitality and hope.&#x201D;</em></p>\n</blockquote>\n\n<div><iframe allow=\"autoplay; encrypted-media\" allowfullscreen frameborder=\"0\" height=\"480\" src=\"https://www.youtube.com/embed/QW7n8hklwsk\" width=\"100%\"></iframe></div>\n\n<p>&#xA0;</p>\n\n<p><strong>Divas are leaders</strong></p>\n\n<blockquote>\n<p><em style=\"font-size: 1.6rem;\">&#x201C;Being the Queen is not all about singing, and being a diva is not all about singing. It has much to do with your service to people. And your social contributions to your community and your civic contributions as well.&#x201D;</em></p>\n\n<p>&#xA0;</p>\n</blockquote>\n\n<p>Aretha taught us to reclaim words such as &#x2018;diva&#x2019;. Girls that lead in the playground are often called bossy. Words like this send a message: don&#x2019;t be assertive and don&#x2019;t speak up. &#xA0;As these girls grow up, they become less interested in leading than boys - a trend that continues into the workplace</p>\n\n<div>\n<p>Let&apos;s start encouraging girls to lead.</p>\n</div>\n\n<p><strong>Know your worth</strong></p>\n\n<p>&#x201C;Be your own artist, and always be confident in what you&apos;re doing. If you&apos;re not going to be confident, you might as well not be doing it.&#x201D;</p>\n\n<p>Aretha taught us to own our strengths and successes. It&#x2019;s vital that women frequently express that we are not &#x2018;imposters&#x2019; and that we do deserve the career that we want. &#xA0;Aretha had grit. She had, and was, a vocal gift. And she knew this.</p>\n\n<blockquote>\n<p><em>&#x201C;The man who gets me is getting one hell of a woman&apos;&#x201D;.</em></p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<div><iframe allow=\"autoplay; encrypted-media\" allowfullscreen frameborder=\"0\" height=\"480\" src=\"https://www.youtube.com/embed/n0POmdK18WU\" width=\"100%\"></iframe></div>\n\n<p>Aretha taught us never to settle, with a partner or in your career. Women are deserving, capable, and women demand respect. Aretha wanted women to always feel in control. It took hard work and time to get to where we are today in the fight for equality. It is essential that we preserve what women have gained, including the right to make our own choices.</p>\n\n<p>Through her words and lyrics, Aretha&#x2019;s contribution as a feminist pioneer will not be forgotten. May her legacy live on forever.</p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p dir=\"ltr\" style=\"line-height:1.38;margin-top:0pt;margin-bottom:0pt;\">&#xA0;</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2018/08"}