{"url":"https://www.work180.com.au/blog/2016/04/removing-blockers-for-women-wanting-to-excel-in-a-non-traditional-industry","title":"Removing blockers for women wanting to excel in a non-traditional industry","author":"WORK180","body":"\n\t\t\t\t\t<p>Brisbane Screening is one of the largest mobile recycling providers in Queensland. Their focus on sieving, mixing and remediating soils on client sites is creating huge savings for clients along with minimising changes to the local ecosystem.</p><p>Family owned and operated, the team works with a range of large clients from major construction companies including councils, state government, developers, mine sites and waste management businesses on jobs anywhere from 400m3 to 400,000m3+.</p><p>I had the pleasure of catching up with Alison Price, who heads up Operations in addition to her role as President (QLD &amp; NT) of the National Association of Women in Construction (NAWIC). We got chatting about a unique role advertised by Brisbane Screening through DCC, and I wanted to share the story behind the role.</p><p>Normally, to get into the industry, the applicant needs to have tickets and most employers are looking for at least five years&#x2019; experience. But Alison and her team are looking at this from a different angle.</p><p>As Alison explained to me, &#x201C;We prefer to train our staff to use the machinery from scratch- we&#x2019;ve had great results this way and find that people enjoy learning on the job.&#x201D;</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2a3e0f94-550e-4153-b5e6-7b2b5a460784.jpeg\">&#x200B;</p><p>Every 12 months, Brisbane Screening hire a trainee, who by the end of the 2 year traineeship, receive valuable experience and licences to operate excavators, bobcats, drotts, trucks and loaders.</p><p>&#x201C;While it&#x2019;s possible to get a skid steer and excavator licence by doing a week long course, most of the operators who come out of these courses don&#x2019;t have enough experience to go straight to work,&#x201D; explained Alison. The company is certainly open to training anyone who has the passion to learn- even Alison&#x2019;s step daughter is being taught to operate a skid steer and excavators while still studying.</p><p>In regards to the current vacancy advertised on the DCC site, Alison approached us after the all-male team asked her to try and see if there could be more of a focus on getting females to apply. This in itself is unusual for us to hear and we asked Alison what she thought contributed to a culture where people are not just looking to hire &#x201C;someone just like them.&#x201D;</p><p>According to Alison, &#x201C;Our site management team, made up of males, specifically asked if we could diversify the team. While they understand that the style of training will need to be somewhat adjusted, they really want to work with someone who genuinely wants the job.&#x201D;</p><p>The way Alison and her team see it- when a female applies to work in a role in an industry where she may well be the only female on the team, there is a genuine passion behind this, and a drive to throw yourself 100% into the role.</p><p>&#x201C;We find that people who look at this as more than &#x2018;just a job&#x2019; really get the most out of the training we provide and of course, having someone like that on board is brilliant for the business,&#x201D; elaborated Alison. &#x201C;It&#x2019;s all about removing the blockers for women wanting to excel in our industry and we&#x2019;re proud of creating an inclusive environment where anyone can thrive.&#x201D;</p><p>We encourage everyone to share this great opportunity with the women in your network.</p><p><br></p><h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/04","associated_company":"work180"}