{"url":"https://www.work180.com.au/blog/2017/09/resume-speak","title":"Resume Speak","author":"WORK180","body":"\n\t\t\t\t\t<p>Many years ago I took a Business Writing Skills Course. Before the awesome advances in digital content, the company I was working for was writing 200 page tender documents for large corporates and it seemed our responses were filled with tired and boring language. We needed a writing coach to come and help us become engaging, succinct and sales focused. The course taught me a lot of great techniques but the one sentence I continue to remember and apply over and over again is &#x201C;always write how you would speak&#x201D;. It has stayed with me and my writing ever since.</p><p>I think this approach is really effective in all communications but it is even more important when you are writing your resume. It is about you after all. So write it as if you were telling someone about yourself. I have read hundreds of resumes and the ones that get interviews, are those that are simple to read, interesting and they sound like a real person.</p><p>So let&apos;s think about how to apply resume speak. Particularly when job advertisements are changing the way they are written to be more personable and direct, using terms such as &#x201C;you&#x201D;, &#x201C;us&#x201D; and &#x201C;the team&#x201D;. We should be revising our resumes to respond to these changes in the industry.</p><p><br></p><p><strong>1.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;</strong>&#xA0;<strong>Tell people who you are, what you enjoy doing and what you carry in your skills backpack.</strong>&#xA0;You are a stranger to the person reading your resume, so it is important to start to create a picture of who you somewhere at the start of your resume. For example, some of my profile overview at the start of my resume reads likes this: &#x201C;<em>I have had a diversified career across leadership in sales, project and product management in multiple industries. I mostly enjoy customer relationships, refining process, managing projects and strategy in businesses and coaching other colleagues to succeed.&#x201D;</em></p><p>When I meet someone new in a professional situation, I would say something very similar to that to let them know who I am. I would speak about a diversified career and my passion for the customer, business improvement, and people&#x2019;s success.</p><p><br></p><p><strong>2.&#xA0;&#xA0;&#xA0;&#xA0;</strong><em>&#xA0;&#xA0;</em><strong>Talk simply about what you did in each role.&#xA0;</strong>Every role is different and the title is not always an indicator to the actual content of your role. So be specific, as if you were answering an interview question. For example,&#xA0;<em>&#x201C;in my role as product manager I led the product strategy and product funding; I created partnership relationships; I defined the product roadmap and I resolved any issues with the functioning of the product&#x201D;.</em></p><p>Outlining each role does not need to be complicated but specific and factual in describing exactly what you did and how effective you were at the role.</p><p><br></p><p><strong>3.&#xA0;&#xA0;&#xA0;&#xA0;</strong>&#xA0;&#xA0;<strong>Never copy and paste a cover letter.</strong>&#xA0;If the organisation has taken the time to write a job description and advertisement, it is only fair and reasonable they receive a letter that tells them why you would be a great person for the role in return. It does not have to be long but it should be personable and relevant. And you should always send a cover letter, even if it only says who you are, why you would be a great fit for the role and how to contact you. If you are having problems with a cover letter, it might help to pretend you are making a phone call to the recruiter to tell them why they should consider you as a candidate. Maybe even record yourself and then type up the call. Write, as you would speak.</p><p><br></p><p>Digital channels have provided us with so much more content and different ways of communicating but the greater the content, the less time we have to consume it. If you want to get the attention of somebody, create an interesting, personable and factual resume that speaks to who you are. And would sound like you, if spoken out loud.</p><p>I have provided many clients, colleagues and friends support in their resume preparation. Working with a coach to refine and position a resume is really valuable and it provides the opportunity to reflect and write with support from the sideline. Plus, they can always read your resume back to you out loud!</p><p><br></p><p>Louise is one of our contributors, learn more about her and our other contributors <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>.</p><p><br></p><h4><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with <a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a> now.&#xA0;</p>\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2017/09","associated_companies":["work180"]}