{"url":"https://www.work180.com.au/blog/2018/04/return-to-work-with-the-stamina-program","title":"Return to Work with the Stamina Program","author":"WORK180","body":"\n\t\t\t\t\t<p><a href=\"https://www.veski.org.au/inspiring-women/Stamina\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/48c05a1c-d26a-4537-ab8d-a941668aac45.jpeg\" style=\"float:right\">The Stamina</a> - Women returning to work program is designed to support women wanting to return to work within a STEM industry. This is a<a href=\"https://www.veski.org.au/inspiring-women/Stamina\"> free program, available for 30 females. </a>Candidates must have previously worked in&#xA0;STEM&#xA0;and be looking to return to employment within a STEM industry in Australia. The&#xA0;program&#xA0;will help develop networks across Universities, Research Centres, Industry and Government with the aim to expand and enhance the current talent pool and effect&#xA0;cultural&#xA0;change through the return of women into STEM industries.&#xA0;</p>\n\n<blockquote>\n<p>Based in Melbourne, this dynamic and free&#xA0;8 month&#xA0;program consists of workshops and networking opportunities&#xA0;designed to empower women at different career stages with the skills, networks&#xA0;and&#xA0;mindset to develop and achieve their career goals within STEM (Science, Technology, Engineering and Mathematics) industries.&#xA0;</p>\n</blockquote>\n\n<p>The new 2018 inspiring women STEM&#xA0;sidebyside&#xA0;program is an initiative to support women in the STEM industries that is led by&#xA0;veski&#xA0;and Monash University with the support of the British Consulate General Melbourne.&#xA0;&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Applicants and Evaluation</strong></h4>\n\n<p>Applications to join the Stamina: Women returning to work stream are sought from mid-career women who are looking to return to the workforce in Australia within academia, industry or government STEM sectors after experiencing a career break. T</p>\n\n<p>he program is open to women in the fields of science and innovative technology, primarily in the areas&#xA0;of:&#xA0;<br>\n&#xA0;- science</p>\n\n<p>- technology</p>\n\n<p>- engineering</p>\n\n<p>- mathematics.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>To be eligible to apply applicants must, at the time of application be; </strong></h4>\n\n<p>- currently not working but wishing to return to employment within a STEM industry, or</p>\n\n<p>- working in a non-STEM industry but wishing to return to employment within a STEM industry, and</p>\n\n<p>- have Australian citizenship or permanent residency;</p>\n\n<p>and - have at least 7 years of Full-Time Equivalent (FTE) post-primary degree experience in STEM sectors.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Application requirements </strong></h4>\n\n<p>Complete a full application demonstrating/ detailing:</p>\n\n<p>- why you wish to join the Stamina</p>\n\n<p>- Women returning to work stream of the STEM sidebyside program;</p>\n\n<p>- how you will use the skills, experience and networks that you have garnered moving forward; and</p>\n\n<p>- your significant achievements &amp; their impact in your STEM field, noting outcomes relative to opportunities.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Supporting document</strong></h4>\n\n<p>- Provide a current curriculum vitae or LinkedIn URL demonstrating the nature of your achievements, to include the duration and FTE of each role held post</p>\n\n<p>-primary degree in STEM sectors; and</p>\n\n<p>- provide proof of Australian citizenship or permanent residency.</p>\n\n<p>If applicable, Managers at your employer should be made aware of your interest to participate in the STEM sidebyside program. Successful applicants will be required to attend all program event activities to be scheduled throughout the year.</p>\n\n<h4><strong>Questions?<a href=\"https://www.veski.org.au/inspiring-women/Stamina\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/861b9f3e-4c44-40b5-b71a-c503ccfcdcd7.jpeg\" style=\"float:right\"></a></strong></h4>\n\n<p>If you have any enquiries, please contact: veski fellowships co-ordinator<br>\n&#xA0;E-mail: fellowships@veski.org.au<br>\nTel: +61 (0)3 9635 5700<br>\n&#xA0;</p>\n\n<h4><strong>Apply!</strong></h4>\n\n<p>Applicants must lodge their applications via the veski website:&#xA0;<a href=\"https://www.veski.org.au/inspiring-women/Stamina\">https://www.veski.org.au/inspiring-women/Stamina</a></p>\n\n<p>Application deadline extended&#xA0;-&#xA0;please submit your application no later than 2.00pm (AEST) Thursday,&#xA0;26 April 2018.</p>\n\n<hr>\n<h3><strong>About STEM </strong><strong>sidebyside</strong></h3>\n\n<p>The STEM&#xA0; sidebyside &#xA0;program launched on 22 March, with program activities to be delivered between May and October 2018. The program will include events, workshops and networking opportunities offering personal and professional development to STEM women at three differing career stages;</p>\n\n<p>- Empowering You: University students</p>\n\n<p>- Leading the Way: Mid-career emerging leaders</p>\n\n<p>- Stamina: Women returning to work.</p>\n\n<hr>\n<h3><strong>About WORK180</strong></h3>\n\n<p>WORK180 (previously DCC Jobs) is a jobs board with a difference. We pre-screen employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.work180.com.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.work180.com.au/dashboard/candidate\">one click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["job seeking tips","Career Development"],"upload_date":"2018/04","associated_company":"work180"}