{"url":"https://www.work180.com.au/blog/2018/08/road-to-alcoa-an-obvious-path-for-top-curtin-graduate","title":"Road to Alcoa an obvious path for top Curtin graduate","author":"WORK180","body":"\n\t\t\t\t\t<h4>Katie Marshall of Mandurah is proof that woman can succeed in male-dominated fields.</h4><p>The 22-year-old chemical engineer has dominated Curtin University&#x2019;s fourth-year engineering prizes, taking out three awards including top student and most innovative research project. She has also just landed a Graduate Chemical Engineering role at Alcoa of Australia&#x2019;s Wagerup Alumina Refinery.&#xA0;</p><p>Katie is no stranger to Alcoa. As a high-school graduate, Katie took out Alcoa&#x2019;s Bev Corless Memorial Scholarship, which helped fund her engineering studies. Her interest in Alcoa was further sparked during a tour of the company&#x2019;s bauxite mining and alumina refining operations in Western Australian while in her third year at University. Later that year, Katie was back with Alcoa completing three months of vacation work.</p><p>She also worked with flocculation expert Andrew Owen at Alcoa&#x2019;s Centre of Excellence in Kwinana to complete her final year research project, which was awarded &#x2018;most innovative research project&#x2019; for Curtin&#x2019;s Chemical Engineering Department.</p><p><br></p><h4 style=\"text-align: center;\">&#x201C;Alcoa is a positive workplace for its culture, safety and innovative solutions,&#x201D; Katie said. &#x201C;It&#x2019;s also really involved in the community. I did a lot of volunteering while at university and so it&#x2019;s good to be part of a company that values the same thing as me.&#x201D;</h4><p><br></p><p>Katie said engineering seemed an obvious and ideal career choice for her as she loved maths, science and creating new things through problem solving.</p><p>&#x201C;Engineering is very creative as it gives you the chance to think outside the box and come up with solutions that don&#x2019;t yet exist,&#x201D; Katie said.&#xA0; &#x201C;You also can research and discover brand new ideas or pursue ideas further. I chose chemical engineering because I really liked working with processes.&#x201D;</p><p>Katie encouraged other females to consider a career in traditionally male-dominated fields including the resources sector.</p><p>&#x201C;When I was in high-school, I had never even considered the possibility of working in the resources sector,&#x201D; she said. &#x201C;It was such a foreign concept, especially with me being a girl. Looking back, I think we can do more to show young females that there are jobs in this industry that they would enjoy.</p><p>&#x201C;I do work mostly with men, but I have found all of them more than willing to teach me and include me, whether it be taking the time to step me through some piping, or chatting around the lunch table.&#x201D;</p><p>Alcoa of Australia Chairperson and Managing Director Michael Parker echoed Katie&#x2019;s call, saying diversity was essential to the company&#x2019;s ongoing success.</p><p>&#x201C;A culture of inclusion is what we strive to create at Alcoa,&#x201D; Michael said. &#x201C;We want every employee to bring their whole selves to work and feel included and valued for who they are and for the diversity of ideas and experiences they bring.&#x201D;&#xA0;</p><p><br></p><h4 style=\"text-align: center;\">&#x201C;It&#x2019;s proven that companies that invest in diversity outperform and employees who feel valued are more creative, innovative and productive. The business case is clear and the personal benefits are significant and worth striving for.&#x201D;</h4><p><br></p><p>Alcoa has been named an employer of choice for 16 consecutive years by the Federal Government&#x2019;s Workplace Gender Equality Agency. As one of the agency&#x2019;s Pay Equity Ambassadors, Michael said he was proud that in 2017 Alcoa was successful in reducing the pay gap, increasing female workforce participation and attracting, promoting and retaining women.</p><p>Growing up in Harrisdale, south-east of Perth, Katie&#x2019;s career trajectory into mining came as a surprise to her family.&#xA0;</p><p>&#x201C;We are not a family of engineers or miners,&#x201D; Katie said. &#x201C;Mum is a primary school teacher and Dad is a carpenter by trade. My younger brother started studying surveying last year with the hope of also entering the mining industry. There&#x2019;s certainly a lot more hi-vis flouro in the laundry than there used to be.&#x201D;</p><p>Katie said engineering was a challenging degree and it was important to surround yourself with supportive people and maintain a balanced lifestyle while studying.</p><p>&#x201C;My school teachers at Carey Baptist College (in Harrisdale) encouraged me to pursue engineering and I am grateful for my family who have been by my side the whole time,&#x201D; Katie said. &#x201C;I also had a really good network of friends and mentors while studying at university. My advice to others considering further studies is to volunteer, play a sport, learn an instrument, just make sure you take a break and connect with others.&#x201D;</p><hr><p>This post was originally published by <a data-cke-saved-href=\"https://www.alcoa.com/australia/en/news/releases.asp?id=2018/07/road-to-alcoa-an-obvious-path-for-top-curtin-graduate&amp;year=y2018\" href=\"https://www.alcoa.com/australia/en/news/releases.asp?id=2018/07/road-to-alcoa-an-obvious-path-for-top-curtin-graduate&amp;year=y2018\">Alcoa.&#xA0;</a></p><p><br></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8f7895d6-10bc-4705-9246-9919c9c30d86.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8f7895d6-10bc-4705-9246-9919c9c30d86.jpeg\" style=\"font-size: 16px; float: right; width: 100px; margin: 10px;\"></p><h4><strong>About Alcoa</strong></h4><p>Alcoa Australia are global leaders in bauxite, alumina and&#xA0;aluminium products. Alcoa is an Endorsed Employer of WORK180 providing their employees with 16 weeks paid parental leave, mentoring opportunities, coaching programs and with targets to raise the number of women in leadership.&#xA0;Read more about their workplace&#xA0;on their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/alcoa\" href=\"https://www.work180.com.au/clients/alcoa\">Best Employer page.</a></p><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\"></a></p>\n\t\t\t\t","tags":["Engineering","graduate","succeeding","Employee Stories"],"upload_date":"2018/08","associated_companies":["work180"]}