{"url":"https://www.work180.com.au/blog/2016/10/run-your-own-race","title":"Run Your Own Race","author":"WORK180","body":"\n\t\t\t\t\t<p>One of my favorite images from the&#xA0; Olympics was of Chad Le Clos in the 200m butterfly final glancing across to his arch rival Michael Phelps in the next lane. The fact that Phelps went on to win that race Le Clos who&#x2019;d claimed Gold in London four years earlier held a poignant lesson for anyone who sometimes spends more time focusing on how others are doing than on how they are.</p>\n\n<p>As human beings, it&#x2019;s easy to get caught up comparing how well we&#x2019;re doing against people around us, particularly those we share the most in common with. Family members. Work colleagues. Old friends. Neighbors.</p>\n\n<p>But here&#x2019;s the deal:</p>\n\n<p>Every minute you spend comparing how well you&#x2019;re doing against someone else &#x2013; your colleague, your competitor, your neighbor or college roommate - &#xA0;is a minute you aren&#x2019;t spending running your own best race. &#xA0;Not only that, but the very act of comparing yourself generally triggers emotions that leave you feeling either resentful, intimidated, inferior, jealous, flat or fearful that our life just isn&#x2019;t measuring up&#x2026; that we aren&#x2019;t measuring up! &#xA0;None of which set you up to get on with the task of being more successful in whatever you&#x2019;re engaged in.&#xA0;</p>\n\n<p>It&#x2019;s why too much time on social media can be an act of self-sabotage. The continuous roll of other people&#x2019;s highlight reels often leaves us feeling like we&#x2019;re missing out or falling short. Little wonder research has found that too much time on Facebook can trigger depression. Social media appeals to our vanity and vulnerability and can all too easily ensnare us in a web of negative comparisons. &#xA0;&#xA0;</p>\n\n<blockquote>\n<p>Comparing yourself to others is a race you can never win!</p>\n</blockquote>\n\n<p>The truth is that we all have our own mountains to climb, strengths to nurture, and opportunities to seize. Likewise, we all have our own to hurdles to jump, burdens to carry, mistakes to learn from and fears to conquer. And we bounce back from our setbacks faster and leverage our opportunities better when we are focused on making the very of what is right in front of us (and within us) rather than looking across to see whether we&apos;re gaining (or losing) ground on those around us. The irony is that the moment you stop comparing, is the moment you win. So long as you think winning in life is about being better or having more than others, your comparisons hold your happiness hostage.</p>\n\n<blockquote>\n<p>Le Cros lost to Phelps by 0.04 seconds. Whether he would have still lost had he never glanced over at his rival we will never know. But one thing is certain, had he focused solely on running his own best race he&apos;d likely have come in that little bit faster than he did.</p>\n</blockquote>\n\n<p>It begs the question, where are you losing ground in your career, business or life because you&apos;re not focusing on simply running your own best race? Where is your envy of the gifts, good luck and opportunities of those around you distracted you from making more of your own?&#xA0;</p>\n\n<p>The only race that ever truly matters is the one you run is against yourself; to be that little bit better than you were yesterday. &#xA0;So run your own race and do the best you can with what you&apos;ve got. The rest will take care of itself. &#xA0;After all, when you give up comparing, you win.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p><span style=\"font-size: 16px;\">Margie&#xA0;is one of our contributors, read about them all&#xA0;</span><a href=\"https://www.dccjobs.com/contributors\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">here</a><span style=\"font-size: 16px;\">. &#xA0;Interested in becoming a contributor? Click</span><a href=\"https://www.dccjobs.com/career-advice/become-a-contributor\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">&#xA0;</a><a href=\"https://www.diversecitycareers.com/becomeacontributor\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">here</a><a href=\"https://www.dccjobs.com/career-advice/become-a-contributor\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">.</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/10","associated_company":"work180"}