{"url":"https://www.work180.com.au/blog/2017/11/australias-workforce-still-highly-segregated-by-gender-wgea-report","title":"Sally's Big Punt on Unusual Career Choice Pays Off","author":"WORK180","body":"\n\t\t\t\t\t<p>Sally Snow had dreams of becoming a ballerina, but her love of maths and father&apos;s influence led to her becoming a racetrack bookie.</p>\n\n<p>A mother of three young girls, Ms Snow, 32, worked as a bookmaker on racecourses around Sydney including Randwick, Rosehill, Canterbury and Warwick Farm from the age of 19 and studied business and accounting at university.</p>\n\n<p>She was &quot;sad to say&quot; that she probably would not have thought of entering bookmaking as a career if her bookmaker father and bookmaker grandfather had not introduced her to it.</p>\n\n<blockquote>\n<p>&quot;A lot of females would have thought of bookmakers as older men with bags over their shoulders,&quot; she said.</p>\n</blockquote>\n\n<p>A report from the Workplace Gender Equality Agency shows Australia has a highly segregated labour market with women and men concentrated in different occupations and industries.</p>\n\n<p>Women are concentrated in health care and social assistance professions, representing 80 per cent of the workforce and 70 per cent of management roles.</p>\n\n<p>Men are more evenly spread across the workforce, but have a very low representation in the female-dominated health and social service industry.</p>\n\n<p>Women are least represented in construction and mining. But mining and administrative support services are the only industries where women are not under-represented in management compared to their representation across the industry.</p>\n\n<p>Marian Baird, professor of gender and employment relations at the University of Sydney, said there had been a concerted push to put women in management positions in mining.</p>\n\n<blockquote>\n<p>&quot;They are profitable companies which have the resources to push new agendas &#x2013; if they choose to &#x2013; and this is one they did work on,&quot; she said.</p>\n</blockquote>\n\n<p>All other industries including ones that are dominated by women have a lower proportion of women in management compared to women in the workforce.</p>\n\n<p>The biggest gaps between the representation of women in the workforce and in management are in agriculture, forestry and fishing, and financial services.</p>\n\n<p>Ms Snow said she wanted to be a ballerina when she left school until the racetrack took hold.</p>\n\n<p>At the age of 24, she joined Tabcorp in a marketing role in 2008 and now works as a fixed-odds thoroughbred manager, which means she manages a team of thoroughbred traders that manage risk and price betting odds.</p>\n\n<p>She was promoted to the management role a week before she went on maternity leave in 2013 to have her third daughter. She said the promotion gave her a confidence boost and made her eager to return to work to &quot;do a good job and hit the ground running&quot;.</p>\n\n<blockquote>\n<p>&quot;It was a great turning point,&quot; she said. &quot;I felt extremely supported in the new role. It gave me a lot of confidence.&quot;</p>\n</blockquote>\n\n<p>Tabcorp says it has reduced its gender pay gap between like-for-like roles to 1.2 per cent and 51 per cent of its workforce is made up of women. Women now make up 39 per cent of Tabcorp&apos;s senior leadership roles, up from 34 per cent last year.</p>\n\n<p>When she returned to work in 2014, Ms Snow worked three days a week for six months and progressed to full-time two years ago.</p>\n\n<p>She loves the maths involved in her job and the people she works with.</p>\n\n<p>&quot;No two days are the same,&quot; she said. &quot;You are looking at a number of races each day and every race is different. It&apos;s an adrenaline rush.&quot;</p>\n\n<p>Professor Baird said education qualifications could determine or influence women&apos;s job choices.</p>\n\n<p>While Australian women were more likely to hold tertiary education qualifications than men, women were still more likely than men to have completed qualifications in management and commerce, society and culture, health and education.</p>\n\n<p>Men were more likely to have qualifications in engineering, architecture, building and IT.</p>\n\n<p>&quot;These qualifications lead directly to the labour market and the jobs that men and women do,&quot; Professor Baird said</p>\n\n<p>Social attitudes, employers and workplace culture could also help explain why women chose particular areas of study.</p>\n\n<p>&quot;In relation to social attitudes, there still appears to be a strong tradition in women&apos;s gender roles being related to service: in care work, educational work or retail work for example,&quot; she said.</p>\n\n<p>&quot;But these patterns are also determined by the opportunities provided by employers and the structure of our economy.&quot;</p>\n\n<p>The growth in the service sector, including health and social services, has outstripped the growth in employment in manufacturing, mining and agriculture, which are traditionally male-dominated areas.</p>\n\n<p>There has also been a shift to part-time work in the services sector.</p>\n\n<p>&quot;Given the lack of childcare services in Australia, women may be choosing jobs that provide shorter ... and more predictable hours,&quot; Professor Baird said.</p>\n\n<p>Professor Baird said there were also clear signals sent by workplaces about expectations of work and whether they were female-friendly work environments in terms of working hours, working patterns, discrimination towards women, the type of work and technology. Women were smart enough to read them and respond accordingly.</p>\n\n<p>Natalie Hannan, a senior scientist at the University of Melbourne, said her friends in the corporate sector had less flexible working hours than she had at the Mercy Hospital in Heidelberg.</p>\n\n<p>She said women were probably drawn to the health industry because of the caring aspect of the work and because they could make a difference to the lives of patients.</p>\n\n<p>&quot;Different hours can be worked, so women can balance their family and working life,&quot; Dr Hannan said.</p>\n\n<p>&quot;As a scientist, I wanted flexible working arrangements, which I found in a hospital-based university environment.&quot;</p>\n\n<p>However, fewer female scientists rise to the level of professor in academia, despite the equal number entering the profession.</p>\n\n<p>Melissa Kennedy, a Health Services Union delegate who works as a paramedic in Dubbo, said she was one of just a few women in the field when she started working 20 years ago. She said there was now less heavy lifting in the job, with new and lighter equipment including stretchers.</p>\n\n<p>&quot;We&apos;ve seen a big change in recent years and have more women joining now,&quot; she said.</p>\n\n<p>&quot;I knew I wanted to help people and wanted to be challenged on a regular basis.&quot;</p>\n\n<p><em>This article was originally published by <a href=\"http://www.smh.com.au/national/life-as-a-bookie-beats-being-a-ballerina-20171115-gzlq4x.html\">SMH.</a></em></p>\n\n<p><em>&#x200B;</em></p>\n\n<h4><strong>About Tabcorp</strong></h4>\n\n<p>Tabcorp is a DCC Endorsed Employer for Women. Learn more about the company <a href=\"https://www.dccjobs.com/clients/tabcorp\">here.</a></p>\n\n<p>Find jobs with Tabcorp <a href=\"https://www.dccjobs.com/job-search?client=tabcorp\">here.&#xA0;</a></p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Celebrating Women","gender equality"],"upload_date":"2017/11","associated_company":"work180"}