{"url":"https://www.work180.com.au/blog/2017/10/schneider-electric-actively-working-to-improve-gender-diversity","title":"Schneider Electric actively working to improve gender diversity ","author":"WORK180","body":"\n\t\t\t\t\t<p>Diversity is one of the most important business and people strategy priorities.</p><p>As a global leader in the energy automation and technology sector, Schneider Electric is made up by a diverse workforce serving customers in over 100 countries. Yet, like most non-traditional sectors the organisation must actively work to improve gender balance.</p><p>Schneider Electric&#x2019;s Vice President for Energy, Simon Mouat says the organisation places gender equality at the top of their agenda and diversity is one of the key business and people strategy priorities.</p><blockquote><p>&#xA0;&#x201C;We have committed to act as a key &#x2018;agent of change&#x2019; and build a better and more fair world where gender diversity and equality are real&#x201D;, Mr Mouat said.</p></blockquote><p>Core to this priority is Schneider Electric&#x2018;s participation in the HeforShe campaign and CEO, Jean Pascal Tricoire&#x2019;s role as one of 10 corporate champions for the IMPACT 10x10x10 initiative.</p><p>IMPACT 10x10x10 is a global initiative that engages key decision makers to make gender equality an institutional priority.</p><blockquote><p>&#x201C;In our commitment to the IMPACT 10x10x10 framework, &#xA0;our ambition is that 42% of all new professional positions by qualified female talent. Our Talent Acquisition team actively network and source female talent and challenge the business on hiring decisions and we work closely with Diversity Networks such as DCC Jobs to share our offering.&#x201D;</p></blockquote><p><a data-cke-saved-href=\"https://www.dccjobs.com/\" href=\"https://www.dccjobs.com/\">DCC Jobs</a>&#xA0;is an Australian job platform which vets employers prior to advertising their jobs to ensure they support women&#x2019;s careers. Employers are pre-screened on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an essential tool for job seekers when assessing employers.</p><p>Schneider Electric is also leading in providing flexibility for all employees.</p><p>&#x201C;Our&#xA0;<em>FlexSE</em>&#xA0;policy means our people can work in a way that suits them, their team, clients, business and family.&#x201D;</p><p>The organisation believes it is important to ensure all staff feel comfortable in discussing flexible working arrangements with their managers.</p><p>&#x201C;In June 2017, we joined DCC Jobs&#x2019; inaugural Flexible Working Week and our entire executive team joined the&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/flexible-working-ambassadors\" href=\"https://www.dccjobs.com/what-women-want/flexible-working-ambassadors\">Flexible Working Ambassador</a>&#xA0;list.</p><blockquote><p>&#x201C;We believe in change, leading from the top.&#x201D;</p></blockquote><p>Support for families also forms part of Schneider Electric&#x2019;s diversity strategy and Schneider recently announced the new Global Family Leave Policy further demonstrating itself as a truly inclusive company.</p><p>To support employees during significant life changing events the organisation pays primary and secondary carers leave.</p><blockquote><p>&#x201C;To tackle inequality, and further promote inclusion, we have removed the minimum tenure meaning all employees are eligible for this benefit&#x201D;, Mr Mouat said.</p></blockquote><p>&#x201C;This is in stark contrast to the average minimum required tenure being 12 months across Australian workplaces.&#x201D;</p><p>Additionally, they have committed to significantly reducing female pay gap by April 2018.</p><p>&#x201C;We will deliver this goal via a dedicated budget that will reduce and/or close any validated gender pay gaps supported by a refined new hire process that will position men and women on equal footing.</p><blockquote><p>&#x201C;We are also one of very few companies in Australia who pay superannuation on the unpaid portion of parental leave - an important step to close the gender super gap as women retire with an average of 52.8% less in super savings compared to men.&#x201D;</p></blockquote><p>With these initiatives Schneider Electric aims to have a positive impact on productivity, workplace culture and promote a more diverse workplace.</p><p>&#x201C;Ultimately our goal is to empower our employees to manage their professional and personal commitments&#x201D;, Mr Mouat said.</p><p><br></p><p><i>This article was orignally published by Engineers Australia <a data-cke-saved-href=\"https://www.engineersaustralia.org.au/News/schneider-electric-actively-working-improve-gender-diversity\" href=\"https://www.engineersaustralia.org.au/News/schneider-electric-actively-working-improve-gender-diversity\" target=\"_blank\">here</a>.&#xA0;</i></p><p><br></p><p><b>About Schneider Electric</b><br>Schneider Electric is an approved DCC Endorsed Employer for Women. Learn more about Schneider Electric and their jobs&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients/schneider-electric\" href=\"https://www.dccjobs.com/clients/schneider-electric\" target=\"_blank\">here.</a></p><p><br></p><h4><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p><p><br></p>\n\t\t\t\t","tags":["DCC News","gender equality"],"upload_date":"2017/10","associated_company":"work180"}