{"url":"https://www.work180.com.au/blog/2016/08/scientist-spotlight-dr-julia-archbold","title":"Scientist Spotlight – Dr Julia Archbold","author":"WORK180","body":"\n\t\t\t\t\t<p>This is my first interview for my Scientific Reasoning feature. The questions will be the same for each interviewee and I hope that they will give us some insight into the lives of a few of today&#x2019;s scientists.</p><p><br></p><p>Dr Julia Archbold is a good friend of mine. We have known each other for many years and have worked together in the past in our twenties (ish). I admire Julia greatly, both as a scientist and as a person. She is warm and talented, with a quick wit and a very kind soul. She is about to embark on an exciting new adventure and I caught her just in time for this interview.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b6e98e65-5b90-4019-84ca-c6917b0c755a.jpeg\"></p><p><strong>me: So I know you&#x2019;re a scientist, but when did you decide to become a scientist? What were you thinking? (Not WHAT WERE YOU THINKING?!?! but what made you decide that science was going to be your future?)</strong></p><p>Julia:&#xA0;I actually started a science degree &#x2018;thinking&#x2019; I would become a medical doctor. At that time in Queensland, you had to have a degree before being able to sit a<a data-cke-saved-href=\"http://dcc.staging.volcanic.net.au/admin/blogs/1562/edit#\" href=\"http://dcc.staging.volcanic.net.au/admin/blogs/1562/edit#\">&#xA0;</a> entrance exam to study medicine. But it was in my first year of my science degree that I realised there was one problem with my plan &#x2014; I would faint at the sight of blood!!</p><p><br></p><p><strong>me: What was the best thing about studying science?</strong></p><p>Julia:&#xA0;What I really loved was the theory behind the medicine. How does the heart pump blood around the body? How does the immune system recognise a virus? Why do some people suffer from asthma? How do we discover new drugs? And it was that quizativity that led me to follow a career in medical research. I spent over 13 years in the lab as a researcher, but just recently have switched career paths into science editing and communication. I am now embarking on a new challenge as a freelance scientific editor (shameless plug &#x2013; www.corrected.com.au)</p><p><br></p><p><strong>me: And what was the most irritating part?</strong></p><p>Julia:&#xA0;I think for me, the most frustrating part of research was the constant feeling of &#x2018;failure&#x2019;.</p><p>You can spend months working hard, thinking you are on the right track, and then you realise that your experiment just isn&#x2019;t going to work the way you thought it would. Or you drop your protein that took months and months to make on the floor! I think it was those sorts of things that irritated me as it could feel like an incredible waste of time.</p><p>In the past, that probably would have been okay, and you could just start another experiment, happy in the knowledge that you had ruled something out. But the way science is funded these days you need to have a &#x2018;positive&#x2019; result &#x2014; a major breakthrough that makes a difference to the world around you. If you don&#x2019;t, you simply don&#x2019;t get funded. I think its really sad that it has gone that way, as we are losing some of the best scientists simply because they didn&#x2019;t have their &#x2018;Eureka!&#x2019; moment in the first few years of their career and then they lose their job.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8a4bf01e-11b1-4c23-9820-7af6880b9ee5.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/8a4bf01e-11b1-4c23-9820-7af6880b9ee5.jpeg\"></p><p><br></p><p><strong>me: What type of scientist are you (and what does that mean)?</strong></p><p>Julia:&#xA0;My field of research was&#x2018;structural biology&#x2019;. Basically that means, I try to understand what proteins and peptides look like right down at the atomic level. These proteins are too small to be seen under a light microscope, so we have to use a different technique that uses even brighter light, such as X-rays. The technique also requires knowledge in physics, maths, computing, and biochemistry to be able to create models of these proteins. But once we do &#x2018;see&#x2019; what these proteins look like, it can tell us a lot about its function in the body and what might be going wrong in disease. We can then use this information to design new therapies.</p><p><br></p><p><strong>me: What&#x2019;s your claim to fame?</strong></p><p>Julia:&#xA0;I think my proudest achievement was winning the&#xA0;<a data-cke-saved-href=\"http://www.monash.edu.au/news/monashmemo/assets/includes/content/20100609/stories-lead.html\" href=\"http://www.monash.edu.au/news/monashmemo/assets/includes/content/20100609/stories-lead.html\" target=\"_blank\">Victorian Premier&#x2019;s Award for Medical Research</a>. This was for my PhD research into understanding organ transplant rejection. I studied the interaction between two proteins involved in the rejection process by solving their structures. Unlike the current dogma where we try to genetically match the donor and recipient as closely as we can, my research pointed to the possibility that if we used extreme genetic mismatching we might have better outcomes. The recipient of the transplanted organ may not actually be able to start an immune response against the donor tissue resulting in rejection, because it actually can&#x2019;t detect it in the body. Its like it is wearing an invisibility cloak. However, this research is still in its early stages.</p><p>I received the award at Government House in Melbourne and my parents were invited. It was so nice to have my parents there. They have played such an important role in my education and I would not have been able to get to that point without their emotional and financial support. So the award really recognised the sacrifices they have made, and their support of me becoming a scientist even though its not the most financially rewarding career path!</p><p><br></p><p><strong>me: What part of your job gives you the most satisfaction and why?</strong></p><p>Julia:&#xA0;The most satisfaction I got was when I finally saw the structure of the protein that I was working on. It was an amazing feeling to be seeing something for the first time. Only then can we start to understand how that protein really works in the body and maybe even be able to fix things that go wrong in disease.</p><p>The thing I loved about being a scientist was the sense that I could potentially help those suffering from disease or illness in the future1&#xA0;and improve their quality of life.</p><p><br></p><p><strong>me: Do you find that people react a certain way when you tell them you&#x2019;re a scientist? Do they make any assumptions? Are they correct?</strong></p><p>Julia:&#xA0;Yes! I think the best way I can explain this is through a little experiment I did when I was a lot younger and very single. I would go to bars with a few friends of mine and guys would try to strike up a conversation and eventually ask &#x201C;so what do you do, Julia?&#x201D;</p><p>I had two answers to that question:&#x201C;I&#x2019;m a scientist&#x201D; or &#x201C;I&#x2019;m a hairdresser&#x201D;. If I used the first answer, there would be silence and the majority of guys would make some lame excuse to get away from me. But being a hairdresser was awesome, and they would continue buying me drinks! This also worked for another scientist friend of mine who chose the slightly more glamorous occupation of &#x2018;air hostess&#x2019;.</p><p>In all seriousness though, I think people do get the impression that because you are a scientist, you are boring or you only want to talk about science and your own research. But we are actually quite normal people really, and we aren&#x2019;t completely socially awkward (well maybe a little bit).</p><p><br></p><p><strong>me: Are you a good public speaker?</strong></p><p>Julia:&#xA0;Public speaking makes me want to vomit. Yes, even after all these years. For me, this was one of the toughest parts of being a researcher. Saying that, it did get better over the years. And I think my nerves meant that I practiced and prepared enough to give an acceptable talk. Oh and just recently, I discovered beta blockers to help with the anxiety and obvious shaking hands. They definitely help!</p><p><br></p><p><strong>me: What&#x2019;s your superpower?</strong></p><p>Julia:&#xA0;I&#x2019;m anxiety girl! Able to jump to the worst conclusion in a single bound! No but seriously, I think my superpower is my ability to be super organized. And this is a really important quality as a scientist.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5eb9950e-081c-4ff3-a81a-a726d92c056e.jpeg\"></p><p><br></p><p><strong>me: Do you wear a lab coat and safety glasses? Why?</strong></p><p>Julia:&#xA0;I always wear a lab coat in the lab, mostly because I was working with litres and litres of bacteria or yeast so I didn&#x2019;t want to get that stuff on my pretty clothes. I would wear safety glasses most of the time (don&#x2019;t tell my safety officer that!). It depended on what I was doing I guess. If I was pouring acid, yes I&#x2019;d wear glasses.</p><p><br></p><p><strong>me: So when you aren&#x2019;t in the lab, or the office, what do you love doing?</strong></p><p>Julia:&#xA0;I know its clich&#xE9;d but I just really enjoy spending time with the people I love &#x2013; whether it&#x2019;s at the pub, going to a gig, or watching movies.</p><p><br></p><p><strong>me: Tell me about one thing that makes you smile or laugh out loud!</strong></p><p>Julia: Oh there are so many things that make me laugh! Like right now, I&#x2019;m watching Family Guy and that&#x2019;s making me laugh! :)</p><p><br></p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4f1b3c9d-1ddb-4969-9186-1c6ad18f2fff.jpeg\">&#x200B;</p><p>Thank you Julia for being my first interviewee for this series. You were great fun and so easy to photograph.</p><p>I hope you&#x2019;ve enjoyed this interview, I think you&#x2019;ll agree that Julia is a very accomplished young woman and a great example of the modern scientist. Just like many of us, Julia started with a plan but things don&#x2019;t always go according to plan. She is on a new path now, building her business and now she&#x2019;s heading off to see the world!</p><p>I wish Julia the best of luck and all the happiness in the world.</p><p><br></p><p>Desley is one of our contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p><p><a data-cke-saved-href=\"/jobs/science/\" href=\"https://www.dccjobs.com/jobs/science/\">Explore jobs in science on DCC Jobs.</a></p><p><br></p><h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2016/08","associated_company":"work180"}