{"url":"https://www.work180.com.au/blog/2017/08/scientist-spotlight-professor-jenny-martin","title":"Scientist Spotlight – Professor Jenny Martin","author":"WORK180","body":"\n\t\t\t\t\t<p>Professor Jenny Martin was appointed Director of the Griffith Institute for Drug Discovery (GRIDD) in 2016. At that time, it was called The Eskitis Institute and I worked there from 2000 &#x2013; 2005. Being an alumni and a photographer, Jenny asked me to photograph the leadership team and students for the rebranding of the Institute to give it its new name, GRIDD.</p><p>I had a wonderful time photographing Jenny and the team and she very kindly agreed to be interviewed for my&#xA0;Scientist Spotlight&#xA0;series, which I have sadly neglected of late.</p><p>Jenny is an incredibly intelligent, thoughtful and kind&#xA0;woman, who advocates for education and for gender equality, particularly in academia&#xA0;and I am humbled to be able to feature her here.</p><p style=\"text-align:center\"><strong>So I know you&#x2019;re a scientist, but when did you decide to become a scientist? What were you thinking? (Not WHAT WERE YOU THINKING?!?! but what made you decide that science was going to be your future?)&#xA0;</strong><br><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f6914101-e452-481b-b583-068a1e885db1.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/f6914101-e452-481b-b583-068a1e885db1.jpeg\" alt=\"Professor Jenny Martin\"></p><p>At high school I was always going to be a vet. The world&#x2019;s worst vet apparently, as&#xA0;<span style=\"color:rgb(0, 128, 128)\">I faint at the sight of blood</span>. Luckily, I was accepted into Pharmacy, aced the course (<span style=\"color:rgb(0, 128, 128)\">Gold medallist!</span>) and was encouraged into a Masters research degree. The rest is history.</p><p><strong>What was the best thing about studying science?</strong><br>Ah, the thrill of discovery and the continual learning. It&#x2019;s&#xA0;<span style=\"color:rgb(0, 128, 128)\">addictive</span>.</p><p><strong>And what was the most irritating part?</strong><br>The focus on metrics &#x2013; that mean nothing to anyone outside science &#x2013; that are used to measure the worth of individuals.</p><p><strong>What type of scientist are you (and what does that mean)?</strong><br>I am a structural biologist &#x2013; I use a range of biophysical techniques to decode the atomic structures of disease-causing proteins. And then I use those structures for early-stage drug discovery.</p><p><strong>What&#x2019;s your claim to fame?</strong><br>I am very well-travelled. I&#x2019;ve lived in Melbourne Australia, Oxford UK, Gold Coast QLD, New York New York, and Brisbane QLD. I&#x2019;ve been to the Himalayas in Nepal, the Atlas Mountains in Morocco, a garden party at Buckingham Palace, the White House, the Great Wall of China, the JukkesJ&#xE4;rvi Ice Hotel above the arctic circle in Sweden in mid-winter&#x2026;&#x2026;</p><p style=\"text-align:center\"><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c94ba349-13eb-4916-a13a-ab6c27ae9e39.jpeg\"></strong></p><p><strong>What part of your job gives you the most satisfaction and why?</strong><br>Supporting others to succeed. Because I am&#xA0;<span style=\"color:rgb(0, 128, 128)\">hardwired to help</span>. And I care about people.</p><p><strong>Do you find that people react a certain way when you tell them you&#x2019;re a scientist? Do they make any assumptions? Are they correct?</strong><br>They usually say, &#x201C;you don&#x2019;t look like a scientist&#x201D;. I guess they assume that scientists aren&#x2019;t women. They are incorrect of course &#x2013;&#xA0;<span style=\"color:rgb(0, 128, 128)\">women have been the best scientists since the beginning of time</span>.</p><p><strong>Are you a good public speaker?</strong><br>People tell me I am. I guess the repeat invitations are a good indication.</p><p><strong>Do you wear a lab coat and safety glasses? Why?</strong><br>I used to, but not any more. I fear I&#x2019;d be dangerous in a lab these days.</p><p><strong>So when you aren&#x2019;t in the lab, or the office, what do you love doing?</strong><br>I love clocking up long-distance walks: Milford Track, Routeburn Track, Overland Trail, Dales Way, RidgeWay, South Downs Way and many more. There&#x2019;s a long list waiting for me&#x2026;. perhaps I&#x2019;ll tick off 1-2 more this year.</p><p><strong>Tell me about one thing that makes you smile or laugh out loud!</strong><br>Funny cat videos. And that video of the BBC family man&#x2026;.</p><p><strong>What is your superpower?</strong><br>Baking.&#xA0;<span style=\"color:rgb(0, 128, 128)\">(DP edit: I love this about her!)</span></p><p>Thank you so much Jenny for being a great interviewee and model for this shoot. I&#x2019;ve included a couple of behind the scenes shots below which I think are good fun.</p><p><br></p><p>I know that Jenny has&#xA0;underplayed her &#x201C;claim to fame&#x201D;. Among many other accolades, Jenny&#xA0;is the recipient of prestigious awards including:</p><ul><li>ASBMB Roche Medal</li><li>Queensland Smart Women Smart State Research Scientist Award</li><li>Women in Biotech Outstanding Achievement Award</li><li>ARC Queen Elizabeth II Fellowship</li><li>ARC Professorial Research Fellowship</li><li>ARC Australian Laureate Fellowship.</li></ul><p>You can find Jenny on Twitter:&#xA0;@Jenny_STEM and the institute&#xA0;@GRIDD_GU</p><p>Jenny also&#xA0;<a data-cke-saved-href=\"https://cubistcrystal.wordpress.com/\" href=\"https://cubistcrystal.wordpress.com/\" target=\"_blank\">blogs here</a>&#xA0;on WordPress.</p><p>You can see many more shots from the GRIDD Photo Shoot on my portfolio site&#xA0;<a data-cke-saved-href=\"https://desley-pitcher.squarespace.com/client-corporate-shoot-griffith-university/\" href=\"https://desley-pitcher.squarespace.com/client-corporate-shoot-griffith-university/\" target=\"_blank\">here</a>&#x2013; this includes the other scientists as well as students in action!</p><p><a data-cke-saved-href=\"/jobs/science/\" href=\"/jobs/science/\">Explore jobs in science on DCC Jobs.</a></p><h4><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"www.dccjobs.com/clients\" href=\"www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p><p><br></p><p>Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now!<br></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/08","associated_companies":["work180"]}