{"url":"https://www.work180.com.au/blog/2016/09/scientist-spotlight-moana-simpson","title":"Scientist Spotlight – Moana Simpson","author":"WORK180","body":"\n\t\t\t\t\t<p>This is my second interview for my Scientific Reasoning feature, designed to give us some insight into the lives of some of today&#x2019;s scientists. The first interview can be found&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/news/scientist-spotlight-dr-julia-archbold/15222/\" href=\"https://www.diversecitycareers.com/news/scientist-spotlight-dr-julia-archbold/15222/\">here</a>&#xA0;&#x2013; you will notice that many of the questions are the same &#x2013; I wanted a fairly even playing field, so we can get a good understanding of these talented people.</p><p>Today&#x2019;s interview is with my very good friend, Moana Simpson. We met in 2000 when we worked together as research scientists at the same institute. I left there in 2005 but we have remained the best of friends ever since. Most of these photos were taken at her&#xA0;mum&#x2019;s birthday high tea, which I have previously posted here.</p><p><br></p><p><strong>me: So I know you&#x2019;re a scientist, but when did you decide to become a scientist? What were you thinking? (Not WHAT WERE YOU THINKING?!?! but what made you decide that science was going to be your future?)</strong></p><p>Moana:&#xA0;So I think I decided something in science for a career in Grade 11 when I chose the maths/science subjects but I didn&#x2019;t really know what in science&#x2026;I&#x2019;m not sure many of us did. Then after those two hellish years of hating physics, I decided to put a Bachelor of Information Technology down as my number 1 preference on my QTAC form (entry into University)..so completely non-science related. I completed one year&#x2026;due mostly to the fact that I failed&#xA0;programming&#x2026;never failed a subject before so took that as a sign that I should stick to what I know and started my BSc the following year in chemistry and biochemistry. &#xA0;My plan was to become a forensic&#xA0;scientist-it&#xA0;was back when Grisham (that&#x2019;s the CSI Grisham) was pretty cool.</p><p><br></p><p><strong>me: What was the best thing about studying science?</strong></p><p>Moana:&#xA0;I have to say the best part was getting my hands dirty&#x2026;the labs. &#xA0;Loved food and drug analysis lab where we got to titrate samples and use the HPLC for the first time&#x2026;work out what chemicals were in everyday foods. &#xA0;My favorite lab was Advanced&#xA0;biochemistry&#xA0;where we got to run our own western blots. &#xA0;It was just good putting the lectures into practice except for microscopy labs- those were the worst!</p><p><br></p><p><strong>me: And what was the most irritating part?</strong></p><p>Moana:&#xA0;Probably doing subjects that I never saw a benefit&#xA0;in-thermodynamics&#xA0;and reaction kinetic. Seriously&#x2026;those subjects are nap-worthy. &#xA0;The other thing was learning to get a decent job you needed to do an extra year after finishing 3 years&#x2026;and not get paid</p><p><br></p><p><strong>me: What type of scientist are you (and what does that mean)?</strong></p><p>Moana:&#xA0;Well, I&#x2019;m probably not technically a scientist anymore&#x2026;I was a screening biologist for 8 years following my Honours degree. &#xA0;Primarily this means I would screen a large number of samples or compounds on a biological enzyme or protein in&#xA0;a cancer&#xA0;or infection pathway and identify an active inhibitor that could potentially be the next best drug&#x2026;didn&#x2019;t&#xA0;happen but it was a fairly cool hands-on job. I did manage to work overseas at&#xA0;Astrazeneca&#xA0;in the UK doing this job which was a great experience personally and professionally.&#xA0;</p><p>Now I manage a national facility for compound management which is probably more project management and equipment handling than true science. &#xA0;It does mean I get to play with pretty cool robots and help chemists and biologists across Australia.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e5b8df11-1211-42f4-aca7-8628c4b5ea86.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e5b8df11-1211-42f4-aca7-8628c4b5ea86.jpeg\"></p><p><strong>me: Do you find that people react a certain way when you tell them you&#x2019;re a scientist? Do they make any assumptions? Are they correct?</strong></p><p>Moana:&#xA0;My mother says &#x201C;Moana is a scientist. She makes tubes fly across the ceiling!&#x201C;&#x2026;and that&#x2019;s about all any of my family understands. She is correct..I do make tubes fly across the ceiling but my job is a little more involved than that, Mum :)</p><p>Others I meet &#x2013; I tend to say I&#x2019;m a lab manager rather than scientist&#x2026;less likely for them to have their eyes glaze&#xA0;over .They like to hear about the robots and cool equipment I get to play with-I think Science just freaks some people out</p><p><br></p><p><strong>me: Is there anything about working in science that is completely different to what you imagined it would be?</strong></p><p>Moana:&#xA0;Yes and no&#x2026;.yes because I never appreciated how ever-changing science really is and no because it&#x2019;s never going to be the most high-paying job out there but it can be very rewarding in other ways.</p><p><br></p><p><strong>me: If money and time&#xA0;we&#x2019;re&#xA0;not an issue, what would you be doing with your days?</strong></p><p>Moana:&#xA0;Other than sitting on on a beach reading a book and playing with the dog&#x2026;.or planning some great overseas adventures. &#x2026;I&#x2019;d like to make cushions and my&#xA0;xmas&#xA0;crafts and sell them locally.</p><p><br></p><p><strong>me: So when you aren&#x2019;t in the&#xA0;lab,&#xA0;or the office, what do you love doing?</strong></p><p>Moana:&#xA0;Hanging with my &#x201C;besties&#x201D; &#x2013; Olly my beautiful, big&#xA0;german&#xA0;shepherd at the beach&#x2026; Otherwise catching up with&#xA0;miss&#xA0;desley&#xA0;(when she&#x2019;s not galavanting around the countryside), eating dumplings and chatting (aka bitching about life,&#xA0;love&#xA0;and stuff in general), or hanging with my family.</p><p><br></p><p><strong>me: Tell me about one thing that makes you smile or laugh out loud!</strong></p><p>Moana:&#xA0;Looking at old photos&#x2026;.being a child of the 80s and 90s meant I had about 30&#xA0;hair styles&#xA0;including a perm and a mullet&#x2026;seriously what we&#x2019;re we thinking &#x263A;</p><p>Thank&#xA0;you&#xA0;Moana for doing this interview with me. I love these photos and you have some amusing answers in there. I had a mullet and a perm as well (as you know, and at one point both at the same time &#x2013; good grief!!). We all wish you the best of luck with whatever adventure comes up next.</p><p>I hope you enjoyed this interview &#x2013; again, Moana has taken a different path to the one she started on, but it&#x2019;s always been grounded in science. Moana and I (BFFs) hang out regularly &#x2013; dumplings, cocktails, movies, shopping, all those fun things and I am blessed to have her in my life.</p><p>You can find Moana on Twitter @elmoolly or via email at elmoolly@gmail.com</p><p><br></p><p>Desley&#xA0;is one of our contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p><p><a data-cke-saved-href=\"/jobs/science/\" href=\"https://www.dccjobs.com/jobs/science/\">Explore jobs in science on DCC Jobs.</a><br></p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2016/09","associated_company":"work180"}