{"url":"https://www.work180.com.au/blog/2017/08/scientist-spotlight-professor-kathy-andrews","title":"Scientist Spotlight – Professor Kathy Andrews","author":"WORK180","body":"\n\t\t\t\t\t<p>Professor Kathy Andrews was the first person I had the pleasure of photographing during the Griffith Uni photo shoot. I was a little nervous since there wasn&#x2019;t a lot of direction about what was required, except for the new Griffith tagline #beremarkable</p><p>Kathy lives up to that tagline &#x2013; she is a remarkable woman *spoiler alert* : she looks up to women who juggle work, home and life in general and she is someone who does just that and makes it look easy. She has launched an exciting new program called &#x201C;<a data-cke-saved-href=\"https://www.facebook.com/ThatsRadScience/\" href=\"https://www.facebook.com/ThatsRadScience/\" target=\"_blank\">That&#x2019;s RAD! Science</a>&#x201D; which is aimed at engaging children with the sciences.</p><p>Kathy was always smiling during the photoshoot and happy to try some weird ideas for shots, including traipsing in amongst the trees, and in another instance, looking intently at a blood sample at what was probably quite an uncomfortable angle</p><p>Here is my interview with Kathy, along with some of the photos from the shoot.</p><p><strong>So I know you&#x2019;re a scientist, but when did you decide to become a scientist? What were you thinking? (Not WHAT WERE YOU THINKING?!?! but what made you decide that science was going to be your future?)</strong></p><p>I remember when I was in primary school that my parents loved to visit auctions and of course auctions were pretty exciting for kids too. At one auction I saw a mixed box that contained several glass&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">test tubes</span></strong>&#xA0;and convinced my mum that I had to have them! I think I was always interested in science, but to have my own test tubes was definitely pretty inspiring.</p><p><strong>What was the best thing about studying science?</strong></p><p>The best thing about studying science is that&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">every day is different</span></strong>&#xA0;and you never know what amazing new thing you will discover. Being the first in the world to know about a new aspect of your research area is pretty great.</p><p><strong>And what was the most irritating part?</strong></p><p>Paperwork!</p><p><strong>What type of scientist are you (and what does that mean)?</strong></p><p>I am a&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">malaria drug discovery</span></strong>&#xA0;scientist. This means that I am searching for new medicines that may help people sick with a disease called malaria, or even prevent them from getting sick to start with.</p><p><strong>What&#x2019;s your claim to fame?</strong></p><p>My lovely daughter Emma would have to be my claim to fame!</p><p style=\"text-align:center\"><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/244382ef-f4b8-47d0-ac44-e0b010262e03.jpeg\"></strong></p><p><strong>What part of your job gives you the most satisfaction and why?</strong></p><p>Working with fantastic staff and students gives me the most satisfaction. I really enjoy helping my students develop into&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">confident and talented young scientists</span></strong>. Very rewarding!</p><p><strong>Do you find that people react a certain way when you tell them you&#x2019;re a scientist? Do they make any assumptions? Are they correct?</strong></p><p>Telling people that I am a scientist can sometimes&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">stop a conversation</span></strong>&#xA0;at a party, but generally I think people are extremely interested in science.</p><p><strong>Are you a good public speaker?</strong></p><p>Sometimes &#x2013; especially when I am talking about an area I&#x2019;m passionate about. A big part of my job as a scientist is to talk to different kinds of people. I especially&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">love talking to kids about science</span></strong>&#xA0;as they are always so enthusiastic and ask the most interesting (and sometimes very unexpected) questions.</p><p><strong>What would you ideal day look like?</strong></p><p>My ideal day at work would include discussing exciting new data with my students and helping them to plan new experiments. Or celebrating the success of one of our team with&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">cake</span></strong>!</p><p style=\"text-align:center\"><strong><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/26f891b5-c32a-4f5b-9527-f48368997ad8.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/26f891b5-c32a-4f5b-9527-f48368997ad8.jpeg\"></strong></p><p><strong>So when you aren&#x2019;t in the lab, or the office, what do you love doing?</strong></p><p>I love to spend time with my family, especially watching my daughter play netball. I am also&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">working on a series of children&#x2019;s picture books</span></strong>about science, technology, engineering and mathematics (STEM) at the moment so I love working on that new project.</p><p><strong>Tell me about one thing that makes you smile or laugh out loud!</strong></p><p>Seeing the very odd positions my cat sleeps in! Hilarious!!</p><p><strong>Who do you look up to and why?</strong></p><p>I look up to all working&#xA0;<strong><span style=\"color:rgb(0, 128, 128)\">parents who juggle work, children and life</span></strong>!</p><p style=\"text-align:center\">&#x200B;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d327142f-9606-4fd5-bc37-9dd8633f110e.jpeg\"></p><p>You can connect with Kathy on her social media channels here:</p><ul><li>Twitter @kandrew07141156</li><li>Twitter @ThatsRADScience</li><li><a data-cke-saved-href=\"https://www.facebook.com/ThatsRadScience/\" href=\"https://www.facebook.com/ThatsRadScience/\" target=\"_blank\">That&#x2019;s RAD</a>&#xA0;on Facebook</li></ul><p>Thank you again Kathy for this candid little interview, I certainly enjoyed learning more about you and I look forward to seeing where the That&#x2019;s RAD! Science program goes.</p><p><a data-cke-saved-href=\"/jobs/science/\" href=\"https://www.dccjobs.com/jobs/science/\">Explore jobs in science on DCC Jobs.</a></p><p><br></p><h4><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p><p><br></p><p><span style=\"font-size: 16px;\">Set up your job alert with&#xA0;</span><a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">1 click</a><span style=\"font-size: 16px;\">&#xA0;now!</span><br></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/08","associated_company":"work180"}