{"url":"https://www.work180.com.au/blog/2017/11/sensei-breaking-out-of-the-typical-it-shell","title":"Sensei - breaking out of the typical IT shell","author":"WORK180","body":"\n\t\t\t\t\t<p>Here at&#xA0;<a href=\"https://www.dccjobs.com/clients/sensei\" target=\"_blank\">Sensei</a>, we are firm believers in the idea of &#x201C;Team&#x201D;. Team is central to everything we do &#x2013; in our working with customers, bringing new ideas and solutions to market, or just relaxing and having fun. So much so that even though we call our company &#x201C;Sensei&#x201D;, our emails are&#xA0;person-name@teamsensei.com.au. We hope that everyone feels like they are part of the team. Over the past year we&#x2019;ve been thinking about how to improve the team and make it stronger, which led us on a path of actively working to diversify our team. You may be thinking &#x201C;Here we go, another article about diversity and why it&#x2019;s important&#x2026;&#x201D; &#x2013; but hear me out; this is a story about our journey and what we&#x2019;ve seen so far. And I&#x2019;m happy to report that it&#x2019;s been great for our business so far, and hope to continue seeing success from evolving our sense of &#x201C;Team&#x201D;.</p>\n\n<p><br>\nFor starters, we looked at the way in which we could &#x201C;break out of the typical IT shell&#x201D; of who is a part of our team. In our industry, that has traditionally meant men&#x2026; usually aged 25 to 40. We partnered with DCC Jobs to help us reach a whole other audience that we thought could strengthen our team with different skills and perspectives &#x2013; you know, the other half of the population&#x2026; women! And whilst we are only really at the start of this journey, acknowledging that we are on the journey has been hugely helpful for us. We are now more aware of what might interest potential team members, outside of the &#x201C;traditional candidate&#x201D; (the young guy who wanted Friday beers and Xbox) &#x2013; and not just for women. It allowed us to rethink our benefits around family; time off during pregnancy and birth, and flexible working hours. It made us &#x201C;pick up our act&#x201D; with regards to a few things that we had always just thought &#x201C;yes, of course that&#x2019;s important&#x201D; to, and we wrote some policies and documented our beliefs. Examples of this have been our Domestic Violence policy and our Environmental policy. And we continue to think about what&#x2019;s important to our team as it grows and evolves to a whole new set of people with different ages, sexes, races and beliefs.</p>\n\n<p><br>\nOne of the things I&#x2019;m most proud of is the way in which we&#x2019;re working hard to make Sensei a flexible workplace. We&#x2019;ve recently (in the past month) hired two new team members into Flexible working arrangements. It&#x2019;s been made clear to them that we care more about the outcome rather than the &#x201C;where&#x201D; or &#x201C;when&#x201D; they are working. For example, one new starter will be working with us in our Melbourne office 4 days a week, but receiving all the benefits of a 5 day a week team member (e.g. no pro-rata on their leave, benefits, or anything else). In our mind, it&#x2019;s up to them to manage their workload into a 4 day bracket each week. Another team member who lives some distance away will be working from home between one and two days a week. Again, we are not hung up on making sure they are online from 9am to 5pm when they are working from home &#x2013; we trust that they will do the job that needs to be done. If it&#x2019;s not, we expect them to own the responsibility to get that work done.&#xA0;Personally, I like to try and work from home once every 2 or 3 weeks to help save a bit of unproductive travel time as well as create solid blocks of time without interruption. As much as I enjoy the train ride into work, it does mean that I&#x2019;m not as productive as I need to be, plus I&#x2019;m able to start nice and early in the day and roll all the way through to lunch &#x201C;in the zone&#x201D;. The downside is that the coffee at home isn&#x2019;t quite as good as at the office&#x2026; but it&#x2019;s a small price to pay :)</p>\n\n<p><br>\nWe have 6 key values at Sensei, and 3 of them come into play here; &#x201C;We care deeply about people&#x201D;, &#x201C;We are easy to work with&#x201D; and &#x201C;We keep promises&#x201D;. If our team members deliver on these 3 values, having a Flexible working policy is a no-brainer. And it&#x2019;s been commented on by a number of people in our business over the past 6 months; from those doing the school drop-offs and pick-ups, to those who just felt like they were going to be more productive at home that day. In time I see us extending this policy even more, and even encouraging people to try new ways of working, for the benefit of their own work/life balance as well as their own personal productivity.</p>\n\n<p><br>\nSo whilst it&#x2019;s still early in our journey, I do see some things that we&#x2019;ll work on in the coming six to 12 months that will evolve our business. Most of these initiatives we have planned come down to two main things; trust in people and sharing the accountability and ownership in our business. Once people feel like they have ownership and are trusted with it, we believe that&#x2019;s far more powerful than any policy or company directive. And for us, that&#x2019;s how we will continue to grow as a business and attract the right kind of people to our business that align with our values and provide us with a diverse, strong and capable team. Stay tuned for an update on how it&#x2019;s all going in six months&#x2019; time!</p>\n\n<p>&#xA0;<br>\nCheers,<br>\n<em>Andy Neumann</em><br>\nChief Executive&#xA0;Officer<br>\n<br>\n<strong>About Andy Neumann</strong><br>\n&#xA0;<br>\nAndy has extensive experience in management and leadership within a number of high-profile Australian Microsoft partners and IT companies over the past 20 years. Prior to leading Sensei, Andy led one of Australia&#x2019;s largest and most successful Microsoft Productivity partners, OBS from 2008 to 2015 (the business was acquired by&#xA0;Empired&#xA0;Ltd. In 2013). He also led the Victorian Microsoft business for DWS Advanced Business Solutions, built and led a number of successful national practices at Strategic Data Management (SDM) and spent a number of years providing project management consulting into many large Australian corporates and government departments.&#xA0;<br>\n&#xA0;<br>\nAndy&#x2019;s background in software development, project management and consulting has contributed to his ability to lead and shape a profitable services business. You can read more about Andy&#xA0;<a href=\"https://www.linkedin.com/in/andyneumann/\" target=\"_blank\">here</a>.</p>\n\n<p><strong>About Sensei</strong></p>\n\n<p>Sensei is a DCC Endorsed Employer for Women. Learn more about the company and apply for their jobs <a href=\"https://www.dccjobs.com/clients/sensei\" target=\"_blank\">here</a>.</p>\n\n<h4 style=\"font-family: Lato, sans-serif;\">&#xA0;</h4>\n\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality","Career Development"],"upload_date":"2017/11","associated_companies":["work180"]}