{"url":"https://www.work180.com.au/blog/2017/04/seven-benefits-of-joining-a-board","title":"Seven Benefits of Joining a Board","author":"WORK180","body":"\n\t\t\t\t\t<p>Being on a board is very rewarding in its own right and I&#x2019;ve seen all of types of people come to Get on Board Australia for help in building their board skills. The main motivators are:</p>\n\n<ul>\n\t<li>\n\t<p>Looking to improve your skills in the hope of gaining a promotion in your professional career.</p>\n\t</li>\n\t<li>\n\t<p>You&#x2019;re building towards future paid board positions.</p>\n\t</li>\n\t<li>\n\t<p>You&#x2019;re starting to build a portfolio career</p>\n\t</li>\n\t<li>\n\t<p>You&#x2019;re up-skilling to move your career to its next stage after a redundancy.</p>\n\t</li>\n</ul>\n\n<p>So how does being on a board help achieve these goals?</p>\n\n<p>It just so turns out that the benefits of being on a board go far beyond the boardroom. From my own and others&#x2019; board experiences, there are seven primary benefits that you will acquire from being on a board:</p>\n\n<p><strong>1. Increased corporate governance skills</strong></p>\n\n<p>Board exposure helps you understand and appreciate what corporate governance is and how to implement&#xA0;best practice methodologies into organisations</p>\n\n<p>This knowledge is important for ensuring personal and organisational compliance and sound operation, which gives assurance to shareholders,&#xA0;customers, and other important stakeholders that the organisation is well run and safe to do business with.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>2. Improved strategic and business acumen</strong></p>\n\n<p>Becoming competent in &#x2018;the business of doing business&#x2019; helps you to discern&#xA0;the interdependence of all aspects of business operations.</p>\n\n<p>Understanding the link between all of an organisation&#x2019;s departments enables&#xA0;informed decision-making and consideration of the broader implications and requirements of strategic decisions and the decisions you make in your professional role.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>3. Better understanding of board and business processes and operations</strong></p>\n\n<p>The board environment is full of unusual and highly formulated processes and procedures, all tied in with a good dose of interpersonal politics. You will learn and understand how to&#xA0;navigate this environment to ensure that you survive and thrive in the boardroom and workplace. You will also begin to understand the difference between strategic and operational matters.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>4. Enhanced confidence</strong></p>\n\n<p>Confidence is increased through acquiring new&#xA0;knowledge.&#xA0;You will find yourself knowing the right&#xA0;questions to be asking at board meetings, and be contributing and leading discussions with conviction and self-assurance. Something easily transferred to your &#x2018;day job&#x2019; that will pay dividends.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>5. Further developed leadership and interpersonal skills</strong></p>\n\n<p>Life as a company director involves being a leader within an organisation and with its stakeholders. With this comes the need for you to be able to&#xA0;form and leverage&#xA0;important relationships with a wide range of individuals, all with their own agenda.</p>\n\n<p>Refining and honing&#xA0;your interpersonal and leadership skills helps you to successfully maneuver yourself, the board, and the organisation through its operating environment. Influencing and moving people to achieve specific goals form a significant part of any job.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>6. Improved decision making</strong></p>\n\n<p>All of the above benefits ultimately lead you to be able to make better-informed&#xA0;strategic decisions with confidence. This improved decision making ability will serve you in all situations and&#xA0;organisations you work within.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>7. Access to a broader network</strong></p>\n\n<p>Boards connect you with other board members and organisational stakeholders. This network will open up your personal network beyond your usual professional career network. An extended network can lead to further board appointments and connections with subject-matter experts that you can call on when you&#x2019;re in need of specific expertise.</p>\n\n<p>These boardroom benefits can work together to help you achieve any (or all) of the primary motivations for joining a board. Combined with professional&#xA0;<a href=\"http://www.getonboardaustralia.com.au/\">director development</a>, it is a powerful blend for your career.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/bc685f86-6e1e-4d5f-946e-7a4224b1789f.jpeg\"></p>\n\n<p><strong>Lisa Cook</strong></p>\n\n<p>Lisa Cook is the Founder and Managing Director of Get on Board Australia. Get on Board delivers education and development courses that are open to new and aspiring company directors from all professional backgrounds and all types of industries (public, private, NFP, sporting organisations and clubs, etc.). Get on Board focuses on aspiring directors &#x2013; those people looking to join a board in the near future &#x2013; and on new directors &#x2013; those who are currently in their first to fifth year of sitting on a board. Get on Board delivers the Boardroom Bootcamp course: a 12-week online program leading to a Certificate in Board Readiness.</p>\n\n<p>Lisa sits on the board of a number of organisations in the private, public, and not-for-profit sectors in Adelaide and Sydney. Lisa holds a degree from Charles Sturt University in business management and marketing, and has completed the Foundations of Directorship program through AICD.</p>\n\n<p>&#xA0;</p>\n\n<p>Get on Board Australia</p>\n\n<p><a href=\"http://www.getonboardaustralia.com.au/\">Website</a></p>\n\n<p><a href=\"http://twitter.com/GetOnBoardAUS\">Twitter</a></p>\n\n<p><a href=\"https://www.facebook.com/GetOnBoardAustralia/\">Facebook</a></p>\n\n<p><a href=\"http://www.linkedin.com/company/get-on-board-australia\">LinkedIn</a></p>\n\n<p>Connect with Lisa</p>\n\n<p><a href=\"https://twitter.com/lisamcook\">Twitter</a></p>\n\n<p><a href=\"http://www.linkedin.com/in/lisamcook\">LinkedIn</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/04","associated_company":"work180"}