{"url":"https://www.work180.com.au/blog/2018/03/six-scientists-you-need-to-know-but-have-probably-never-heard-of","title":"Six scientists you need to know (but have probably never heard of)","author":"WORK180","body":"\n\t\t\t\t\t<p>When you imagine an inventor you probably think of them suddenly having a &#x2018;Eureka moment&#x2019; and running to their basement to screw retractable legs to the back of a chair or throwing on a white lab coat and boiling chemicals over a bunsen burner. If only it was that simple. In reality, life-changing discoveries take years of research and pages upon pages of peer-reviewed papers. Not as glamorous as you might expect but this is the reality of innovation. Luckily for us, the below six scientists weren&#x2019;t driven by something so fleeting as glamour or fame. As a result they have made significant scientific discoveries that have had huge implications not only in their field of research, but in our everyday lives.</p><h3>1. Maria&#xA0;Goeppert Mayer</h3><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/72c0ef5f-8cca-4cab-b1f8-f0c6272d95d3.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/72c0ef5f-8cca-4cab-b1f8-f0c6272d95d3.jpeg\" style=\"margin: 10px; width: 600px; height: 311px;\"></p><p>Long before Shrek, Professor Maria Geoppert Mayer was referring to life (specifically, the atoms that make up life) as being like an onion. In 1963 Maria discovered that protons and neutrons are spinning along orbits inside the atomic nucleus, kind of like how the Earth spins around its own axis as well as orbiting around the sun. Maria would often explain an atom&#x2019;s structure is made up of several shells, like an onion&#x2019;s layers, but with nothing in the centre. For her discovery she was awarded the Nobel Prize for Physics and for her tasty analogy, the nickname &#x201C;The Onion Madonna&#x201D;.</p><h3><strong>2. Nettie Stevens</strong></h3><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/02b1fac4-a7db-4408-9798-b8697d91ef4a.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/02b1fac4-a7db-4408-9798-b8697d91ef4a.jpeg\" style=\"width: 600px; margin: 10px;\"></p><h5>Nettie Stevens at work at the Naples Zoological Station in 1909. Image: Bryn Mawr Special Collections</h5><p>Nettie Stevens was born in in the mid-1800s, an era where women had three career choices: secretary, teacher or nurse. Nettie began her career as a teacher however she was determined to study her favourite subject: biology. She saved fervently until she could afford to attend university at the age of 35. She didn&#x2019;t begin her research career until she was 39 but went on to make one of the most important discoveries in the field of genetics: She discovered different combinations of the X and Y chromosomes were responsible for sex determination. Sadly, she passed away only 12 years after beginning her career. Despite being in the field for a comparatively short time, she had a lasting impact on modern biology.</p><h3><strong>3. Jane Goodall</strong></h3><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f65f296-5bc7-47fd-9ca6-16cae5713ef5.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f65f296-5bc7-47fd-9ca6-16cae5713ef5.jpeg\" style=\"margin: 10px; width: 600px; height: 401px;\"></p><h5>Image: Baron Hugo Van Lawick, National Geographic</h5><p>Before 1960, scientists believed&#xA0;<em>Homo sapiens&#x2019;</em>&#xA0;ability to use tools was what separated us from other animals.&#xA0;<em>Man the Toolmaker.</em>&#xA0;Humans use tools, animals don&#x2019;t, simple. Dr Jane Goodall turned that theory on its head when she took a highly unorthodox approach to field research. By living near a community of chimpanzees for an extended period of time (instead of coming and going like other researchers), the chimps became used to her presence and behaved more naturally. This led to her observing two chimpanzees making and using tools. As a result, scientists were forced to dramatically reconsider the definition of&#xA0;<em>Homo sapiens</em>. Her unique approach to field research has had a lasting impact for biologists, resulting in many new and incredible findings about the animals we share our world with. Her work has significantly impacted not only our understanding of chimpanzees, but completely redefined the relationship between humans and animals.</p><h3><strong>4. Mary Anning</strong></h3><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e8648320-251d-43cb-b059-14358488d98e.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e8648320-251d-43cb-b059-14358488d98e.jpeg\" style=\"margin: 10px; width: 600px; height: 318px;\"></p><h5>One of the Plesiosaurs fossils Mary discovered on display at the Natural History Museum in London Image CC: Jtweedie1976</h5><p>Are you a fan of fossils? Then let me introduce you to your new hero: Mary Anning. Born into extreme poverty in 1799, Mary&#x2019;s entire family were keen fossil hunters, often selling their finds to scientists and the nobility to make ends meet. She taught herself to read and write and learnt everything she could about anatomy and geology. She made many significant finds including the first ichthyosaur fossil and the first plesiosaurs fossil. By 1820 Mary had established herself as the most accomplished anatomist in the family, and by extension, one of the best in the new and growing field of paleontology. Despite her family&#x2019;s circumstances, scientists and nobility came from far and wide to visit Mary and discuss her findings. Upon meeting Mary, Lady Harriet Sivester wrote in her diary:</p><p>&#x201C;&#x2026; by reading and application she has arrived to that degree of knowledge as to be in the habit of writing and talking with professors and other clever men on the subject, and they all acknowledge that she understands more of the science than anyone else in this kingdom.&#x201D;</p><p>Her discoveries had a huge impact on how scientists reconstructed the history of the world and the animals within it.</p><h3><strong>5. Hedy Lamarr</strong></h3><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c4377e2f-e3e6-468d-a888-2d91eff5ad51.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c4377e2f-e3e6-468d-a888-2d91eff5ad51.jpeg\" style=\"width: 600px; height: 337px; margin: 10px;\"></p><h5>Archive footage from Bombshell: The Hedy Lamarr Story</h5><p>If you&#x2019;re a film buff you might recognise Hedy. In the 1940s she starred in Oscar-nominated films&#xA0;<em>Algiers&#xA0;</em>and&#xA0;<em>Sampson and Delilah</em>. She was certainly a beautiful and talented actress but she had a secret passion; during her downtime she would go into her trailer and invent. &#x201C;The brains of people are more interesting than the looks I think,&#x201D; Hedy said in an interview 10 years before her death. Hedy had an exceptional brain. Fleeing from an unhappy marriage in Austria in 1934, Hedy emigrated to the United States, learnt English and landed herself a contract in Hollywood. She had a short fling with the eccentric Howard Hughes who supported her greatly with her inventions, probably because she helped him greatly with his. When he came to her with a problem about his planes flying too slow, she went out and bought books on birds and fish, analysed the fastest animal&#x2019;s wings or fins and provided Hughes with a significantly improved plane wing design. &#x201C;[I] showed it to Howard Hughes and he said, &#x2018;You&#x2019;re a genius.&#x2019;&#x201D; What she is most famous for, though, is her patented invention of frequency-hopping technology, the precursor to secure Wi-Fi, GPS and Bluetooth. That&#x2019;s right: you have &#x2018;the most beautiful woman in the world&#x2019; to thank for being able to read this blog on your phone.</p><h3><strong>6. Jocelyn Bell</strong></h3><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e1c9601b-5d57-40f7-a2b6-8bc729a0c139.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e1c9601b-5d57-40f7-a2b6-8bc729a0c139.jpeg\" style=\"margin: 10px; width: 600px; height: 400px;\"></p><h5>Photo: PA Archive / Alamy</h5><p>You have to be a special kind of person to get up every day, go to a telescope you helped build and analyse more than 30 metres of charts by eye. You have to be even more special to notice in all that length of data a tiny &#x2018;scruff&#x2019;. Luckily for science, Jocelyn Bell is that kind of person. Working with her supervisor Antony Hewish, Bell captured a detailed recording of the strange signal. From this, she could see that the &#x2018;scruff&#x2019; was a train of pulses. After months of eliminating different potential sources, Bell and Hewish had officially made one of the most significant scientific achievements of the 20th&#xA0;century: they discovered pulsars. A pulsar is a small, spinning star &#x2013; a giant ball of neutrons, left behind after a normal star has died in a fiery explosion. Pulsars help us do lots of important things including finding gravitational waves, test the general theory of relativity and determine the structure of our galaxy.&#xA0;Hewish and his colleague Sir Martin Ryle were <a data-cke-saved-href=\"https://www.telegraph.co.uk/news/science/11941453/Female-physicist-overlooked-for-Nobel-Prize-finally-receives-recognition-as-Woman-of-the-Year.html\" href=\"https://www.telegraph.co.uk/news/science/11941453/Female-physicist-overlooked-for-Nobel-Prize-finally-receives-recognition-as-Woman-of-the-Year.html\">later awarded the Nobel Prize in Physics</a> for the discovery, despite Bell being the first to observe them and being listed second on the research paper.</p><h3><strong>Notice anything?</strong></h3><p>There&#x2019;s a common thread between the above six researchers: they are all women. Women who, regardless of the era, faced significant barriers in their pursuit of science. Luckily for us, they all pushed through those barriers and made world-changing discoveries.&#xA0;</p><p>This post was originally published by <a data-cke-saved-href=\"https://blog.csiro.au/six-scientists-you-need-to-know/\" href=\"https://blog.csiro.au/six-scientists-you-need-to-know/\">CSIROscope.</a>&#xA0;</p><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About CSIRO&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2fe5b586-381e-4cca-86b7-285b311100ef.png\" style=\"float: right; margin: 10px; width: 100px; height: 100px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2fe5b586-381e-4cca-86b7-285b311100ef.png\"></strong></h4><div><p>WORK180 welcomed CSIRO to our list of #EndorsedEmployersforWomen in November 2017. With CSIRO, you&#x2019;ll use science to solve challenges and provide solutions. You&#x2019;ll enjoy a flexible working environment with all staff encouraged to embrace flex the way it works for them: job sharing,&#xA0;part time, flexible hours etc. Gain excellent development opportunities, scholarships, mentoring, financial study assistance, and the opportunity to represent CSIRO at national and international conferences and much more!</p><p>Learn more about CSIRO on their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/csiro\" href=\"https://www.work180.com.au/clients/csiro\">Best Employer page</a>&#xA0;&amp; apply for their jobs&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=csiro\" href=\"https://www.work180.com.au/job-search?client=csiro\">here.</a><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=csiro\" href=\"https://www.work180.com.au/job-search?client=csiro\">&#xA0;</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div><p><br></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2018/03","associated_company":"work180"}