{"url":"https://www.work180.com.au/blog/2018/09/six-strategies-ownership-career","title":"Six strategies to take ownership of your career","author":"WORK180","body":"\n\t\t\t\t\t<p>Of three things guaranteed to rock you in life, I got them all at once. On the cusp of my forties, I had a baby, my relationship abruptly ended and I lost my job within the first two weeks of maternity leave. It was a trifecta of terror, and I spent my already sleepless nights turning over various disaster scenarios in my head, bracing for the downward spiral I was convinced would see me and my baby on the street. How was I meant to care for this new little person, deal with the fallout of the breakup (including finding a new address, without evidence of income) and negotiate getting back into the workforce all at once?</p><p>I&#x2019;m not going to lie, the first few months of my baby&#x2019;s life were hell on earth and I still grieve the fact that my first and only experience of being a new mother was defined by fear and uncertainty. Mothers&#x2019; group was a special kind of torture; fronting up to face all those loved-up couples with intact families and settled babies. I had failed spectacularly at life.</p><p>Funnily enough, this total disruption of my world turned out to be possibly one of the best things that has ever happened to me.</p><p>How? Suddenly being the sole breadwinner for my little family forced me to take proper charge of my career. The buck stopped with me now. But if I was going to create a supercharged path to career success and security, I knew I had to stop ignoring the discrimination (both casual and systemic) I had seen and experienced in every role I&#x2019;d had to date. It was time to get focused and tough. I went to war for myself and got out of my own way at the same time.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMDMvMDIvMzAvMzkvNjg5L0FjY2VudHVyZS1QcnVlLUpvbmVzLWNvbnRlbnQxLmpwZyJdXQ\" src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMDMvMDIvMzAvMzkvNjg5L0FjY2VudHVyZS1QcnVlLUpvbmVzLWNvbnRlbnQxLmpwZyJdXQ\" style=\"margin-left: 10px; margin-right: 10px; width: 600px;\"></p><h5 style=\"text-align: center;\"><em>Prue on stage at The Design Conference 2018 in Brisbane</em></h5><p>There was one reprieve. Before the birth of my child I had been working in a start-up that I&#x2019;d been headhunted to join. Fortunately, I&#x2019;d built into my contract that if I was let go for any reason, I would get a three month pay out. That payout afforded me extra time at home with my child and a little flexibility to find a role that would suit my new situation. Of course, I realise that not every woman would have had the confidence to negotiate this, but you know what? I didn&#x2019;t either. It was the idea of an older male colleague I&#x2019;d befriended in a previous agency &#x2013; he&#x2019;d suggested asking for this contract clause when I&#x2019;d expressed concern about going into such a precarious employment position. I thought they&#x2019;d laugh me out of there, but they didn&#x2019;t blink.&#xA0;<strong>Strategy one: find a killer business confidant who has more experience than you. Use their strategies to protect yourself. Do it early in your career and do it every time you have to make a big decision.</strong></p><p>The lifeline I didn&#x2019;t know I&#x2019;d need so much underscored the importance of taking real ownership of your career as a woman. With over 15 years working in the creative industry under my belt at that time, I could see I needed to get a lot more assertive, but it still felt awkward. There&#x2019;s no easy way to be a woman at work, because, as you may have noticed if you&#x2019;re a woman, there&#x2019;s no&#xA0;<em>acceptable</em>&#xA0;way to be a woman at work.</p><p><br></p><h4><strong>Lessons from the past</strong></h4><p>I graduated from design school in 1993 and started my career working in design and visual communication. I gravitated to the conceptual side of things and moved into advertising, working in creative agencies.</p><p>Being a woman working in advertising in the 90s was like repeatedly being invited to the hottest party in town, but only ever being allowed to watch through the windows. It was a culture that rewarded blokeiness, early starts and all-nighters, and how much you could down at the office bar at beer-o-clock. Sexism was rife, although I didn&#x2019;t actively&#xA0;<em>see</em>&#xA0;it then because it was like wallpaper. When one well-known &#x201C;larrikin&#x201D; of the advertising world literally pinched me on the bum at an office party I was shocked but not surprised. Actually, my thoughts were, &#x201C;Hey, at least he noticed me.&#x201D; Sadly, with the advent of #metoo and #dietmadisonavenue we see that not much has really changed. But I have, as a result of these experiences, and I learned to look back at this time and feel the indignance I should have felt then, but didn&#x2019;t.&#xA0;<strong>Strategy two: If you feel a little (or a lot!) of rage after cumulative discriminatory experiences in the workplace, channel it to make changes where you currently work. Don&#x2019;t question the validity of your feelings, that&#x2019;s your internal gender bias telling you women&#x2019;s anger is unacceptable.</strong></p><p>Although I really loved the work it became apparent that women were viewed very differently to men in the industry. I watched men get promoted ahead of women in droves. But I stayed, determined to prove that I too, was worthy of being admitted to the party.</p><p>As women, we often suffer from &#x2018;tiara syndrome&#x2019;. You rarely take holidays, live in the office, sacrifice personal time, do excellent work and think someone will tap you on the shoulder, place a little crown on your head and bestow you with a promotion. But that strategy rarely pays off. You have to&#xA0;<em>ask</em>&#xA0;for what you want. It was true back in the 90s and it&#x2019;s true today, but it&#x2019;s difficult for women to do because we&#x2019;re socialised from birth not to be &#x2018;demanding&#x2019;. Regardless, you have to put that aside and advocate for&#xA0;<em>yourself</em>. I&#x2019;ll never know if I would have been promoted there, because I didn&#x2019;t ask for it. Disgruntled, I left when I got headhunted to go somewhere else, so they lost out too.&#xA0;<strong>Strategy three: Back yourself ferociously. Continually let people know why that tiara belongs on&#xA0;<em>your</em>&#xA0;head.</strong></p><p>Yes, things are getting better and there&#x2019;s more awareness around unconscious bias, but only a few years ago when I was resigning from the role I had prior to joining Accenture, one of the male leaders remarked, &#x201C;There&#x2019;s always been a glass ceiling for you here.&#x201D;</p><p>I was too shocked to respond (&#x201C;Does he even know what that metaphor means?&#x201D;). If I had responded, it probably would have been with words I can&#x2019;t print here. At this point after 25+ years in the industry, and with more experience than many of the leadership team themselves, I never dreamed I&#x2019;d ever hear this sentiment expressed so brazenly.</p><p>One of the main reasons I was compelled to accept Accenture&#x2019;s offer was because I knew they take I&amp;D very seriously. I wanted to go to a place where my talents were encouraged, not overlooked. After all, how can you ever know what you&#x2019;re capable of if you are constantly denied opportunities to demonstrate it?&#xA0;<strong>Strategy four: Like a bad relationship, the wrong workplace robs you of your confidence and sense of self. Know your value, go where it will be appreciated and don&#x2019;t look back. Go where there&#x2019;s plenty of &#x2018;stretch&#x2019; for you, because that&#x2019;s how you grow.</strong></p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMDMvMDIvMzIvMDgvMzgxL0FjY2VudHVyZS1QcnVlLUpvbmVzLWNvbnRlbnQzLmpwZWciXV0\" src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMDMvMDIvMzIvMDgvMzgxL0FjY2VudHVyZS1QcnVlLUpvbmVzLWNvbnRlbnQzLmpwZWciXV0\" style=\"margin-left: 10px; margin-right: 10px; width: 600px;\"></p><h4><strong>Hope in Accenture</strong></h4><p>Nothing makes me happier than seeing young women excelling and being comfortable and confident in their workplace. The needle is definitely moving here.</p><p>However, as Cindy Gallop opined when I interviewed her recently at the Adobe Symposium, getting to gender parity in any organisation won&#x2019;t be much of an achievement if it&#x2019;s men who are still holding all the leadership positions. Accenture has this sentiment in their sights as we try to reach this goal by 2025 and for the most part the talk is starting to line up with the walk.</p><p>But there is still work to do.</p><p>People want to work with and for companies that are actively changing cultures to reflect the makeup of the actual world in terms of gender, race, culture, physical and mental ability. Companies who claim to be all about I&amp;D and demonstrate the opposite create a disconnect from the brand values they claim to represent. This is the fastest and simplest way to lose trust with clients and potential talent alike.&#xA0;<strong>Strategy five: Be insistent and vigilant, because diversity makes things better for everyone, including you. Diversity is not just good for the bottom line, it&#x2019;s insulation from negative judgements about your company culture.</strong></p><p><br></p><h4><strong>Our broader I&amp;D program</strong></h4><p>At Accenture we host monthly I&amp;D breakfasts which are about raising awareness of the fact that there are still issues with acceptance across a range of groups &#x2013; gender, enablement, veterans, indigenous/cross cultural and pride &#x2013; even though many people think &#x201C;these things don&#x2019;t happen anymore&#x201D;. They do. Many people view the world through the lens of their own experience. Our breakfasts strive to highlight people&#x2019;s lived experience, and bring it out into the open to be acknowledged.</p><p><br></p><h4><strong>It&#x2019;s not me, it&#x2019;s you</strong></h4><p>If we view the progress of women through a &#x2018;deficit model&#x2019; where women have to be &#x2018;fixed&#x2019;, changed or coached in order to become versions of men so that they can compete for leadership positions &#x2013; that&#x2019;s not progress for anyone. It&#x2019;s not up to women to &#x2018;improve&#x2019;, it&#x2019;s the&#xA0;<em>responsibility of the business</em>&#xA0;to change to ensure women aren&#x2019;t penalised for being themselves.</p><p>This is especially true for &#x2018;working mothers&#x2019; (which is a I term I loathe. No one refers to working fathers).</p><p>My child is now 11, and over the years I&#x2019;ve battled many times with the little voice that repeats, &#x201C;you&#x2019;re failing him&#x201D; when my workload has been high. I now know that voice is simply my own internal gender bias whispering in my ear. I&#x2019;m confident what I&#x2019;m&#xA0;<em>actually</em>&#xA0;doing is modelling reality: Women work and women have careers. It&#x2019;s vital for boys to see their mothers excelling and achieving so that it&#x2019;s simply the norm as they grow up. Obviously it&#x2019;s crucial for girls to see this too, so their self-belief is strong from the outset. This way, coupled with men stepping up to do their share in the domestic sphere, sexist attitudes can be eradicated before they take root.&#xA0;<br><strong>Strategy six: Let go of the pointless guilt. Insist on a fair division of labour at home. If you&#x2019;re doing it alone, nurture yourself, you&#x2019;re keeping this show on the road.</strong></p><p>Of course there are times when you have to make sacrifices, but there are other times when companies like Accenture afford you the flexibility to be able to be there for the important moments with family while also maintaining a successful career. And your sanity.</p><p>I hope by the time my son hits the workforce &#x2013; this will be the norm everywhere. This is something we shouldn&#x2019;t have to ask for, it&#x2019;s something we should insist on.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMDMvMDIvMzMvMTQvNDQ2L0FjY2VudHVyZS1DaW5keS1HYWxsb3AtMkFNLmpwZyJdXQ\" src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDkvMDMvMDIvMzMvMTQvNDQ2L0FjY2VudHVyZS1DaW5keS1HYWxsb3AtMkFNLmpwZyJdXQ\"></p><h5 style=\"text-align: center;\"><em>Prue interviewing Cindy Gallop at The Adobe Symposium 2018. Photo credit Dave Thompson.</em></h5><hr><p>This post was originally published by <a data-cke-saved-href=\"https://www.accenture.com/au-en/Blogs/blogs-taking-charge-of-your-career?src=SOMS&amp;c=car_careersblog_10344546&amp;n=smc_0818\" href=\"https://www.accenture.com/au-en/Blogs/blogs-taking-charge-of-your-career?src=SOMS&amp;c=car_careersblog_10344546&amp;n=smc_0818\">Accenture.&#xA0;</a></p><p><br></p><h4><strong><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b5df36ec-79dc-4407-83d7-2e273526d15c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b5df36ec-79dc-4407-83d7-2e273526d15c.png\" style=\"float: right; margin: 10px; width: 100px;\">About&#xA0;Accenture</strong></h4><p>Accenture is an Endorsed Employer for Women. Accenture is<span id=\"ember6195\"> ready to discuss how your role may be done flexibly at the interview stage and support programs for girls learning tech. These are just some of the ways they foster women&#x2019;s careers. Read more about them on their<a data-cke-saved-href=\"https://www.work180.com.au/clients/accenture\" href=\"https://www.work180.com.au/clients/accenture\">&#xA0;Best Employer page.</a></span></p><p>Browse jobs with Accenture&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=accenture\" href=\"https://www.work180.com.au/job-search?client=accenture\">here.&#xA0;</a></p><p><br></p><h4><br></h4><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["confidence","accenture","Career Development","job seeking tips"],"upload_date":"2018/09","associated_companies":["work180"]}