{"url":"https://www.work180.com.au/blog/2018/08/6-women-who-reached-the-top-but-no-one-told-you","title":"Six women who reached the top but no one told you","author":"WORK180","body":"\n\t\t\t\t\t<p>Companies that intentionally pursue the appointment of women to their top leadership ranks are better positioned to outperform competitors. Firms with the highest gender diversity show stronger stock price growth (70%) and having at least one woman on the board <a data-cke-saved-href=\"http://www.cpahq.org/cpahq/cpadocs/Genderdiffe.pdf\" href=\"http://www.cpahq.org/cpahq/cpadocs/Genderdiffe.pdf\">decreases bankruptcy by a full 20%</a>.</p><p>Today we are celebrating women who broke down barriers, challenged stereotypes and have been promoted to executive levels in 2018.</p><p><strong>Stacey Cunningham was named the first female president of the New York Stock Exchange.</strong></p><p>This is the first time the NYSE has had a female leader in its 226-year history. Stacey&#x2019;s appointment raises hopes that the glass ceiling may have finally cracked on Wall Street.&quot;It&apos;s really important to recognise that any time a woman pushes the boundaries and redefines the boundaries, she&#x2019;s redefining them for everyone else that follows her.&#x201D;</p><p style=\"text-align: center;\">&#x200B;&#x200B;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/87a30bce-dbab-4a41-b671-aebd57818f28.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/87a30bce-dbab-4a41-b671-aebd57818f28.jpeg\"></p><p><strong>Suzanne Scott was named CEO of Fox News.</strong></p><p>Suzanne is the first female chief executive of the Fox News operations. Suzanne doesn&apos;t just make history for being first women CEO at Fox - but the first in all of cable news. Century Fox Co-Chairman Lachlan Murdoch commented: &#xA0;&quot;Suzanne has been instrumental in the success of FOX News and she has now made history as its first female CEO. Her vision and innovation have helped create some of the most popular and lucrative primetime programs on cable.&quot;</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/130ae1be-4767-4540-903f-f7c66d546d14.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/130ae1be-4767-4540-903f-f7c66d546d14.jpeg\"></p><p><strong>Dhivya Suryadevara was named CFO of General Motors.</strong></p><p>Divya becomes the first female CFO in the history of GM and will replace current CFO Chuck Stevens, who has been working at the auto company longer than Dhivya has been alive. Anna Beninger, senior director of research at Catalyst says: &quot;Any time a woman is added to the C-Suite it&apos;s something that should be celebrated. Given that the rate of change for women into the C-suite and into the CEO level has been so slow, any time we see one, it is certainly progress.&quot;</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/75be3cda-9778-447c-ae1c-f87d7e4c929d.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/75be3cda-9778-447c-ae1c-f87d7e4c929d.jpeg\"></p><p><strong>Debra Perelman was appointed CEO of Revlon.</strong></p><p>This makes Deborah the first woman in the position in the company&apos;s 86 years of existence. With women holding only 5% of the CEO jobs in the S&amp;P 500, this is an important achievement for diversity in corporate management. We need more women at the helms of our large corporations, especially when their products are aimed at women. &#x201C;Beauty has emerged as one of today&#x2019;s most dynamic and fastest-growing industries and I look forward to working with Revlon&#x2019;s world-class team to amplify our strategy and accelerate growth&#x201D;.</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/76d8573e-fb9c-4504-9aa2-91921fe5ab25.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/76d8573e-fb9c-4504-9aa2-91921fe5ab25.jpeg\"></p><p><strong>Priscillah Mabelane is BP&apos;s first black female CEO</strong></p><p>Priscillah&#x2019;s appointment as CEO of BP Southern Africa (BPSA) marks a significant milestone in the organisation and industry transformation journey of the company. BPSA chairperson Thandi Orleyn said: &#x201C;Priscillah&#x2019;s appointment reinforces BPSA&#x2019;s pioneering role and strength of commitment to cultivating a diverse and inclusive workforce that will breed creativity and ensure we meet, even exceed customer expectations.&#x201D;</p><p style=\"text-align: center;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4a35fe8c-43f9-48d5-89f9-99a884b2cb45.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4a35fe8c-43f9-48d5-89f9-99a884b2cb45.jpeg\"></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;<span style=\"font-family: &quot;Trebuchet MS&quot;, sans-serif; font-size: 10.5pt; -webkit-text-stroke: rgb(0, 0, 0);\">&#xA0;</span></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2018/08","associated_companies":["work180"]}