{"url":"https://www.work180.com.au/blog/2016/07/size-doesnt-matter","title":"Size Doesn’t Matter","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;As a petite female in a male dominated industry, I&#x2019;m no stranger to comments regarding the way I look, from male colleagues.</p>\n\n<p>It&#x2019;s usually about how small or skinny I am or how young I look. Or how much I can eat. Go figure! I usually take those comments as compliments but if I really think about it, they are not compliments. They are merely observations.</p>\n\n<p>Do I get offended? Depending on the context and situation. If I was told that I am tiny and short and I should sit at the front for group photos, of course I am not going to be offended. On the other hand, if I was told that I am tiny and short and therefore, I shouldn&#x2019;t be an emcee, well, the person who said it is going to regret it. And sometimes, I can&#x2019;t help but wonder why it&#x2019;s ok to tell a skinny person skinny but not a fat person fat. Or why it is okay to say someone looks young for their age but not the other way around?</p>\n\n<p>A few weeks ago, I found out that my daughter&#x2019;s friends have been pointing out that she&#x2019;s not tall like them. They also said she isn&#x2019;t four yet and they are. Sure they are her friends and it&#x2019;s the truth but still, my heart aches for her. When she goes to primary school, will she be teased by her peers because she is not as tall or as old as them? Will it make her cry? Will she hate going to school then? I suppose it&#x2019;s natural for a mum to overthink and worry.</p>\n\n<p>And then I realised that it&#x2019;s not any different to me being told I&#x2019;m tiny or skinny. So how do I respond in those situations? I usually respond with a witty comment, saying thanks or smiling politely. Unless I am really offended and feel that I am being discriminated against. Then I will be very quiet with a straight face but will be thinking of ways to let the person know that what he said is not ok. But these types of responses are not appropriate for 4 years olds.</p>\n\n<p>So I thought about how to teach my daughter to respond appropriately to pre-schoolers. When I first heard of my daughter&#x2019;s friends teasing her for being slightly younger than them, I was angry. I thought, &#x2018;so what, she is not four yet, it&#x2019;s none of your business&#x2019;. It is amazing how strong our protective instinct for our children can be.</p>\n\n<p>Having thought long and hard for a few days, I came to the conclusion that I want my daughter to be confident about herself no matter what other people say. No one should bring her down, when she is happy with herself. So rather than teaching my daughter what to say to her friends the next time they tease her, I told her that I think she is amazing and a very clever almost 4 year old. And that&#x2019;s all that matters.</p>\n\n<p>How about you, I hear you ask. Well, as for me, I believe in leading by example so I will be working on my own confidence and self-worth. No more wondering or getting upset when someone makes a comment on my appearance.</p>\n\n<p>May we all be confident and happy with ourselves.</p>\n\n<p>&#xA0;</p>\n\n<p>This article was originally posted on&#xA0;<a href=\"https://www.steelheels.com.au/\" target=\"_blank\">Steel Heels</a>. &#xA0;It can be viewed&#xA0;<a href=\"https://www.steelheels.com.au/ban-bossy-2/\" target=\"_blank\">here</a></p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2016/07","associated_company":"work180"}