{"url":"https://www.work180.com.au/blog/2017/07/smart-strategies-to-improve-gender-equality-in-the-workplace-wgea-case-studies","title":"Smart Strategies to Improve Gender Equality in the Workplace- WGEA Case Studies","author":"WORK180","body":"\n\t\t\t\t\t<p>DCC Jobs partner&#xA0;<a href=\"https://www.diversecitycareers.com/page/partner-network/government-agencies/wgea/\">Workplace Gender Equality Agency (WGEA)</a>&#xA0;have today released&#xA0;<a href=\"https://www.wgea.gov.au/media-releases/eight-ways-tackle-gender-inequality-work\">eight case studies</a>&#xA0;of Australian organisations, demonstrating how innovative employers are using smart strategies to improve gender equality in their workplace. Over the last two years, DCC Jobs have seen a tremendous change in workplace policies and approach to gender equality. One of many examples from our&#xA0;<a href=\"https://www.diversecitycareers.com/bestemployers\">Endorsed Employers for Women</a>&#xA0;is Bank of Queensland&#xA0;<a href=\"https://blog.boq.com.au/boq-dcc-getting-more-women-in-finance/\">increasing their women in leadership from 27% to 32%</a>&#xA0;in only five months. DCC Jobs have also seen employers double their paid parental leave offering and recently saw Colin Biggers and Paisley become the first&#xA0;<a href=\"https://www.diversecitycareers.com/cbp\">Flex Able certified law firm</a>&#xA0;in Australia.</p>\n\n<p>Whilst DCC Jobs Endorsed Employers for Women continue to lead the way, there is still much left to do. WGEA Director Libby Lyons said employers are looking at ways to create lasting change and hopes their case studies can offer inspiration.</p>\n\n<blockquote>\n<p><em>&#x201C;Sometimes it is hard for employers to know where to start. We know that employers are very interested in effective strategies to address key challenges like pay equity, workforce segregation and women&#x2019;s leadership representation. We hope these inspiring stories will generate ideas and drive change.&#x201D; </em>said Lyons.</p>\n</blockquote>\n\n<p>Case studies include examples from NAB, who are&#xA0;<a href=\"https://www.diversecitycareers.com/page/companies-we-endorse/nab\">addressing a wide adoption of flexible working</a>&#xA0;practices through their self-service, flexible working intranet site where employees can manage their formal or informal flexible working arrangements directly with their manager. Options range from part-time and remote working, to job sharing and transition to retirement.</p>\n\n<p>Another DCC Jobs,&#xA0;Mercy Health&#xA0;is working to recruit more young males as carers and nurses to help redress the unbalanced gender mix in the industry and prepare for the increasing demand for healthcare workers as the population ages.</p>\n\n<p>DCC Jobs believe one of the key drivers is transparency to help women choose employers who are truly committed to supporting their careers.</p>\n\n<blockquote>\n<p><em>&#x201C;Around 10% of employers who approach us to advertise jobs are rejected. Most go on to improve internal policies and re-apply to advertise. DCC list the amount of paid parental leave, commitment to equal pay, flexible working arrangements, programs to develop leadership skills and more. This exclusive and often confidential material is public on our website and functions as an important trigger and source of inspiration for other employers to improve internally,&quot;&#xA0;</em>said Gemma Lloyd, DCC Jobs&#xA0;cofounder&#xA0;</p>\n</blockquote>\n\n<p>You can view employer information which is not publicly available anywhere else on&#xA0;<a href=\"https://www.diversecitycareers.com/bestemployers\">this page</a>&#xA0;by selecting a company logo and scrolling to the bottom of their page.</p>\n\n<p style=\"text-align:center\"><a href=\"https://www.diversecitycareers.com/news/smart-strategies-to-improve-gender-equality-in-the-workplace-wgea-case-studies/23730/www.diversecitycareers.com/bestemployers\"><img alt=\"\" src=\"https://www.diversecitycareers.com/media/diversecitycareers/Articles/DCC%20Endorsed%20Employer%20for%20Women%20PNG.png\" style=\"border-style:initial; border-width:0px; height:87px; margin-bottom:10px; margin-top:10px; width:365px\"></a></p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/job-search\"><span style=\"color:rgb(66, 139, 202)\">jobs board&#xA0;</span></a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/clients\"><span style=\"color:rgb(66, 139, 202)\">essential tool</span></a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News","gender equality"],"upload_date":"2017/07","associated_companies":["work180"]}