{"url":"https://www.work180.com.au/blog/2017/08/stop-letting-knowledge-is-power-control-you","title":"Stop Letting \"Knowledge Is Power\" Control You","author":"WORK180","body":"\n\t\t\t\t\t<p>All your life you have had teachers, coaches, parents, and friends always telling you that &#x201C;Knowledge is power&#x201D;. In fact, that particular statement has been so instilled in you that you can&#x2019;t escape the understanding of it, so much so that it now causes you fear every time someone asks you something you don&#x2019;t know.</p>\n\n<p>Your fear further is driven by any changes that are due to take place in your life, the fear of the unknown and the worry that someone out there might find out that you don&#x2019;t know something you think they expect you to. If you feel all these things then it is time to change and feel empowered.</p>\n\n<blockquote>\n<p>We need to embrace those things that make us weaker and find ways to turn them into positive thoughts, that will help drive a change in our outlook on the situation.</p>\n</blockquote>\n\n<p>Hopefully, once you are finished reading this article you will have some hints and tips on how to do just that.</p>\n\n<h4><strong>Why do You Need to Know Everything?</strong></h4>\n\n<p>It all stems back to reprogramming years of experiences that you have had since being a child. It may have been that one teacher that found you being disruptive in class for asking so many questions, it may have been your tired parents just trying to have a rest, bite to eat, or even a manager who was knowledgeable but unequipped to manage your career progression. You have just got to step back and reflect on your experiences and ask yourself why exactly it is that you feel like you need to know everything before you go ahead and do something!</p>\n\n<p>I mentor younger ladies entering the IT workforce, whose only experience is University life when it comes to developing technology. I myself can reflect back to the time when I finally got my Masters in Communication and Electronic engineering and had to make the decision about where best to find work. My female peers all felt that it would be best if they went into a position that used their soft skills rather than their technical skills. They felt intimidated to try and prove themselves to interviewers who were male and experienced. I have to admit feeling the same way, but just being bolder at taking chances<strong>.</strong></p>\n\n<blockquote>\n<p>I have at times got very lost in conversations about things I did not understand; I kept encouraging myself using my inner voice that all I needed was a bit more time to get acquainted and I remember my husband always saying, &#x201C; It doesn&#x2019;t matter if you don&#x2019;t understand everything, as long as you are willing to learn.</p>\n</blockquote>\n\n<p>You always feel overwhelmed when you are in a new environment because you always want to know everything but this takes time. Having that one person be there to support me mentally has helped me overcome a lot of mental blocks and perceptions I have had about myself because I tend to set unrealistic goals about what is expected of me and I am my worst critic.</p>\n\n<h4><strong>Build Friendships at Work</strong></h4>\n\n<p>By making friendships with key members of staff and sharing personal interests with them about things outside of work, it made it easier for me to approach those individuals about technical matters I was unsure of. The exchange of information becomes easier once you get over the first obstacle of not knowing the person first and not knowing how they might react or how you might be judged.</p>\n\n<blockquote>\n<p>You never know when that same person may come to you seeking advice about something you are familiar with.</p>\n</blockquote>\n\n<h4><strong>Asking Why Because Understanding is not Inherited</strong></h4>\n\n<p>As technology is fast paced, what is relevant today may not be relevant tomorrow and although most people are used to using certain tools, methodologies or approaches, that doesn&#x2019;t necessarily make them current and appropriate for the business anymore<strong>. </strong></p>\n\n<blockquote>\n<p>The only way to grow is to acknowledge that you might not know what the current way of doing something is, and to actively endeavor to push the boundaries to what is possible and initiate valuable conversations that might lead to significant improvements to the business delivery.</p>\n</blockquote>\n\n<p>Value is added in conversation through questioning, because knowledge may be inherited, but understanding is not. You might ask a colleague about a particular system architecture or process and if you hear something that does not make sense, you can ask further questions which will prompt your colleague to think hard about why things are the way they are. You may find that a lot of change is identified through WHY questioning. You can then work on putting action plans in place to improve the process and show your worth instantly.</p>\n\n<h4><strong>Finding Yourself at Work</strong></h4>\n\n<p>At the end of the day, there are many ways that people can add value to an organisation. Start off by being comfortable with yourself, finding familiarity in others and questioning things that you are not certain of.</p>\n\n<p>Your attitude and approach to work and people will form the basis of how they perceive you. Your technical abilities can never be demonstrated in a day or with simple questions. If you have the willingness to learn and the curiosity/hunger to find the answers, I would say you are more than half way there.</p>\n\n<h5><strong>About Lilia Christofi</strong></h5>\n\n<p><a href=\"https://www.linkedin.com/in/lilia-christofi-3690886/\" target=\"_blank\">Lilia Christofi</a> has multinational experience in IT project delivery and operation for public and private sector firms. Over 10 years IT software project delivery and head of operations, leading and managing large teams as Head of IT.&#xA0;&#xA0;She mentors graduates or soon to be graduate females who are studying IT or Engineering. She is passionate about&#xA0;promoting her mentees to build the confidence to ask more questions and not being afraid to say they lack experience in certain areas. Communicating the importance of social interactions and how they can help overcome the lack of knowledge and understanding is her primary interest.</p>\n\n<h5><strong>About DCC Jobs</strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/08","associated_companies":["work180"]}