{"url":"https://www.work180.com.au/blog/2018/11/striking-the-right-balance","title":"Striking the right balance ","author":"","body":"\n\t\t\t\t\t<div><p>In 2016, BHP set a bold aspirational goal to achieve gender balance by 2025.</p><p>In the two years since we announced this aspirational goal, the action, debate and innovation it originally sparked has intensified across our company and within the industry. These forces are essential to bring about genuine change.</p><p>By the end of FY2018, 915 more women were employed at BHP compared to the same time last year. That is 915 individuals who will be given every opportunity to steer our industry into the future. The number of women in the business globally has increased by over 2,000, or 40 per cent, since 2016.</p><p>While this is positive progress, we know we have a lot more work ahead of us. This year we increased the female representation by 1.9 percentage points, and in the two years since we announced our goal, overall female representation has increased from 17.6 per cent to 22.4 per cent. This is a significant achievement when you consider that not long ago, few could imagine a future where the prevalence of women in the mining industry was normal, even routine.<br>&#xA0;<br>Historically, the industry&#x2019;s track record hasn&#x2019;t been great. Until recently the problem was, effectively, overlooked.</p><p>At BHP, the tide has turned as we tackle the issue on multiple fronts.</p><blockquote><p><em>The number of women in the business globally has increased by over 2,000, or 40 per cent, since 2016.&#xA0;</em><br></p></blockquote></div><div><h4><strong>Attracting female talent</strong></h4><p>First, we work with a sense of urgency to attract more women into our business and into the industry. Our FY2018 external recruitment ratio of 40 per cent women and 60 per cent men is the strongest contributor to improved female representation outcomes. This is a significant increase compared to FY2015 (at 10.4 per cent women).</p><p>We must increase the pipeline of female graduates in STEM fields (science, technology, engineering and maths). And we are working harder to recruit women from other sectors.</p><h4><strong>Focus on flexible work</strong></h4><p>Second, a sharper focus on flexible work over the past two years has already paid off.</p><p>Our leaders support efforts to make flexible work the norm rather than an exception where they can balance individual and business needs.</p><p>46% of our people now work flexibly, both formally and informally. And more are on course to do so over the next 12 months. Those who work flexibly report greater levels of wellness compared to our company average.</p><p>A classic example is Craig, a fly-in, fly-out maintenance team member at our Iron Ore business in Western Australia. As his family grew and their needs changed, he transitioned to a job share roster with a colleague. He achieved the ideal balance with his two-weeks on, four-weeks off work schedule, which also freed up his wife Amanda to join our Supply team.</p><h4><strong>Potential bias and the gender pay gap</strong></h4><p>Third, we have made a concerted push to mitigate potential gender bias. We have made good progress on this front, but we still have more to do.</p><p>We know bias can manifest in many ways, like in gender pay disparity. And we have taken steps to rectify this discrepancy.</p><p>In our FY2018 salary review process, we made more than 1,000 pay adjustments worth US$4 million where we identified pay discrepancies between men and women performing like-for-like roles. This compares to 100 adjustments to the tune of US$400,000 in the previous year. It&#x2019;s the result of more sophisticated data analysis and a commitment from our leaders to act.</p><p>Other initiatives underway look at the systemic issues behind gender pay gaps, like the way we determine remuneration when we hire. Ultimately, where the role, individual capability, attributes, relevant experiences and performance of two people are similar, no pay gap should exist. We are determined to achieve this.</p><h4><strong>Retention of talent</strong></h4><p>Turnover is also firmly on our radar so we retain more female employees than we do today. This remains our biggest challenge. Our focus is to further embed flexible work, and persist with our efforts to strengthen our culture.</p><p>Certainly, the current environment the #metoo movement has created is pervasive and impacts every industry, and much more needs to change to achieve genuine inclusion. For BHP, we encourage a more open discussion internally on what respectful behaviour is in this day and age, and how to listen and to speak up if behaviours contradict our company values.</p><h4><strong>Suppliers</strong></h4><p>Finally, our network of more than 9,000 different equipment and labour suppliers presents an ideal opportunity to advocate for inclusion and diversity within the broader industry. This includes our work with partners to make equipment more accessible for all levels of physical capability, which benefits everyone &#x2013; both men and women.</p><p>Any improvement we make in this area has tangible benefits for our entire business - most of all for our people. I see this in action everywhere I go across our locations. From more women in our operational teams to the positive impact of flexible work for both men and women, the change is evident.</p><p>This is a challenge we will not back away from. Our ambition to achieve our aspirational goal remains resolute.</p><hr><h4><strong>About BHP&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/15d53536-61f7-4647-874b-866c09fddc32.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/15d53536-61f7-4647-874b-866c09fddc32.png\" style=\"float:right;width:200px;height:110px;\"></strong></h4><p>BHP is an Endorsed Employer for Women and&#xA0;Flex Able&#xA0;Certified.&#xA0;CEO Andrew Mackenzie says working really hard doesn&apos;t mean you have to work many hours. &#xA0;BHP has also set an aspirational goal to achieve gender balance globally by 2025. It&#x2019;s top 10 most diverse sites already perform 15% better than other mine sites, have better safety records and are more likely to meet production forecasts and maintenance schedules. Learn more about working with BHP on their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/bhp\" href=\"https://www.work180.com.au/clients/bhp\">Employer page.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=bhp\" href=\"https://www.work180.com.au/job-search?client=bhp\">Browse jobs and apply to join BHP here</a>.&#xA0;</p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p></div>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2018/11"}