{"url":"https://www.work180.com.au/blog/2018/04/stuck-in-a-career-rut-heres-4-ways-to-break-out-of-it","title":"Stuck In A Career Rut? Here’s 4 Ways To Break Out Of It.","author":"WORK180","body":"\n\t\t\t\t\t<p>Ever had one of those pivotal moments where you are at work and you feel like your values aren&#x2019;t aligned? Or you feel a bit sick going to work every day? If this is you, then something is wrong. Trust you gut instinct and make some changes. It&#x2019;s probably time to re-assess where you are at.</p>\n\n<p>So don&#x2019;t panic. We have lots of practical tips to get you up and running&#x2026;.and to help you get an energising action plan in place.</p>\n\n<h3><strong>1.&#xA0;Create a personal purpose statement</strong></h3>\n\n<p>The things that drive you are powerful motivators IF you tap in to them. Simon Sinek has built a world-wide following by challenging us to &#x201C;Start with why&#x201D; &#x2013; why do we get up in the morning and how can we harness our why to build greater inspiration in ourselves and others.</p>\n\n<p>To create a personal purpose statement, ask yourself:</p>\n\n<ul>\n\t<li>What is it I do, and why?</li>\n\t<li>Why is that important to me? And why is that important? (I&#x2019;m not going crazy here but I am repeating the question to prompt you to take your self-reflection deeper and deeper)</li>\n\t<li>What do I enjoy most? Why is that?</li>\n\t<li>When do I feel most energised? And (yep you guessed it) why?</li>\n</ul>\n\n<p>When you&#x2019;re finished consider the themes and write down 3 to 5 words that are the first articulation of your personal purpose. What inspirational and aspirational sentence answers the question &#x201C;Why do I get up in the morning?&#x201D;</p>\n\n<p>Once you have a rough version of those 3 to 5 words this statement can be used to help shape your next steps. Some examples of personal purpose statements I&#x2019;ve heard are &#x201C;To help others grow and learn&#x201D;; &#x201C;To provide a stable foundation for others&#x201D;; &#x201C;To increase education across the world&#x201D; or &#x201C;To improve the health of children&#x201D;. To really tap in to your motivation they should have a higher purpose or societal impact than just the outcome for you.</p>\n\n<h3><strong>2. Create a fuzzy career vision</strong></h3>\n\n<p>Lots of people I work with don&#x2019;t have a career plan, or do, but it&#x2019;s a piece of paper that they &#x201C;had to&#x201D; do, not something that they own and live.</p>\n\n<p>For real career success, and to unleash your potential, you need to have at least a fuzzy vision of where you are going, some ideas of how to get there AND be constantly testing, refining and evolving this. It can be a meandering country road you&#x2019;re travelling, rather than a busy speedway, but without a map and a destination then you&#x2019;re just leaving your career to chance.</p>\n\n<p>To create a fuzzy career vision, ask yourself:</p>\n\n<ul>\n\t<li>If I won 1 million dollars (enough money to give space and time, but not enough to retire) what would I do for work?</li>\n\t<li>If I could re-start my career (knowing what I know now), what would I choose to do?</li>\n\t<li>On retiring, what do I want to say my legacy has been?</li>\n\t<li>If all barriers were removed and there were no limits. What would I love do?</li>\n\t<li>If my confidence was so high that I could achieve anything, what would I do? And why?</li>\n</ul>\n\n<p>Now, with those answers in mind, consider the following question:</p>\n\n<p>In 10 years time, what do I want to be doing? Really draw yourself a vision of this answer by being detailed &#x2013; where am I, what is the environment, what work am I doing, what am I wearing (seriously!), what level am I operating at?</p>\n\n<h3><strong>3. Review your personal brand and undertake a rebranding exercise</strong></h3>\n\n<p>What are you known for and are these the things you WANT to be known for in the future. Will they drive your career forwards?</p>\n\n<p>We all have a personal brand and in many ways this is working both for, and against, us. To take your next steps it will be helpful for you to reflect on your personal brand, and change some things. For some of us these changes can be small tweaks, and for others a full &#x201C;re-brand&#x201D; might be needed, and that is totally ok.</p>\n\n<p>To help you consider your personal brand, ask yourself the following questions and write down your answers:</p>\n\n<ul>\n\t<li>What four words would others use to describe me?</li>\n\t<li>What technical skill am I known for?</li>\n\t<li>What behaviours am I known for?</li>\n\t<li>What are others&#x2019; first impression of me in the first 30 seconds? What do they think of my personal presentation, grooming and impact?</li>\n</ul>\n\n<p>Then consider your future self:</p>\n\n<ul>\n\t<li>What four words would I LIKE others to use to describe me?</li>\n\t<li>What technical skill DO I WANT TO BE known for?</li>\n\t<li>What behaviours DO I WANT TO BE known for?</li>\n\t<li>What DO I WANT others first impression of me to be? What do I WANT them to think of my personal presentation, grooming and impact?</li>\n</ul>\n\n<p>Now compare your two lists. How far apart are they? And what actions do you need to put in place to take steps towards your future-self personal brand?</p>\n\n<p>For this exercise to work at this best, actually ask the people around you the first list of questions, rather than just filling out your perception of their answers.</p>\n\n<h4><strong>Download your free personal brand guide workbook</strong></h4>\n\n<p>Join WORK80&apos;s FB group and<a href=\"https://www.facebook.com/groups/dccwomensnetwork/\"> download free guides </a>including how to develop your personal brand via the group. You can find all resources <a href=\"https://www.facebook.com/groups/dccwomensnetwork/files/\">in the files section.</a><br>\n&#xA0;</p>\n\n<h3><strong>4. Re-energise your network</strong>&#xA0;</h3>\n\n<p>To bring your next steps to life you need to maximise your relationships externally to your employer (as well as internally). So many of us let our external network slip when we get comfortable in a company or a job, but this is a source of competitive advantage to you if you invest in it.</p>\n\n<p>The people who have regular contact with a broader base of people outside of their employer are more valuable to that employer because they bring insight and intelligence in that many others won&#x2019;t. They are also more marketable because they know more people and are able to use those relationships for future work opportunities.</p>\n\n<p>To make a start here, ask yourself:</p>\n\n<ul>\n\t<li>Who have I enjoyed working with in the past that I&#x2019;ve lost contact with?</li>\n\t<li>Who have a met and really meant to catch up with but just haven&#x2019;t made the effort?</li>\n\t<li>Who is a favourite former boss, senior stakeholder and where are they now?</li>\n\t<li>Who has great energy, great ideas or is always doing something interesting I could learn from?</li>\n</ul>\n\n<p>Also if you&#x2019;re not finding the right support inside your company to take your next step then it might be time to consider talking to recruiters to test the market, your skill and help you finesse your fuzzy career vision. So ask yourself, who is a good recruiter I&#x2019;ve dealt with in my space? Or who would my trusted friends recommend?</p>\n\n<p>Pick out a few people you&#x2019;d like to connect/reconnect with and book some catch-ups in the following weeks. Don&#x2019;t wait too long and DO NOT give in to temptation to cancel the meeting just before it! Everyone gets busy and there is an option to back out at the 11th hour, but investing time into this activity will be worth it. I promise you, you will surprise yourself at how much energy, enthusiasm and ideas you get from these meetings to build in to your purpose and fuzzy career vision.</p>\n\n<hr>\n<h4><strong>About the author</strong></h4>\n\n<p>Shannon Lyndon-Lugg is&#xA0;is a mama to two lovely children and&#xA0;the founder of&#xA0;<a href=\"http://www.lyndonlugg.com/\" rel=\"noopener\" target=\"_blank\">Lyndon Lugg Consulting</a>, With expertise in human resources, leadership development, diversity and performance, Shannon works with companies to improve leadership, inclusion and diversity, culture and performance.&#xA0;</p>\n\n<hr>\n<h4><strong>About WORK180</strong>&#xA0;</h4>\n\n<p>WORK180 is&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">jobs board&#xA0;</a><span style=\"font-size: 1.6rem; color: rgb(51, 51, 51);\">with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;</span><a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">essential tool</a><span style=\"font-size: 1.6rem; color: rgb(51, 51, 51);\">&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;</span><a href=\"https://www.dccjobs.com/users/login\" style=\"background-color: rgb(255, 255, 255); font-size: 1.6rem;\">one click</a><span style=\"font-size: 1.6rem; color: rgb(51, 51, 51);\">&#xA0;now.&#xA0;</span></p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/04","associated_companies":["work180"]}