{"url":"https://www.work180.com.au/blog/2016/07/stuck-in-a-work-rut-back-yourself-and-get-out-of-it","title":"Stuck in a Work Rut? Back Yourself and Get Out of It!","author":"WORK180","body":"\n\t\t\t\t\t<p>Originally posted on&#xA0;<a href=\"https://leadersinheels.com/\" target=\"_blank\">Leaders in Heels</a>, this article can be viewed&#xA0;<a href=\"https://leadersinheels.com/career/stuck-work-rut-back-get/\" target=\"_blank\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Most of us have been there at some point in our working lives. Really excited about a new job or career opportunity only to find, after learning the ropes and building the skills required to traverse them blindfolded, that we&#x2019;ve fallen into a rut.</p>\n\n<p>What once seemed exciting no longer is.</p>\n\n<p>Like that overused &#x2018;boiling frog&#x2019; analogy, a quiet sense of indifference, dissatisfaction or desperation can creep upon us in increments. It&#x2019;s often not that we are completely miserable; we&#x2019;re just not pumped. Sure no-one goes to work every day about to set the world on fire, but if you&#x2019;d prefer to stay home in your PJs most days then it&#x2019;s probably a sign that something needs to change and you need to change it!</p>\n\n<p>&#xA0;</p>\n\n<p>Your job.</p>\n\n<p>Your career.</p>\n\n<p>Or perhaps just your outlook.</p>\n\n<p>&#xA0;</p>\n\n<p>Too often we underestimate the price we pay when we stay on in a role that we&#x2019;ve outgrown or with an organisation or industry that no longer aligns with our passion and vision. &#xA0;We tell ourselves that we&#x2019;re lucky to be where we are. That we&#x2019;ve worked hard for it. That the money is good. That it&#x2019;s secure. That nobody loves their job all the time.</p>\n\n<p>All perfectly &#x2018;fine&#x2019; reasons, assuming you&#x2019;re content to settle for &#x2018;fine.&#x2019;</p>\n\n<p>But if you&#x2019;ve been feeding yourself those reasons for quite some time then perhaps you haven&#x2019;t considered their flip side. Rather than focusing on the risks you&#x2019;d be taking on if you left the familiarity of where you are, consider the risks you are taking on if you stay.</p>\n\n<p>As Kathy Calvin, President of the United Nations Foundation shared with me during our recent interview,&#xA0;&#x201C;When people aren&#x2019;t happy in their jobs it&#x2019;s not just obvious to them, it&#x2019;s obvious to everyone around them.&#x201D;</p>\n\n<p>Staying in a job that isn&#x2019;t bringing out your best not only does you a disservice, it does all those around you a disservice while simultaneously depriving someone else the valuable opportunity to step into the role you&#x2019;re languishing in.</p>\n\n<p>Getting out of a &#x2018;job funk&#x2019; doesn&#x2019;t necessarily mean leaving the place you are in, but leaving the spot you&#x2019;re in and moving to a different place on the &#x2018;career lattice.&#x2019; &#xA0;It could also mean deciding to be more proactive in stretching yourself and doing things that set you up for future roles &#x2013; joining a board, expanding your network or learning a new skillset. Then again, sometimes you just need to bite the bullet and take a brave leap of faith in an entirely new direction.</p>\n\n<p>In my late 20s, and a little (okay, a lot) disillusioned with my marketing career, I decided to head back to university to study psychology. I wasn&#x2019;t sure where it would lead. At the time I knew nothing of the world of coaching (beyond the sporting arena) and had no clear idea where this new path would take me. I just knew I wasn&#x2019;t okay staying on the old one, despite the security and salary it provided.</p>\n\n<p>Over the years I&#x2019;ve met hundreds of women (and a few men) who&#x2019;ve made similar moves to extract themselves out of a career rut. While they&#x2019;ve all faced road bumps, not once has anyone ever expressed regret. &#xA0;The only regrets have been not doing it sooner! Needless to say, all have taken courage.</p>\n\n<p>Courage to say no to something good to create space for something better.</p>\n\n<p>Courage to take a risk.</p>\n\n<p>Courage to trust that when you start moving toward whatever ignites your ambition, interest or passion, you&#x2019;ll discover new opportunities, make new connections and unlock new possibilities for yourself that you never would otherwise.</p>\n\n<p>And I have no doubt that there are many, many, women in the Leaders in Heels community who would be testament to that.</p>\n\n<p>So, as Kathy shared with me, make a decision to take ownership of your career before someone else makes a decision for you.</p>\n\n<p>Paint a vision for your career and life that inspires you then decide to put yourself &#x2018;out there&#x2019; (that is, outside your comfort zone!) and do whatever you can to start building your own brand of luck. Just don&#x2019;t kid yourself that playing it safe and staying where you are, however &#x2018;fine&#x2019; it is for now, doesn&#x2019;t exact its own risks.</p>\n\n<p>To quote Gloria Steinman:&#xA0;&#x201C;Dream big, If you don&#x2019;t dream big you&#x2019;ll never have the ability to get ahead!&#x201D;</p>\n\n<p>&#xA0;</p>\n\n<p>Margie is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/07","associated_company":"work180"}