{"url":"https://www.work180.com.au/blog/2017/05/successful-women-throw-down-your-tresses","title":"Successful Women: Throw down your tresses","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/successful-women-throw-down-your-tresses/\" target=\"_blank\">Femeconomy</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Trina Hockley, successful retailer, female trades advocate, experienced Board Director and&#xA0;Chair of the&#xA0;<a href=\"http://aicd.companydirectors.com.au/\" target=\"_blank\">Australian Institute of Company Directors</a>&#xA0;(AICD) Gold Coast committee knows a thing or two about being a female leader in a male dominated industry, having worked in the Electrical industry for most of her career. Given Trina&#x2019;s wealth of experience, in Boardrooms, as a community leader, and entrepreneur, we asked her to contribute her wisdom accumulated over years &#xA0;of successfully navigating her career as a female leader.</p>\n\n<p>What would I say to my younger self when venturing into a male dominated business worl not that I am in my mid-fifties and can look back in reflection? The first thing that comes to mind is:&#xA0;<strong>do not try to be &#x201C;one of the boys&#x201D;. You aren&#x2019;t and you never will be.</strong> Accept that you are the minority in that industry, but that does not mean you cannot rise to the top! Be true to yourself and respect will follow.</p>\n\n<p>Imagine finally realising your dreams of being voted by the members of a large unlisted company to be their first and youngest female director. You walk into the boardroom with its high back leather chairs, names engraved in brass plaques in front of your leather writing mat, a full bar and kitchen are at one end of the boardroom. The older gentlemen in the room, who really didn&#x2019;t want you there, all stop and stare.&#xA0;<strong>The Chairman stands and says &#x201C;make us a cup of tea&#x201D;. This is it, the defining moment that will establish our relationship for the next few years</strong></p>\n\n<p>Without a second thought I replied, &#x201C;I do not drink tea or coffee, I do not make tea or coffee for my husband and I will not be making your tea or coffee&#x201D; and took my seat. I was never asked again.</p>\n\n<p>My motivation to step up to board postitions was at first a thrist for knowledge. When I took up my first government board position it was not in an industry I knew, but I needed to understand why it took the government so long to make decisions. I had been working in an area that depended on tendering for government contracts and the sheer frustration of waiting, sometimes for 18 months on decisions drove me to want to understand the machinations of the public service.</p>\n\n<p>Since then I have found that sitting on a diverse range of boards in a range of industries has significantly broadened my business and governance knowledge. It has also allowed me to champion other women along the way.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Successful Women - Throw down your tresses!</strong> I&#xA0;am a firm believer in assisting others to reach where you have struggled to climb. There is a saying that&#xA0;if you reach the&#xA0;top of the castle, you should always throw down your locks to help others climb up&#xA0;. Never close the draw bridge to others trying to access the castle.&#xA0;That is like saying I made it and you can&#x2019;t come too!&#xA0;There is so much more reward to assisting others.</p>\n\n<p>I have met a wonderful group of women and together we have formed Women in Power. Women in Power exists to&#xA0;assist girls and women into the world of being a tradie and progress through to become successful entrepreneurs and business champions. I also Chair two schools where I believe we can make the most positive changes. I am mindful of not going too far the other way and having majority of females at the board table. Remember also that diversity is a much larger discussion that just gender.</p>\n\n<p>There are still too many barriers to gender equality, and it is frustrating.&#xA0;My biggest frustration when it comes to gender equality in my business world has been the lack of progress and the barriers placed against women coming into my industry. There is no support, no voice and no recognition for any woman. The industry recently held a meeting to discuss the lack of new business owners coming into the industry.&#xA0;<strong>I, again, suggested that if they made women welcome there is a whole market out there. The response (as always) was stares and silence.</strong></p>\n\n<p>My other frustration is when a couple own and operate a business and the husband retires, moves on or even passes away, the woman believes they do not have the capacity to run the business by themselves. This is especially prevalent in more regional areas. These women can do it, should do it and just need encouragement and support to have a go.&#xA0;<strong>This is one area that I can see would make a big difference to providing female leadership&#xA0;role models to girls in regional centres.</strong>&#xA0;I always make a point of being available to judge business women&#x2019;s awards as these women should be celebrated and their achievements made public.&#xA0;We have to be a nation of women helping women &#x2013; it really does make an enormous difference.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>My advice to aspiring female leaders?</strong></p>\n\n<p>Work the system. I often took a male coworker to meetings. Not that I needed his advice or protection, it actually made the other party (male) more comfortable and would enable a more open conversation. So why not? Don&#x2019;t be precious about it.</p>\n\n<p>Don&#x2019;t be angry about the &#x201C;boys club&#x201D;. Create your own diverse group of supporters and likeminded business people. Don&#x2019;t insist on it being women only. Although there are times that meeting with females only can be inspiring, and often exhausting &#x2013; there is so much to do!</p>\n\n<p>Have fun, support others, and believe in yourself.&#xA0;<strong>Lastly, enjoy.</strong>&#xA0;So much has changed and so much more is changing. Enjoy the ride. It is exciting and daunting! Encourage and embrace other female entrepreneurs, tradies, academics&#x2026;and the list goes on.&#xA0;<strong>You&#x2019;ve got this.</strong></p>\n\n<p><em>Trina Hockley BHMS, GMQ, FAICD&#xA0;is a highly respected business owner operator of the&#xA0;<a href=\"http://www.lmgoldstar.com.au/\" target=\"_blank\">L &amp; M Group</a>&#xA0;of Companies and an experienced, qualified non- executive director with a background in training, education, employment, retail and governance.&#xA0;Highly sought after for both her business and governance acumen, she holds the position of&#xA0; Chair of the Australian Institute of Company Directors (AICD) Gold Coast committee. She is also Chair of Arcadia College and Ohana for Youth and director of the Spot Academy, The Gold Coast Sporting Hall of Fame and Sports Gold Coast.</em></p>\n\n<p><em>Trina&#x2019;s volunteering has seen accolades as an Outstanding Volunteer to the Indigenous Community and she has received a 20 year Leadership Award from the City of Gold Coast. She is an avid advocate for women in trades and for youth education and development.</em></p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/05","associated_company":"work180"}