{"url":"https://www.work180.com.au/blog/2017/03/superhero-daughter-day-challenges-stereotypes-in-tech","title":"Superhero Daughter Day Challenges Stereotypes in Tech","author":"WORK180","body":"\n\t\t\t\t\t<p>Women&#x2019;s job site DCC Jobs together with non-profit organisation Tech Girls Movement are determined to challenge gender bias and stereotypes in technology through a bold initiative aimed at primary school girls. &#xA0;Held to celebrate International Women&apos;s Day, Superhero Daughter Day promotes technology as a career path of choice for young women in a fun and interactive environment.</p>\n\n<p>Women are vastly underrepresented in STEM (science, technology, engineering and maths) and&#xA0;<a href=\"https://www.eurekalert.org/pub_releases/2017-01/aaft-ygl012317.php\" target=\"_blank\">new research</a>&#xA0;shows that gender bias and stereotypes take form and can impact career choices as early as at the age of 6.</p>\n\n<p>&#x201C;Challenging these conceptions at an early age is crucial to ensure the future pipeline of STEM professionals has a gender balance that reflects the society we live&#xA0;in&#x201D;&#xA0;says Gemma Lloyd, DCC Jobs&#xA0;Cofounder.</p>\n\n<p>After the success of the inaugural Superhero Daughter Day held in Brisbane in 2016, DCC Jobs and Tech Girls Movement are rolling out this event across Australia along with Auckland in 2017. &#xA0;On a Saturday afternoon in March, over 1500 girls and their guardians will meet female role models in tech, learn about interesting careers in the industry, and participate in creative games and enjoy cupcakes.</p>\n\n<p>Dr. Jenine Beekhuyzen, Founder and CEO of the Tech Girls Movement has evidence that showcasing role models and giving girls hands on skills can influence their chosen career pathways, &#x201C;our research shows events like Superhero Daughter Day can impact as many as 60% of attendees to consider a career in STEM when they may not have otherwise,&#x201D; says Dr Beekhuyzen.</p>\n\n<p>Superhero Daughter Day is a not-for-profit event organised by volunteers and partner organisations across Australia have stepped forward to pledge their support with venues and facilitation of activities. Supporters include Auckland University of Technology Colab, Accenture, Charles Darwin University, Coder Factory Academy, CORE Education, Dr Sue Pillans, Enterprize, Inspiring Australia, Next Gen Health &amp; Lifestyle Club, OMGTech!, She#, TechnologyOne, University of Adelaide and Zendesk, and many more.</p>\n\n<p>Activities will vary from state to state and are designed to spark excitement through games and mini-workshops. Dan Siepen, Coder Factory Academy cofounder says;</p>\n\n<p>&#x201C;STEM-related activities have always been portrayed as difficult to teach kids. What makes Superhero Daughter Day special is that it demystifies the complexity to undertake STEM-related training and activities. To have parents, grandparents, aunties and uncles learning together with the girls is a highly rewarding experience and it&#x2019;s exactly what Australia needs to encourage more STEM professionals, particularly&#xA0;&#xA0;women in tech.&#x201D;</p>\n\n<p>In just two weeks, Superhero Daughter Day was booked out in Brisbane, Sydney and Perth with tickets disappearing fast in Adelaide, Auckland, Darwin, Hobart and Melbourne.</p>\n\n<p>&#xA0;</p>\n\n<p>Contact for media quotes:&#xA0;</p>\n\n<p>DCC Jobs</p>\n\n<p>Gemma Lloyd</p>\n\n<p>0413 130 067</p>\n\n<p><a href=\"mailto:gemma@diversecitycareers.com\">gemma@diversecitycareers.com</a></p>\n\n<p>&#xA0;</p>\n\n<p>Tech Girls Movement</p>\n\n<p>Jenine Beekhuyzen</p>\n\n<p>0405 272 068</p>\n\n<p><a href=\"mailto:jenine@techgirlsmovement.org\">jenine@techgirlsmovement.org</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["DCC News","Celebrating Women"],"upload_date":"2017/03","associated_company":"work180"}