{"url":"https://www.work180.com.au/blog/2018/10/supporting-parents-through-stillbirth","title":"Supporting parents through stillbirth","author":"WORK180","body":"\n\t\t\t\t\t<p>Today is International Pregnancy and Infant Loss Remembrance Day. Last October 15, the Stillbirth Foundation Australia, alongside a group of parents and corporate leaders,<a href=\"https://www.huffingtonpost.com.au/victoria-bowring/paid-parental-leave-should-include-the-parents-of-stillborn-children_a_23241984/\"> launched a campaign</a> to ensure access to paid parental leave (PPL) in the case of stillbirth.</p>\n\n<p>WORK180 is a proud supporter of this campaign and we caught up with one of its members, Andrew McBride, father of baby Hope:</p>\n\n<blockquote>\n<p><em>&quot;My daughter, Hope, was stillborn in December 2009. At the time, my wife and I were both in the Australian Public Service so I was able to access my accrued personal leave and my wife was entitled to her maternity leave. This allowed us to grieve our daughter and recover &#x2013; both physically and emotionally. I soon realised that not everyone is as fortunate to get this kind of support. I remember meeting, at the cemetery where Hope is buried, a newly grieving mother who had to return to work because she had no leave and could not afford to take time off.&quot;&#xA0;</em></p>\n</blockquote>\n\n<p>It was this encounter with the grieving mother that made Andrew aware that many company parental leave policies are ambiguous as to whether the parents of stillborn babies are entitled to paid parental leave. Consequently, he worked with Stillbirth Foundation Australia and a group of corporate leaders including WORK180 to ensure that the recognition of stillbirth in paid parental leave policies becomes a norm in corporate Australia. One year later, the list of employers who have joined is growing.&#xA0;</p>\n\n<p>The &#x201C;ask&#x201D; of companies by the campaign is simple:</p>\n\n<p><strong>A commitment to review company parental leave policies to ensure that employer funded paid parental leave is available in the circumstance of stillbirth.</strong></p>\n\n<p><span style=\"font-size: 16px;\">Many other corporations are poised to follow&#xA0;says Kate Lynch, CEO of the Stillbirth Foundation:</span></p>\n\n<blockquote>\n<p>&quot;We are really pleased to report that the response to this ask has been overwhelmingly positive, with companies both big and small taking action. Companies who have joined this campaign are demonstrating their support by registering on <a href=\"https://stillbirthfoundation.org.au/corporate-register/\">Stillbirth Foundation Australia&#x2019;s website</a>. &quot;</p>\n</blockquote>\n\n<p>A number of employers within the WORK180 network have already joined the campaign and updated their policies.&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/clients/microsoft\">Steven Worrall, managing director at Microsoft Australia</a> explained why they re-wrote their parental leave policy and decided to join the Stillbirth Foundation after realising it was not initially included:</p>\n\n<blockquote>\n<p><em>&#x201C;As part of Microsoft&#x2019;s aspiration to provide our people with the best place to work, we are reinforcing our commitment to improving our parental leave benefits and have extended our Paid Primary and Partner Parental Leave to those who are affected by the tragic circumstances of stillbirth. Tragically, there are six stillborn babies a day in Australia. Despite enormous technological and medical advances, the rate of stillborn babies has not declined in two decades. Microsoft has partnered with the Stillbirth Foundation to call on other businesses to match this commitment. The Stillbirth Foundation is the only Australian charity dedicated to stillbirth research and it is their mission to significantly reduce the incidence of stillbirth through research, education and advocacy. We hope that this change will remove ambiguity from an already challenging situation.&#x201D;&#xA0;</em></p>\n</blockquote>\n\n<p>Similarly, HSBC also joined earlier this year and the company now&#xA0;includes paid parental leave in the tragic case of stillbirth and calls for more employers to join:&#xA0;</p>\n\n<blockquote>\n<p><em>&#x201C;</em><a href=\"https://www.work180.com.au/clients/hsbc\"><em>HSBC</em></a><em><a href=\"https://www.work180.com.au/clients/hsbc\">&#xA0;Australia</a> places great importance on supporting its employees in the most important aspects of their lives. HSBC is proud to support Stillbirth Foundation Australia in its efforts to encourage businesses to include stillbirth in paid parental leave policies so there is no ambiguity about parents&#x2019; entitlements.&quot; </em></p>\n</blockquote>\n\n<p><a href=\"https://www.work180.com.au/clients/buildkite\">Tim Lucas, CEO </a><a href=\"https://www.work180.com.au/clients/buildkite\">and</a><a href=\"https://www.work180.com.au/clients/buildkite\"> founder of Buildkite</a>, a start-up currently employing 11 people, said it was important to include the policy already at the start of their journey, to ensure adequate support was part of their foundation.</p>\n\n<blockquote>\n<p><em>&quot;We&apos;re committed to supporting any of our team who might be affected by the tragic circumstances of&#xA0;stillbirth,&#xA0;and have a parental leave policy that explicitly gives them full parental leave benefits. We are proud to partner with the Stillbirth Foundation to call on other businesses to match this commitment.&quot;</em></p>\n</blockquote>\n\n<p>One year since launching the campaign, WORK180 is proud to be a key supporter.&#xA0;</p>\n\n<blockquote>\n<p><em>&quot;We are working closely with the Stillbirth Foundation, bringing more employers on board as they re-write their parental leave policies.&#xA0;&#xA0;<span style=\"font-size: 16px;\">Most of the time it&apos;s something that has not been thought of, yet with 6 babies being stillborn each day, there are so many families affected&quot; says Valeria Ignatieva, WORK180 CEO and Co-founder.</span></em></p>\n</blockquote>\n\n<p>To date,&#xA0;<a href=\"https://www.work180.com.au/clients\">Xero, HSBC, Buildkite, Microsoft,&#xA0; Telstra, Optus, Roads and Maritime Services (NSW Government), BP, CSIRO, John Holland and PwC</a> have all recognised&#xA0;stillbirth&#xA0;in their Paid Parental Leave policies after finding out about the campaign. Some are still so recent they are yet to be added to the<a href=\"https://stillbirthfoundation.org.au/corporate-register/\"> full list of employers </a>on the Stillbirth Foundation site.&#xA0; &#xA0;</p>\n\n<p><span style=\"font-size: 16px;\">For further information about the campaign, visit the&#xA0;</span><a href=\"https://stillbirthfoundation.org.au/corporate-recognition/\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">Stillbirth Foundation website</a><span style=\"font-size: 16px;\">&#xA0;or&#xA0;</span><a href=\"https://www.work180.com.au/contact\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">reach out to WORK180 directly.</a></p>\n\n<hr>\n<h4><strong>About</strong><strong>&#xA0;the Stillbirth Foundation</strong></h4>\n\n<p>The <a href=\"https://stillbirthfoundation.org.au/\">Stillbirth Foundation Australia</a> is the only Australian charity dedicated to stillbirth research. We are 100 percent community funded.&#xA0;It was launched by Emma McLeod in October 2005 after Olivia, Emma&#x2019;s second child and first daughter, died unexpectedly in utero and was born still on 31 July 2002. At the time, Emma was shocked to discover that so little was invested in researching the possible causes of stillbirth.&#xA0;</p>\n\n<p>Since 2005, the Stillbirth Foundation has allocated over $1million to funding the most rigorously designed studies aimed at finding a means of preventing stillbirth and supporting the families of stillborn babies.</p>\n\n<p>Today, The Stillbirth Foundation Australia is recognised nationally as a leading voice on stillbirth and represents the voices of thousands of Australian families who have been touched by stillbirth.</p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n\t\t\t\t","tags":["Stillbirth","WORK180 News"],"upload_date":"2018/10","associated_company":"work180"}