{"url":"https://www.work180.com.au/blog/2018/10/supporting-mental-health-and-wellbeing-in-the-workplace","title":"Supporting mental health and wellbeing in the workplace","author":"Sedgman","body":"\n\t\t\t\t\t<blockquote>\n<p><em>&quot;Life can throw us a curveball at any stage in our lives, making us feel not ourselves. At Sedgman, we want our people to know that we care and that support is available. Mental Health Week is an important event on the Sedgman calendar and we will be continuing to raise awareness and help our employees look after their wellbeing&quot;</em></p>\n\n<p>Samantha Douglas, Sedgman General Manager, People, HSEQ and Communications</p>\n</blockquote>\n\n<p>A focus on physical safety and reducing the risk of injury and disease is nothing new. However, an emerging realisation is that organisations must also provide and deliver initiatives to support the mental and emotional wellbeing of our people.&#xA0;</p>\n\n<p>The mining and resources industry presents unique challenges related to mental and emotional wellbeing including workers on roster often spending time away from their families while also working varying shift schedules over a 24-hour period.&#xA0;</p>\n\n<p>The mining industry has one of the highest rates of mental health conditions in Australia.&#xA0; Statistics identified by Beyondblue show that 1 in 5 Australian mining industry workers has experienced mental health conditions including depression or anxiety in the past 12 months. These statistics underscore Sedgman&#x2019;s commitment to working with our people on strategies and initiatives that support good mental and emotional health.</p>\n\n<p>&#xA0;</p>\n\n<h4><em>Initiatives for mental health and wellbeing</em></h4>\n\n<p>To support our employees&#x2019; mental and emotional health, Sedgman, a member of CIMIC Group, provides services and support within the workplace.&#xA0; Initiatives by both CIMIC Group and Sedgman, such as discounted private health insurance, salary continuance insurance, a dedicated wellness program and discounts, preventative healthcare, a robust Employee Assistance Program (EAP), targeted health events, flexible working arrangements and employee social events, all contribute to Sedgman employees having access to support to focus on their mental and emotional wellbeing.</p>\n\n<p>Not only are we seeking ways to care for our employees, we are also ensuring our managers are equipped to help and support their people. Managers will receive mental health training to better support their teams and to identify the impacts of projects, travel and rotating rosters on employees&#x2019; mental and emotional wellbeing.&#xA0;</p>\n\n<p>We strongly believe the stigma associated with mental health conditions needs to be broken down. One way we are tackling this is by encouraging our people to share their own experiences of overcoming personal challenges.</p>\n\n<p>&#xA0;</p>\n\n<h4><em>Mental Health Week</em></h4>\n\n<p>On World Mental Health Day, October 10, as part of Mental Health Week, Sedgman will be hosting morning teas in each of our locations and raising awareness among our teams. Commencing on Monday 8 October, and running through the week, will be themed days focusing on the following six steps to improving mental and emotional wellbeing:</p>\n\n<ol>\n\t<li>Be active</li>\n\t<li>Keep learning</li>\n\t<li>Connect</li>\n\t<li>Give</li>\n\t<li>Take notice</li>\n\t<li>Care for our planet&#xA0;</li>\n</ol>\n\n<p>Resources and information will be made available to all our people, as well as ideas on each of the above steps for improving mental and emotional wellbeing.&#xA0;</p>\n\n<p>At Sedgman, going home safe means not only focusing on your physical safety but also on mental and emotional wellbeing; this is a commitment we make to our people.</p>\n\n<hr>\n<h4><strong><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/99b80514-69f3-46bd-9961-33fa736dc10f.png\" style=\"float: right; width: 130px; height: 29px; margin: 10px;\">About</strong><strong> Sedgman</strong></h4>\n\n<p>Ranked #6 on the LinkedIn Best Australian Company list, with health and income protection benefits for eligible employees. Add to that, rewards programs and the opportunity to work overseas.</p>\n\n<p>Interested? Browse jobs with Sedgman and apply <a href=\"https://www.work180.com.au/clients/sedgman\">here.</a></p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0; &#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;&#xA0;</p>\n\n\t\t\t\t","tags":["wellbeing","mental health"],"upload_date":"2018/10"}