{"url":"https://www.work180.com.au/blog/2016/12/supporting-staff-on-parental-leave-a-perfect-example-from-curtin-university","title":"Supporting Staff on Parental Leave- a Perfect Example from Curtin University","author":"WORK180","body":"\n\t\t\t\t\t<p>Leaving an exciting job to take maternity leave is often one of the hardest career milestones to navigate for women. In addition to the emotional rollercoaster that takes over your life, dealing with looking after a newborn, worrying about work should be the last on the list. However it&#x2019;s difficult to &#x2018;just let go&#x2019; and at DCC we&#x2019;ve heard the good, the bad and the downright ugly accounts of how organisations have supported (or not) women who took maternity leave. I&#x2019;d like to highlight a great story, outlining Susan O&#x2019;Dowd&#x2019;s experience with taking maternity leave while working with Curtin University.</p><p>Susan started her career at Curtin as a marketing consultant, engaged for a four month project. At its completion, Susan was offered a permanent role and continued to impress the University, ultimately achieving the position of Senior Brand and Marketing Manager, looking after both local and international marketing communications and branding initiatives.</p><p>&#x201C;Throughout my entire career, Curtin were very supportive of my professional development- I attended several training and development courses and was very happy with my career progression,&#x201D; recalled Susan.</p><p>However, when Susan and her husband decided to start a family, they had some concerns around Susan potentially taking a step down from a role she loved upon returning from maternity leave.</p><p>&#xA0;&#x201C;While on maternity leave, I naturally had some concerns around how my working life would be when I returned to work.&#xA0;Will I be able to juggle being a mother and a professional1?&quot; recalled Susan. &quot;However, when I sat down with my manager and discussed the transition plan, many of my worries were alleviated. The best thing an employer can do is reaffirm the value that the staff member brings to the organisation. That alone can greatly help with the transition process.&#x201D;</p><p>It was decided that although Susan wanted to keep her position, she would not be ready for a 5 day a week commitment. Curtin offered Susan a project based role as a Strategic Project Manager for a period of time, working 3 days per week before returning to her previous position.</p><p>&#x201C;This opportunity was great as it allowed me to gain experience in another aspect of the department and provided me with a broader skill set to apply when I returned to my previous position .&#x201D; said Susan.</p><p>After baby Eva was born, Susan enjoyed her time as a new mum and took 12 months maternity leave, as Curtin provided excellent maternity leave benefits. &#x201C;Even though Eva never slept through the night until she was 11 months, I still missed my job,&#x201D; said Susan. A busy mum/marketer can hardly sit still so Susan kept herself busy and &#x201C;drove her husband crazy with projects around the house&#x201D;.&#xA0; Staying in touch with her team was very important to Susan, and Curtin arranged for her to come in for a number of events and portfolio meetings to stay connected.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/fe3d2957-fa00-46c1-845f-ff000ef1ac91.png\">&#x200B;</p><p>&#x201C;It was great to get dressed up, even if once a month to get out of the house and catch up with my colleagues. I also found it helped with the transition when I returned to work.&quot;</p><p>While Susan experienced a supportive environment from an employer, she saw the opposite happening around her, &#x201C;There were so many conversations at my mother&#x2019;s group, where other mums couldn&#x2019;t believe how great Curtin was- some of whom were senior professionals in the field, resigned to looking for part time admin roles after maternity leave because there was no flexibility in returning to their old roles. I feel that there needs to be a greater appreciation for the value that returning mothers bring as well as employers being more open to new ways of working to ensure that corporate knowledge is retained and valued.&#x201D;</p><p>This is an issue prevalent in our society, however we&#x2019;re also seeing a huge focus on this from our clients at DCC. They all pride themselves on recognising that supporting women&#x2019;s careers is not only the right thing to do, it is crucial to remaining competitive.</p><p><a data-cke-saved-href=\"https://www.diversecitycareers.com/origin/\" href=\"https://www.diversecitycareers.com/origin/\" target=\"_blank\">Origin Energy&#xA0;</a>Chairman Gordon Cairns summed up the issue of unconscious bias around women progressing their careers while caring for families very well in this&#xA0;<a data-cke-saved-href=\"https://www.youtube.com/watch?v=TSjEFgVcIsI\" href=\"https://www.youtube.com/watch?v=TSjEFgVcIsI\">video</a>, stating&#xA0;&#x201C;We need to be able to provide the support system, the infrastructure and the sponsorship to enable women to do both.&#x201D;</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2016/12","associated_company":"work180"}