{"url":"https://www.work180.com.au/blog/2017/05/taking-a-year-out-is-no-sabbatical","title":"Taking a Year Out is No Sabbatical!","author":"WORK180","body":"\n\t\t\t\t\t<p>Women&#x2019;s careers have taken centrefold in the last couple of years and have become a priority in almost every company across Australia&#x2026;just look at how DCC Jobs have grown in only 2 years.</p>\n\n<p>There is so much focus on re-integrating women into the workforce, adopting flexible working practices and removing gender bias in candidate selection. What is never spoken about is how difficult the pre-baby piece is!</p>\n\n<p>We work hard, focussing on delivering and smashing goals. Then out of nowhere, suddenly fall pregnant and your whole world changes! We do not want to be perceived or treated differently, so soldier on through the aches and pains, meetings and delivering on our personal and business objectives.</p>\n\n<p>The biggest challenge for me has been to be able to let go and take a step back. It is quite confronting knowing you will be out of the workforce for a year, things will change, cannot plan ahead and need to start winding down and taking a back seat for once!</p>\n\n<p>Your team involve you in everything but you are a bit powerless as the reality is you will be spending the next year as a mum and biggest priority will be taking care of your little one!</p>\n\n<p>This is why I am so glad I work for REA Group. We have recently created an Expecting Parents (gender neutral) slack group and community, where we share advice, frustrations and meet up for regular luncheons and share this overwhelming but amazing experience together. This has been an amazing support for me and others who are Aussie orphans and do not have family close by to rely on! The whole process is so much easier when you know your employer support you 100%, financial worries do not even surface with our amazing&#xA0;<a href=\"https://youtu.be/7112FHRi56Q\" target=\"_blank\">Parental Leave Scheme</a>&#xA0;and supportive Return to Work Programme.</p>\n\n<p>As excited as I am for the next chapter of my adult life, I also feel super engaged with my organisation and just as excited to return a year from now and see what new challenges and opportunities I will have.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/05","associated_company":"work180"}