{"url":"https://www.work180.com.au/blog/2015/06/the-heroes-and-heroines-of-workplace-diversity","title":"The heroes and heroines of workplace diversity","author":"WORK180","body":"\n\t\t\t\t\t<p>As <a href=\"https://conferences.ted.com/TEDWomen2015/program/\">TEDWomen 2015</a> launches this week, we celebrate how far society has come. We no longer exclude women from attending university or joining certain professions. We don&#x2019;t make our citizens sit in different sections of the bus because of their race, or limit their citizenship rights. We welcome those with disabilities to live in our community and not behind institutional walls. We have made progress towards marriage equality.</p>\n\n<p>But even today we are still talking about how to bring more diversity to our governments, institutions and companies. We don&#x2019;t like to hear statistics that say that in the US,<a href=\"http://www1.eeoc.gov/eeoc/statistics/employment/jobpat-eeo1/2013/index.cfm#select_label\"> 88% of executive and senior level jobs are held by white people</a>; or that there are <a href=\"https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/321048/fulfilling-potential-discussion-so-far.pdf\">65,000 instances of disability hate crimes every year in the UK</a>; or that the <a href=\"https://www.wgea.gov.au/media-releases/gender-pay-gap-171-employers-tackle-pay-inequity\">pay gap between men and women&#x2019;s average weekly full-time earnings in Australia has hovered between 15-18% for 20 years</a>. We are aware that diversity is an issue, but to say we are outraged or actively engaged would be a significant overstatement.</p>\n\n<p>If I fast forward 25 years and imagine myself explaining to my future grandchildren what it felt like to live in 2015, I might tell them: &#x201C;There was a general discomfort or malaise about diversity, tinged with a sense of resignation. Diversity didn&#x2019;t galvanize global attention like climate change, terrorism or technology, but there were some bright spots.&#x201D;</p>\n\n<p>I will tell my grandchildren about the inspiring leaders who emerged during this period to reshape their organizations and countries from within. In particular, I will tell them about Australia&#x2019;s <a href=\"http://malechampionsofchange.com/\">Male Champions of Change</a> (MCC), a group of 25 senior executives who first joined forces in 2010 under the guidance of <a href=\"http://www.theguardian.com/australia-news/2015/may/08/sex-discrimination-commissioner-calls-on-men-to-champion-womens-rights\">Liz Broderick, the Sex Discrimination Commissioner</a>, to <a href=\"https://www.humanrights.gov.au/our-work/sex-discrimination/projects/male-champions-change\">&#x201C;listen, learn, and lead&#x201D;</a> through action.</p>\n\n<p>The group includes many powerful and influential men, like Lieutenant General David Morrison, Australia&#x2019;s former Chief of Army; Simon Rothery, CEO of Goldman Sachs, Australia and New Zealand; David Thodey, CEO of Telstra; Alan Joyce, CEO of Qantas; Gordon Cairns, chairman of Origin Energy; Andrew Stevens, former managing director of IBM Australia and New Zealand; Mike Smith, CEO of ANZ; and Giam Swiegers, former CEO of Deloitte Australia.</p>\n\n<p>Why men? As Gordon Cairns explained, &#x201C;Men invented the system, men largely run the system, and men need to change the system.&#x201D; This sentiment was echoed by Broderick: &#x201C;Relying on women to change the status quo when they don&#x2019;t hold all the levers of power is illogical. Men, in the main, hold those levers. If we want change, we need men taking the message of gender equality to other men.&#x201D;</p>\n\n<p>The MCCs developed bold initiatives, including the &#x201C;all roles flex&#x201D;, which helped create more family-friendly workplaces. In Telstra, for example, Thodey disrupted the norm of full-time work by mandating that all roles should be flexible. <a href=\"http://malechampionsofchange.com/wp-content/uploads/2015/03/Progress-Report-20141.pdf\">A pilot program</a> in the customer sales and service team at Tesltra saw the number of women in the applicant pool grow by more than 15%, and the share of women in job placements increase by 35%.</p>\n\n<p>They changed the speaker profile at conferences. The MCCs recognised that the implicit value in speaking opportunities in terms of raising speaker profiles and extending networks, but that these opportunities were biased towards men. As the MCCs looked at their fellow speakers they noticed the dominance of male speakers, and the lost opportunities for women. In order to draw attention to this disparity, and make a symbolic and practical change, every time the MCCs are asked to speak at a public forum, they ask the event organizers to ensure that <a href=\"http://malechampionsofchange.com/wp-content/uploads/2015/03/Progress-Report-20141.pdf\">women are equally represented</a>. In 2015, this bold move is really starting to bite.</p>\n\n<p>The MCCs also developed <a href=\"https://www.humanrights.gov.au/sites/default/files/document/publication/MCC-LeadershipShadow_210314.pdf\">The Leadership Shadow</a> tool, which aims to help leaders think about their personal impact on diversity and inclusion outcomes. Simple but effective, the tool asks a series of questions to enable leaders to self-assess if what they say or do was heard and seen by followers as indicative of a commitment to diversity and inclusion, or whether it was in fact empty words and empty actions.</p>\n\n<p>They also created the <a href=\"http://malechampionsofchange.com/wp-content/uploads/2015/03/Progress-Report-20141.pdf\">Supplier Multiplier Initiative</a>, in which MCCs use their corporate buying power to influence suppliers by requiring them to demonstrate compliance with diversity objectives. And as part of a broad communication campaign, they published reports, guides, action plans and have given 250 speeches around the world. Already, their initiative has established spin-off groups in different industries and locations, and their sponsored events draw in large crowds of executives who now want to be part of a conversation they had previously ignored.</p>\n\n<p>I will tell my grandchildren that the bright spots made a difference, but they were not the only change agents on task. They were stepping up and taking their rightful place beside women to create a better world together, shaping a new reality by using their personal and corporate levers of power.</p>\n\n<p>&#xA0;</p>\n\n<p><em>Juliet Bourke leads the Diversity and Inclusion practice and co-leads the Leadership practice at Deloitte Australia. @julietbourke</em></p>\n\n<p>This article originally appeared in <a href=\"http://www.theguardian.com/the-b-team-partner-zone/2015/may/26/male-champions-of-change-liz-broderick-australia-heforshe\">the Guardian</a> and was reposted with Juliet&apos;s permission.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2015/06","associated_company":"work180"}