{"url":"https://www.work180.com.au/blog/2018/07/the-very-flexible-octopus","title":"The very flexible Octopus","author":"WORK180","body":"\n\t\t\t\t\t<p>When Paul Stovell started Octopus Deploy, he wanted to build a business that he&#x2019;d be happy to work in for the rest of his life. He set about creating an environment where flexible working was embedded in the culture and the people he hired were supported and valued. He also decided they wouldn&apos;t be called employees, they&#x2019;d be craftspeople.</p><p>Anyone applying to work at Octopus Deploy goes through a rigorous selection process to ensure they have the right skills for the job. But equally important is their ability to communicate effectively with the team while to working remotely. Not everyone makes it through, but those who are welcomed into the business are able to choose how and when they work. They even decide who they work with.&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b9379bb3-df2a-4826-9a86-6230a6fc269b.png\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b9379bb3-df2a-4826-9a86-6230a6fc269b.png\" style=\"margin: 10px; float: right;\"></p><blockquote><p><em>&#x201C;Each craftsperson is trusted and therefore invited choose the project and team they want to be a part </em><em>of</em><em>&#x201D; says </em><em>Paul</em><em>. Love working on deep technical problems? Join a team working to solve a problem you&#x2019;re interested in. Want to learn a new skill? Choose a project and team with a mentor that inspires you.&#x201D;</em></p></blockquote><p>This level of flexible working turns the old notion of structured hours and close supervision on its head. If someone wants to work less than full time, that is agreed through a part time work arrangement. If they want to work longer hours for half the month, then take time off at the end of the month, that&#x2019;s OK too. And when a new craftsperson comes on board, Octopus Deploy provides a budget to buy a laptop of their choice and gives a yearly allowance for home office equipment.</p><p>Of course, operating remotely makes effective collaboration essential. Meetings are recorded, ideas and plans are shared digitally and people play catch up if they can&#x2019;t attend in real time. Then, twice a year, everyone in the organisation comes together for a face to face, where they connect, socialise and share knowledge.</p><blockquote><p><em>&#x201C;Octopus doesn&apos;t restrict when or where I work. You can&apos;t get more flexible than that. The freedom to work at </em><em>8am</em><em> from a cafe or </em><em>10pm</em><em> at home after my kids are asleep, undoubtedly makes me more productive and happier.&#x201D;&#xA0; Says Michael Richardson, Solution Architect.</em></p></blockquote><p>Octopus Deploy employs 40 people and services more than 20,000 organisations around the world. In June 2018, the business was awarded Flex Able certification by WORK180.</p><p><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About the Flex Able Certification</strong></h4><p><a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? WORK180&#x2019;s&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\">Flex Able</a><a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\">&#xA0;Certification&#xA0;</a>helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><p>Learn more about the&#xA0;Flex Able&#xA0;Certification&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" style=\"background-color: rgb(255, 255, 255);\">here</a><a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\">.</a></p><p><span style=\"color: rgb(169, 127, 177);\">WORK180 Flex Able&#xA0;Certified Employers include:</span></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/245a56b6-d30c-4a5b-b43f-8ebf5a79f335.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/245a56b6-d30c-4a5b-b43f-8ebf5a79f335.png\"></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About&#xA0;Octopus Deploy&#xA0;</strong><br><br></h4><p>&#xA0;We are excited to welcome Octopus Deploy to our list of&#xA0; Endorsed Employers for Women. They live and breathe flexible working which is also why they&#x2019;ve been awarded the Flex Able Certification. Learn more on their <a data-cke-saved-href=\"https://www.work180.com.au/clients/octopus-deploy\" href=\"https://www.work180.com.au/clients/octopus-deploy\">Best Employer page.</a></p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["flex able certification","flexible working"],"upload_date":"2018/07"}