{"url":"https://www.work180.com.au/blog/2017/12/the-myth-of-worklife-balane","title":"The Myth of Worklife Balance","author":"WORK180","body":"\n\t\t\t\t\t<p>These days, everyone is totally obsessed with achieving this mythical state of work life balance. At work, it&#x2019;s something that&#x2019;s repeated over and over, and it&#x2019;s usually code for, &#x201C;I want to spend less time at work.&#x201D; Blogs give advice on shortcuts to having it all and social media is flooded with glamorous mothers giving tips on throwing dinners for 50 while effortlessly running high-profile jobs.</p><p>Don&#x2019;t be sucked in. Work life balance is harder to find than unicorns because the demands on women to juggle work and family life are at an all-time high. In her 2017 book &#x2018;Work Strife Balance&#x2019;, Mamamia founder Mia Freedman talks about the pressure cooker environment to have it all, at work, at home, on social media, in the mirror&#x2014;and she&#x2019;s right.</p><p>In a recent <a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\" href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\" target=\"_blank\">Circle In </a>survey of mums who were preparing to return to work from parental leave, 83 % said that they were most concerned with balancing work and family. This internal conflict between what&#x2019;s right for me and my family and what&#x2019;s right for my career plays out continuously and adds to the stress of returning to work.</p><p>Many of us also fall into the trap of trying to be a super human when we do go back to work. We often feel the need to work even more hours than before to prove that we can still do it. And this is on top of juggling the endless domestic duties that come with having children. Why do we do this to ourselves?</p><p>We&#x2019;d like to offer a different perspective. We think achieving work life balance is not actually realistic, so let&#x2019;s stop killing ourselves trying to pursue this impossible dream. How about instead we strive for work life&#xA0;<em>harmony</em>? As a busy working mama, it&#x2019;s actually about making trade-offs and choosing to focus on the things that are the most important to you, your career and your family, and not everyone else.</p><p>There&#x2019;s no magic bullet to help solve the very real working mama dilemma, but here are a few things that help me keep perspective:</p><p>1. Focus on the important things. Think about what&#x2019;s important for you, your family, your career, then try to find the right amount of time to spend in each of these areas. It&#x2019;s unlikely you&#x2019;ll feel fulfilled unless you have at least some time in each area.</p><p>2. Flex is important. During your working life, your focus and amount of time you spend on work and life will no doubt change. Sometimes it&#x2019;s the right time to go hard at your career, and other times wrapping your arms around your family needs to be your primary focus. Sometimes you&#x2019;ll nail it and other times feel like you are drowning. That&#x2019;s normal, but when this happens, take a deep breath and get back to basics. Evaluate where you are at and what are the main priorities in your life, then refocus on them.</p><p>3. Use technology to work flexibly. I found working one day a week from home invaluable as it enabled me to condense all of my meetings into my days in the office and then carve out a day to work at home uninterrupted. It made my working week so much more productive.</p><p>4. Go easy on yourself. Don&#x2019;t try to do everything all at once. You aren&#x2019;t a superwoman and you shouldn&#x2019;t aspire to be one. Be realistic about what&#x2019;s achievable, try to share the domestic duties with your partner and outsource as much as you can afford to.</p><p>5. Let go of the mama guilt. Whether you feel like you&#x2019;re not spending enough quality time with your kids or you aren&#x2019;t making birthday cakes from scratch or your home is constantly a bit of a mess, we all suffer from mama guilt from time to time. We really need to learn how to let this go. The most important thing is that our kids know that we care for them. And as they grow up, they will benefit from seeing you role model achievement through hard work.</p><p>Everyone&#x2019;s version of work life harmony will be different. And as a busy working mum, give yourself the space to experiment and work out what&#x2019;s best for you and your family.</p><div><div><br></div><h4><strong>About the Author&#xA0;</strong></h4><p>Kate Pollard and Jodi Geddes are Co-founders of <a data-cke-saved-href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\" href=\"https://www.dccjobs.com/what-women-want/support-network/professional-service-providers/circle-in\">Circle In.</a> Circle In&#xA0;is a WORK180 partner and a free online career resource for working mothers. Circle In provides advice, real stories, podcasts, videos and resources to women across the entire parental leave journey - from thinking of having a baby to returning to work.&#xA0;</p><h4 style=\"font-family: Lato, sans-serif;\"><strong><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2704841f-951b-4e4d-a25e-32b0ef991521.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2704841f-951b-4e4d-a25e-32b0ef991521.jpeg\"></strong></h4><h4><strong>About WORK180</strong></h4><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p></div>\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2017/12","associated_company":"work180"}