{"url":"https://www.work180.com.au/blog/2016/09/the-perils-and-privilege-of-working-part-time","title":"The Perils and Privilege of Working Part time","author":"WORK180","body":"\n\t\t\t\t\t<p>Whilst more and more of the workforce is opting to deviate from the standard 40 hour work, moving to part time still presents a balancing act between managing the commitments of a demanding job in a condensed time-frame and the need to set your own boundaries with how that works.&#xA0;</p><p>I count myself lucky to be in the privileged position of spending less time working and more time doing other things that are important to me. &#xA0;I&#x2019;ve cut a deal whereby I get to take an additional days unpaid leave every week &#xA0;and in return I&#x2019;m providing &#xA0;20% more efficiency by delivering a full time job in four days. &#xA0;Sometimes that works to my advantage, sometimes it swings the other way, but having done it for over a year would I cut the same deal again? &#xA0;Absolutely, without question and here&#x2019;s why it&#x2019;s a privilege:</p><p>You can&#x2019;t buy time back.</p><p>Time is finite and most of us sell it in hourly increments to our employers but we can&#x2019;t buy it back. &#xA0;We can, however make the most of the time we have day by day and week by week and make living as much of a priority as working. &#xA0;I&#x2019;m all for work life integration rather than striving for elusive work life balance but having a day that&#x2019;s mine in the week really helps me to live that philosophy. &#xA0;I get to &#xA0; carve out time for my own personal projects and more importantly I get to spend precious time with my daughter without the chaos and stress of our normal routine.</p><p>You get to slow down.</p><p>My working days are mostly me starting the day as a drill sergeant. &#xA0;Getting the household up and out the door at high speed. &#xA0; Once we&#x2019;re out and the inevitable parting tears become inaudible, I&#x2019;m pelting down the street trying to cover a 10 minute walk to the train station in 4 minutes and in so doing set the pace for the day.&#xA0;</p><p>Work is a flurry of emails and back to back meetings, while making sure that my team&#x2019;s projects are running smoothly. &#xA0;Then, like many others, I have to do the same in reverse. &#xA0;Run to day-care trying not to be the last parent to pick up their child, get home, make dinner, coerce child into the bath and then spend an hour negotiating bedtime. &#xA0;After that, I collapse in a heap and try to keep my eyes open till an appropriate grown up bedtime, before the whole show starts again in the morning. &#xA0;Who wants that existence every day?</p><p>My non-working day allows me to spend some leisurely snuggle time with my daughter in our PJ&#x2019;s. &#xA0;We potter into the kitchen and decide what we&#x2019;ll do for the day. Every decision and moment are just ours for the whole precious day.</p><p>&#xA0;Your performance at work will improve&#xA0;</p><p>My &#x2018;day off&#x2019; gives me the chance to do other things whilst I catch my breath and reflect on the big picture. &#xA0;In an environment where days of meetings and projects blend into each other, &#xA0;the benefit of having the time to process and reflect is a significant advantage.</p><p>The prospect of a &#x2018;down day&#x2019; also improves my focus and levels of performance consistency at work. &#xA0;I can give a stellar performance for my working days knowing I have a recovery day. &#xA0;I think of it like interval training at the gym, two days hard work, one day recovery.</p><p>Plus we&#x2019;re all human, on some weeks your motivation is off and making it through the week is like wading in treacle, on those weeks a mid-week day off is like a breath of fresh air.</p><p>Of course&#xA0;nothing good comes without a trade-off; here are some of the perils to watch out for and manage...</p><p>There is a perception you&#x2019;re choosing the career slow lane.</p><p>Am I really that career orientated if I only want to work four days?</p><p>Despite being a very driven person and very career focussed, I question myself constantly. &#xA0;Am I really dedicated to advancing my career if I don&#x2019;t want to work the obligatory 5 day plus schedule required to make it to the top?&#xA0;</p><p>The pragmatic side of me says, we are in the midst of a paradigm shift and the world needs people like me who occupy that space between dedication to family and career. Trying to challenge the conventional wisdom that career advancement is ONLY gained through working a 70 hour week.</p><p>The world doesn&#x2019;t stop turning when you have a day off.</p><p>Unfortunately whilst you are having your &#x2018;day off&#x2019; the world does not stop turning. &#xA0; You will have to miss out on things and that includes; important meetings, team lunches, training days etc. &#xA0;How I manage this personally is to make a call on when/if the event is important enough to swap my day off and rearrange childcare options for that day. &#xA0;Or sometimes I&#x2019;ll try to come to a compromise by dialling in instead of attending in person. &#xA0;You have to create your own boundaries, a little reminder to colleagues is often enough to get a reschedule happening but sometimes and unavoidably, majority rules and you need to live with it.</p><p>Public holidays and peak periods can feel like an uphill struggle</p><p>Most people are hanging for a public holiday but it is with mixed feelings that they roll around for me. If a full time role in a four day week is a stretch, then doing the same in three days is breaking point! The same goes for peak work periods. &#xA0;I had the task of organising our sales kick off earlier this year and a huge event like that involves day and night preparation. &#xA0;My strategy for dealing with it is being realistic about the responsibilities and workload involved, getting support with childcare and communicating my position to the people around me at home and work.</p><p>With all that said and done, I consider working a four day week and the associated flexibility a real privilege. When I came back into the workforce after maternity leave and mulled over my options, I knew work and life wouldn&#x2019;t be the same as they were before, especially reducing my days and the perilous potential to be stuck in the slow lane. &#xA0; I can also attest that the privileges associated with my mid-week day off far outweigh the perils. &#xA0;Would I make the same choice again? &#xA0;In a heartbeat!</p><p>If you want more tips like this to help you kick butt at work and build the career you want, make sure you invest in yourself and join us for interactive sessions with networking opportunities coming up in Perth &amp; Brisbane! Bring along your resume and leave with a wealth of knowledge from our special speaker for the evening, Teagan Dowler, Founder of the Blue Collared Woman. Tickets are $20 with all proceeds donated to Our Watch. Book Perth on the&#xA0;4th October here&#xA0;and Brisbane on the&#xA0;5th October here&#xA0;(2016).</p><p><a data-cke-saved-href=\"https://bhpbilliton.webex.com/mw3100/mywebex/default.do?service=1&amp;main_url=%2Fmc3100%2Fe.do%3Fsiteurl%3Dbhpbilliton%26AT%3DMI%26EventID%3D497896682%26MTID%3Dm2137e662fd01365fca6b00a903a70a5e%26RG%3D1%26Host%3DQUhTSwAAAALLC9gHEXpLWlM7jiu9bP0zSx7825jRpI4jSw084QBpLiIwPooLBJ8_GmpUR74qgfbkUvUzamVtxv5m_fMZ5MMo0%26FrameSet%3D2&amp;siteurl=bhpbilliton&amp;nomenu=true\" href=\"https://bhpbilliton.webex.com/mw3100/mywebex/default.do?service=1&amp;main_url=%2Fmc3100%2Fe.do%3Fsiteurl%3Dbhpbilliton%26AT%3DMI%26EventID%3D497896682%26MTID%3Dm2137e662fd01365fca6b00a903a70a5e%26RG%3D1%26Host%3DQUhTSwAAAALLC9gHEXpLWlM7jiu9bP0zSx7825jRpI4jSw084QBpLiIwPooLBJ8_GmpUR74qgfbkUvUzamVtxv5m_fMZ5MMo0%26FrameSet%3D2&amp;siteurl=bhpbilliton&amp;nomenu=true\"> </a></p><p>Please note&#xA0;these events were held in 2016. To hear about our future events, sign up to our newsletter&#xA0;<a data-cke-saved-href=\"http://divercitycareers.us10.list-manage.com/subscribe?u=b7edcb910bf084d8a89d1c86f&amp;id=0f94c72711&amp;__hstc=118090006.bbb7ad751073b1abf559a8d1b3312257.1476149511249.1482093163957.1482105458949.217&amp;__hssc=118090006.3.1482105458949&amp;__hsfp=605588163\" href=\"http://divercitycareers.us10.list-manage.com/subscribe?u=b7edcb910bf084d8a89d1c86f&amp;id=0f94c72711&amp;__hstc=118090006.bbb7ad751073b1abf559a8d1b3312257.1476149511249.1482093163957.1482105458949.217&amp;__hssc=118090006.3.1482105458949&amp;__hsfp=605588163\">here</a>.</p><p><br></p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/193dd0d5-39f3-432d-8a38-25fe0910f43e.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/193dd0d5-39f3-432d-8a38-25fe0910f43e.jpeg\"></p><p><br></p><p>Originally posted on Huffington Post, the article can be viewed&#xA0;<a data-cke-saved-href=\"http://www.huffingtonpost.com/entry/the-perils-and-privilege-of-working-part-time_us_57cf463fe4b0eb9a57b6889c\" href=\"http://www.huffingtonpost.com/entry/the-perils-and-privilege-of-working-part-time_us_57cf463fe4b0eb9a57b6889c\" target=\"_blank\">here</a>.</p><p><br></p><h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development","Career Development"],"upload_date":"2016/09","associated_company":"work180"}