{"url":"https://www.work180.com.au/blog/2018/01/the-power-of-listening-to-your-own-voice-and-making-friends-with-people-who-do-things-differently","title":"The Power of Listening to Your Own Voice and Making Friends with People who do Things Differently","author":"WORK180","body":"\n\t\t\t\t\t<p>In 2017 I had the pleasure of experiencing what a real career and life rut is. At my age, 27, you might say it was like a quarter life crisis (yes, I can hear you laughing). Earlier in the year I pursued a teaching opportunity at a private language school that seemed to be exactly what I wanted-a full time, ongoing role, with many training opportunities. However, soon after I started the job, I realised that it wasn&apos;t at all what I thought it would be like. The school&apos;s management style was erratic, the work environment was very hostile and particularly difficult for a somewhat new teacher.</p><p>So, I put my health first and decided I needed to leave. This was an extremely difficult choice as although I felt like I had to do, it felt like I was a failure. It was also hard telling my friends and family who were shocked and worried about what I would do next.</p><p>And the not knowing what I was meant to do was extremely paralysing. I had always been &apos;that person&apos; who knew exactly what I was doing, why and where it would get me to. Luckily while I was figuring things out, I managed to pick up relief/substitute teaching work in primary schools to pay my rent and bills, since I was fully qualified to teach in Victoria.</p><p>For a long period of time my family, friends and colleagues kept encouraging me to apply for a school teaching role for Term 3, then Term 4 and then for 2018. And so, I went along with it, because it was easier than saying to people &quot;I don&apos;t know if I want to pursue teaching&quot;. I continued to apply for things which I didn&apos;t want to do, but thought were right for me. As a result, I got what seemed like a never ending stream of rejections. Enough to almost use as wallpaper for my bedroom. I didn&apos;t want to admit to myself that my heart wasn&apos;t in it, because I had no other tricks up my sleeve.</p><p>I was so lost and desperate to figure out what it was that I shouldn&apos;t just&#xA0;<em>do</em>, but that I would love and feel passionate about doing and where I would have a sense of purpose and fulfilment. When I told some people this, they thought I was being idealistic and that I was wasting my three qualifications in Arts (IS) and Education.</p><blockquote>I didn&apos;t want to listen to those voices, but after a while my inner voice of self-doubt took over and I started to question whether I was wrong?</blockquote><p>Thank goodness I overcame the self-doubt and decided to speak to a professional. My aunt kindly recommended a friend and brilliant career advisor. I had an hour of career &apos;therapy&apos; which was incredibly cathartic. It was the first time I had an open discussion with someone about my trajectory and expectations around work and success. My prescription, if you will, was to research the fields of PR, Communications and Marketing. I was advised not to do a long winded course, instead something to give me enough insight and credibility to enter into a new field.</p><p>I decided that Marketing interested me as it integrates many disciplines and I already had knowledge and experience as a teacher which I could transfer. Strategies I had developed in understanding human behaviour, how people learn and how to differentiate a message to different audiences I could already apply to Marketing. Through studying a Graduate Certificate in Marketing, I am getting up-to speed on the core theories and best practices used in this field. And through my own research I discovered a whole new world of tech and the many exciting tools which make up the essential ingredients used by a digital marketer.</p><p>For the first time in a long time, I regained my appetite to learn everything I can about the world that is social, content and digital marketing. And I&apos;m going on networking adventures to meet, connect with and learn from people who are the best at what they do.</p><p>I am just at the start of my journey, but one that I decided to be on. So, I wanted to share with you some powerful, inspirational and supportive women that I&apos;ve had the pleasure of meeting. They have all reminded me to shhhsh that self-doubting inner voice and remember the potential that I possess.</p><p>1. Rachel Service- Her amazing workshops have helped me to brand myself and articulate to a range of audiences who I am, what I do and what I can bring to the table.&#xA0;<a data-cke-saved-href=\"https://www.linkedin.com/in/rachelservice/\" href=\"https://www.linkedin.com/in/rachelservice/\" saprocessedanchor=\"true\" target=\"_blank\">@RachelService</a>&#xA0;<a data-cke-saved-href=\"http://happinessconcierge.com/\" href=\"http://happinessconcierge.com/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">@happinessconcierge</a></p><p>2. Penny Locaso- Her training sessions have helped me to reset my idea of the workplace and understand the changes that are, and will, continue to mould the workforce, and what we can do to ensure our happiness.&#xA0;<a data-cke-saved-href=\"http://bkindred.com.au/\" href=\"http://bkindred.com.au/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">@BKindred</a></p><p>3. Bec Thexton- Has given me some great tools to better manage my time on social media, to ensure my mental health is not compromised. I know this will be very handy when I move into digital marketing.&#xA0;<a data-cke-saved-href=\"https://www.linkedin.com/in/rebeccathexton/\" href=\"https://www.linkedin.com/in/rebeccathexton/\" saprocessedanchor=\"true\" target=\"_blank\">@BecThexton</a></p><p>3. Valeria Ignatieva- She welcomed me into a community of strong professional women who fight for fairness and equality for women in the workplace&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/\" href=\"https://www.dccjobs.com/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">@dccjobs</a></p><p>4. Valeria de Goede and Veronica Munro- Both helped me overcome my fear of the words &apos;coding&apos; and &apos;programming&apos;.&#xA0;<a data-cke-saved-href=\"https://www.linkedin.com/in/vdegoede/\" href=\"https://www.linkedin.com/in/vdegoede/\" saprocessedanchor=\"true\" target=\"_blank\">@ValeriadeGoede</a>&#xA0;<a data-cke-saved-href=\"https://www.linkedin.com/in/vmunro/\" href=\"https://www.linkedin.com/in/vmunro/\" saprocessedanchor=\"true\" target=\"_blank\">@VeronicaMunro</a><a data-cke-saved-href=\"https://www.commoncode.io/\" href=\"https://www.commoncode.io/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">@CommonCode</a>&#xA0;<a data-cke-saved-href=\"http://girlgeekacademy.com/\" href=\"http://girlgeekacademy.com/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">@Girl GeekAcademy</a></p><p>5.&#xA0;<a data-cke-saved-href=\"https://www.mollytolsky.com/\" href=\"https://www.mollytolsky.com/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">Molly Toslky</a>- She created this incredible website for women,&#xA0;<a data-cke-saved-href=\"http://www.heyalma.com/\" href=\"http://www.heyalma.com/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">Alma</a>, &quot;a publication for ladies with chutzpah&quot;, who just don&apos;t take no for an answer and who aren&apos;t afraid to tell it like it is. I&apos;m privileged that I get to contribute to this space and be a part of an awesome community of writers and readers.</p><p>6. Samantha Hurley- I had the pleasure of attending a workshop she ran at&#xA0;<a data-cke-saved-href=\"https://generalassemb.ly/\" href=\"https://generalassemb.ly/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">The General Assembly</a>&#xA0;on Digital Marketing which was a no bs, practical approach to understanding what this line of work really means.&#xA0;<a data-cke-saved-href=\"https://www.linkedin.com/in/samanthalhurley/\" href=\"https://www.linkedin.com/in/samanthalhurley/\" saprocessedanchor=\"true\" target=\"_blank\">@SamanthaHurley</a></p><p>7. Anushka Batu- I call this wonderful woman my Networking Wife. I met her at a DCC Jobs networking event and we bonded over the same struggle of being overqualified yet under recognised.&#xA0;<a data-cke-saved-href=\"https://www.linkedin.com/in/anushka-batu/\" href=\"https://www.linkedin.com/in/anushka-batu/\" saprocessedanchor=\"true\" target=\"_blank\">@AnushkaBatu</a></p><p>In the year ahead and beyond I&apos;ve set these goals for myself;</p><ul><li>I want to embrace the&#xA0;<a data-cke-saved-href=\"https://www.ted.com/talks/brene_brown_on_vulnerability?utm_campaign=tedspread--b&amp;utm_medium=referral&amp;utm_source=tedcomshare\" href=\"https://www.ted.com/talks/brene_brown_on_vulnerability?utm_campaign=tedspread--b&amp;utm_medium=referral&amp;utm_source=tedcomshare\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">power of vulnerability</a>&#xA0;and get comfortable speaking in public settings as opposed to the confines of my key board. I know I&apos;ll have a pretty good opportunity when I MC my brother&apos;s wedding in February. Eeeek!</li><li>I want to overcome those feelings of inadequacy or&#xA0;<a data-cke-saved-href=\"https://www.forbes.com/sites/moiraforbes/2017/09/13/the-one-thing-you-need-to-do-to-shut-down-impostor-syndrome/#773435b12fe7\" href=\"https://www.forbes.com/sites/moiraforbes/2017/09/13/the-one-thing-you-need-to-do-to-shut-down-impostor-syndrome/#773435b12fe7\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">imposter syndrome</a>, which creep up on me when I&apos;m feeling flat.</li><li>I want to develop the skills to better express myself more confidently when something doesn&apos;t feel right to me, especially in my professional life but equally in my personal life too.</li></ul><p>I&apos;m happy to report that I landed my first gig as a Marketing Assistant at an edu/tech start-up. FINALLY I was heard and acknowledged for the true person that I am. Watch this space!</p><h4><strong>About WORK180</strong></h4><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/01","associated_companies":["work180"]}