{"url":"https://www.work180.com.au/blog/2017/10/female-leaders-sharon-kinchela-and-chris-figg-founders-ngiyani","title":"The Journey to Leadership: Sharon Kinchela & Chris Figg, Founders Ngiyani","author":"WORK180","body":"\n\t\t\t\t\t<p>Sharon Kinchela and Chris Figg are Co-Founders and Directors of&#xA0;<a href=\"https://www.ngiyani.com/\" rel=\"noopener\" target=\"_blank\">Ngiyani,</a>&#xA0;meaning &#x201C;We all&#x201D;. Ngiyani provides management consultancy services to individuals, communities, and businesses to equip them to engage in a culturally competent way with Aboriginal and Torres Strait Islander people, to provide pathways to economic independence.</p>\n\n<p>The duo have a formidable portfolio of combined expertise, forged during 20 plus year careers served at senior leadership levels across corporate, public sector and non-government organisations. Sharon is currently Project Manger for Kambu Aboriginal and Torres Strait Islander Corporation for Health, and an Education Advisory Board member University of Southern Queensland. Her previous roles have included Partnerships Service Manager Red Cross, Regional Director for Department of Communities, Child Safety &amp; Disability Services and Ministerial Policy Advisor to the Minister for Housing &amp; Homelessness, Community Services &amp; Minister for Women.</p>\n\n<p>Chris&#x2019;s background is as a qualified Solicitor, admitted to the&#xA0;Supreme Court of Queensland and to the High Court of Australia. After working in private legal practice, she transitioned to the public sector assuming increasingly more senior roles across departments within the Queensland Government, including Natural Resources and Mines,&#xA0;Communities, Child Safety &amp; Disability Services and Office for Women.</p>\n\n<p>Their passion for supporting culturally appropriate methods of empowering Aboriginal and Torres Strait Islander is complemented by their leadership experience, commercial acumen, and their vast network of relationships across Queensland.</p>\n\n<blockquote>\n<p>In agreeing to share their journey to leadership, Sharon and Chris are consciously stepping outside a strongly held cultural norm that values humility in leaders and eschews tall poppies. They have chosen to do so as a clarion call and role model to other strong female leaders within their community to follow suit, so that stories of Aboriginal and Torres Strait female leaders are widely understood, recognised and celebrated.</p>\n</blockquote>\n\n<p>Their heartfelt words, and the warm and graceful way in which they share their personal stories of leadership offered for me an insight into their understated approach. Their demonstrated leadership style is to tread lightly, with inclusion, high emotional and cultural intelligence, respect and deep empathy, harnessing the collective wisdom.</p>\n\n<h4><strong>HOW DOES NGIYANI HELP BUSINESSES TO IMPROVE THEIR CAPACITY AND CAPABILITY TO EFFECT SOCIAL CHANGE IN THE LIVES OF ABORIGINAL AND TORRES STRAIT ISLANDER PEOPLE?</strong></h4>\n\n<p>Sharon:</p>\n\n<p>Ngiyaningu maran yaliwunga ngarra-li.&#xA0;(our ancestors are always watching). I will always walk gentle on mother earth and follow the footprints of my ancestors. In order to do this, I honour my ancestors and need to walk in balance &#x2013; with my head and heart connected.</p>\n\n<p>I am a grassroots and very simple woman. A proud Gamilaroi woman, a sister, mother and grandmother to many. My vision has been to empower Aboriginal and Torres Strait Islander individuals, families and communities to take their rightful place in Australia. And, whatever that may look like has to be determined by the people themselves, my people.</p>\n\n<p>My life&#x2019;s work has been about reconciliation, I believe that recognition and respect will only come for the first people when wider Australia are taught the true history of our nation&#x2019;s history. There is a need to acknowledge and accept it and work at the root cause to address intergenerational challenges that we see as a result in today&#x2019;s society; however, investment has to be with a genuine heart. Only then&#xA0;<em>ngiyani&#xA0;</em>&#x2018;we all&#x2019; can move forward as a nation. This is at the heart of our economic freedom.</p>\n\n<p>Social change will come, I have no doubt of that. However today in 2017, there still exists huge gaps in all socio-economic indices between the Aboriginal and Torres Strait Islander people and the wider Australia population. It appears to me that these gaps exist for a number of reasons.</p>\n\n<p>One in particular is due to multifaced complex levels of racism and fear perpetuated by sensational media stories and images. Also, government agency continues to exclude our Leaders (male and female) from the decision-making table and large corporates and business sector have not had either the courage nor &#x2018;know how&#x2019; to address these challenges. This will take a genuine and holistic concerted effort, at all levels of our society, with the Aboriginal and Torres Strait Islander people truly empowered to lead the change. Ngiyani Pty Ltd has been established specifically to address some of these very challenges.</p>\n\n<p>Our business offers two-way learning to equip corporate and business with the tools required to work towards changing the status quo.&#xA0;<a href=\"https://www.ngiyani.com/\" rel=\"noopener\" target=\"_blank\">Ngiyani</a>&#xA0;has a vision to specifically empower individuals, families, organisations and communities to enhance their capability and financial independence. By utilising the&#xA0;<em>NgiyaniDTSM&#xA0;</em>&#x2018;Don&#x2019;t Tell me &#x2013; Show Me&#x2019; approach, businesses opt in to organisational development that will increase their cultural capabilities to work with and conduct business that allows Aboriginal and Torres Strait Islander people to sit as equals in all deliberations.</p>\n\n<p>Chris:</p>\n\n<p>I often find myself thinking these days in business meetings and other discussions, particularly with other black entrepreneurs that&#xA0;<a href=\"https://www.ngiyani.com/\" rel=\"noopener\" target=\"_blank\">Ngiyani</a>&#xA0;are supporting from start-up, that&#xA0;you simply cannot put a dollar price on FAITH, HOPE and LOVE.</p>\n\n<p>At Ngiyani we really are a family business. I have walked with my business partner, Sharon for many many years! When I first Sharon she didn&#x2019;t even say hello, she said, &#x201C;I have been waiting for you&#x201D;. I always believe we have walked together in past lives.</p>\n\n<p>We built our business on the values of Cultural Integrity, Social Justice, and Truth, Honesty and Respect. That has a lot to do with how we walk in this life and how we practice our work and have engaged with others in our many business roles over the years.&#xA0;</p>\n\n<blockquote>\n<p>As strong female leaders, we both have oodles of work experience combined that&#x2019;s for sure, with strong networks and connections. When we established Ngiyani there were so many women in our current network and circle who applauded our initiative as women to go out on our own and set the company up. While it has been humbling to receive such positive affirmations, I suppose it is that shared sisterhood that underlies that sentiment. So as a black female business start-up we have empowered others, particularly women, to think&#xA0;<em>You Can Do It</em>.</p>\n</blockquote>\n\n<p>More broadly our work at Ngiyani to date has shown that capacity building is the key to all good business, including black business. So we have called ourselves capacity building consultants, as our vision at Ngiyani that is that individuals, communities, and business are supported through the provision of excellent consultancy services so as to ensure they can engage in a culturally competent way with Aboriginal and Torres Strait Islander people to empower their economic independence.</p>\n\n<p><a href=\"https://www.ngiyani.com/\" rel=\"noopener\" target=\"_blank\">Ngiyani&#xA0;</a>Pty Ltd has three key product offerings which are embedded in honouring our cultural ways of knowing, being and doing business. One of those is the Doing or as we refer to it&#xA0;<em>NgiyaniRISE</em>&#xA0;&#x2013; Respecting Indigenous Social Enterprise &#x2013; which is about the attraction of investment to build capacity with individuals, families and communities to establish small business and social enterprises for economic independence and financial&#xA0;security.</p>\n\n<p>We only started-up this year but only in the space of&#xA0;<em>NgiyaniRISE</em>&#xA0;have we been truly blessed to support and see other black entrepreneurs set up their own businesses. We have walked with them and I return to my original statement you cannot put a dollar price on faith, hope and love.&#xA0; Starting a business can be filled with fear and doubt. Ngiyani have provided that solid leading hand walking with them, and with courage walking through the fear together. This is what I see as affecting social change.</p>\n\n<h4><strong>AS TESS RYAN REPORTED ABORIGINAL WOMEN &#x201C;GET THINGS DONE.&#x201D; WHAT ARE SOME OF THE ACHIEVEMENTS OF ABORIGINAL WOMEN LEADERS YOU WOULD LIKE TO SHARE?</strong></h4>\n\n<p>Sharon:</p>\n\n<p>Australia needs to recognise the cultural distinction and diversity between and within Aboriginal and Torres Strait Islander nations. Therefore as an Aboriginal woman, I can only share from my perspective. It is important that Australia as a nation, understand the difference between both cultures and does business in accordance to the protocols and cultural practice within each.</p>\n\n<p>The ability to navigate and manage in two worlds through their everyday life, work and lead extremely successful businesses and also maintain community leadership and sustain their cultural obligation in accordance with their family responsibility. This is seen across many Aboriginal communities in Australia. Aboriginal women in leadership roles, whether that be community, professional or business are not profiled enough! Our women do not necessarily see that they are doing anything exceptional, just that they have a cultural obligation to do or responsibility for, and they do this with humility and dignity.</p>\n\n<blockquote>\n<p>Aboriginal women are achieving amazing outcomes on all levels, but in particular health and social wellbeing, and this is evident with increases in the number of female doctors and psychologists.</p>\n</blockquote>\n\n<p>Chris:</p>\n\n<p>I am still on a journey learning more about my own identity and culture (which is precious to me as a human being). I&#x2019;m constantly surrounded and am therefore blessed in particular by the strength of Aboriginal women getting things done. I have an abiding admiration for the strength and wisdom of my current business partner Sharon Kinchela. A consummate professional facilitator, I have seen her walk into facilitations both at the grassroots level to the completely other end of the scale with big business corporates and it is like 65000+ years of culture and wisdom just walked in the room.</p>\n\n<p>Our words have the power to influence individuals, families, communities and countries! I derive a lot of my strength from the Aunties. I am often reminded of&#xA0;<a href=\"http://www.austlii.edu.au/cgi-bin/viewdoc/au/journals/IndigLawB/2004/21.html?context=1;query=Jackie%20Huggins\" rel=\"noopener\" target=\"_blank\">quote by a wonderful Aboriginal female leader,&#xA0;</a>Dr Jackie Huggins, wherein she says &#x201C;The reality of being a leader is not necessarily about earning big money or being recognised on the street. And this is particularly true of our women leaders, many of whom work tirelessly, thanklessly, behind the scenes to make their communities healthy&#x201D;</p>\n\n<p>I don&#x2019;t know how many times I have been in my community or other Aboriginal communities where I have been inspired and blessed to be in the presence of strong community women. I just heard from a female Elder in my Ipswich community the other day who provided the most defining speech in front of a room full of dignitaries and others at a Launch event that just moved me and most others to tears. I&#x2019;ll never forget that address, so moved was I because it in part addressed tackling violence in our community, that I just went over to hug her.</p>\n\n<p>I couldn&#x2019;t thank her enough for speaking those words particularly in front of the politicians assembled, they had to hear them. This Elder was humble of course when I reached her in the crowd. Her speech, her words, was just part of her doing. So I draw strength from this Aunt, and many other strong women and remain respectfully always in awe of how they just get on and get things done without seeking out glory and big noting themselves to others. They just DO and DO WELL. That is why in part our culture is as strong as it is today.</p>\n\n<h4><strong>HOW WOULD YOU LIKE TO SEE AUSTRALIA CELEBRATE THE ACHIEVEMENTS OF ABORIGINAL WOMEN?</strong></h4>\n\n<p>Sharon:</p>\n\n<p>Just the mere fact that we, as Aboriginal women have survived in this country for more than 65,000 years needs to celebrated! Aboriginal women are blessed with the teachings and essence of a beautiful culture, that needs to be shared and celebrated.</p>\n\n<p>It is important that we acknowledge and pay homage to the women that have lead the way, through much adversity, which has allowed Aboriginal women today, to step up even further in Australia. There are so many women who led the struggle for equal rights for our people. Such as Faith Bandler, Essey Coffee, Mum Shirl, Oodgeroo Nunukle for the right to vote, access to education, quality health care and equality in pay etc. This has allowed the next generation of women to push the envelope even further like we see today in Magistrate Pat O&#x2019;Shane, author and historian, Jackie Huggins OAM, Senator Linda Burney, Minister Leeanne Enoch and Olympian Cathy Freeman and the list goes on. These are the women who are profiled, however every community has Elder Clan women and leaders who also duly need to be recognised.</p>\n\n<blockquote>\n<p>We carry the cultural responsibility and obligation of our families and for me it is no different. My Aunties Marcella and Margaret Kinchela carved a path for me as I now do for my daughter Laurie-anne and nieces, and so it goes on in every family. No different to other women, right? So why do we not see Australia celebrating the achievements of Aboriginal women? Maybe it&#x2019;s not newsworthy, or the positions of power need to be reversed.</p>\n</blockquote>\n\n<p>I see these achievements every day in every family and every community. I would like Australia to see and listen to these achievements through our lens with their ears, eyes and from their heart.</p>\n\n<p>Chris:</p>\n\n<p>Simple answer, like all others, with a genuine intent and no hint of tokenism. I suppose you could look at it this way, Aboriginal women have been leading for over 65,000 years, so from a point of experience maybe they have the advantage? All strong Aboriginal leaders, both male and female, work from humility. There is no big noting or talking yourself up. You just get on and do it. If you do big note yourself your mob will soon bring you back down to reality! Humble strong leadership is done, for family, community and the advancements of our mob.</p>\n\n<h4><strong>WHAT ARE SOME OF THE SKILLS WE CAN LEARN FROM ABORIGINAL LEADERS THAT WILL HELP US MOVE FORWARD TOGETHER IN SOCIETY?</strong></h4>\n\n<p>Sharon:</p>\n\n<p>Survival skills would be top of the list. To push through the negative belief and the deficient thinking of how people see you, from the preconceived notions of how we are supposed to behave and act. These skills are a gift to wider Australia, however for this to occur there needs be an awakening of the hearts and minds of people, in order to receive them in a good way.</p>\n\n<p>A deeper understanding of own&#xA0;<em>spiritual beliefs systems&#xA0;</em>and our lessons contained in the cultural ways of knowing, being and doing. You can&#x2019;t put an economic price on it.</p>\n\n<p>NgiyaniLEAD is specifically about changing and challenging these concepts therefore we are advocating for recognition of Aboriginal and Torres Islander Leadership. This can occur through the business and corporate if there is a preparedness to invest the Aboriginal and Torres Strait Islander business.</p>\n\n<p>Chris:</p>\n\n<p>Three key skills really, humility, compassion and altruism. It&#x2019;s not about you it&#x2019;s about your peoples&#x2019; advancement and the survival of cultural ways. I suppose these days this would be described as the quintessential EQ in leadership.</p>\n\n<h4><strong>WHAT HAS BEEN YOUR GREATEST CHALLENGE?</strong></h4>\n\n<p>Sharon:</p>\n\n<p>I have faced many challenges in my personal life that have moulded and shaped my reality to date. There have been times where I experienced unwarranted discrimination, abuse and assumptions of who I am and how I should be.</p>\n\n<p>My greatest challenge has been and still is, is how to use the bricks that others have thrown at me to build a strong foundation with those very bricks; working at a human level and with love for all human beings. This takes strength, courage and tenacity to keep working for social change for our people to take our rightful place in Australian society.</p>\n\n<blockquote>\n<p>I have worked tirelessly to bring about change in attitude to the Aboriginal and Torres Strait Islander people. And will continue to do so.</p>\n</blockquote>\n\n<p>Chris:</p>\n\n<p>From a business context, managing uncertainty.</p>\n\n<h4><strong>WHAT ARE YOU MOST PROUD OF?</strong></h4>\n\n<p>Sharon:</p>\n\n<p>Being an Aboriginal woman. We are family people. My family are my strength for all that I am and all that I do. I would not have been able to accept the opportunities offered to me without my sister, Deborah who has always been there, and furthermore if I had not had the support of my children.</p>\n\n<p>I am proud to have such an amazing business partner in Chris Figg who I trust with my life. Together we have been blessed to lead by example for other Aboriginal women to stand up and shine, which takes much courage, as this is not our way.</p>\n\n<p>Chris:</p>\n\n<p>Easy, my son. Business comes a distant second. Family, including the sisterhood shared with my current business partner and other strong women in my circle.</p>\n\n<h4><strong>WHAT IS ONE PIECE OF ADVICE FOR FUTURE FEMALE LEADERS?</strong></h4>\n\n<p>Sharon:</p>\n\n<p>Keep it real, stay true to yourself and never compromise on your cultural integrity.</p>\n\n<p>Chris:</p>\n\n<p>I always say, and many I have lead will remember this quote, FEAR is a big fat four letter word starting with &#x201C;F&#x201D;. You have to walk through it to evolve. Have courage and faith and squash self-doubt when it creeps in, although that is easier said than done. Your leadership is a practice and you have to be consistent. Practice good leadership every day. If you have a bad day, dust yourself off, and try again the next. You will be letting yourself down most if you don&#x2019;t.</p>\n\n<p><em>This story was originally published by <a href=\"https://femeconomy.com/female-leaders-sharon-kinchela-chris-figg-founders-ngiyani/\" target=\"_blank\">Femeconomy.</a></em></p>\n\n<h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\"><strong style=\"box-sizing: border-box;\">About Femeconomy</strong></h4>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif; text-align: center;\"><a href=\"https://femeconomy.com/submit-a-brand/\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/6f76a4cc-ab81-479a-999f-7c5c4b7e7ecb.jpeg\" style=\"box-sizing: border-box; border-width: 0px; border-style: initial; vertical-align: middle; max-width: 100%;\"></a><br style=\"box-sizing: border-box;\">\n&#xA0;</p>\n\n<h4 style=\"box-sizing: border-box; font-family: Lato, sans-serif; line-height: 1.1; color: rgb(169, 126, 179); margin-top: 10px; margin-bottom: 10px; font-size: 18px;\"><strong style=\"box-sizing: border-box;\">About DCC Jobs</strong></h4>\n\n<p style=\"box-sizing: border-box; margin: 0px 0px 10px; font-size: 1.6rem; font-family: Lato, sans-serif;\">DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"www.dccjobs.com/clients\" style=\"box-sizing: border-box; background: transparent; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease;\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;<span style=\"font-family: Lato, sans-serif; font-size: 16px;\">Set up your job alert with&#xA0;</span><a href=\"https://www.dccjobs.com/users/login\" style=\"box-sizing: border-box; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial; color: rgb(238, 76, 155); text-decoration-line: none; transition: all 0.3s ease; font-family: Lato, sans-serif; font-size: 16px;\">1 click</a><span style=\"font-family: Lato, sans-serif; font-size: 16px;\">&#xA0;now.&#xA0;</span></p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/10","associated_company":"work180"}