{"url":"https://www.work180.com.au/blog/2016/05/the-future-of-parental-leave","title":"The Future of Parental Leave","author":"WORK180","body":"\n\t\t\t\t\t<p>Mother&#x2019;s Day this month gave us cause to stop and recognise the wonderful female carers in our lives. Yet as thousands of pairs of fluffy slippers were unwrapped across the country, you&#x2019;d be forgiven for pausing to consider what it is that Australian working mums actually need most.</p>\n\n<p>There is no shortage of data to quantify the gap between women and men at work. While women make up nearly half (46%) of the workforce and are on average more educated, they fill only 23% of director positions, 15% of CEO roles and experience a gender pay gap in average weekly earnings of 17.3%. When you consider only the full-time annualised total remuneration (salary + super + bonus) of people in non pubic sector organisations with more than 100 employees, the gap widens to 24%. At retirement, average superannuation balances for women are 53% less than those for men.</p>\n\n<p>Despite the considered efforts around reporting, targets and affirmative action, we are not seeing the change aspired. EY&#x2019;s recent data suggests we&#x2019;ve actually gone backwards in the last couple of years, estimating at our current rate of progress, it will take more than 117 years to achieve gender parity.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Why the gap? </strong></p>\n\n<p>Women taking time out of the workforce to start a family is, as you may expect, a contributing factor. While nature necessitates that mums play a critical part in parenting, our policies and practice often disincentivise dads to share the load. Less than 40% of organisations provide secondary carer&#x2019;s leave and of those that do, it&#x2019;s often five days. The result serves to compound the stereotypes we hold around the roles of women and men at work and home and feed unconscious biases that can inhibit the progress of women.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>What can we do? </strong></p>\n\n<p>While there&#x2019;s no silver bullet, one of the best ways we can reduce the workplace impacts on working mums is to un-gender the role of primary care givers and extend parental entitlements to mums and dads in equal measure. If secondary care givers are incentivised (i.e. receive paid leave of equal proportion) to take on the role of primary care giver, we will of course see parenting shared more equally and normalise the practise of both genders taking time away from the workplace to start and raise a family. Creating a culture where work inside and outside the home is shared more equally is pivotal to unwinding the biases we hold around gender, work and parenting.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>The way forward</strong></p>\n\n<p>The future of parental leave is offering all parents the same entitlements to care for their children. The pendulum of equality must swing both ways and provide (and encourage!) men with the same opportunity to raise their children. After all, they&#x2019;re parents too.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Businesses leading the charge</strong></p>\n\n<p>There&#x2019;s some sensational organisations already recognising the benefits of enabling both parents to take time out to parent.</p>\n\n<p>National Australia Bank offers 12 weeks paid primary carers leave to both parents which can be taken at any time during the first 12 months of a child&#x2019;s life.</p>\n\n<p>Aurizon recently launched their shared care scheme, incentivising partners who take on the role of primary carer for between 13-26 weeks with half pay for the period. If a mother returns to work at Aurizon and her partner (who works elsewhere) takes unpaid leave of 13-26 weeks to take on the primary care giving role, &#xA0;the mother receives 150% of her salary for the duration.</p>\n\n<p>Silicon Valley is fast becoming a hotspot for progressive parental leave, a happy result of their local war for talent. Facebook now offers all new parents up to 4 months paid leave. Etsy offers both parents 6 months paid leave. Netflix are leading the pack with up to 12 months paid leave for both parents. These offerings all apply to adoptive parents too.</p>\n\n<p>As policy makers in government and business well know, no change is without challenge. Yet if we genuinely want to see gender parity in less than a century, this is an enormous step in the right direction.</p>\n\n<p>&#xA0;</p>\n\n<p>Originally posted on&#xA0;<a href=\"http://thediversityagenda.com/\" target=\"_blank\">The Diversity Agenda.</a>, this article&#xA0;can be viewed <a href=\"http://thediversityagenda.com/working-mums/\" target=\"_blank\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/05","associated_company":"work180"}