{"url":"https://www.work180.com.au/blog/2018/07/the-evolution-of-optus-cycling-culture","title":"The evolution of Optus’ cycling culture","author":"WORK180","body":"\n\t\t\t\t\t<p>I&#x2019;ve been with Optus for over 13 years and I&#x2019;ve seen some incredible changes. But the one thing that&#x2019;s always been consistent is my passion for cycling.</p>\n\n<p>Today I am an IT Asset and Configuration Manager, and I was one of the original IT crew to move to the new Macquarie Park campus from our North Sydney office in 2007. In fact, I was the first person to start at our on-site gym!</p>\n\n<h4><strong>My cycling journey</strong>&#xA0;</h4>\n\n<p>I&#x2019;ve pretty much cycled my whole life, I&#x2019;m a kiwi. My riding really changed after participating in my first Tour de Cure in 2011 (a national cycling event to fundraise money for cancer projects) with a group of Optus cyclists. This endurance event is bigger than anything I&#x2019;ve done before. Each year it&#x2019;s slightly different, and training typically takes a minimum of 3 months. This year, it&#x2019;s a 9-day event and we&#x2019;ll have the biggest team we&#x2019;ve ever had; 13 full tour riders, 9 stage riders, and 2 support crew, all from Optus. We start in Mackay, head to Cape Tribulation then to Cairns visiting regional communities &amp; school children along the way.</p>\n\n<p>Over the years, the Tour de Cure group continued to train for various cycling events, but it became evident that it was more suited for skilled cyclists and wasn&#x2019;t inclusive for recreational riders. As such, in 2017, I was inspired to create a second cycling group that appealed to more everyday riders, some of which are taking on the challenge of Tour de Cure.</p>\n\n<h4><strong>Optus&#x2019; involvement&#xA0;</strong></h4>\n\n<p>Our cycling programs are all employee-led, but Optus has been extremely supportive in many ways.<br>\nFor example, at our Macquarie Park campus, we have:</p>\n\n<ul>\n\t<li>Parking for over 300 bicycles</li>\n\t<li>88 showers</li>\n\t<li>Over 2,000 lockers</li>\n\t<li>On-site bicycle servicing...&amp; great coffee!</li>\n</ul>\n\n<p><em>I guess you could say we&#x2019;re pretty spoiled.</em></p>\n\n<p><em>&#x2026;and that&#x2019;s why Tuesdays are epic&#xA0;</em><br>\n<br>\nEvery Tuesday, about 12-14 employees hop on their bikes and meet at our Macquarie Park campus for a 6:00 a.m. start. Talk about commitment! We head over to Lane Cove National Park. On average, most people end up cycling 35-45 km. This ride is open to all riders and abilities &#x2013; as long as you have a bike.</p>\n\n<p>One story I&#x2019;ll always remember is when an employee showed up alone, with a heavy, old bike. I could tell she was quite new to cycling so I rode with her. To get to Lane Cove National Park, it&#x2019;s quite hilly, and she walked up every hill. She was well behind the fitness ability of everyone else, but that didn&#x2019;t stop her. The following week, she came back and rode up the hills instead of walking. Plus, she brought a friend. She also had a new bike. Today, she&#x2019;s completed a few endurance rides and continues to inspire me. That&#x2019;s why I love cycling, it&#x2019;s got a great sense of community.</p>\n\n<h4><strong>Safety matters</strong></h4>\n\n<p>When we go out on our rides, most employees wear the Optus cycling kits meaning we look like we&#x2019;re part of a pack. We ride together, follow the road rules, and all have insurance.</p>\n\n<h4><strong>The friendships make it all worth it</strong></h4>\n\n<p>Our programs are wholesome, we laugh a lot. I&#x2019;m in IT, I wouldn&#x2019;t normally meet many people across the&#xA0;organisation&#xA0;but I&#x2019;ve met so many people from all over the business. It&#x2019;s certainly made my career more interesting. I&#x2019;m also proud that this has given me the opportunity to role model health and fitness across Optus.</p>\n\n<p>After our rides, we come back and have a coffee together. The endorphins (and caffeine) are such a great way to start my workday.</p>\n\n<p>If you&#x2019;re interested in getting into cycling&#x2026;<br>\nHead to your local bike shop, most of them are connected to a bicycle group. That&#x2019;s probably a good place to start.</p>\n\n<h4><strong>In case you need reminding:</strong></h4>\n\n<ul>\n\t<li>It&apos;s inexpensive - avoid rising petrol costs and tolls</li>\n\t<li>It&apos;s fun and relaxing - avoid the stress of traffic congestion</li>\n\t<li>It&apos;s convenient - leave home when you want without the hassle of timetables</li>\n\t<li>It&apos;s healthy - great way to integrate exercise into your daily life</li>\n\t<li>It&apos;s good for the environment - you can do your bit to reduce congestion and CO2 emissions</li>\n\t<li>It&apos;s quick - it may actually be faster than driving or travelling by bus or train, especially for short trips.</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<p><em>See you out there, cyclists!</em></p>\n\n<hr>\n<h4 style=\"font-family: Lato, sans-serif;\"><strong>About Optus&#xA0;<a href=\"https://www.work180.com.au/clients/optus\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" style=\"float: right; margin: 10px; width: 300px; height: 60px;\"></a></strong></h4>\n\n<p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p>\n\n<p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page&#xA0;<a href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p>\n\n<p>Browse jobs with Optus and apply&#xA0;<a href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p>\n\n<hr>\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3>\n\n<p>WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/07","associated_companies":["work180"]}