{"url":"https://www.work180.com.au/blog/2017/02/the-power-of-no","title":"The Power of “No”","author":"WORK180","body":"\n\t\t\t\t\t<p>I was recently listening to Daniel Priestley, the Australian Author and Entrepreneur, he was sharing his philosophy on the &#x201C;Power of no&#x201D;. &#xA0;</p>\n\n<p>He opened by reminding us, (those who are old enough) that in the 1970&#x2019;s Manhattan Night Club Studio 54 would rather than an empty nightclub than one filled with the wrong people. &#xA0;They were the first club that famously turned people away for not being glamorous enough.</p>\n\n<p>It made me think about how powerful&#xA0;the word &#x201C;no&#x201D; can be (and should be) in our own lives. &#xA0;Are we not staying true to our own value and filling our lives (like the night club) with the wrong things instead of only allowing in the things that meet with our values?</p>\n\n<p>We are so used to saying yes, yes, yes to everything. &#xA0;</p>\n\n<p>Yes to staying late at work, yes to accommodating a friend of a friend, yes to being on the school committee, yes to joining the gym - it goes on and on. We are pressured by outside forces to continually say yes. &#xA0;Most of the time we say yes in order to please others - not ourselves - or to be compliant. Often with the closing phrase &#x201C;whatever will keep you quiet&#x201D;. &#xA0;</p>\n\n<p>But how does this continual stream of &#x2018;yes&#x2019;s&#x2019; fit in with your values? &#xA0;Have you really thought about it?</p>\n\n<p>I value my family so &#x2018;no&#x2019; I won&#x2019;t stay late at work</p>\n\n<p>I value my weekends so no I cannot have your friend stay this weekend</p>\n\n<p>I value my children but no I cannot be part of the school committee - I can find another way to help</p>\n\n<p>I value my health but no I don&#x2019;t want to join a gym, I would prefer yoga.</p>\n\n<p>Are you being true to your own values by agreeing to things that don&#x2019;t necessarily match them?</p>\n\n<p>I can hear you now - easy for you to say - I could lose my job or my friend may not like what I have to say&#x2026;.</p>\n\n<p>Let&#x2019;s look at this from another angle. &#xA0;Where else is no frequently said and you think nothing of it or perhaps even expect it.</p>\n\n<p>Priestly reminds us that business we consider to be the best in their industry are able to say no and still maintain their reputation and popularity. The best restaurants say no to a reservation if they are fully booked. They don&#x2019;t want to add extra tables because their value is an elegant dining experience. &#xA0;The best fashion houses will say no to a jacket that doesn&#x2019;t look right on you because they value their fit and tailoring,&#xA0;the best companies say no to outstanding job applicants because they value their clients and team, investors will be turned away if their offer just doesn&#x2019;t feel right and so forth. &#xA0;These companies are upholding their values and are not being punished for it. &#xA0;They say no when they are asked to compromise.</p>\n\n<p>How often do you say yes even though it just doesn&#x2019;t feel right. &#xA0;How strongly are you holding to your own values? &#xA0;What are you compromising each time you say yes instead of no.</p>\n\n<p>Remember only the best will say &#x2018;no&#x2019;. &#xA0;Be the best. &#xA0;It means getting clear on your values and being brave enough to say N.O.<br>\n<br>\nTo learn more about the services&#xA0;<a href=\"http://www.diversecitycareers.com/page/partner-network/professional-development-services/the-concierge-collective/\">CONCIERGE COLLECTIVE</a>&#xA0;offer and your exclusive DCC discount click&#xA0;<a href=\"http://www.diversecitycareers.com/page/partner-network/professional-development-services/the-concierge-collective/\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/02","associated_company":"work180"}