{"url":"https://www.work180.com.au/blog/2016/06/the-roles-we-can-play-in-making-flexible-working-the-norm","title":"The Roles We Can Play in Making Flexible Working the Norm","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;This post was originally published on <a href=\"https://dropeverything.com.au/post/roles-we-can-play-making-flexible-working-norm\">Drop Everything.</a></p>\n\n<p>Through DCC Jobs, we have many conversations about flexibility with both corporate clients and job seekers. Most companies we come across are focused on achieving that perfect balance of the right policy, getting staff (in particular men) to adopt flexible working and creating a culture where working outside the traditional hours is not frowned upon.</p>\n\n<p>Of course not every role can be flexible, and some people enjoy the routine of going to the same place, at the same time every day. Personally, I&#x2019;m a nomad and thrive in conditions others may find too irregular for their liking. Most days you&#x2019;d find me working from caf&#xE9;s and co-working spaces - put me in a &#x2018;standard&#x2019; office and watch me wither!</p>\n\n<p>DCC Jobs clients provide a range of flexibility options even in some of the most &#x2018;inflexible&#x2019; roles. For example, Origin modifies plant operator rosters and Unitywater has some unique job-sharing scenarios.</p>\n\n<p>We won&#x2019;t bore you with tonnes of research because as we all know, there&#x2019;s yet to be a study to come out pointing to the benefits of chaining staff to their desks.</p>\n\n<p>Based on our experience, three types of people can play the biggest part in influencing and creating positive change when it comes to shifting our mindsets on what &#x2018;normal&#x2019; working looks like.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>The senior leader</strong></p>\n\n<p>Without senior role models for flexible working, you can forget about high adoption rates. The most productive companies report managers being vocal about leaving &#x2018;early&#x2019; &#x2013; this in turn makes others comfortable to work in the way that gets the best results for both individuals and the business.</p>\n\n<p>Charlie Wood, Managing Director for Australia and New Zealand at Dropbox, is a great example of leading from the top.</p>\n\n<p>&#x201C;Trust, flexibility, and mobility are central to our company and employee values. I live an hour or so away from the office with three young kids, which means I&#x2019;m able to work from home when I need to in order to fit into my family&#x2019;s schedule,&#x201D; said Charlie.</p>\n\n<p>One of the most impactful perspectives I&#x2019;ve heard lately was from Dean Robertson, CEO at Mexia. We were discussing flexible working while checking out Mexia&#x2019;s new website, when I commented on one particular photo on the team page, of Mexia&#x2019;s QLD Practice Lead.</p>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p>&#x201C;That&#x2019;s Julia - who is absolutely awesome,&#x201D; remarked Dean.</p>\n\n<p>&#x201C;If it wasn&#x2019;t for flexibility, we wouldn&#x2019;t have Julia with us!&#x201D;</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p><strong>The recruiter</strong></p>\n\n<p>Just the other day, I discussed this topic with Martha Creedon, a Technology Recruitment Specialist at REA Group over lunch. Martha&#x2019;s view is that diversity and flexible working is on every organisation&#x2019;s agenda to attract top talent, but not every organisation is set up to make it successful. This makes the job application and recruitment process overwhelming for the candidate who worry about things like;</p>\n\n<ul>\n\t<li>How do I really know if I will be set up to be successful in the new role?</li>\n\t<li>Will there be eyebrows raised in office when I need to work from home to care for a sick child?</li>\n\t<li>Will peers question to why I&#x2019;m are only working 4 days a week when the rest of team are doing overtime?</li>\n</ul>\n\n<p>&#x201C;In my opinion, it&#x2019;s up to the recruiter to educate and make this a seamless process for the candidate,&#x201D; said Martha.</p>\n\n<p>&#x201C;Are we setting the scene in the initial screening interview? It&#x2019;s important to leave bias at the door and ask the candidate what is important to them and why. We should never assume that every female wants to work part time or that a millennial wants to work hard and party hard. I believe the role of a true recruiter is to tap into that psyche at the start, and continually build that rapport throughout the process.&#x201D;</p>\n\n<p>Martha&#x2019;s advice is to set the seed early. The candidate does not make up their mind when they receive that nice juicy offer. It&#x2019;s usually at interview stage, when they weigh up pros and cons of the opportunity. If there is no education and real examples to why this is a great opportunity or organisation, you are likely to lose this candidate.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>The candidate</strong></p>\n\n<p>As hard as it is to bring up flexibility in the interview process, it must be done. While we don&#x2019;t suggest you blurt it out in the first few minutes of the interview, don&#x2019;t act like you don&#x2019;t deserve the role because you require flexibility.</p>\n\n<p>First of all, demonstrate the value that you will bring and enquire how the company approaches flexibility and discuss how you&#x2019;re most productive at work.</p>\n\n<p>&#xA0;</p>\n\n<p>I&#x2019;ve lost count on how many times I&#x2019;ve heard comments like:</p>\n\n<p>&#xA0;</p>\n\n<blockquote>\n<p>&#x201C;I&#x2019;ve got two kids so I guess my career is over now&#x201D;</p>\n</blockquote>\n\n<p>or</p>\n\n<blockquote>\n<p>&#x201C;I know I&#x2019;m underpaid at my current job but they let me have Wednesdays off. Who else will take me?&#x201D;</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<p>And it&#x2019;s not just the mums. I know plenty of men and women who want to study or pursue a project or a hobby outside of work.</p>\n\n<p>One of the reasons for starting DCC Jobs was to provide the only jobs platform where employers are pre-screened around ways they support women&#x2019;s careers. If you are going for a job with one of our <a href=\"/clients\">endorsed employers</a>, we encourage you to have every confidence to speak up and reference the fact they advertise with DCC Jobs in the interview. In fact just this week, we were excited to add in a new search term called &#x2018;flexible working arrangements&#x2019; to the traditional full/part time, casual and contract search options.</p>\n\n<p>&#xA0;</p>\n\n<p>AECOM is another great example of a company who, for a global giant in a male-dominated industry, is leading the way as an employer of choice by creating opportunities for women to pursue both rewarding careers and personal commitments, through a flexible environment.</p>\n\n<p>&#xA0;</p>\n\n<p>Originally posted on Dropbox Drop Everything. &#xA0;Read the article <a href=\"https://dropeverything.com.au/post/roles-we-can-play-making-flexible-working-norm\">here</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality","Celebrating Women"],"upload_date":"2016/06","associated_company":"work180"}