{"url":"https://www.work180.com.au/blog/2018/08/the-changing-face-of-flexible-work","title":"The changing face of flexible work","author":"WORK180","body":"\n\t\t\t\t\t<p>There are a lot of misconceptions about flexible work arrangements &#x2013; like who &#x2018;can&#x2019; take it from a legal standpoint or who &#x2018;should&#x2019; be able to access it because of their age, gender, or family circumstance.</p><p>In my work as the head of the Culture and Capability team at Queensland Urban Utilities &#xA0;I am a case-in-point about how mindsets about flexible work arrangements have changed in workplaces generally. I&#x2019;ve found that an inclusive mindset at Queensland Urban Utilities is helping to remove any taboo about flexible work arrangements both the employees and the business appreciate the benefits.&#xA0;<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/becafb85-684e-44a6-b178-ad72b577062e.png\" style=\"float: right; margin: 10px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/becafb85-684e-44a6-b178-ad72b577062e.png\"></p><p>To Glenn Smith, our Executive Leader People and Safety, flexible work is really about the employer and the employee having mutual respect and a foundation of trust. We all have commitments and priorities outside of work and the reality is that sometimes work crosses into our personal time, and sometimes our personal life commitments can cross into our work time. Queensland Urban Utilities respect this, and we support leaders and employees in having honest conversations about when flexibility is required so that we can support their needs. For Glenn, it means that in return, employees respect the business requirements by ensuring a continuation of delivering excellent work results.</p><p>Flexibility is part of how I live and work. I have three children under the age of eight. Two are in school and one is still in day care. Working flexibly means I can balance my responsibilities as a Dad, with my work commitments. I am a man and I am a senior leader, so I am aware that in a way I am a role model for the adoption of flexible working for all types of employees at Queensland Urban Utilities. There continues to be a shift in society in relation to child care responsibilities and this is a great thing. Having parents who take equal responsibility for their children means inevitably more men &#x2013; at all levels &#x2013; will want to balance their lives differently. Flexibility is important to all employees and the positive impact it has extend far beyond the individual person working flexibly.</p><p>I lead a small team of Human Resource professionals, both men and women, who all access flexible work arrangements. I remember my biggest concern when starting out wasn&#x2019;t about my team&#x2019;s ability to deliver on their work commitments, but rather, how others would perceive the arrangements. My main concern was that I would be viewed as a leader who had abandoned his team and that my team would be considered &#x2018;not committed&#x2019; because we weren&#x2019;t in the office every minute of the working day.&#xA0;</p><p>What I quickly realised though was that leading positive change in the workplace is all about doing things that others aren&#x2019;t already doing &#x2013; even if you get criticised for it initially. We work hard as a team, we deliver results for our employer, we respect each other&#x2019;s personal and work circumstances, and we really appreciate the opportunity to all work flexibly when we need to.</p><p>The truth is that flexible work is one of the main reasons why my team enjoy working at Queensland Urban Utilities. It is that simple.</p><p>Flexible work arrangements will continue to become the norm as work becomes less about a &#x2018;place that you go to&#x2019;, and more about something that you can do from just about anywhere. To make it successful though, employers need to avoid the trap of putting too many rules around it.</p><p>Flexible work is successful when you can communicate clearly with your team about the outcomes required, the quality of work you are seeking and the timeframes for delivery.</p><p>It&#x2019;s not just about <em>where</em> they work from to get the work done.</p><p>Flexible work fails, in my opinion, when you start putting rules around it - like how it can and should work &#x2013; because then it&#x2019;s no longer flexible and it signals that you don&#x2019;t trust people.</p><p>Above all, flexible work arrangements are successful when your most senior leaders demonstrate through their actions that they truly support and encourage it and I am happy to be working for an organisation who is leading the way.</p><hr><h5><strong class=\"\">Queensland</strong><strong> Urban Utilities&#xA0;</strong><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=queensland-urban-utilities\" href=\"https://www.work180.com.au/job-search?client=queensland-urban-utilities\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9820a668-efc5-4d00-aaf9-4e725a1e247d.png\" style=\"float: right; width: 300px; height: 64px; margin: 10px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/9820a668-efc5-4d00-aaf9-4e725a1e247d.png\"></a></h5><p>WORK180 approved QUU because they have&#xA0;14 weeks paid parental leave for primary carers, 4 weeks for secondary carers, multiple flexible working arrangements on offer, tailored development and coaching programs plus much more. <a data-cke-saved-href=\"https://www.work180.com.au/clients/queensland-urban-utilities\" href=\"https://www.work180.com.au/clients/queensland-urban-utilities\">Check out their Best Employer page.&#xA0;</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=queensland-urban-utilities\" href=\"https://www.work180.com.au/job-search?client=queensland-urban-utilities\">Browse jobs with QUU here.&#xA0;</a></p><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\"></a></p>\n\t\t\t\t","tags":["gender equality","parental leave","flexible working"],"upload_date":"2018/08","associated_companies":["work180"]}