{"url":"https://www.work180.com.au/blog/2017/12/9-simple-things-you-can-do-to-promote-inclusion-xero","title":"The Small Things That Make a BIG Impact on Inclusion","author":"WORK180","body":"\n\t\t\t\t\t<p>Recently I have been fortunate to speak at a couple of diversity and inclusion conferences and it&#x2019;s been really inspiring to see that, like <a href=\"https://www.dccjobs.com/clients/xero\">Xero</a> where I work, so many&#xA0;organisations&#xA0;are talking about the importance of inclusion.</p>\n\n<p>Whilst diversity is critical it&#x2019;s through inclusion that we really tap into the power and potential of our differences and create workplaces where our people can be themselves and thrive.</p>\n\n<p>As Vern&#x101;<span style=\"font-size: 16px;\">&#xA0;Myers&#xA0;</span>so beautifully puts it:</p>\n\n<blockquote>\n<p><em>&#xA0;&#x2018;diversity is being invited to the party; inclusion is being asked to dance.&#x2019;</em></p>\n</blockquote>\n\n<p>In our Diversity and Inclusion workshops, we start by helping our people understand what it really means to be inclusive. We ask &#x2018;what does inclusion mean to you?&#x2019; and together we write down a list of words that come to mind when thinking of inclusion. In no time the walls are covered in words and phrases like &#x2018;equality, belonging, acceptance, connection, celebrating difference, authenticity, all voices being heard, respect, and being welcomed&#x2019;. What this exercise&#xA0;highlights&#xA0;is&#xA0;that inclusion is associated with strong feelings,&#xA0;values&#xA0;and emotions that are so important to people. Which makes sense because we know that as humans we have a biological need to belong.</p>\n\n<p>Next&#xA0;we ask people to think about what inclusion looks like in practice &#x2013; what tangible interactions and activities help produce those feelings we&#x2019;ve just brain dumped. From this comes one of the key&#xA0;take-aways&#xA0;&#x2013; inclusive practices can be the big initiatives we do as an&#xA0;organisation&#xA0;but importantly it can also be the really small everyday stuff. It&#x2019;s often the personal, small shifts in attitude and&#xA0;behaviour&#xA0;that can have the biggest impact. And importantly that we all have a valuable role to play in ensuring inclusion at Xero.</p>\n\n<h3><strong>So what can all of us do every day that makes a difference?</strong></h3>\n\n<p>1. Take time to talk and share stories of who we are and what we value</p>\n\n<p>2. Be authentic with others and encourage people to be themselves</p>\n\n<p>3. Be open, curious, compassionate and empathetic to those around us</p>\n\n<p>4. Slow things down to reflect on our decisions and check ourselves for bias</p>\n\n<p>5. Take a moment to call out non-inclusive behaviours (with respect and sensitivity)</p>\n\n<p>6. Embrace and support the different ways in which people like to work</p>\n\n<p>7. Be mindful of communication styles and enabling other voices to be heard</p>\n\n<p>8. Encourage and value different perspectives and ideas</p>\n\n<p>9. Widen your net and include a good mix of people as part of your projects and initiatives at work</p>\n\n<p>These are just a few suggestions but they highlight that the small stuff matters and can have a really positive impact on everyone around us and the culture we create.</p>\n\n<p>At Xero, we know we are not going to get it right every time, but as we continue to scale, our employees are committed to working together to create inclusive workplaces where everyone feels they belong.<br>\n&#xA0;</p>\n\n<h4><strong>About the author&#xA0;</strong></h4>\n\n<p>Bindy Edelman is the&#xA0;Head of Diversity, Inclusion &amp; Community at DCC Endorsed Employer for Women <a href=\"https://www.dccjobs.com/clients/xero\">Xero</a>.</p>\n\n<p>Find jobs with Xero <a href=\"https://www.dccjobs.com/job-search?client=xero\">here.&#xA0; </a><br>\n&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/12","associated_companies":["work180"]}