{"url":"https://www.work180.com.au/blog/2017/04/there-is-no-i-in-job-share","title":"There is No ‘I’ in Job Share","author":"WORK180","body":"\n\t\t\t\t\t<p>Job sharing is a great option for women and men to enable fulfilling lives through balancing rewarding, challenging careers with family and other personal responsibilities. Personally I&#x2019;ve always been intrigued around how to do this successfully, particularly at a senior leadership level.</p><p>During my conversation with Allison and Karen, I learned about not only how to make job sharing a seamless arrangement, but also about the incredible business benefits that arise as a result.</p><p>Thank you Allison and Karen for sharing your story, along with many tips we can all take on board. Here are my main lessons learnt:</p><p><br></p><p><strong>Why are You Choosing to Job Share?</strong></p><p>For Allison and Karen, the arrangement enables them to thrive in their careers, while having the time to be more involved with their children through their schools and local community sporting clubs. Their advice for individuals is to take the time to identify exactly why you are seeking this arrangement. For the business, it&#x2019;s crucial not to &#x2018;force fit&#x2019; job shares as the failure of these arrangements creates a negative perception, hindering the next opportunity for job sharing.</p><p>&#x201C;Job sharing won&#x2019;t work for everyone, and for us, it&#x2019;s how we choose to work,&#x201D; explained Karen. &#x201C;We are lucky to have support from our families to work 3 days a weeks, and support from NAB to have the opportunity to work on engaging and meaningful projects. What you get in return is two absolutely engaged employees giving 110% at work and at home, without feeling uncomfortable or guilty about either the professional or personal areas of our lives.&#x201D;</p><p><br></p><p><strong>Finding a Job Share Partner and Setting Joint Career Goals</strong></p><p>Allison joined NAB over 16 years ago and has worked across various Finance functions in a variety of flexible working arrangements. Karen joined the NAB Group Finance team as part of the Aviva integration 8 years ago. Three years ago, a role arose for which Karen sought out the opportunity to design the role as a job share. &#xA0;&#x201C;Back then, the hardest challenge was not knowing who would want to partner with me,&#x201D; recalled Karen. &#x201C;It certainly helps if two people are connected by someone who knows them both well,&#x201D; she continued. In their case, a mutual acquaintance, who used to work with Karen was the common connection.</p><p>According to Karen, &#x201C;Having an open mind and taking the time to get to know each other to make sure it&#x2019;s the right fit is important-after all, this relationship is just like a marriage!&#x201D; Both women complement each other&#x2019;s personalities- &#x201C;Karen is more of an extrovert, yet we balance each other very well, and between us, tend not to miss anything,&#x201D; said Allison.&#xA0;</p><p>Both women commenced their job share arrangement in a Managerial role with aspirations to be promoted to a Leadership role within 2-3 years. Their journey to reach their goal included individual development plans, many formal and informal conversations with their manager and networking. Both women networked and sought sponsors, along with putting themselves forward for key projects and consistently going the extra mile to demonstrate the value of an effective job sharing team.</p><p>In December 2016, Allison and Karen were appointed to the role of Head of Finance Partner, Business Direct &amp; Small Business (Business &amp; Private Finance at NAB). This is one of the most senior level job share appointments at NAB.</p><p>&#x201C;We worked hard to earn sponsorship,&#x201D; said Karen. &#x201C;Our sponsor took a chance on us after seeing what we delivered. Put in the hard yards but at the same time, ensure you have a lot of backers.&#x201D;&#xA0;</p><p><br></p><p><strong>Have an Open Mind and Building Trust</strong></p><p>Both women stressed the importance of being patient with yourself and each other at the beginning. &#x201C;You just don&#x2019;t know if it is all going to work- no one does,&#x201D; said Allison. &#x201C;We gave ourselves six months and communicated this to our manager. We believe in failing fast, therefore you need to make sure the arrangement works for everyone- including your team, clients and other stakeholders. Continually ask everyone for feedback on your performance.&#x201D;</p><p>Respecting your job share partner&#x2019;s privacy is paramount. Allison and Karen both work three days each, with a &#x2018;handover&#x2019; day on Wednesday. &#x201C;For us, it helps to understand each other&#x2019;s lives, and be flexible to accommodate each other when needed. We are very respectful of each other&#x2019;s days off,&#x201D; emphasised Karen. Both women did confess to being guilty of jumping in on emails on their days off, but also acknowledged it&#x2019;s something they are actively working on.</p><p>&#x201C;Trust is implicit in our relationship,&#x201D; continued Karen. &#x201C;We need to be one person, deliver the same message and ensure our work is carried out in a seamless fashion. Your team and clients should be able to feel they have had one conversation and it filters through to the other partner.&#x201D;</p><p>The ladies have achieved even more than this- often being mistaken for one another in meetings- an ultimate measure of their success.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/0763bce6-0176-45c2-a6b6-7030bfa268b9.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/0763bce6-0176-45c2-a6b6-7030bfa268b9.jpeg\"></p><p><strong>Practical Advice for Job Sharing Partners</strong></p><p>&#xA0;&#x201C;Setting up your partner for success is key,&#x201D; added Allison. &#x201C;On Monday morning, if I need to walk into a 9am meeting after not being at work since Wednesday, I know Karen has documented everything I need to be mindful of.&#x201D;</p><p>&#x201C;You need to take good notes,&#x201D; pointed out Karen. &#x201C;That involves notes on everything! Make sure to adopt a style that works for both partners. In our case, I write everything down so that it&#x2019;s easier for Allison to be kept up to date. Don&#x2019;t assume your partner will understand your high level notes.&#x201D;</p><p>Taking the ego out of everything is also crucial. &#x201C;You do need to check that at the door,&#x201D; said Allison. &#x201C;You can&#x2019;t compete with one another- you need to trust and back each other. We are proving &#x2018;us&#x2019;, not just yourself, we want to succeed as a whole.&#x201D;</p><p>Allison and Karen usually spend Wednesdays to do the handover, and also to remove themselves from performing day to day tasks, using the time to strategise and do some &#x2018;blue sky&#x2019; thinking.</p><p>&#x201C;We feel very confident, as we&#x2019;re able to bounce ideas off each other and gain a different perspective before going forward,&#x201D; explained Karen.</p><p>When making independent decisions, Allison and Karen consider how the other person would think and practice the growth mindset. &#x201C;We need to present a uniting front, and having another person&#x2019;s viewpoint to consider before replying can really challenge your thinking,&#x201D; explained Karen. &#x201C;For example, if I know Allison has a very strong opinion on something, I will take the time to reflect and think differently and if necessary, that&#x2019;s when I make a call to her on her day off. Allison will do the same.&#x201D;</p><p><br></p><p><strong>Two Minds are Better than One</strong></p><p>This diversity of thought is a huge advantage, both to individuals and the business.</p><p>&#x201C;The benefit to our team of having two leaders is around their own development- having two different coaches with two different styles is very valuable,&#x201D; said Karen.</p><p>&#x201C;For our own leadership team, we feel we can provide them with a different perspective on leadership- having two points of view means we&#x2019;ve become a became a sounding board and trusted advisors around a number of strategic decisions,&#x201D; added Allison.</p><p>At NAB, all roles are flexible in the Finance team and both women and men work flexibly in a variety of ways, with leadership modelling flexible working practices as well. &#x201C;These are not just made available to working parents, either,&#x201D; pointed out Allison. &#x201C;For example, we have athletes who work part time in order to train, and some people splitting their time between different states.&#x201D;</p><p>Initiatives such as these make for a truly inclusive environment, where everyone can be themselves at work.&#xA0;</p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About NAB<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1f953365-c0d1-4b0c-9eef-75324f178686.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1f953365-c0d1-4b0c-9eef-75324f178686.jpeg\" style=\"float: right; margin: 10px; width: 103px; height: 150px;\"></strong></h4><p><span id=\"ember12378\">One of the ways&#xA0;</span><a data-cke-saved-href=\"https://www.work180.com.au/clients/NAB\" href=\"https://www.work180.com.au/clients/NAB\">National Australia Bank</a><span id=\"ember12386\"><a data-cke-saved-href=\"https://www.work180.com.au/clients/NAB\" href=\"https://www.work180.com.au/clients/NAB\">&#xA0;</a>are working on achieving gender equality is by making flexibility a reality for all employees. At NAB, more than 85% of people work flexibly, including 84% of women &amp; 88% of men. Learn more about NAB&#x2019;s supportive culture on their Best Employer page&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/NAB\" href=\"https://www.work180.com.au/clients/NAB\">here.</a></span></p><p>Browse jobs with NAB&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=nab\" href=\"https://www.work180.com.au/job-search?client=nab\">here.</a></p><p><br></p><p><br></p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/04","associated_company":"work180"}