{"url":"https://www.work180.com.au/blog/2017/01/this-is-what-a-great-leader-looks-like","title":"This is What a Great Leader Looks Like","author":"WORK180","body":"\n\t\t\t\t\t<p>Melissa Johnson is a Maintenance Manager at <a data-cke-saved-href=\"/clients/bhp\" href=\"/clients/bhp\">BHP</a> and currently leads a team ranging between 80- 200 people at the Hay Point Coal Terminal. WORK180 caught up with Melissa to learn more about her journey in an industry largely under-represented by women.</p><blockquote><p><em>&#x201C;You can do anything, just give it a go&#x201D;</em>- This was a mantra Melissa often heard growing up, along with&#xA0;<em>&#x201C;Don&#x2019;t ever think you&#x2019;re any bigger than anyone else&#x201D;.</em></p></blockquote><p>It was this kind of upbringing and influence from her hard working parents that saw Melissa and her younger brother pursue rewarding careers after graduating from University- Melissa as an engineer and her brother as a nurse (later moving into medical law).</p><p>&#x201C;At the time, the thought of my brother and I having &#x2018;non-traditional&#x2019; roles didn&#x2019;t even cross our minds,&#x201D; recalled Melissa.</p><p>Fast forward 20 years and Melissa has developed an incredible career for herself across a number of industries, travelling the world and raising three children, who of course also believe they can do anything and are her biggest cheerleaders.</p><p>Melissa started out as a project engineer at a consulting firm, where she took the opportunity for a three month secondment in Hong Kong. At the end of the three months, Melissa was offered a full time role and ended up living and travelling in Hong Kong for the next 10 years. Throughout that time, Melissa worked her way up to become the Engineering and Construction Manager- a senior role requiring endorsement of the candidate through the Hong Kong Environmental Protection Department (EPD).</p><p>It was during her time in Hong Kong that Melissa first developed leadership skills to create high performing and happy teams.&#xA0;</p><p>Here are Melissa&#x2019;s top tips for creating a supportive and results driven culture.</p><p><br></p><p><strong>1. Don&#x2019;t ever underestimate what starting at grass roots can do for you</strong></p><p>&#x201C;I was very fortunate to work my way up in the construction industry, starting out with an initial secondment in Hong Kong which involved performing quality control inspections for all construction activities,&#x201D; explained Melissa. &#x201C;By spending so much time onsite I learnt an enormous amount and it gave me the opportunity to get to know everyone&#x2019;s name, with the team fluctuating from 90 to 300 people.&#x201D;</p><p>Getting to know everyone on site not only helped Melissa build rapport but exposed her to very different cultural backgrounds. As Melissa learned more about her team, she started to put in place some adjustments to ensure everyone enjoyed coming to work.</p><p>This involved a variety of considerations, from ensuring staff could observe Ramadan, understanding the context&#xA0;behind&#xA0;the political unrest in Nepal (at the time) to facilitating people who wanted to return to their country every two years by consolidating their leave. &#x201C;When the management saw the benefits these supportive practices were delivering, it was a no-brainer and the majority of that workforce is still there, many years later,&#x201D; Melissa told us.</p><p><br></p><p><strong>2. Flexibility is not reserved just for people with young children</strong></p><p>Melissa moved back to Australia after the birth of her first child to be closer to her family in Brisbane and started working with BHP where she currently leads the maintenance department of a&#xA0;24 hour&#xA0;operation. Maintaining that kind of high capacity required flexibility for the entire team.</p><blockquote><p>&#x201C;We have a give and take structure,&#x201D; explained Melissa. &#x201C;When it comes to working flexibly, it really doesn&#x2019;t matter if you have young children or not. We have superintendents who are grandparents, some without children and some with teenage children. We&#x2019;re all different but the respect around having flex arrangements regardless of your circumstances must be consistent if you want to have a high-performing team.&#x201D;</p></blockquote><p>Melissa believes working flexibly should be based on individual values. &#x201C;You may want to visit your grandchildren, go shopping or spend time with your dog which is why you need flexibility and that&#x2019;s fine,&#x201D; continued Melissa. &#x201C;It&#x2019;s about &#x2018;how&#x2019; you will still achieve &#x2018;what&#x2019; you need to achieve and bring value to the team.&#x201D;</p><p>Melissa&#x2019;s own schedule is testament to this. Starting her day at 6:30am, Melissa normally finishes at 4pm and gets some exercise. &#x201C;We&#x2019;re completely transparent- I have &#x2018;swim or run&#x2019; in my diary at 4pm each day and the team respects that&#x2019;s what I need to do to be a more effective leader.&#x201D;</p><p><br></p><p><strong>3. Mutual support and respect is key</strong></p><p>&#x201C;The way BHP has supported me is fantastic,&#x201D; said Melissa. &#x201C;In return, I&#x2019;ll do everything I can to support the business.&#x201D;</p><p>Prior to her role as the Maintenance Manager, Melissa was living in Moranbah. &#x201C;When my personal circumstances changed, I began struggling with work life balance and had limited support opportunities,&#x201D; recalled Melissa. As a single parent to three young children aged 5-9, Melissa wanted to move to a small city environment and gain easier access to a nanny service; along with before and after school care programs. &#x201C;Both my Senior Manager / Head of Function (a woman) along with my direct Manager - General Manager (a male) were incredibly supportive of the move,&#x201D; said Melissa.</p><p>Melissa also pointed out the importance of having support from the immediate team- &#x201C;While it was wonderful to have support from above, unless you have your team backing you as well, the flexibility is not as effective.&#x201D; &#xA0;</p><p><br></p><p><strong>4. Think outside the box when creating diverse teams</strong></p><p>BHP has recently announced an industry-first initiative to achieve a gender balanced workforce by 2025 and Melissa shared some of the strategies she&#x2019;s seen implemented to remove barriers for women wanting to join the Maintenance team.</p><blockquote><p>&#x201C;First of all, I think the announcement is&#xA0;fantastic,&#xA0;and shows a really strong commitment,&#x201D; said Melissa. &#x201C;At the operational level, we are working on addressing concerns from male team members- the aim moving forward is to bring in new recruits who are diverse candidates, which support our current, strong workforce.&#x201D;</p></blockquote><p>The business will work towards the goal through a number of ways:&#xA0;</p><p><br></p><p><strong>Re-inventing the recruitment process</strong></p><p>Melissa prefers to have a look at the full list of applicants instead of having them vetted by the HR team.</p><blockquote><p>&#x201C;A lot of the time, we align the screening process to the key skills, engineering degrees and things like 10- years&#x2019; experience in mining,&#x201D; said Melissa. &#x201C;In the old way of recruiting, these specific requests would have inhibited applicants.&#x201D;</p></blockquote><p>According to Melissa, &#x201C;If you can demonstrate drive and initiative to succeed through your CV along with results you&#x2019;ve achieved- those skills are completely transferable across any industry.&#x201D;</p><p><br></p><p><strong>Apprenticeship programs</strong></p><p>Women who have shown ability but haven&#x2019;t been exposed to other areas of the business will have the opportunity to join a 12 month development program. &#x201C;Our focus is on supporting staff to ensure they are set up for success,&#x201D; explained Melissa. Participants will be introduced to key stakeholders, assigned a mentor and specific support in the day to day tasks. &#x201C;Putting people in roles and not giving them the backing support is my top concern,&#x201D; said Melissa. &#x201C;Technical understanding or capability can be provided through support and if the person we&#x2019;ve invited to go through the program fails, it&#x2019;s on us also, not solely the apprentice.&#x201D;</p><p><br></p><p><strong>Role shadowing</strong></p><p>BHP&#xA0;have&#xA0;identified talented women and have invited them to experience a &#x2018;day in the life of&#x2019; by shadowing particular roles for a day.</p><p><br></p><p>&#x201C;We&#x2019;ve had a male leader instigate this initiative in our team,&#x201D; Melissa told us. &#x201C;We then reached out to a talented young woman who is very driven and has shown initiative and asked what her long term development goals were and what she&#x2019;d be interested in.&#x201D;</p><p><br></p><p>After a few days of consideration, the woman came back to the team- she would have loved the opportunity to join the Maintenance team but was unsure if she&#x2019;d be up for the role.</p><p><br></p><p>&#x201C;This is where the opportunity to role shadow someone is perfect- you can &#x2018;try before you buy&#x2019; and understand the role a bit more,&#x201D; explained Melissa. &#x201C;As women we often think we need to tick every box, but I can tell you that behaviours such as being self-driven and motivated are often overlooked, yet to me are most critical. Technical proficiency is a lot easier to pick up.&#x201D;</p><p><br></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/34e68e54-0e5d-4c85-8dde-7ce4998bf8f4.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/34e68e54-0e5d-4c85-8dde-7ce4998bf8f4.png\" style=\"float: right;\"></p><div><br></div><blockquote><p>Melissa&#x2019;s story is a great blueprint for empathetic leadership. Having the right kind of supportive employer certainly plays a big part- you can<a data-cke-saved-href=\"https://www.work180.com.au/clients/bhp\" href=\"https://www.work180.com.au/clients/bhp\"> learn more about working with BHP&#xA0;here</a>. BHP is also Flex Able Certified meaning job seekers are encouraged to discuss flexible working already at the interview stage.</p><p>Apply for BHP jobs <a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=bhp\" target=\"_blank\" href=\"https://www.dccjobs.com/job-search?client=bhp\">here</a><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=bhp\" href=\"https://www.work180.com.au/job-search?client=bhp\">.&#xA0;</a></p></blockquote><hr><h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3><p>WORK180 (previously DCC Jobs) is a jobs board with a difference. We pre-screen employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients\" href=\"https://www.work180.com.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/dashboard/candidate\" href=\"https://www.work180.com.au/dashboard/candidate\">one click</a>&#xA0;now.&#xA0;</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/01","associated_company":"work180"}