{"url":"https://www.work180.com.au/blog/2018/03/lynn-dangs-donor-story-UNHCR","title":"This run is personal - from refugee to UNHCR marathon rep","author":"WORK180","body":"\n\t\t\t\t\t<p><em><strong>This month we welcome a new Team UNHCR member to the fold, runner, professional, mother of two and former refugee, Lynn Dang.</strong></em></p><p>For Lynn, racing in the&#xA0;<a data-cke-saved-href=\"https://smh2017halfmarathon.everydayhero.com/au/lynndang\" href=\"https://smh2017halfmarathon.everydayhero.com/au/lynndang\">Sydney Morning Herald Half-Marathon</a>&#xA0;and fundraising for UNHCR is a closely personal pursuit. She shares her story of how UNHCR once gave her and her family &#x201C;light during our darkest months.&quot;&#xA0;</p><p><br></p><h4>When did you first become interested in refugee issues?</h4><p>The refugee experience is deeply personal to me. I was a refugee at 3 years old and spent time at the Pulau Bidong Malaysian UNHCR camp after the Vietnam War.</p><p>Nowadays, I am inspired by the strength and resilience of the millions of refugees around the world. It is incredibly life-affirming; the heroic efforts of refugees who continue to fight for&#xA0;their agency, self-determination and a place to call home despite the atrocities of&#xA0;war and growing hostility to their existence.</p><blockquote style=\"text-align: center;\">&quot;We all want a more compassionate and peaceful world. It starts with how we treat and protect the most vulnerable&quot;</blockquote><blockquote style=\"text-align: center;\">&#x201C;The UNHCR reminded us of our humanity and provided rights and protection with hope for our future.&#x201D;</blockquote><h4><img data-cke-saved-src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDMvMjAvMDIvMjcvMzQvMzc4L2x5bm4tZGFuZy1waG90by1jb2xsZWN0aW9uX3dlYi5qcGciXV0\" src=\"https://d418bv7mr3wfv.cloudfront.net/s3/W1siZiIsIjIwMTgvMDMvMjAvMDIvMjcvMzQvMzc4L2x5bm4tZGFuZy1waG90by1jb2xsZWN0aW9uX3dlYi5qcGciXV0\"></h4><h4>How did UNHCR help your family during that time?</h4><p>When we reached the UNHCR camp, my family and I were provided with practical support such as immediate access to shelter, food, clothing and medical attention.</p><p>Equally as important, the UNHCR gave us light during our darkest months. When you become a refugee, you become invisible and stateless, living in a limbo of uncertainty. The UNHCR reminded us of our humanity and provided rights and protection with hope for our future.</p><h4><br></h4><h4>Why do you think it&#x2019;s important to support refugees around the world?</h4><p>Refugees are ordinary people who are fleeing their homes by extraordinary circumstances of war, conflict and persecution. They have endured trauma and hardship. It&#x2019;s important that we don&#x2019;t stand by silently whilst others are suffering.</p><p>We all want a more compassionate and peaceful world. It starts with how we treat and protect the most vulnerable people when they ask us for our help.</p><h4><br></h4><h4>Do you have any fundraising hints &amp; tips for others who want to take on a similar challenge?</h4><ol><li>Share your story on why the cause is important to you.</li><li>Pick an activity that you enjoy so you can have fun as well!</li></ol><p>As a busy working mother of two young children, running gives me the solitary time I need to reflect and re-energise. Incorporating it to&#xA0;<a data-cke-saved-href=\"https://www.teamunhcr.org.au/fundraise/join-an-event/\" href=\"https://www.teamunhcr.org.au/fundraise/join-an-event/\">fundraise for a cause</a>&#xA0;close to my heart is a win-win situation.</p><h4><br></h4><h4>What would you say to someone who is considering becoming an Australia for UNHCR supporter?</h4><p>My story is just one example of how the UNHCR saved mine and my family&#x2019;s lives 30 years ago.</p><p>The UNHCR continues to make a difference to millions today by providing humanitarian assistance and recognising the dignity of refugees.</p><p>Your actions will help the UNHCR to continue their critical ongoing protection and advocacy for refugees.</p><p><br></p><p>Join us and&#xA0;<a data-id=\"2664\" data-cke-saved-href=\"https://www.unrefugees.org.au/get-involved/petition/\" href=\"https://www.unrefugees.org.au/get-involved/petition/\" title=\"Petition\">stand with refugees</a>.&#xA0;</p><p><br></p><p><a data-cke-saved-href=\"https://www.teamunhcr.org.au/fundraise/join-an-event/#_ga=2.233098206.1720462850.1521511592-136050390.1521511592\" href=\"https://www.teamunhcr.org.au/fundraise/join-an-event/#_ga=2.233098206.1720462850.1521511592-136050390.1521511592\">Join Lynn and support Australia for UNHCR through one of UNHCR&apos;s many events in 2017.</a></p><hr><p>This post was originally published by <a data-cke-saved-href=\"https://www.unrefugees.org.au/\" href=\"https://www.unrefugees.org.au/\">UNHCR</a><a data-cke-saved-href=\"https://www.unrefugees.org.au/our-stories/lynn-dangs-donor-story/\" href=\"https://www.unrefugees.org.au/our-stories/lynn-dangs-donor-story/\">.&#xA0;</a></p><h4><strong>About UNHCR</strong></h4><p>Australia for UNHCR is the UN Refugee Agency&#x2019;s national partner in Australia, raising awareness and funds to support UNHCR&#x2019;s global emergency response to humanitarian crises. It achieves this through the generosity of Australian individual donors, trusts, foundations and other organisations who donate to and partner with Australia for UNHCR to support its goals.</p><p><br></p><h4><strong>About Microsoft<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a96f3b87-9e22-4ec3-bcf4-d44823f41f5a.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/a96f3b87-9e22-4ec3-bcf4-d44823f41f5a.png\" style=\"float: right; width: 200px; height: 74px; margin: 10px;\"></strong></h4><p>Microsoft is an endorsed employer for women. They have passed WORK180&apos;s 20 pre-screening criteria and offer&#xA0;20 weeks paid parental leave,&#xA0; Flexible Working, no minimum tenure to be eligible for paid parental leave and is a Workplace Gender Equality Agency Pay Equity Ambassador. Read more about their workplace on their <a data-cke-saved-href=\"https://www.dccjobs.com/clients/microsoft\" href=\"https://www.dccjobs.com/clients/microsoft\">Best Employer page.</a></p><p><a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=microsoft\" href=\"https://www.dccjobs.com/job-search?client=microsoft\">Browse jobs </a>and apply to join Microsoft.&#xA0;</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["women in sport","Celebrating Women"],"upload_date":"2018/03","associated_companies":["work180"]}