{"url":"https://www.work180.com.au/blog/2016/10/three-mottos-for-the-millennial-professional-to-live-by","title":"Three Mottos For the Millennial Professional to Live By","author":"WORK180","body":"\n\t\t\t\t\t<p>I&#x2019;m a girl known to have a motto for every occasion. Some of my friends can pre-empt these before I even get to mention them these days; needless to say, they&#x2019;ve given me a foundation to forge ahead in the professional world. The mottos have given me the resilience to jump in the deep end to chase opportunities and tackle the challenges. There is no favourite of the three and I hand them out to girls at any opportunity like models post selfies.</p><p>Fake it till you make it.&#xA0;I started work as a bright eyed and bushy tailed 18 year old as an accounting cadet. I had been selected ahead of 300 other applicants for one of three positions: they must have made a mistake? As I progressed to more senior positions I was holding one on one meetings with senior executives of multi-million dollar companies and I would get to a stage in the meeting and have a freak-out and think &#x2018;Do they know how old am I? What will they think if they find out how young I am? Will they think I&#x2019;m too young to do this job?&#x2019;. I felt like a complete fraud.</p><p>Then I watched Amy Cuddy&#x2019;s TED talk &#x2018;Your body language shapes who you are&#x2019; about impostor syndrome. I realised that I&#x2019;m not the only one. We all feel it. Amy speaks about this idea that we can &#x201C;fake it till we become it&#x201D;. We just have to keep telling ourselves that we deserve to be there and eventually we will believe it.</p><p>This motto is my all-time favourite for when my friends are like &#x201C;oh, I could never do that&#x201D; or &#x201C;oh, I don&#x2019;t have enough experience&#x201D; or &#x201C;oh, they wouldn&#x2019;t want me&#x201D;. Girl, just go and fake it till you make it, who gives a f*** what other people might think, do it for you.</p><p>Just wing it.&#xA0;I don&#x2019;t mean in the context of delivering a life-changing pitch or showing up to a meeting completely unfamiliar with the content. There are some things where if you want them to go well, you should most definitely not wing it (note: there are always exceptions to the rule, another motto but I&#x2019;ll save that for another time).</p><p>But, &#x201C;winging it&#x201D; is one of my all-time favourite things and when I started living it, it freed me from my prison of perfectionism. &#x201C;Winging it&#x201D; isn&#x2019;t about being lazy, or being a procrastinator, it&#x2019;s about giving yourself permission for something not to be perfect, being ok with the idea that maybe I don&#x2019;t have to make sure that every single aspect of my day must be planned to the minute, or spend the whole night memorising a speech so you can recite it word for word</p><p>&#x201C;Winging it&#x201D; brings me into the present moment and is the way to end all excuses for why you can&#x2019;t get started now: right now. Believe me, there is never a perfect moment and its way more fun to make it up as you go. If you&#x2019;re worried about &#x201C;winging it&#x201D; refer back to motto number one (see I told you they were all linked).</p><p>Be in it to win it.&#xA0;I&#x2019;ve been successful in about 98% of opportunities I apply for. This is not because I am the smartest or most charismatic person in the world (though I would love to think otherwise). The percentage is so high because I submit the dam application in the first place. It&#x2019;s just like those people who earn a living from entering competitions: they aren&#x2019;t insanely lucky people, they just know they you have to be in it to win it. A lot of smart creative girls get hooked on this idea that &#x2018;Oh, I&#x2019;m not smart enough&#x2019; or &#x2018;they don&#x2019;t want someone like me&#x2019; or even &#x2018;I won&#x2019;t get picked&#x2019;. Girl, I am 100% sure that you will not get picked if you don&#x2019;t enter. So please, please, if you can only take away one motto: be in it to win it.</p><p>Case in point, I was recently hand-picked to be in a future leader program facilitated by Keith Abrahams, one of Australia&#x2019;s premier thought leaders on passionate performance. Nominees were required to answer 5 questions around why they would be a good fit. I thought &#x2018;this sounds like fun!&#x2019;&#x2026;&#x2026;. then I read &#x2018;must be a video submission&#x2019;. The idea of seeing myself on video was giving me the sweats. I sucked it up and did it anyway because you&#x2019;ll never know, if you never try.</p><p>Weeks later I got the acceptance email, being accepted over people that had 5-20 years more experience, than my 4 years. Just proves that it always pays to give it a crack.</p><p>Pop these mottos in your notebook now!</p><p><br></p><p>Originally posted on&#xA0;<a data-cke-saved-href=\"https://www.steelheels.com.au/\" href=\"https://www.steelheels.com.au/\" target=\"_blank\">Steel Heels</a>. &#xA0;The original can be viewed&#xA0;<a data-cke-saved-href=\"https://www.steelheels.com.au/three-mottos-millennial-professional-live/\" href=\"https://www.steelheels.com.au/three-mottos-millennial-professional-live/\" target=\"_blank\">here</a>.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About WORK180</strong></span></h5><p>WORK180 is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p><p><br></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/10","associated_company":"work180"}