{"url":"https://www.work180.com.au/blog/2016/09/three-simple-things-you-can-start-doing-right-now-to-build-confidence","title":"Three Simple Things You Can Start Doing Right Now to Build Confidence","author":"WORK180","body":"\n\t\t\t\t\t<p>Building confidence- it&#x2019;s a big topic in the area of women&#x2019;s leadership and development. Women are constantly told to be more confident, stop being &#x201C;nice&#x201D; and to &#x201C;Lean In&#x201D; more. It&#x2019;s almost enough to make you think that if we can master these things, we will finally achieve equality.</p>\n\n<p>In 2015, the Rio Tinto CEO Sam Walsh, publically shared his mission to get more women into the senior management ranks of his business. At the time Rio Tinto employed a workforce of 18% women with very few in senior management positions. His public commitment to increasing the numbers was wildly applauded. That is, until he followed up by saying the key to getting more women into the senior ranks was for women to increase their confidence.</p>\n\n<p>Walsh received mixed reviews in the media about this comment. On one hand, people were rapt that such a global, male dominated organisation was publically stating they wanted more women. Yet on the other hand, his comments were interpreted by some as good ol&#x2019; fashioned victim blaming; &#x201C;it&#x2019;s the woman&#x2019;s fault she&#x2019;s not in the senior management, she&#x2019;s just not confident enough.&#x201D;</p>\n\n<p>However, perhaps Walsh wasn&#x2019;t far from the truth with his comments. Studies into the confidence gap between the genders found that, not surprisingly, males do have higher levels of self-esteem than females. Yet the interesting part is that this self-esteem gap exists across multiple cultures, not just Western cultures. The authors propose that these findings could suggest gender differences in self-esteem may have a genetic influence, however they encourage further research be carried out before a definitive genetic conclusion be drawn.</p>\n\n<p>So if women across multiple cultures all have less self-esteem and lower confidence than men, should we just accept it? Should we accept that maybe we&#x2019;re not good enough to ask for that pay rise? Or fierce enough to pull off that outfit? Or capable to apply for a job that&#x2019;s different to the ones we&#x2019;ve done before?</p>\n\n<p>The answer my lovelies is, &#x201C;No way!&#x201D;</p>\n\n<p>Confidence, or lack thereof, can be a strong deterrent, but it does not have to control us! It is not indicative of our true ability, nor does it define our future success. We can regain control over it and we can build it. Here are my top tips for increasing your confidence!</p>\n\n<ul>\n\t<li>\n\t<p>Just Do It!&#xA0;- No, I&#x2019;m not kidding, and no, I&#x2019;m not sponsored by Nike. What I am telling you is that if there is something you want to achieve, the best thing you can possibly do is give it a go. As scary as it is, the only way we will be confident that we can do something is by actually giving it a go. As Katty Kay and Claire Shipman (authors of The Confidence Gap) state&#xA0;</p>\n\t</li>\n</ul>\n\n<p>&#x201C;Confidence accumulates&#x2014;through hard work, through success, and even through failure.&#x201D;</p>\n\n<ul>\n\t<li>\n\t<p>Visualisation&#xA0;- Visualisation is more than just thinking good thoughts and hoping it will all turn out for the best. Rather, the deliberate act of imagining a detailed scenario primes your brain and strengthens the neural pathways you want to use in that situation. By rehearsing a scenario over and over again, your brain begins to get comfortable with that particular scenario through familiarity. Therefore, if you use visualisation to prepare for a scenario that you&#x2019;re nervous about you may actually reduce the fear and anxiety experienced in reality. In other words, it&#x2019;s like your brain goes &#x201C;oh, we&#x2019;ve coped with this before. No worries, we can handle it&#x201D;.</p>\n\t</li>\n\t<li>\n\t<p>Power Pose&#xA0;- Harvard University researcher, Amy Cuddy found that expansive, open, space-occupying postures which she calls &#x201C;Power Poses&#x201D;, changes testosterone and cortisol levels to make us feel more confident, better able to deal with stressful situations, more open to risk, and able to perform better in job interviews. To strike a power pose, think about the classic Wonder Woman pose, hands on hips, chest out, back straight and a legs planted firmly and broadly on the ground. Cuddy found that by holding your body in this posture for only two minutes can give a real boost to your feelings of confidence.</p>\n\t</li>\n</ul>\n\n<p>If you want more tips like this to help you kick butt at work and build the career you want, make sure you invest in yourself and join us in&#xA0;<a href=\"https://www.eventbrite.com.au/e/how-to-identify-your-transferable-skills-and-elevate-your-career-tickets-27520275886\">Perth on the 4th October</a>&#xA0;and&#xA0;<a href=\"https://www.eventbrite.com.au/e/how-to-identify-your-transferable-skills-and-elevate-your-career-tickets-27521487510\">Brisbane on the 5th October</a>. Tickets are only $20 with proceeds donated to One Watch.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>About the author: Teagan Dowler</strong></p>\n\n<p>Teagan has worked in the space of Human Resource Management, Organisational Leadership, Training, Development and Coaching for the past decade. Her experience has been built in traditionally masculine workplaces including civil construction, underground and open-cut coal mining, open-cut iron ore mining and steel processing. This practical experience is underpinned by formal academic qualifications in Psychology and Human Resource Management.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Teagan&#x2019;s new book</strong></p>\n\n<p>Teagan has recently released her first book,&#xA0;<a href=\"http://www.thebcw.com.au/shop/rules-of-the-game\">Rules of the Game: Women in the Masculine Industries</a>&#xA0;which explores the world of engineering, resources and construction from the perspectives of over 50 women and men. Rules of the Game presents an honest account of the realities faced by women in these industries and succinctly delivers recommendations on how to overcome the challenges and make the most of the advantages. This book is an essential guide for any woman about to commence her career in engineering, resources and construction or anyone who wants to better understand these industries to achieve success.</p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2016/09","associated_company":"work180"}