{"url":"https://www.work180.com.au/blog/2017/03/three-tips-for-creating-a-rewarding-career-as-a-graduate","title":"Three Tips for Creating a Rewarding Career as a Graduate","author":"WORK180","body":"\n\t\t\t\t\t<p>Rui Yang is part of the team at <a data-cke-saved-href=\"/clients/unitywater\" href=\"/clients/unitywater\">Unitywater</a>&#x2019;s Sewage Treatment Plant in Maroochydore. As a Process Engineer, Rui enjoys working on some of the plant&#x2019;s most challenging technical projects.&#xA0;&#xA0;</p><p>We spoke to Rui about her journey and advice for other graduates looking to establish their careers.<br>&#x200B;</p><h4><strong>Find an Industry that&#x2019;s a Good Fit for You</strong></h4><p>Rui studied chemical engineering at University of Queensland and after graduating in 2011, began exploring career paths. &#x201C;While most of my friends were searching for jobs in oil and gas and mining, I personally didn&#x2019;t really find these industries of great interest and looked for others,&#x201D; recalled Rui. In her research, Rui came across the water industry. &#x201C;The main reason I was attracted to this industry was the fact I would be helping protect the environment,&#x201D; explained Rui. &#x201C;Contributing to the local community was also a big drawcard for me.&#x201D;</p><p>Rui joined Unitywater as a graduate in 2012 and couldn&#x2019;t be happier with her choice. &#x201C;An often overlooked fact about the water industry, is that it&#x2019;s essentially the backbone to how society functions,&#x201D; said Rui. &#x201C;I&#x2019;m also very excited about the future, as the industry grows and shifts into newer technology. For example, we&#x2019;re about to move to resource recovery and explore economical ways to generate electricity from waste.&#x201D;</p><p>Rui&#x2019;s advice for graduates in their first role is to be patient, as the transition from a student to a full time employee can take a little while to get used to. &#x201C;One of my biggest challenges at the start was to navigate my way through different personnel in order to get my job done,&#x201D; recalled Rui.</p><p>Rui also pointed out that everyone in the business is used to new employees coming in, and it serves the business better if everyone is comfortable asking questions.</p><blockquote><p><em>&#x201C;This isn&#x2019;t something we&#x2019;re taught at uni. If you are unsure of anything, don&#x2019;t be afraid of talking to people to get your job done.&#x201D;</em></p></blockquote><p><br></p><h4><strong>Look for Companies who Understand Employees Have a Life Outside of Work</strong></h4><p>It can be hard to find an employer that allows you to get your work life balance right, with a management team which understands and practices flexibility. In Rui&#x2019;s case, Unitywater ticked both boxes.&#xA0;</p><p>&#x201C;Our working hours are fairly flexible- I can start anytime between 6-9 am to suit my schedule for the day,&#x201D; explained Rui. Parents at Unitywater are also accommodated- Rui told us about a playroom at the office, which enables parents to collect kids from school and have somewhere fun for them to hang out if the parents need to return to the office, before going home together.</p><p>Rui herself plays soccer along with coaching a children&#x2019;s soccer team, which means she needs to leave the office before 5pm on some occasions. &#x201C;I love the fact I can finish a bit earlier and complete the work at home later that evening,&#x201D; said Rui.</p><p>Rui and one of her team members are also involved in the Australian Water Association, where they are part of a committee for Young Water Professionals. &#x201C;Unitywater is a corporate member, and my manager is very supportive of both of us putting our time towards the committee, and attending meetings in Brisbane, which again requires some juggling of my schedule,&#x201D; said Rui.</p><p>&#x201C;Ensure to find out if the company practices what they preach,&#x201D; is Rui&#x2019;s advice for job seekers.1&#xA0;&#x201C;Our whole branch is very tight-knit, and I admire our managers and supervisors, who are a living example of how you should conduct yourself professionally.&#x201D;</p><p><br></p><h4><strong>Adapting Your Communication Style</strong></h4><p>&#x201C;When I first started out in the field, I felt a little intimidated being the only female, and working with men who were closer to my parents&#x2019; age,&#x201D; shared Rui. However, Rui quickly realised her team was very welcoming.</p><p>As an engineer, Rui&#x2019;s role includes supporting the plant operators when they encounter problems- a relatively new function because traditionally, plant operators would be used to operating without engineers and making decisions based on empirical observations. We discussed the delicate nature of change management, and collaborating with a broad range of stakeholders.</p><blockquote><p><em>&#x201C;Before explaining the engineering or theoretical point of view, it&#x2019;s very important to understand the other person&#x2019;s point of view,&#x201D; explained Rui.&#x201D; I always ask about prior experience and what the other person&#x2019;s thoughts are on the topic of discussion before sharing my observations.&#x201D;</em></p></blockquote><p>Rui also stressed the importance of not becoming disheartened if the information delivered is not retained the first time, and exploring the way you can change the delivery of the same message.</p><p>Embracing challenges is also a key trait of succeeding in your first role. &#x201C;One of the bigger highlights for me has been stepping into a plant and not only experiencing some of the technical issues firsthand but also working on real solutions,&#x201D; concluded Rui.</p><p>Rui&#x2019;s tips are great for anyone looking to develop their career. &#xA0;</p><hr><h4><strong>About Unitywater<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/130abbe6-f5f1-47fa-898c-f6a74f2bb98f.png\" style=\"float: right; width: 200px; height: 180px; margin: 10px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/130abbe6-f5f1-47fa-898c-f6a74f2bb98f.png\"></strong></h4><p>With a strong focus on being an employer of choice for women, Unitywater provides great opportunities for professional development within a flexible, family-friendly environment. UnitiWater gives you a<span id=\"docs-internal-guid-d2f65e54-e6c6-6455-b6c7-fe9dca9bdad6\">&#xA0;chance to make a difference to the community &amp; build a water business for tomorrow!&#xA0;<br><br>Learn more about Unitywater on their <a data-cke-saved-href=\"https://www.work180.com.au/clients/unitywater\" href=\"https://www.work180.com.au/clients/unitywater\">Best Employer page</a>.</span></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=unitywater\" href=\"https://www.work180.com.au/job-search?client=unitywater\">Apply to join </a>Unitywater.&#xA0;</p><hr><h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3><p>WORK180 (previously DCC Jobs) is a jobs board with a difference. We pre-screen employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients\" href=\"https://www.work180.com.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/dashboard/candidate\" href=\"https://www.work180.com.au/dashboard/candidate\">one click</a>&#xA0;now.&#xA0;&#xA0;</p>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/03","associated_company":"work180"}