{"url":"https://www.work180.com.au/blog/2017/03/time-for-me","title":"Time for Me","author":"WORK180","body":"\n\t\t\t\t\t<p>Most recently I realised how I have spent the last 7 years raising children, running a business, being a wife, a sister, a friend, a mentor.</p><p>I loved every moment but why did I feel guilty when I stopped to take&#xA0;Time for Me!</p><p>Often when a commitment clashes I am quick to put&#xA0;my&#xA0;life on hold while I deal with it, not realising that it was&#xA0;me&#xA0;making the choice to do so.</p><p>In understanding this, I asked the question &#x201C;What do I feel guilty about taking time for me?&#x201D; Now didn&#x2019;t that start an endless internal dialogue, the very essence was that no-one could do it like I do!</p><p>Finally, I had clarity.</p><p>My husband is amazingly supportive and has always backed me no matter my choice, but at 35 I realised it was time to start living.</p><p>So straight away I got my whiteboard out and started a running list of all the things I wanted to do, soul fulfilling adventures which include a champagne seafood lunch in the waters of Bora Bora, snorkelling the Great Barrier Reef and lunch with Richard Branson.</p><p>Whilst I had made a start, how was I going to implement these dream adventures, well it started with my husband gifting me a Bucket List Journal which not only has a space to include an inspirational photo of my dream adventure, but a timeline of when I want to achieve this and how was it going to make me feel.</p><p>Sometimes our headspace is too busy doing the &#x2018;do&#x2019;, rather than planning the what and when, a great reason why my client&#x2019;s come to me as they are busy living their lives, and are able to achieve most things purely because someone else has done the planning.</p><p>&#x2018;Time for Me&#x2019; is a poorly used phrase, it is about stopping and doing something that will bring about a sense of calm where you get to do what makes you happy.</p><p>What&#x2019;s on the top of your list?</p><p style=\"text-align:center\"><br></p><p>To learn more about the services&#xA0;<a data-cke-saved-href=\"/concierge-collective/\" href=\"/concierge-collective/\">CONCIERGE COLLECTIVE</a>&#xA0;offer and your exclusive DCC discount click&#xA0;<a data-cke-saved-href=\"http://www.diversecitycareers.com/page/partner-network/professional-development-services/the-concierge-collective/\" href=\"http://www.diversecitycareers.com/page/partner-network/professional-development-services/the-concierge-collective/\">here</a>.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/03","associated_company":"work180"}