{"url":"https://www.work180.com.au/blog/2015/04/top-companies-with-women-on-boards-perform-better-research-finds","title":"Top companies with women on boards perform better, research finds","author":"WORK180","body":"\n\t\t\t\t\t<p>This article originally appeared in the <a href=\"http://www.smh.com.au/federal-politics/political-news/top-companies-with-women-on-boards-perform-better-research-finds-20150423-1mqsm2.html\">Sydney Morning Herald.</a></p>\n\n<p>&#xA0;</p>\n\n<p>Top Australian companies with at least 25 per cent female boards perform more than 7 per cent better than those with all-male boards, according to research that will boost the push to improve corporate diversity.</p>\n\n<p>Analysis of ASX200 companies released on Thursday shows that, since 2010, investors would have done better if they had put their money in companies that had at least one-quarter female boards, compared with those with less gender-diverse and all-male boards.</p>\n\n<p>The research, by the Centre for Gender Economics and Innovation and Infinitas Asset Management, found companies with gender-diverse boards performed an average of 2 per cent better per year than ASX200 companies generally. They performed more than 7 per cent better per year than companies with no women on their boards.</p>\n\n<p>The level of gender diversity in top companies is &quot;frustratingly low&quot;, the research finds, but is growing. As of March 2015, there were 63 companies that met the 25 per cent threshold, up from 15 in mid-2010.</p>\n\n<p>Centre for Gender Economics and Innovation chairwoman Susanne Moore said women were often thought of as a &quot;cost&quot; in the corporate environment in terms of such issues as job flexibility and maternity leave. But she said women could have a positive impact on the bottom line instead.</p>\n\n<p>&quot;Common sense would tell you that if you have a more diverse group sitting at the decision-making table, then you&apos;re going to get more diverse ideas,&quot; she said.</p>\n\n<p>Infinitas Asset Management director Steve Macdonald said top gender-diverse performers included Medibank Private with chair Elizabeth Alexander and directors Anna Bligh and Cherrell Hirst, Westpac with directors Elizabeth Bryan and Alison Deans and Telstra with chair Catherine Livingstone and directors Nora Scheinkestel&#x200B; and Margaret Seale&#x200B;.</p>\n\n<p>&quot;All-bloke&quot; boards included Cabcharge, logistics company Qube Holdings and mining company Sandfire Resources.</p>\n\n<p>&quot;We&apos;re not claiming that women are such brilliant executives and much better than men and that&apos;s the reason,&quot; he said.</p>\n\n<p>&quot;It&apos;s just that boards function better if there&apos;s a variety of views sitting around the table.&quot;</p>\n\n<p>Mr Macdonald said the issue of women on boards was not a complex problem.</p>\n\n<p>&quot;We shouldn&apos;t be dealing with this. It should just be fixed,&quot; he said.</p>\n\n<p>Greens spokeswoman for women Larissa Waters, who will attend the research launch, said international studies had found that gender-balanced boards were good for business.</p>\n\n<p>&quot;It&apos;s exciting that this index for investors confirms the same is true in Australia,&quot; she said.</p>\n\n<p>Senator Waters is calling on the federal government to give preferred supplier status under procurement guidelines to companies with gender balanced boards.</p>\n\n<p>Liberal and Labor MPs are also expected to attend the Sydney launch.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/04","associated_company":"work180"}