{"url":"https://www.work180.com.au/blog/2017/06/top-tips-for-first-time-expats-job-hunting-in-australia","title":"Top Tips for First-Time Expats Job Hunting in Australia","author":"WORK180","body":"\n\t\t\t\t\t<p>Everyone, no matter what stage of their career will experience loss of confidence and belief in their abilities.&#xA0; These feelings are compounded when you&#x2019;ve moved abroad and are looking for a new job, which is why we really appreciated Gunjan Mehta bravely sharing her story with us. Hopefully her journey of resilience and building confidence may inspire others who are experiencing similar challenges.</p>\n\n<p>Even though Gunjan has worked in global HR roles for over eight years, when she arrived in Australia from India, she found it very difficult to secure a job in her field. Even landing interviews were proving to be a bigger challenge than she&#x2019;s ever experienced in her career.</p>\n\n<p>&#x201C;At first, I assumed that excellence in your field of expertise was all that mattered,&#x201D; explained Gunjan. &#x201C;With Australia being so diverse,&#xA0;<span style=\"color:inherit !important\">I thought my experience across different cultures would be viewed as a plus.</span>&#x201D; On the contrary, Gunjan was turned away by recruiters, with the most common reason being a lack of local experience.</p>\n\n<p>Gunjan felt her confidence levels decreasing steadily, and found it hard to maintain a positive attitude. &#x201C;It was by chance that I went to the movies with my husband one evening, where I saw a poster in the washroom- an advertisement for Diverse City Careers,&#x201D; recalled Gunjan.</p>\n\n<p><strong>Gunjan went onto the DCC Jobs&apos; online jobs board, where she noticed other services to help women with developing their careers and decided she wanted to get some help with tailoring her resume to the Australian market.</strong></p>\n\n<p>&#x201C;Even though in my previous role I used to look at over 200 resumes per day, I knew there was always room for improvement with my own resume and wanted to invest in myself,&#x201D; said Gunjan. &#x201C;When I first spoke to Gemma, I felt a huge confidence boost. Gemma confirmed that my resume was almost perfect, and just needed a few changes.&#x201D;</p>\n\n<p>Gunjan shared the following tips that enhanced her resume;</p>\n\n<ul>\n\t<li>\n\t<p><strong>Always ensure to tailor your resume to reflect any relevant, local experience</strong>. While Gunjan&#x2019;s resume was very descriptive, it was missing remarkable outcomes she delivered while recruiting for Australian hotels through an overseas company.</p>\n\t</li>\n\t<li>\n\t<p><strong>Make your achievements more prominent.</strong>&#xA0;Gunjan had plenty of highlights throughout her career, however, they were &#x2018;buried&#x2019; within the resume. Ensure to make achievements visible, rather than outline your responsibilities in the role.</p>\n\t</li>\n\t<li>\n\t<p><strong>Make sure your LinkedIn profile is up to date.</strong>&#xA0;These days, your online presence is the first place recruiters will review, so ensure your LinkedIn profile reflects your new resume and your other social media sites project a professional image.</p>\n\t</li>\n\t<li>\n\t<p><strong>Practice your pitch.</strong>&#xA0;Gunjan ran through some mock interviews with Gemma and practised speaking about the outcomes she was proud of in a confident manner.</p>\n\t</li>\n</ul>\n\n<p>Just two weeks after contacting DCC Jobs, Gunjan found the job of her dreams and less than one year into the new role, Gunjan is already stepping up into a managerial position.</p>\n\n<blockquote>\n<p>&#x201C;When I first reached out to DCC Jobs, I was very nervous, and it was a matter of confirmation from someone local that I did have a strong background and could add value to a local business that helped boost my confidence. Gemma has been an absolute pillar of strength- it was great to have someone be there for you, and believe in you,&#x201D; summed up Gunjan.</p>\n</blockquote>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2017/06","associated_companies":["work180"]}