{"url":"https://www.work180.com.au/blog/2016/07/top-5-warning-signs-telling-you-its-time-for-a-new-job","title":"Top 5 warning signs telling you it’s time for a new job","author":"WORK180","body":"\n\t\t\t\t\t<p>We&#x2019;ve all felt stressed, upset or unmotivated at work. It&#x2019;s perfectly normal to have such feelings, but the big question is, when do you know it&#x2019;s time to call it quits? Below are five of the main indicators you should look out for.</p>\n\n<p>&#xA0;</p>\n\n<ul>\n\t<li>\n\t<h4><strong>You don&#x2019;t believe in the company&#x2019;s mission</strong></h4>\n\t</li>\n</ul>\n\n<p>If you don&#x2019;t believe in the company&#x2019;s mission, it&#x2019;s highly likely you&#x2019;re not going to be engaged. A lack of engagement at work can result in feeling low and possibly even underperforming, which isn&#x2019;t good for you or the company. Not believing in the organisation also means you&#x2019;re lacking passion. It&#x2019;s important to re-evaluate this regularly, as sometimes you may join a company which aligns perfectly with your own morals, yet ends up operating against what&#x2019;s printed in the welcome brochures. Waking up every morning not passionate or looking forward to work, is no way to live.</p>\n\n<p>&#xA0;</p>\n\n<ul>\n\t<li>\n\t<h4><strong>You don&#x2019;t get along with your boss</strong></h4>\n\t</li>\n</ul>\n\n<p>If you&#x2019;ve tried and tried to make things work with your boss, but you&#x2019;re still having a hard time, it could be time to move on. If your blood pressure feels like it&#x2019;s rising at every interaction, email and phone call with your boss, and there&#x2019;s no other options for working with someone else, it&#x2019;s definitely time to go. Sometimes, issues just can&#x2019;t be fixed.</p>\n\n<p>&#xA0;</p>\n\n<ul>\n\t<li>\n\t<h4><strong>Work is impacting your personal/family life</strong></h4>\n\t</li>\n</ul>\n\n<p>Good employers recognise the importance of work/life balance. Going home and not being able to &#x2018;switch off&#x2019; from work or having to spend ridiculously long hours in the office, is only going to cause stress.&#xA0;No job is ever worth your health or negative impact on your family1. Many forward thinking companies are now implementing policies to support employees with balancing family, personal projects and work, such as flexible hours. At DCC we work with a range of clients, across&#xA0;<a href=\"https://www.diversecitycareers.com/advancedsearch.aspx?search=1\">different industries&#xA0;</a>who all value their employees&#x2019; family &#xA0;and personal commitments.</p>\n\n<p>&#xA0;</p>\n\n<ul>\n\t<li>\n\t<h4><strong>The company is a sinking ship</strong></h4>\n\t</li>\n</ul>\n\n<p>No matter whether you believe in your company&#x2019;s mission or enjoy the people you work with, if the company isn&#x2019;t going to be around for much longer, there&#x2019;s no point in staying to watch it fall apart. A good example of this is Kodak. Kodak was once a hugely successful giant, but after failing to follow the times with digital technology, it went into a downwards spiral and filed for bankruptcy in 2012. At the core of great companies is a strong culture of innovation, but sadly, many get caught up in the mindset of &#x201C;this is how we&#x2019;ve always done things&#x201D;. Recognising this stale culture is important, and working for a company that operates outside the box is much more rewarding.</p>\n\n<p>&#xA0;</p>\n\n<ul>\n\t<li>\n\t<h4><strong>You&#x2019;ve stopped learning or developing your skills</strong></h4>\n\t</li>\n</ul>\n\n<p>Sometimes, you just outgrow your role and feel like you&#x2019;ve learned all you can. If your employer doesn&#x2019;t support you with professional development or even broadening your role to allow you to take on new challenges, it&#x2019;s time to move on.</p>\n\n<p>Taking the leap to change roles can sometimes be scary, but it&#x2019;s scarier to stay in a role that you don&#x2019;t enjoy, doesn&#x2019;t align with your values or negatively impacts your life outside of the workplace. Even when you go through the interview process at a new company, you can often be made promises that aren&#x2019;t kept or painted an embellished picture of how great that company is.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","job seeking tips"],"upload_date":"2016/07","associated_company":"work180"}