{"url":"https://www.work180.com.au/blog/2017/02/turning-perceived-weakness-into-strength-and-other-strategies-for-leadership","title":"Turning Perceived Weakness into Strength & Other Strategies for Leadership","author":"WORK180","body":"\n\t\t\t\t\t<p>Lauren Harris joined <a data-cke-saved-href=\"/clients/BHP\" href=\"/clients/BHP\">BHP</a>&#xA0;as a graduate Geologist five years ago, and from there she quickly progressed her career. First moving into a Mining Production Supervisor role at one of BHP&#x2019;s largest iron ore mines, then into an Alternate Superintendent position in Mobile Maintenance before being appointed Planning and Analysis &amp; Improvement Superintendent at the same operation. Following a recent secondment opportunity, Lauren joined the new Maintenance Centre of Excellence as the Planning Superintendent for Load, Haul and Drill maintenance across all of BHP&#x2019;s iron ore mines. During my conversation with Lauren, I learned how to re-frame career limiting thoughts and develop an inspiring leadership style through her experiences. Here are Lauren&#x2019;s top tips:</p><p><br></p><h4><strong>Take Calculated Risks</strong></h4><p>When enrolling at the Australian National University, Lauren chose to study Accounting and Finance, but when offered an option to combine two degree programs, she chose a Bachelor of Science and Bachelor of Commerce, in order to keep her options open.</p><p>&#x201C;I never really thought of a career in mining,&#x201D; recalled Lauren. &#x201C;Instead, I saw myself as an investment banker - picturing myself in a high rise building on Wall Street.&#x201D;</p><p>As time passed, Lauren noticed a big difference between the degree structures. &#x201C;In Finance classes, there were hundreds of students, while geology classes were the complete opposite,&#x201D; recalled Lauren. &#x201C;ANU employed world famous geology lecturers, who were very passionate and really got to know each student.&#x201D; Lauren achieved a Double Major in geology, and while enjoying her Science degree the most, was still leaning towards a career in Finance. Growing up in Canberra was a major driver for Lauren to pursue jobs in Finance, and her efforts paid off as she was shortlisted for several roles.</p><p>It was at that stage that Lauren was faced with a difficult choice, which in hindsight shaped her future career. One of the Lecturers asked if Lauren was interested in staying on for another year, and completing an Honours degree.</p><p>Lauren decided to pull out of all her finance applications and ended up completing an Honours project with a Geochemist and Geophysicist as her supervisors, graduating with First Class Honours. &#x201C;As I realised I was more excited about my science degree, I started to do my research around the best companies to work with,&#x201D; explained Lauren. &#x201C;I kept across their success, watching them weather the ups and downs of the resources sector.&#x201D; BHP stood out to Lauren the most. &#x201C;For example, during the toughest periods, BHP still ran programs for Uni students, when others didn&#x2019;t. With a diversified portfolio of operations in iron ore, coal, copper, uranium and petroleum, the company weathered the storms well. When one commodity was facing uncertain conditions, BHP still had others with positive prospects.&#x201D;</p><p>Lauren&#x2019;s Honours degree played a big part in helping her land her first job in mining five years ago, and she&#x2019;s been with BHP ever since. Whilst worlds apart from her initial dream career on Wall Street, Lauren wouldn&#x2019;t have it any other way.</p><h4 style=\"text-align:center\"><img alt=\"Australian women rowers\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/15cc5d6f-1672-4339-8b13-d09ede48ae4d.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/15cc5d6f-1672-4339-8b13-d09ede48ae4d.jpeg\"></h4><h4><br></h4><h4><strong>Leverage Sport for Leadership Development</strong></h4><p>When Lauren took on her first people management role, her main concern was,&#xA0;&#x201C;what are people going to learn from a young female with no operational experience?&#x201D;. Drawing on her experience as an elite rower, Lauren was able to link skills developed through sport directly to her new role.</p><p>Prior to Lauren&#x2019;s career in mining, she competed as an elite rower, which included winning bronze at the 2009 World Championships in Europe, where she was also an Australian team leader. In the same year she was nominated Female Athlete of the Year by the state academy of sport and awarded a Full Blue for sporting excellence by the Australian National University. Lauren experienced lots of challenges, not unlike those that occur in the workplace, and the discipline and work ethic that allowed her to excel as an elite athlete transferred directly to success in her professional career.</p><p>&#xA0;&#x201C;To me, discipline in sports translates to the workplace; setting goals, training hard, showing commitment to see something through with consistency, even when things get tough. If you know how to succeed at something based on this process, those skills are quite transferrable,&#x201D; Lauren told me.</p><p>Even though Lauren attended an all-girls school, through sports she was around plenty of alpha males, yet never thought of herself as different. &#x201C;We all trained hard together, which stood me in good stead to enter an industry such as mining,&#x201D; concluded Lauren.</p><p><br></p><p style=\"text-align:center\"><img alt=\"Lauren Harris\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ba03ae98-c8db-413e-a933-3531ff69607f.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ba03ae98-c8db-413e-a933-3531ff69607f.jpeg\"></p><h4><strong>Turn Perceived Weakness into Strength</strong></h4><p>Lauren progressed her career quickly, receiving a promotion to Mining Production Supervisor towards the end of her Graduate program, where she was in charge of ensuring the safety of a team of 30 Production Technicians.</p><p>&#x201C;What scared me most going from Geologist to Production Supervisor was my lack of an operational background, and I questioned how I could make a difference,&#x201D; shared Lauren. &#x201C;However, I soon realised that I didn&#x2019;t need to focus on this, as I had other skills and experience to offer.&#x201D;</p><p>The fact Lauren wasn&#x2019;t a digger operator or a truck driver, did not impact on her ability to lead the team. &#x201C;It became clear to me that my team was employed to do that, and I was employed to ensure their safety and assist in their career development&#x201D; said Lauren. &#x201C;In addition, it forced me to recognise that you cannot micro manage something you cannot do yourself, and you need to learn from your team in order to be an effective leader.&#x201D; Lauren leveraged this way of thinking to realise her strengths and ways she could add value to the team.</p><p>&#x201C;People much prefer if you are honest about being green,&#x201D; explained Lauren. &#x201C;On my first day, I told my team I have no mining experience, but that my role was to &#x2018;listen to their needs and remove the clutter, whilst also maintaining and improving productivity&#x2019; so they can be happy and productive. I promised to listen to them and make their lives easier. I promised to remove any red tape where possible and ensure their ideas are heard at the appropriate level of the business.&#x201D;</p><p><br></p><p style=\"text-align:center\"><br></p><h4><strong>Lead by Learning</strong></h4><p>Lauren&#x2019;s top tip for gaining trust and respect as a leader is quick and easy-&#xA0;Show respect and willingness to learn.</p><p>Lauren never put herself on a pedestal, and worked side by side with her team. She was genuinely interested in what the operators on her team did in their day to day roles. &#x201C;I would sit with them in the machines or walk with them around a job in the pit while they talked me through the different aspects of their roles. Their ability to teach me was where I gained the most experience,&#x201D; said Lauren. &#x201C;In the end, those operators taught me more in a short period than I&#x2019;d learnt in any kind of educational institution.&#x201D;</p><p>In Lauren&#x2019;s opinion, bypassing exposure to the front line would have meant she didn&#x2019;t develop the empathy she has now. &#x201C;People don&#x2019;t need to worry so much about fast tracking their progress &#x2013; having a variety of exposure to the business makes a far greater impact,&#x201D; is her greatest take away from that experience.</p><p><br></p><h4><strong>Build a Network of Supporters </strong></h4><p>At one stage, when Lauren was on a secondment to the Maintanance department, she worked closely with a Superintendent who played a key role in her development. &#x201C;Shane&#x2019;s wife is a Fitter by trade, therefore he was aware of the challenges faced by women in non-traditional roles and was very passionate about mentoring the women around him,&#x201D; recalled Lauren. &#x201C;He wanted me to enjoy the secondment, and stay in the role.&#x201D; Shane succeeded; following her secondment, Lauren was offered a role as Maintenance Planning Superintendent at the same operation, and shortly after joined BHP&apos;s Maintenance Centre of Excellence. In this role, Lauren had the opportunity to design the future of maintenance planning and scheduling across BHP&#x2019;s Australian operations.</p><p>&#x201C;I&#x2019;ve had exposure to great senior leaders whom I really trust, not necessarily mentors on a regular basis, but rather people in senior positions whom I&#x2019;ve met throughout my career,&#x201D; explained Lauren. &#x201C;Several leaders, both male and female, whom I&#x2019;ve worked with on mine sites over the years have kept an active interest in my career and provided sound advice for me to make good career decisions. I&#x2019;ve never felt pushed into a role where I haven&#x2019;t had great support from the leadership,&#x201D; summed up Lauren.&#xA0;<span style=\"font-size: 16px;\">&#xA0;</span></p><div style=\"font-family: sans-serif, Arial, Verdana, &quot;Trebuchet MS&quot;; font-size: 13px;\"><br></div><p style=\"font-style: italic;\"><span style=\"font-family: Lato, sans-serif; font-size: 16px; font-style: normal;\">Lauren&#x2019;s tips are invaluable for navigating the common barriers we can face as young leaders.&#xA0;</span></p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/34e68e54-0e5d-4c85-8dde-7ce4998bf8f4.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/34e68e54-0e5d-4c85-8dde-7ce4998bf8f4.png\" style=\"font-family: sans-serif, Arial, Verdana, &quot;Trebuchet MS&quot;; font-size: 13px; float: right;\"></p><div><br><div><blockquote><p style=\"font-style: italic;\">You can learn more about working with BHP&#xA0;<a data-cke-saved-href=\"http://https://www.dccjobs.com/clients/bhp\" target=\"_blank\" href=\"http://https://www.dccjobs.com/clients/bhp\">here</a>. BHP is also Flex Able Certified meaning&#xA0;job seekers are encouraged to discuss flexible working already at the interview stage. Apply for BHP jobs&#xA0;<a data-cke-saved-href=\"http://www.dccjobs.com/job-search?client=bhp\" target=\"_blank\" href=\"http://www.dccjobs.com/job-search?client=bhp\">here</a>.&#xA0;</p></blockquote><div><br></div><div><br></div><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p></div></div>\n\t\t\t\t","tags":["Employee Stories"],"upload_date":"2017/02","associated_company":"work180"}