{"url":"https://www.work180.com.au/blog/2015/10/two-australian-female-led-organisations-focus-on-improving-australias-falling-number-of-female-leaders","title":"Two Australian female led organisations focus on improving Australia’s falling number of female leaders","author":"WORK180","body":"\n\t\t\t\t\t<p>In Australia, we&#x2019;re facing&#xA0;confronting statistics&#xA0;both&#xA0;around the gender&#xA0;gap between men and women and the number of women in leadership. According to the&#xA0;<a href=\"http://www.wgea.gov.au/\">WGEA</a>, the pay gap average is around 17.9% between males and females and&#xA0;82.7% of CEOs of non-public sector companies are male. In addition to this only 19%&#xA0;of startups are led by females, according&#xA0;to the recent survey by&#xA0;<a href=\"https://www.startupmuster.com/\">Startup&#xA0;Muster</a>.&#xA0;&#xA0;</p>\n\n<p>Two Australian&#xA0;female led&#xA0;organisations&#xA0;focused on supporting women -&#xA0;startup DCC Jobs and angel investment firm&#xA0;<a href=\"http://www.formingcircles.com.au/\">Forming Circles Global (FCG)</a>&#xA0;are tackling these issues head on by enabling recruitment of women into companies (DCC) and funding women-led startups (FCG).&#xA0;</p>\n\n<p>DCC Jobs,&#xA0;launched in May 2015, is&#xA0;Australia&apos;s only job site that screens companies based on policies and culture&#xA0;around&#xA0;supporting women. Founders&#xA0;Gemma Lloyd and Valeria Ignatieva,&#xA0;started DCC Jobs after seeing&#xA0;common challenges faced by&#xA0;women working in industries under-represented by females.&#xA0;</p>\n\n<p>In the short time since launch, DCC Jobs has experienced&#xA0;overwhelming success with clients such as&#xA0;PwC, Origin Energy,&#xA0;IBM,&#xA0;Minter Ellison, Laing O&#x2019;Rourke, Cue Clothing,&#xA0;ThoughtWorks&#xA0;and Curtin University advertising with the company.&#xA0;</p>\n\n<p>&#xA0;Both founders&#xA0;are very active in the diversity and inclusion community &#x2013; Gemma&#xA0;is a board member of IT Queensland and Females in IT &amp; Telecommunications (FITT) and Valeria has served on the FITT committee for two years prior to DCC Jobs.&#xA0;</p>\n\n<blockquote>\n<p><em>&#x201C;While we saw</em>&#xA0;<em>first-hand</em>&#xA0;<em>the challenges that exist in the IT industry, we also came across many companies who are passionate</em>&#xA0;<em>about diversity, with a</em>&#xA0;<em>huge focus on ensuring the workplace environment does not exclude women</em>&#xA0;<em>from pursuing rewarding careers,&#x201D;</em></p>\n</blockquote>\n\n<p>DCC Jobs works hard to raise the profile of such companies and shares stories and commitment from industry leaders,&#xA0;through digital campaigns like the <a href=\"http://www.diversecitycareers.com/page/companies-we-endorse/leaders-for-gender-diversity/\">Australian Leaders in Gender Diversity </a>campaign.&#xA0;</p>\n\n<p>Working with clients and partners, DCC Jobs are strong advocators for flexible working - the next event on this topic will be held in Sydney, with representatives from Telstra, GHD and Macquarie University&#xA0;sharing their insights and practical advice.&#xA0;&#xA0;</p>\n\n<p>The women also provide support to female candidates through a range of events, webinars and free resources on topics such as personal branding, negotiation and&#xA0;other&#xA0;areas of professional development.&#xA0;</p>\n\n<p>FCG, headed by angel investor Renata Cooper, will invest half a million dollars over three years in female-led technology&#xA0;startups, small business grants and Australian social enterprises doing good globally.&#xA0;FCG&#x2019;s current portfolio of seven companies includes two US-based and five Australian companies. Renata is also a member of Scale Investors and a muru-D mentor.</p>\n\n<p>In August 2015, FCG launched the <a href=\"http://www.formingcircles.com.au/kickstart-your-business-grant/\" target=\"_blank\">Kickstart Your Business</a> initiative - a $5000 grant plus mentoring opportunity with industry leaders. This week, DCC were&#xA0;announced as the proud winners.&#xA0;</p>\n\n<blockquote>\n<p><em>&#x201C;We were overwhelmed with</em>&#xA0;<em>the responses from women-led/owned businesses to our spring Kickstart Your Business Grant. Diverse City Careers stood out and won the grant for</em>&#xA0;<em>showcasing their passion to place</em>&#xA0;<em>women into some of Australia&#x2019;s top companies committed to creating ideal workplaces for them. Founders Valeria and Gemma have a clear vision of a more gender neutral</em>&#xA0;<em>Australia with inclusive workplaces and we hope winning the grant helps in realising</em>&#xA0;<em>that goal,&#x201D;</em> said Renata Cooper.&#xA0;</p>\n</blockquote>\n\n<blockquote>\n<p><em>&#x201C;We are so pleased to have been awarded this grant. It&#x2019;s so necessary for women to be supporting other women if we want to make a real change- both in the</em>&#xA0;<em>startup and corporate world,&#x201D;</em> stated Gemma.&#xA0;&#xA0;</p>\n</blockquote>\n\n<p>For media enquiries, please contact Valeria Ignatieva: <a href=\"mailto:valeria@diversecitycareers.com\">valeria@diversecitycareers.com</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2015/10","associated_company":"work180"}