{"url":"https://www.work180.com.au/blog/2016/03/view-from-the-balcony-an-interview-with-sally-macindoe","title":"VIEW FROM THE BALCONY: An interview with Sally Macindoe","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was orginally published on the Women in Finance <a href=\"http://www.womeninfinance.org.au/index.php?id=137\">website</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Sally Macindoe is a Partner, the immediate past Chairman and current Global Head of Diversity &amp; Inclusion at Norton Rose Fulbright. She is also the national leader of Norton Rose Fulbright Australia&#x2019;s environment and planning practice. Sally was named the Diversity Leader for the Advancement of Women by the Equal Opportunity for Women in the Workplace Agency at their 2011 Business Achievement Awards, Female Partner of the year at the 2012 Lawyer&#x2019;s Weekly Women in the Law Awards in recognition of her leadership in the diversity area, National Australia Bank Women&#x2019;s Agenda Change Champion in 2013 and named in the 2013AFR/Westpac 100 Women of Influence.</p>\n\n<p>In her time in leadership positions, Sally has been instrumental in achieving the following at Norton Rose Fulbright Australia:</p>\n\n<ul>\n\t<li>An increase in female Partners from 9% in 2005 to 25% in 2015 (with many working flexibly);</li>\n\t<li>An increase in female Senior Associates to over 65%;</li>\n\t<li>Equalised turnover by gender;</li>\n\t<li>An increase in the percentage of all female staff successfully working flexibly from 19% to 27% over the last four years;</li>\n\t<li>Certified as an &#x2018;Employer of Choice for Gender Equality&#x2019; again in 2014 by the Workplace Gender Equality Agency (WGEA); and</li>\n\t<li>Winner of the &apos;Inclusive Workplace Award&apos; at the 2014 Australian Human Resources Institute (AHRI) Inclusion &amp; Diversity Awards.</li>\n</ul>\n\n<p>Sally spoke at one of our Women in Finance event&#x2019;s last year. I know that I was one of many who was eager to know more about how Sally had achieved such career success, whilst also working flexibly and being a single Mum to two boys.</p>\n\n<p>Therefore I was delighted that Sally agreed to share the following &#x201C;View from the Balcony&#x201D; tips with us:</p>\n\n<p><strong>1.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>If you do what you enjoy, you will succeed</strong></p>\n\n<p>&#x201C;I think that it is important to understand why you work,&#x201D; says Sally.&#xA0;&#x201C;Do you work because you love it or because you have to? &#xA0;I think that to progress in your career you have to love what you do and understand why you do it.&#xA0; If you enjoy what you do you will succeed.&#x201D;</p>\n\n<p>Like most, Sally did not know what she wanted to do when she left school. The area of study she enjoyed most was urban geography and she was also strong in Japanese. So Sally chose to go to Monash University, which was strong in both these areas. On advice of her school principal she also enrolled in law as it was likely to give her more options.&#xA0; &#x201C;If I look back, this was sensational advice,&#x201D; says Sally.</p>\n\n<p>Whilst Sally did not particularly enjoy studying law, she likes to finish what she starts and so she decided to do her Articles. To Sally&#x2019;s surprise, she found that she loved the practice of law and discovered a niche area in planning and environment, which also allowed her to combine her love of urban and environmental planning.</p>\n\n<p><strong>2.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Flexible working is about being organised and working smart</strong></p>\n\n<p>Whilst Sally was still on maternity leave with her second child, a few events happened in Sally&#x2019;s personal life and she found that she was suddenly single.&#xA0; Around the same time, the other Partner in her practice area left to go to another firm. Sally was then asked by her Managing Partner, if she would come back to work and lead her national practice group.&#xA0; When Sally explained her situation he indicated she would have full firm support and could work however she needed to.&#xA0; &#x201C;I never thought and planned about working flexibly,&#x201D; says Sally. &#x201C;I just worked how I could out of necessity.&#x201D; After Sally had both her children, she initially came back to work three days a week, but found that she was taking a lot of phone calls on her two days at home. Therefore she decided that&#xA0;a four day work week was best for her.&#xA0;</p>\n\n<p>&#x201C;I was really allowed to work in whatever way I needed to, provided that I was delivering on the required outcomes,&#x201D; says Sally. &#x201C;I learnt to deliver the best service in a different way to a full time partner. Part of that was empowering the staff that worked for me to help manage the client relationship. It is important to remember that clients come first and your team are an incredibly important part of that&#x201D;.</p>\n\n<p>&#x201C;It can be challenging and tiring though,&#x201D; says Sally. &#x201C;The way I have managed my work and family commitments has changed over time.&#xA0; When my children were babies they went to a cr&#xE8;che in the city and I used to express at work and courier the milk to the cr&#xE8;che. The bike riders had no idea what they were transporting!&#xA0; Once my kids were at primary school, my flexible working arrangements needed to take a different form and then a different form again when they were in senior school. I found a wonderful young grandmother, who looks after the boys after school. She has become part of our family. I am also lucky that their father has always been very involved in their lives and has them a couple of nights a week and helps with taking them to sport and other commitments.&#x201D;</p>\n\n<p>&#x201C;Whilst it is not easy to manage flexible arrangements, I now have a team that includes a number of parents (male and female) who are working flexibly,&#x201D; says Sally. &#x201C;For it to work, it has to be three dimensional, taking into account the needs of the business and clients, the team and the individual. If anyone approaches it as a pure entitlement, it will not work. You are also not doing anyone any favours if your peers bear the brunt. Good communication is critical to making flexible arrangements work. I have always been very transparent with my clients about the way I have been working and we have a whiteboard at work to help manage my team&#x2019;s flexible arrangements. I am proud of our group and the way they help each other out.&#x201D;</p>\n\n<p><strong>3.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Accept opportunities</strong></p>\n\n<p>&#x201C;I have had a number of career changing opportunities, but none of those opportunities came when I had spare time,&#x201D; says Sally</p>\n\n<p>One of these was in 2005 when Sally&#x2019;s then Managing Partner, came into her office and suggested that she should stand for election to the firm&#x2019;s Board. &#x201C;It had never occurred to me to do this,&#x201D; says Sally. &#x201C;I had the perception that you had to have a finance or corporate background to be on the board.&#xA0; Also, no female partner had ever&#xA0;been elected to the Board before. I decided to put my hat in the ring, as the worst thing that could happen was that I would not get elected. But to my delight, I did get elected&#x201D;. No one could say that Sally&#x2019;s appointment was made to address a lack of diversity, as it had been a closed electorate. &#x201C;It was a big honour that the partnership was vesting confidence in me and I found it very empowering,&#x201D; says Sally.</p>\n\n<p>Sally has also accepted opportunities outside of the firm.&#xA0;She was asked invited by the then Minister for the Arts, the Honourable Mary Delahunty, to join the board of the Melbourne Recital Centre. Sally was appointed to the Board when the project was in a formation stage as her planning and project background was a skillset of value to the Board. &#x201C;At the time I felt stretched, but it was such a wonderful opportunity, to have a role in developing what has become one of the best performing centres in the world&#x201D;.</p>\n\n<p>A year ago Sally was also appointed to the Committee (Directors) of the MCC. &#x201C;I feel very privileged to sit around the table and work with such an outstanding group of people and the MCC is one of the biggest sporting clubs in the world,&#x201D; says Sally.</p>\n\n<p>&#x201C;Opportunities often present themselves at an inconvenient time,&#x201D; says Sally. &#x201C;I have always adopted a &#x2018;minimum 24 hour rule&#x2019; to considering any opportunity. If you are offered a role that you are not sure about, express gratitude and ask for some time to think about it. I have noticed that some women have a tendency to immediately say &#x2018;I am not the right person/up to the task&#x2019; or &#x2018;I am too busy to take that on now&#x2019;. Women owe it to themselves to recognise when they are being presented with an opportunity and to give themselves some time and space to think about how they might be able to do it.&#xA0;That said, the worst thing to do is accept every opportunity and do a bad job&#x201D;.</p>\n\n<p><strong>4.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Mentors and sponsors</strong></p>\n\n<p>&#x201C;Mentoring programs do not necessarily need to be formally structured. I have never been put through a formal mentor program, but I have naturally found mentors a long the way.&#xA0; I had a senior female stockbroker take an interest in how I was going managing work and bringing up children and she was very encouraging. I found it very helpful to have someone from outside the organisation to seek counsel with,&#x201D; says Sally. &#x201C;But people need to be careful of not falling into the trap of expecting mentors to solve all their problems. Your career is your responsibility. It is also important to remember that great professional relationships are two way streets and you need to think about how you can also help your mentor&#x201D;.</p>\n\n<p>Sally says that she has also had a few great sponsors over the years. &#x201C;A sponsor talks in your favour when you are not in the room, presents opportunities to you and encourages you to step up,&#x201D; says Sally.&#xA0;</p>\n\n<p><strong>5.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Build your knowledge and your profile in your sector </strong></p>\n\n<p>&#x201C;To build a practice in planning and environmental law I had to become known and build a profile in that sector,&#x201D; says Sally. &#x201C;This wasn&#x2019;t going to happen by hoping that someone looked at my LinkedIn profile.&#x201D; I looked for opportunities to present at relevant industry forums. I also attended events where I could learn about new developments that might impact my clients&#x2019; businesses. For example, I have learnt all sorts of concepts associated with traffic and acoustic engineering and new approaches to protecting the quality of water. I also have the Financial Review delivered every morning and keep abreast of articles relevant to our clients and practice. This ensures you understand the business environment within which your clients are operating, provides information to discuss with clients which&#xA0; enhances your relationship with them&#x201D;.</p>\n\n<p><strong>6.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Build your network </strong></p>\n\n<p>&#x201C;Networking is incredibly important and benefits you throughout your career,&#x201D; says Sally.</p>\n\n<p>&#x201C;Women need to make the time to network. When my boys were young, their Dad would have them on Monday nights, so I would arrange to catch up with people after work on Mondays. I would also look for Tuesday breakfast networking opportunities&#x201D;.</p>\n\n<p>&#x201C;You can stretch yourself too thin though. So I think it is important to be smart about how you network. Think about why you want to network and who you want to network with. Then ask yourself if there is a particular forum where everyone you want to meet goes. Also look for opportunities to mix with people who share common interests. For example, the parents at your kids&#x2019; school&#x201D;.</p>\n\n<p>&#x201C;Networking is also about building deep relationships and being interested in the broader perspective of people that you work or mix with.&#xA0;If it is done well it starts at young age with your peers and then as you develop and mature then so do they.&#x201D;</p>\n\n<p>&#x201C;If you are networking and not getting anything out of it, then this is where mentors can be helpful. They can help you with the how and why and help open some doors&#x201D;.</p>\n\n<p><strong>7.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Develop resilience</strong></p>\n\n<p>&#x201C;Women often have a desire to be liked and to want to always reach a consensus, which can make it difficult for them to participate in the leadership journey,&#x201D; says Sally. &#x201C;I think it is also important to remember that leadership is about authenticity, bringing people along on a journey, listening to and receiving feedback, considering feedback, and having the resilience and presence to give difficult messages. I think women in particular, could benefit from assistance in developing resilience. It is important to remember that if you have listened to someone and articulate that you have a different viewpoint, it is much easier for them to accept than if they feel that you have not listened.&#x201D;</p>\n\n<p><strong>8.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Understand and help drive strategy</strong></p>\n\n<p>&#x201C;If people do not understand the strategy, they will often not support the decisions that are made,&#x201D; says Sally. &#x201C;A lack of vision for the long term and articulation of policy is often the underlying cause of office politics that is disruptive and overly negative. Conversely, successful organisations tend to have more people that are willing to participate in driving change.&#x201D;</p>\n\n<p>&#x201C;Women often shy away from office politics. However, women should be interested and participate in debates around strategy. Personally, I have always been fascinated with strategy. I think that this is reflected in my choice of service area which requires forward thinking and planning for the future. I think this interest was a key driver behind being elected to the Board and later becoming the Chairman of Norton Rose Fulbright Australia&#x201D;.</p>\n\n<p><strong>9.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; </strong><strong>Engage men in the diversity discussions</strong></p>\n\n<p>&#x201C;Once I was elected to the Board, I was asked to think about diversity,&#x201D; says Sally.&#xA0; &#x201C;It was not really until this point that I saw the issue from a strategic perspective. Whilst diversity and inclusion involves significantly more than just dealing with gender, the issue of retaining and developing female talent is a critical business issue in most businesses but particularly in the professional services sector. Therefore it needs to be led from the top and men need to be part of the conversation. The challenges need to be solved by everybody, not just women. Men are also increasingly going to need to work differently. We need to bust the myth that flexible working is in some way &#x201C;down shifting&#x201D;, because actually it is about working differently and working smarter.&#x201D;</p>\n\n<p><strong>10.&#xA0; </strong><strong>Get rid of the guilt factor and force yourself to slow down</strong></p>\n\n<p>&#x201C;I believe that you get out of life what you put into it, but you don&#x2019;t have to kill yourself in the process,&#x201D; says Sally. &#x201C;It is important to force yourself to slow down sometimes. I love participating in the lives of my children, I love music, sport, cooking and wine and I love to travel. I make sure I prioritise to fit those things in.&#x201D;</p>\n\n<p>And Sally&#x2019;s final gem&#x2026;..&#x201C;Get rid of the guilt factor.&#xA0; If you are happy and centred, everything else works.&#xA0;&#x201C;</p>\n\n<p>We thank Sally for her fabulous insights.</p>\n\n<p><em>Interview conducted and article prepared by </em><a href=\"http://www.womeninfinance.org.au/index.php?id=31#c67\"><em>Liz Smith.</em></a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2016/03","associated_company":"work180"}