{"url":"https://www.work180.com.au/blog/2017/08/viva-energy-joins-dcc-endorsed-employers-who-pays-super-on-unpaid-parental-leave","title":"Viva Energy Joins DCC Endorsed Employers who Pay Super on Unpaid Parental Leave and Becomes First in Australia to Pay Full Super to Part-Time Parents for 5 Years. ","author":"WORK180","body":"\n\t\t\t\t\t<p>Viva Energy Australia (&#x201C;Viva Energy&#x201D;) &#x2013; the exclusive licensee to the Shell brand in Australia has introduced full-time superannuation payment of 12% base salary during unpaid parental leave and part-time work periods. Viva Energy joins multiple DCC Endorsed Employers for Women who pay super whilst on unpaid parental leave. Employers include <a href=\"https://www.dccjobs.com/clients\">BHP, Aurecon, Thales, Avanade, BOQ, Cbus, CommBank, NAB, AustralianSuper and Schneider Electric. </a>&#xA0;Viva Energy has become the first company in Australia to offer employees a full-time superannuation payment of 12% base salary for up to five years during unpaid parental leave and part-time work periods.</p>\n\n<p>Viva Energy CEO, Scott Wyatt (pictured in middle with baby in the photo above), said he was immensely proud of the new policy and called on corporate Australia to look at ways that they can help parents &#x2013; particularly women &#x2013; to overcome systemic financial disadvantage in retirement as a result of taking time out of the workforce to have children.&#xA0;</p>\n\n<blockquote>\n<p><em>&#x201C;While the new policy applies equally to men and women, we know it will make a lifetime&#x2019;s difference to the retirement savings of female employees who traditionally take extended time off to have children and often return to work part time,&#x201D; said Scott.</em></p>\n</blockquote>\n\n<p>&#x201C;When I became a&#xA0;Workplace Gender Equality Agency (WGEA)&#xA0;Pay Equity Ambassador, I pledged to encourage other business leaders to recognise the importance of pay equity,&#x201D; he said.</p>\n\n<p>&#x201C;I hope our new policy inspires other businesses to be innovative in working on the challenge within their own companies if a gap exists.</p>\n\n<p>&#x201C;Besides being the right thing to do, investing in the future of employees also makes sound business sense.</p>\n\n<p>&#x201C;It provides another incentive to attract and retain high-performing staff while enabling them to manage work-life responsibilities across an extended period.</p>\n\n<p>&#x201C;Our company has always taken a leading position on superannuation as an important strategic element of our remuneration and have paid 12% of base salary for nearly 20 years, well above the government mandated rates.&#x201D;</p>\n\n<p>DCC&apos;s partner<a href=\"https://www.dccjobs.com/what-women-want/support-network/government-agencies/workplace-gender-equality-agency\"> Workplace Gender Equality Agency (WGEA)</a> and Director, Libby Lyons, strongly supports Viva Energy&#x2019;s policy initiatives.</p>\n\n<blockquote>\n<p><em>&#x201C;Taking time out of the workforce to care for children should not have any impact on an employee&#x2019;s economic security in retirement. As women still carry the disproportionate share of society&#x2019;s caring responsibilities, the statistics tell us that they also accumulate significantly less retirement savings,&#x201D; said Libby.</em></p>\n</blockquote>\n\n<p>Viva Energy is to be congratulated for taking these positive actions to substantially improve the retirement balances of their employees who are also working parents.<br>\n&#xA0;</p>\n\n<h4><strong>Find out Which Employers Pay&#xA0;Super Whilst on Unpaid Parental Leave</strong></h4>\n\n<p>Tackling the gender super gap is a priority for DCC&apos;s endorsed employers and part of the pre-screening process. &#xA0;According to the Association of Superannuation Funds Australia, Women&apos;s average superannuation balances at retirement are 52.8% lower than men&apos;s[1]. Women are more likely to use unpaid parental leave and return to work part-time making payment of superannuations extremely important to help bridge the gendered superannuation gap.</p>\n\n<blockquote>\n<p><em>Finding out who pays super whilst on unpaid parental leave is easy on the DCC website. Simply <a href=\"https://www.dccjobs.com/clients\">choose a DCC Endorsed Employer</a> and analyse their workplace initiative&#xA0;grid which can be found on their employer profile page.</em></p>\n</blockquote>\n\n<p>The workplace initiative grid is unique to DCC Jobs and discloses information about employers not available anywhere else. It includes information about other initiatives such as flexible work arrangements, amount of paid parental leave, mentoring opportunities and much more. It is an essential tool when evaluating employers and <a href=\"https://www.dccjobs.com/job-search\">searching for jobs</a>.&#xA0;<br>\n&#xA0;</p>\n\n<h5><strong>About DCC Jobs</strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n<p><small>References</small></p>\n\n<p><small>[1] Clare, R. (2015),<em> Superannuation account balances by age and gender</em> (Sydney: Association of Superannuation Funds of Australia)</small></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["DCC News","gender equality","References","[1] Clare R. (2015), Superannuation account balances by age and gender (Sydney: Association of Superannuation Funds of Australia)"],"upload_date":"2017/08","associated_company":"work180"}