{"url":"https://www.work180.com.au/blog/2018/05/want-to-engage-more-talented-women-in-2018-start-by-being-honest","title":"Want to engage more talented women in 2018? Start by being honest.","author":"WORK180","body":"\n\t\t\t\t\t<p>Recruitment has changed so much in recent years and won&#x2019;t be sitting still any time soon.</p>\n\n<p>Advances in technology and digital marketing are still changing the game. Social sharing and &#x2018;employer reviews&#x2019; are also shifting candidate behaviours. Your talent rivals are ramping up their efforts to beat you to the best people. It&#x2019;s a daunting mix. Add to it your ongoing gender diversity challenge and it can, at times, be hard to know where to start.</p>\n\n<p>Except it&#x2019;s not.</p>\n\n<blockquote>\n<h4><em><strong>To attract the best women in your field to join your organisation, you need to start with who you are and what you are trying to become. Then you have to share it with the women you&#x2019;re trying to target.&#xA0;&#xA0; </strong></em></h4>\n</blockquote>\n\n<p>At WORK180, we spend every day helping employers to do exactly this. Here are a few fundamentals we&#x2019;ve learned along the way.&#xA0;&#xA0;&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>1. Be honest about your challenge and the journey you&#x2019;re on&#xA0;&#xA0; </strong></h4>\n\n<p>It&#x2019;s amazing how many employers still oversell themselves in their recruitment collateral, to try to lure people in. Candidates and employees will ditch you in a heartbeat if you&#x2019;re not what they thought you were. All the research supports the common sense on this one &#x2013; Be upfront from your job ad campaigns onwards about the reality of your diversity challenge and show how (and why) you&#x2019;re changing. Candidates will respect you for the honesty and new hires are much more likely to join with the right expectations and motivations.</p>\n\n<p>For example, over 40% of WORK180 Endorsed Employers choose to display their engagement scores and turnover rates on their <a href=\"https://www.work180.com.au/clients\">profile pages</a>, even when it&#x2019;s not currently a mandatory field. Candidate feedback indicates they appreciate transparency and are more likely to trust and apply with a company when these stats are not hidden, regardless of how impressive / low these scores are.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>2. Purpose really matters, especially to women</strong></h4>\n\n<p>Why do you do what you do? Do your people connect with that purpose? If so, you&#x2019;ve got a great opportunity to attract more female applicants. Experience has consistently taught us women value organisations and roles with a purpose and goals that they believe in. This is backed up consistently by <a href=\"https://www.work180.com.au/blog/2017/11/we-analysed-how-women-engaged-with-130-of-the-best-employer-brands-heres-what-we-learned\">research we&#x2019;ve conducted</a>, and in the amazing stories our clients share with us. If you have similar stories, share them!&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>3. Don&#x2019;t take equal opportunities and fair treatment for granted </strong></h4>\n\n<p>Equal opportunities and fair treatment are very important decision-making factors for women planning their next move. Firstly, don&#x2019;t just assume you deliver on this front. Make sure. And if you do, or have measures in place to get there, ensure this is clearly communicated across your marketing assets and campaigns.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>4. Does your business welcome women? Spell it out, again and again and again.&#xA0;&#xA0; </strong></h4>\n\n<p>A few years ago, Sue O&#x2019;Brien, then CEO of Norman Broadbent, said it can often take eight phone calls to persuade a woman to apply for a job, compared with just two calls for a man. While there are indications this is changing, the fact remains; women tend to be more reticent about putting themselves forward for a role. Research shows that they are more likely than men to understate their capabilities (and even their expected salary).</p>\n\n<p>What does this mean for you? Well, it means your ideal candidate almost applied, but didn&#x2019;t. And in most cases, you&#x2019;ll never even know they were interested. Our clients consistently find that by being clear about their talent offer and their diversity goals, and by repeating this message across all channels, the great prospective candidates apply. Talent pooling is great for this. Stay in touch with prospective candidates, whether it&#x2019;s past employees, previous applicants, or people who have expressed an interest in future opportunities. Nurture them and keep showing them what you offer, what it&#x2019;s like to work for you and who you&#x2019;re looking for. Combine this with great recruitment campaigns and the quality applications will follow.&#xA0; &#xA0; &#xA0;<br>\n&#xA0;</p>\n\n<hr>\n<h4>Become an Endorsed Employer for Women!&#xA0;<a href=\"https://www.work180.com.au/advertisers/dcc-criteria-for-advertising-jobs?\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5e991e28-a1b5-45ee-ae8d-e6febb62ec88.png\" style=\"float: right; margin: 10px; width: 150px; height: 150px;\"></a></h4>\n\n<div>\n<p><a href=\"https://www.work180.com.au/advertisers/dcc-criteria-for-advertising-jobs?\"><u>Apply here to check if your organisation meets the&#xA0;criteria.</u></a></p>\n\n<p>&#xA0;</p>\n\n<h4>About WORK180</h4>\n\n<p>WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.</p>\n</div>\n\n\t\t\t\t","tags":["gender equality","WORK180 News"],"upload_date":"2018/05","associated_company":"work180"}