{"url":"https://www.work180.com.au/blog/2017/11/we-analysed-how-women-engaged-with-130-of-the-best-employer-brands-heres-what-we-learned","title":"We Analysed How Women Engaged with 130 Best Employer Brands. Here’s What We Learned.","author":"WORK180","body":"\n\t\t\t\t\t<p>Why is it that some employers achieve gender balance through recruitment practices incredibly quickly while others take a lot longer?</p>\n\n<p>Of course, the industry sector and employer reputation plays a part however, after analysing tens of thousands of job advertisements, company policies and employer branding initiatives, we found some common themes.</p>\n\n<p>For those unfamiliar with WORK180 (previously DCC Jobs), we are the only jobs board globally which <a href=\"http://www.dccjobs.com/advertisers/dcc-criteria-for-advertising-jobs\" target=\"_blank\">pre-screens employers</a>. We evaluate companies on workplace initiatives such as amount of paid parental leave, flexible working arrangements, professional development programs, community engagement and much more. The information around these initiatives can be found on the <a href=\"https://www.dccjobs.com/clients\" target=\"_blank\">employer profiles,</a> the majority of which is not accessible elsewhere.</p>\n\n<p><strong>And the results are in:</strong></p>\n\n<h3><strong>1.&#xA0;</strong><strong>Purpose driven organisations will always get the best talent</strong></h3>\n\n<p>We&#x2019;ve seen this first hand just recently. When searching for a Client Engagement Manager to join our growing (mostly female) team, we advertised the role on WORK180&#xA0; and SEEK, as we were hoping to attract male applicants to apply. A week later, and the results were in;</p>\n\n<ul>\n\t<li>Despite thousands of search views, only three males and two females applied via SEEK. Unfortunately, two of the three males didn&#x2019;t even know what WORK180 did as a business and failed the phone interview. The other three candidates did not make it to phone interview stage.</li>\n\t<li>We received 10 applications from women via WORK180. Each woman was outstanding and all were shortlisted.</li>\n</ul>\n\n<p style=\"text-align: center;\"><a href=\"http://www.dccjobs.com\" target=\"_blank\"><img alt=\"DCC Jobs\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/86ddfa4d-5046-45f2-9a80-e18682964411.png\" style=\"margin: 10px;\"></a></p>\n\n<p>From speaking with the candidates, the number one reason they&#x2019;d applied for the role was because they believed in our mission and wanted to work with an organisation that is <a href=\"https://www.dccjobs.com/about-us\">making a social impact.</a></p>\n\n<p>We&#x2019;ve also seen this happen with multiple other WORK180 Endorsed Employers, with one of the best examples coming from <a href=\"https://www.dccjobs.com/clients/the-yield\" target=\"_blank\">The Yield, </a>who are an AgriTech start up, headquartered in Hobart. Their ethos &#x201C;The world needs 60 per cent more food by 2050. We want to help meet this challenge without compromising the future&quot; sums up why they&#x2019;ve had great success with hiring talent women in a non-traditional field.</p>\n\n<p style=\"text-align: center;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/e6df2fcf-7a67-46d0-a54d-6463de874eb0.png\" style=\"margin: 10px;\"></p>\n\n<p>In a recent event with WORK180 partner <a href=\"https://www.dccjobs.com/what-women-want/support-network/industry-associations/engineers-without-borders-australia\" target=\"_blank\">Engineers Without Borders (EWB) </a>and Engineers Australia, the numbers spoke for themselves.&#xA0;</p>\n\n<p style=\"text-align: center;\"><a href=\"https://www.dccjobs.com/what-women-want/support-network/industry-associations/engineers-without-borders-australia\" target=\"_blank\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/5493822c-81f1-4f32-bd3e-63f77c493006.png\" style=\"margin: 10px;\"></a></p>\n\n<p>Even if your organisation doesn&#x2019;t have a social mission at its core, it&#x2019;s important to highlight how employees can get involved in supporting the community, whether it&#x2019;s through volunteering, supporting charities, or any other activities which make a social impact and are facilitated by the employer<strong>.</strong></p>\n\n<h3><strong>2.&#xA0;Nothing beats social proof</strong></h3>\n\n<p>The true measure of a company&#x2019;s internal culture, is how the staff feel about it and what they would say when the boss isn&#x2019;t in the room. These days, everyone is talking about how committed they are to diversity and inclusion, but would their staff back it up? When<a href=\"https://www.dccjobs.com/clients/holcim\" target=\"_blank\"> Holcim,</a> who operate and deliver construction materials across Australia joined WORK180, their staff immediately jumped on board to share the news.&#xA0;</p>\n\n<p style=\"text-align: center;\"><a href=\"https://www.dccjobs.com/clients/holcim\" target=\"_blank\"><img alt=\"Holcim Francheska Gobel Quote\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/592aeaaa-3f74-45dc-a75a-a766c91b9cfc.png\" style=\"margin: 10px;\"></a></p>\n\n<p>When other employers saw <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6310750706995388417\" target=\"_blank\">Francheska&#x2019;s post on LinkedIn</a>, we were asked, &#x201C;Did Holcim ask their staff to share the update?&#x201D; The answer was while employers usually do send out internal announcements about working with WORK180, Francheska shared the update well before she was aware of the partnership.</p>\n\n<blockquote>\n<p>We continue to be impressed with Holcim, who are one of the very few organisations which pay superannuation on both the paid &amp; unpaid portion of parental leave, offer a return to work bonus equal to 4 weeks&#x2019; pay, are redesigning traditionally inflexible roles to encourage women applicants, plus much more!</p>\n</blockquote>\n\n<p>Hear more from Francheska in this article: <a href=\"https://www.dccjobs.com/blog/2017/10/how-to-ensure-staff-in-remote-locations-feel-like-part-of-the-team\" target=\"_blank\">How to Ensure Staff in Remote Locations Feel Like Part of the Team</a></p>\n\n<h3><strong>3.</strong><strong>Your leaders need to be vocal about their actions to create an inclusive workplace</strong></h3>\n\n<p>An example of this comes from Frontier Advisors, who recently hired an Associate via WORK180 (previously DCC Jobs). During the interview process, the candidate noted the company&#x2019;s link with WORK180/DCC was an important factor in considering the role, as it provided a positive indication of the support and culture she is likely to experience with the company.&#xA0;&#xA0;</p>\n\n<p style=\"text-align: center;\"><img alt=\"Frontier Advisors Testimonial DCC Jobs\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/380bcbe9-dd64-476c-a31f-22ed4ebdeecb.png\" style=\"margin: 10px;\"></p>\n\n<p>Our Endorsed Employers are proud of their efforts to create better workplaces for all staff, and a big part of that involves advocating for change and leading by example. Fiona Trafford-Walker, Director at Frontier Advisors recently did just that in her recent article, <a href=\"http://www.moneymanagement.com.au/features/what-women-want-workplace\">What Women Want in a Workplace</a> in Money Matters. She wrote:</p>\n\n<blockquote>\n<p>&#xA0;<em>&#x201C;We introduced unconscious bias training, we committed to the Panel Pledge, became an &#x2018;Endorsed Employer for Women&#x2019; by DCC Jobs and we ensure women (and men) who work in part-time roles can have meaningful leadership positions. We now have 32 per cent women in our practice, which is around double the average in financial services firms (the CFA reports less than 20 per cent of its members are women &#x2013; we use this as a proxy for employment in the financial services sector) but short of where we would like it to be.&#x201D;</em></p>\n</blockquote>\n\n<p>In a press release, recently approve<a href=\"https://www.dccjobs.com/clients/laing-orourke\" target=\"_blank\">d Endorsed Employer Laing O&#x2019;Rourke</a>&#x2019;s Australia Hub Managing Director, Cathal O&#x2019;Rourke said:</p>\n\n<blockquote>\n<p><em>&#x201C;In order to achieve this important industry endorsement we have demonstrated that we have the right policies in place to support women in the workplace. In 2016 we conducted a gender pay gap review across Australia and now have pay parity across the organisation and filters in place to ensure men and women&#x2019;s salaries do not diverge, and earlier this year I was pleased to join the leaders of 100 of Australia&#x2019;s largest organisations as a WGEA Pay Equity Ambassador.&#x201D;</em></p>\n</blockquote>\n\n<p style=\"text-align: center;\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2f08ed4d-17b2-47eb-9b44-a8ef07a4585c.png\" style=\"margin: 10px;\"></p>\n\n<h3><strong><em>Conclusion:</em></strong></h3>\n\n<ul>\n\t<li>Even if your organisation is not directly involved in making a social impact through its core business activities, there&#x2019;s always opportunity to engage in corporate social responsibility activities, and attract people who are passionate about working with a purpose driven organisation.</li>\n\t<li>Engagement with your job ads will not happen unless your employer brand is authentic and supported by your employees.</li>\n\t<li>Your leaders cannot remain silent- advocating for industry wide changes speaks volumes about your business to potential candidates and encourages buy in internally.<br>\n\t&#xA0;</li>\n</ul>\n\n<p>You may also like to read another <a href=\"https://www.linkedin.com/pulse/diversity-branding-part-1-valeria-ignatieva/\">article</a> around how WORK180 Endorsed Employers are creating successful Employer Branding initiatives.</p>\n\n<blockquote>\n<p>Keep an eye out for our next post, all about <strong>writing job ads to ensure incredible engagement with women job seekers. </strong><br>\n<a href=\"http://eepurl.com/cZw8rn\"><strong>Subscribe to our HR &amp; D&amp;I Professionals newsletter</strong></a><b>&#xA0;</b>to be the first to read this article!<br>\n&#x200B;</p>\n</blockquote>\n\n<hr>\n<h3 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h3>\n\n<p>In April 2018, DCC Jobs rebranded to WORK180. We will&#xA0;pre-screen employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">one click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["WORK180 News"],"upload_date":"2017/11","associated_companies":["work180"]}