{"url":"https://www.work180.com.au/blog/2016/11/webinar-recording-building-confidence-to-fast-track-your-career","title":"Webinar Recording: Building Confidence to Fast Track Your Career","author":"WORK180","body":"\n\t\t\t\t\t<p>In this webinar, renowned author and career development coach, Tegan Dowler will introduce you to the&#xA0;techniques for building rapport and creating positive impressions at work, including:</p>\n\n<ul>\n\t<li>Understanding the neuroscience of networking and leveraging this knowledge</li>\n\t<li>Tips for preparing yourself for a successful networking event</li>\n\t<li>Making a positive first impression &#x2013;including communication and rapport building techniques</li>\n\t<li>Closing the loop &#x2013;actions to take following a networking event to nurture key relationships</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<h4><strong>ABOUT THE PRESENTER</strong></h4>\n\n<p>Teagan has worked in the space of Human Resource Management, Organisational Leadership, Training, Development and Coaching for the past decade. Her experience has been built in traditionally masculine workplaces including civil construction, underground and open-cut coal mining, open-cut iron ore mining and steel processing. This practical experience is underpinned by formal academic qualifications in Psychology and Human Resource Management.</p>\n\n<p>Teagan is often called upon to provide expert opinion on the topic of leadership,&#xA0;diversity&#xA0;and empowerment. As well as being quoted in The Australian House of Representatives, BCW has featured in a range of magazines (including OK! Magazine, The Collective and CLEO), interviewed on live breakfast radio for 4BC Brisbane and ABC Gippsland and is a Ministerial Committee Member for the School of Student Leadership in Victoria and Treasurer of the Diversity Practitioners Association in Queensland.</p>\n\n<p><br>\n<iframe frameborder=\"no\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/288887376&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\"></iframe></p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/11","associated_company":"work180"}