{"url":"https://www.work180.com.au/blog/2016/06/what-does-a-gender-neutral-boardroom-look-like","title":"What Does a Gender Neutral Boardroom Look Like?","author":"WORK180","body":"\n\t\t\t\t\t<p>From TV series &#x2018;Sons of Anarchy&#x2019; to organsations all around Australia, the popular choice of d&#xE9;cor for boardroom seems to be predominately shades of deep brown and black.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/cbf13cda-e398-46e5-b37e-c15b2f8daa85.png\"></p>\n\n<p>This colour scheme alludes itself to projecting power, as best described by Ron Burgundy in the movie Anchorman. &quot; I&apos;m very important. I have many leather-bound books and my apartment smells of rich mahogany.&#x201D;</p>\n\n<p>This is the room where the most important decisions are made, and also the room with the least women. Out of the 500 of the largest companies listed on the&#xA0;<a href=\"https://en.wikipedia.org/wiki/Australian_Securities_Exchange\">Australian Securities Exchange</a>&#xA0;(ASX), women make up only 17.1% of board positions. From the companies on that list, 162 boards are still without any women. <a href=\"http://www.smh.com.au/business/workplace-relations/asx-200-has-just-11-female-ceos-and-41-have-no-executive-women-leaders-20170906-gyc2om.html\" target=\"_blank\">There are just 11 female CEOs on the ASX 200, and 41 of the nation&apos;s largest companies don&apos;t have a woman on their executive leadership.</a></p>\n\n<p>What does this all have to do with the colour schemes, you may ask? While there&#x2019;s no official research pointing to this, here are some of my thoughts.</p>\n\n<p>Last week, <a href=\"http://dcc.staging.volcanic.net.au\">DCC</a> co-founder Gemma Lloyd and I were visiting an ASX-listed client, and while waiting in the lobby, I found myself looking at what to me looked like a very masculine board room. It reminded me of the White House Situation Room as portrayed in movies with high backed chairs, rich mahogany furniture and an overall, very serious and somewhat intimidating feel.</p>\n\n<p>I like to think of myself as a fairly confident woman, comfortable in most environments around all kinds of people. But as I imagined being the only woman in that room, somehow, the thought was quite scary. I contemplated if I&#x2019;d feel the same in a room that looked like this:</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/91e51bf1-0a05-4741-9bbf-a5ed23bf184e.png\"></p>\n\n<p>The above photo was taken at <a href=\"http://www.oneroofwomen.com/\">One Roof Women</a>, a co-working space for female entrepreneurs. It&#x2019;s definitely gorgeous and on the other end of the scale, positioned on the feminine side, which leads to the question- &#x201C;What does a gender neutral boardroom look like?&#x201D;</p>\n\n<p>These days, many companies are pushing the envelope when it comes to getting the most from their staff by creating environments which foster collaboration, creativity and innovation. &#x201C;Work is what you do, not where you do it,&#x201D; rings true, but there&#x2019;s no denying that &#x201C;where&#x201D; you do it can be engineered to either feel cold and generic (hello office cubicles) or welcoming and inclusive. We&#x2019;ve visited a number of remarkable offices lately, here are a few of our favourites.</p>\n\n<p>Dropbox who have recently moved into a new office in Sydney and have created a &#xA0;beautiful, warm atmosphere, mirroing their commitment to a workplace where everyone feels like they belong.</p>\n\n<blockquote>\n<p><em>&quot;It&#x2019;s up to all of us at Dropbox to create a truly diverse team and culture and our new office space will help attract more diverse candidates.&#xA0; At Dropbox, we think diversity serves another purpose. Diversity makes work more enjoyable, and makes it easier for people to be themselves.&#xA0; Because of this belief we wanted to bring the idea of home and the spirit of family into our new space in Sydney.&#xA0; The vision was to create not just an office to work in every day, not just a &#x2018;house&#x2019; for staff, but a place for shared experience, for making memories and for storytelling, a veritable home for the Dropbox family.&quot;&#xA0;</em>Deeps De Silva, Head of Marketing APAC, Dropbox</p>\n</blockquote>\n\n<p style=\"text-align:center\"><a href=\"https://www.dccjobs.com/clients/nab\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1caef8e7-de7d-4a6e-b357-ae044125e7c5.jpeg\"></a></p>\n\n<p><a href=\"https://www.dccjobs.com/clients/nab\">NAB</a>, who have designed their building in Docklands, Melbourne to drive collaboration and encourage flexible working. When showing me around, Nina Pollard, Talent Acquisition Manager, Personal Banking at NAB shared her thoughts on the space,</p>\n\n<blockquote>\n<p><em>&#x201C;The best thing about this layout, is that it&#x2019;s impossible to tell what time people come and go,&#x201D;</em> she explained. <em>&#x201C;There&#x2019;s no cubicles with someone peeking over and keeping tabs on when you are there and when you aren&#x2019;t. It&#x2019;s a trust based approach that encourages people to act responsibly and &#x2018;do the right thing&#x2019; &#x2013; a core value of the company.&#x201D;</em></p>\n</blockquote>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c6c9bd80-2b80-495a-85ff-ff19895df31b.png\"></p>\n\n<p>When relocating to a new office in Melbourne, Mexia chose to decorate a standard office to reflect it&#x2019;s vibrant internal culture, which centres around making everyone feel included and happy at work.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/ab1aa28b-4b89-4b8e-a0aa-b5fcdaffb4f8.jpeg\">&#x200B;</p>\n\n<blockquote>\n<p><em>&#x201C;There was nothing actually wrong with the space, but we did find it a bit too &#x2018;sterile&#x2019; for our liking,&#x201D;</em><strong><em> </em></strong>explained Grant Samuels, VIC Practice Lead at Mexia. <em>&#x201C;We took a bit longer moving in but really enjoyed decorating a new space that feels warm, inviting and homely.&#x201D;</em> This involved incorporating elements such as wood, glass and greenery and combining them with pops of bold colours such as yellow and the &#x201C;Mexia blue&#x201D;.</p>\n</blockquote>\n\n<p>All in all, I think we&#x2019;d all agree that colours, textures and other factors play a big part in how comfortable we feel and it&#x2019;s great to see companies placing a big focus on designing spaces with this in mind.</p>\n\n<h5 style=\"font-family: Lato, sans-serif;\"><strong><span style=\"color: rgb(169, 127, 177);\">About DCC Jobs</span></strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/06","associated_company":"work180"}