{"url":"https://www.work180.com.au/blog/2018/01/the-importance-of-self-care-after-10-months-job-searching","title":"What 10 Months of Job Searching Has Taught Me ","author":"WORK180","body":"\n\t\t\t\t\t<p>It&#xA0;recently came to my attention that I have been actively seeking full-time employment for about 10 months now. When I remembered this fact I had a minor panic and thought what on earth went wrong in 2017?!</p>\n\n<p>After I calmed down I remembered that lots of incredible things did happen. I am currently very fortunate enough to work as an intern and volunteer my time with the Australian Institute of International Affairs Victoria, creating content, copywriting and managing social media pages for their fantastic institute. I networked and connected with amazing, like-minded individuals.</p>\n\n<p>As someone who in the past didn&#x2019;t attend an event if her friends weren&#x2019;t going, to rocking up to networking events up to 4 times a week by herself, I underwent huge growth, built up confidence and resilience. I even spoke at an event at One Roof Melbourne on coming out of your comfort zone (Grateful to&#xA0;<a href=\"https://www.facebook.com/empoweringlw/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">Empowering Leading Women</a>&#xA0;for giving me the opportunity).</p>\n\n<p>Although 2017 was a struggle and took its toll emotionally and mentally, I gained more clarity in what I want more out of in life. I understood and took pride in the value I brought to an organisation and looked beyond the initial scope of work I thought I&#x2019;d be doing.</p>\n\n<blockquote>\n<p><em>So as I once again embark on more cover letters, applications, cold calls and cold emails, I wanted to compile a self-care list of things that I am trying to incorporate in my life more. Hopefully, it will be helpful to people who are going through the same journey.&#xA0;&#xA0;</em></p>\n</blockquote>\n\n<h3><strong>1) Reach Out</strong></h3>\n\n<p>Talk to your friends; talk to your family; hit up your networks; make new networks. I am so grateful to my friends and family for being my rock during the past year. I am grateful to groups I found through Meet Up,&#xA0;<a href=\"https://www.meetup.com/She-Mentors/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">She Mentors,</a>&#xA0;<a href=\"https://www.meetup.com/Career-Club-Melbourne\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">Career Club</a>,&#xA0;<a href=\"https://dccjobs.com/events\" saprocessedanchor=\"true\" target=\"_blank\">DCC Jobs Meet Up</a>, and&#xA0;<a href=\"https://generalassemb.ly/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">General Assembly</a>&#xA0;in Melbourne for their events and workshops. I came to Melbourne barely knowing anyone and have been able to form a network from scratch. When I showed up to these places I connected with brilliant people and felt somewhat at ease because I found people in similar situations to mine. Listen to others with intent and you will find yourself so inspired in ways you did not think was possible. The last year in Melbourne has brought about infinite number of new interests and possibilities that I never envisioned for myself so that alone is something to be grateful for.&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;</p>\n\n<h3><strong>2) Structure your day</strong></h3>\n\n<p>This is something I struggled with constantly, it&#x2019;s easy to sleep in, its easy to find yourself binging on Netflix all day. I am going into this new year with exam/assignment mentality. Structuring my day as though I have a big exam or huge university project due. Every day will have a new deadline: i.e., call three recruiters, send 4 cold emails, send 2 job applications, spend an hour reaching out to people on Linkedin etc.&#xA0;</p>\n\n<h3><strong>3) Get off social media</strong></h3>\n\n<p>This is is a bit strange coming from someone wanting to get into Digital Marketing, but social media can be a dangerous place where one compares themselves to the perfectly curated online lives of others (let&apos;s not do that anymore). I love social media, but I also know I have to limit my time on there so I don&apos;t get too overwhelmed. Let&apos;s also stop the mindless scrolling we constantly do on our phones, I found Facebook was the culprit for me here and promptly deleted it from my phone. I can only enter the world of Facebook when I open my Macbook. It&#x2019;s a tiny step but makes a world of difference.&#xA0;</p>\n\n<h3><strong>4) Keep perspective&#xA0;</strong></h3>\n\n<p>This one takes a lot of work, it&#x2019;s something I have struggled with over the past few months but keeping perspective and reframing the negative perspectives into positive ones is very important. Time and time again over 2017 I was caught up in the negativity of not being able to land a full-time role but when I take a step back and actually think about everything I did in 2017 I can see many things to be positive about. I stepped out of my comfort zone in a big way and got more comfortable with being uncomfortable and I will continue that into 2018.&#xA0;</p>\n\n<h3><strong>5) Give yourself time off</strong></h3>\n\n<p>Looking for work can be soul crushing and completely disheartening so it is essential we give ourselves a break, cut ourselves some slack and reassure ourselves we are doing everything we can.&#xA0;</p>\n\n<p>Something I will keep telling myself every day:</p>\n\n<blockquote>\n<h2><em>Today&#x2019;s rejection means that another better offer is on its way.</em></h2>\n</blockquote>\n\n<p>So good luck to all the job hunters out there, we got this.</p>\n\n<p><em>Connect with Anushka Batu on </em><em>linkedin</em><em><a href=\"https://www.linkedin.com/in/anushka-batu/\"> here.&#xA0;</a></em></p>\n\n<p>&#xA0;</p>\n\n<h4><strong>About DCC Jobs</strong></h4>\n\n<p>DCC Jobs is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p>\n\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2018/01","associated_companies":["work180"]}