{"url":"https://www.work180.com.au/blog/2015/06/what-are-the-biggest-challenges-faced-by-female-job-seekers-today","title":"What are the biggest challenges faced by female job seekers today?","author":"WORK180","body":"\n\t\t\t\t\t<p>This month, DCC Jobs co-founder Gemma Lloyd and I had a stand at the Reinvent Your Career expo, our very first&#xA0;time &#x201C;manning&#x201D; (what is the female friendly word for this??) a booth for our own business.</p>\n\n<p>Throughout the two days, we met many women, who shared their stories around changing careers and searching for new roles.</p>\n\n<p>There seemed to be a few common challenges faced by the women we spoke to, namely;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Returning to work after having a baby</strong></p>\n\n<ul>\n\t<li>\n\t<p>Not wishing to return to full time work straight away and subsequently losing their jobs. This highlights difficulties faced by both employees and employers- <em>how do you effectively facilitate job sharing, especially at a senior level?</em></p>\n\t</li>\n\t<li>\n\t<p>Lack of support for parents- we were surprised to hear of several, mid-sized organisations having no parental leave policies in place. How these companies hope to remain competitive is a mystery to us.</p>\n\t</li>\n\t<li>\n\t<p>The challenges with breast feeding- some women told us about unfortunate incidents where breastfeeding rooms were taken over for meetings and unavailable for mums to use. Speaking from experience, this is the last thing you want to worry about after a busy day at work and an impatient baby on your hands. In this day and age we would think this would be a non-issue but apparently, lots of progress still to be made.</p>\n\t</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<p><strong>&#xA0;Ageism</strong></p>\n\n<ul>\n\t<li>\n\t<p>We met several women over 50, who spoke about the difficulties applying for work, going through the process only to be rejected at the face to face interview stage. Personally, we struggle to see the problem with hiring mature workers, who have a wealth of experience to offer.</p>\n\t</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<p><strong>&#xA0;Traditional job boards</strong></p>\n\n<ul>\n\t<li>\n\t<p>Applying through traditional job boards was a major paint point with almost every person we met at the expo. They were frustrated with never hearing back after submitting the application, or being contacted by recruiters for jobs that were completely unsuitable.</p>\n\t</li>\n\t<li>\n\t<p>New mothers&#xA0;felt discouraged from applying for roles that seemed &#x201C;out of their league&#x201D; because once flexibility was raised, they were dropped from the interview process. Several had the attitude of not being too &#x201C;picky&#x201D; and accepted roles that were much less senior than prior to having children.</p>\n\t</li>\n</ul>\n\n<p>&#xA0;</p>\n\n<p>On the plus side, we met many confident women who knew exactly what they wanted, what they deserved and would not settle for anything less.</p>\n\n<p>One of the most inspiring people was a young mother, whose son was thankfully on the recovery path from leukemia. This woman had the most positive disposition along with a beautiful, happy smile. She came to a realisation that life was too short to be doing a job she didn&#x2019;t thoroughly enjoy, and is now searching for something that fits her life and suits her talents.</p>\n\n<p>It was an eye opening experience to hear so many stories and experiences, and further ignited our passion for helping more women to find employers that value their contributions and understand the challenges we face.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2015/06","associated_company":"work180"}