{"url":"https://www.work180.com.au/blog/2017/09/what-happens-when-you-mentor-talented-women","title":"What Happens When You Mentor Talented Women?","author":"WORK180","body":"\n\t\t\t\t\t<p style=\"text-align:justify\">Imagine if&#xA0;<a data-cke-saved-href=\"http://serenawilliams.com/\" href=\"http://serenawilliams.com/\" target=\"_blank\">Serena Williams</a>&#xA0;hadn&#x2019;t been mentored or didn&#x2019;t have training drills?&#xA0;Would she have won 21 Grand Slams, 6 Australian Opens, 6 US Opens, 6 Wimbledon&#x2019;s be one of, if not the, best female tennis player, ever?</p><p style=\"text-align:justify\">Imagine if Daisy Pearce, AFL Women star hadn&#x2019;t turned up for training? Would she have been the AFL&#x2019;s women&#x2019;s inaugural&#xA0;<a data-cke-saved-href=\"http://www.afl.com.au/news/2013-05-16/daisy-plucked-first\" href=\"http://www.afl.com.au/news/2013-05-16/daisy-plucked-first\" target=\"_blank\">No.1 draft pick in 2013</a>, &#xA0;Melbourne&#x2019;s inaugural captain,&#xA0;<a data-cke-saved-href=\"http://www.melbournefc.com.au/news/2015-09-11/pearce-wins-best-female-player-award\" href=\"http://www.melbournefc.com.au/news/2015-09-11/pearce-wins-best-female-player-award\" target=\"_blank\">best and fairest winner,</a>&#xA0;and arguably the first female superstar of the AFL female game?</p><p style=\"text-align:justify\">It&#x2019;s fairly incomprehensible that these women wouldn&#x2019;t go to training, be trained and mentored.&#xA0;So why are women not being mentored in a systematic way in our organisations,&#xA0; given the right mentoring and sponsorship can unlock potential and superior performance for both the woman and the organisation that employs her?</p><p style=\"text-align:justify\"><br></p><h4><strong><span style=\"color:#a87eb1\">One of the (many) barriers to women advancing in the workplace is a lack of confidence.</span></strong></h4><p style=\"text-align:justify\">A major factor in overcoming confidence issues is being mentored and sponsored. Worryingly,&#xA0; there a systematic lack of of mentoring and sponsorship in an organised, disciplined way in Australian organisations.</p><p style=\"text-align:justify\">What is mentorship and sponsorship? How about I talk about what it&#x2019;s not? It&#x2019;s not a regular half an hour or hour with your manager to go through a laundry list of actions, decisions or tasks. That&#x2019;s important for business planning. But its not career advancing. It is not a chit-chat which commences with &#x2018;so how are you?&#x2019; That important for rapport building. But it&#x2019;s not training. It&#x2019;s not a one way conversation about what you should or should not be doing. I guess that&#x2019;s important, to someone! But it&#x2019;s not mentoring.</p><blockquote><h4 style=\"text-align:center\"><em>Mentoring is:&#xA0;a developmental partnership through which one person shares knowledge, skills, information, and perspective to foster the personal and professional growth of someone else. The power of mentoring is that it creates a one-of-a-kind opportunity for collaboration, goal achievement, and problem solving.</em></h4></blockquote><p style=\"text-align:justify\">The research that has prompted this article&#xA0;has identified that many women (<em>and men)</em>&#xA0;are not receiving the benefit of being effectively mentored in the workplace. When&#xA0;I speak at an event, post articles or attend networking events, women invariably come up to me or write to me and tell me they do not have a mentor, nor do they regularly have conversations that build their strategic, business and financial acumen. Not do they know what&#xA0;to do about it. They know,&#xA0; and I know, that this is impacting their confidence, their career and limiting them from advancing. Its disheartening for the women. For the organisations that employ these women, its foolish. &#xA0;These organisations are not tapping into the productivity these women will generate when they are engaged and committed which will only come about when investment&#xA0;to increase their skills and advance their career is made.</p><p style=\"text-align:justify\">My research has the primary purpose of informing me about the barriers to gender equality in leadership. Early qualitative research highlighted confidence as&#xA0; a key issue for women. Deeper discussions uncovered that lack of business acumen&#xA0;is a contributor to women lacking confidence. Here&#x2019;s what women in the workplace have told me:</p><ol><li><p><strong>53%</strong>&#xA0;do not receive&#xA0;mentoring or coaching of any kind</p></li><li><p><strong>66%</strong>&#xA0;rate their people leaders coaching skills as poor or non-existent</p></li><li><p><strong>90%</strong>&#xA0;say not receiving coaching, mentoring or training&#xA0;has a moderate to material impact on their happiness and engagement at work</p></li><li><p><strong>40%</strong>&#xA0;are mildly to very dissatisfied with their career progression</p></li><li><p><strong>64%</strong>&#xA0;are mildly to very dissatisfied with their people leaders approach to their career planning</p></li></ol><p><br></p><h4><strong><span style=\"color:#a87eb1\">This data should alarm the </span></strong><strong><span style=\"color:#a87eb1\">organizations</span></strong><strong><span style=\"color:#a87eb1\"> that are serious about </span></strong><strong><span style=\"color:#a87eb1\">advancing&#xA0; women</span></strong><strong><span style=\"color:#a87eb1\">.</span></strong></h4><p>Why? Some fundamentals which will be no surprise:</p><ul><li><p><strong>Mentoring and sponsorship&#xA0;can create a career pathway.</strong>&#xA0;Employers who provide support such as formal mentoring, sponsorship and career planning are more likely to increase the advancement of women and decrease the female talent drain.</p></li><li><p><strong>The right&#xA0;training/development ends the leadership lottery for women.</strong>&#xA0;By actively developing and promoting inclusive leaders across your organization, you will eliminate the lottery women encounter for career progression. Middle managers determine the day-to-day experience of women in organisations. Gender equality awareness and&#xA0;training&#xA0;underpins inclusive leadership.</p></li><li><p><strong>Female leadership development training helps build the skill sets women need:</strong>&#xA0;McKinsey has shown through interviewing 250 C-Suite women that some of the attributes they most relied upon were resilience, grit, and&#xA0;confidence. Quality, regular training and development&#xA0;can unlock and foster these attributes in women.</p></li><li><p><strong>Being mentored&#xA0;can increase happiness &amp; productivity.&#xA0;</strong>Happy workers are productive workers. Former Westpac CEO Gail Kelly has been quoted as saying&#xA0;<em>&#x201C;creating a happy workplace is crucial to building a culture where people are willing to go the extra mile for no extra pay because of team loyalty, professional commitment and personal satisfaction.&#x201D;&#xA0;</em>Discretionary effort from happy engaged people can up to 15% increase in productivity.</p></li></ul><p style=\"text-align:justify\">There are more statistics than I have had hot dinners about the benefits of an inclusive&#xA0;culture and the value that can be created for a company that has greater gender diversity.</p><p style=\"text-align:justify\">My purpose in life is to support and advance women. To achieve gender equality. So when I founded Advancing Women, I knew I was being purposeful and could make a difference for women. &#xA0;I know that by sharing my skills, experience and qualifications that I can accelerate the advancement of women. I know that the women I &#xA0;mentor feel more confident, more accomplished, more empowered and more successful&#x2026;in whatever way they define success. &#xA0;I know the organisations that I work with have women that feel more engaged, valued and have a career path to aspire to. Which means both the organisation and the women who work there are better off.</p><p style=\"text-align:justify\"><br></p><h5><strong><span style=\"color:rgb(169, 127, 177)\">About DCC Jobs</span></strong></h5><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with <a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a> now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development","Celebrating Women"],"upload_date":"2017/09","associated_company":"work180"}