{"url":"https://www.work180.com.au/blog/2016/09/what-happens-to-our-ambition-when-kids-come-along","title":"What Happens to Our Ambition When Kids Come Along?","author":"WORK180","body":"\n\t\t\t\t\t<p>One of the greatest challenges facing many women who have taken a break from the workforce to become mothers is an existentialist one.</p>\n\n<p>Let me explain. Imagine an ambitious and driven thirty something year old professional loving her working career. She&#x2019;s worked hard, somewhat married to the job in her 20s and her ambition and positive attitude gets her promoted over the years. She loves the challenges her new roles come with, enjoys adding value, being rewarded and works even harder. By now, she&#x2019;s recognised within the company and has built herself a fine reputation. She falls pregnant and takes a break to become a mum.</p>\n\n<p>This is when the psychological challenges kick in...not only is she full of hormones that impede her from thinking straight, she has a dependent and demanding baby to look after, an ambitious partner who travels a lot for work so can&#x2019;t help out much, leaving her exhausted, feeling down and wondering whether she&#x2019;ll make it through another night of waking to a crying baby, feeding every two hours and the exhausting day ahead when she awakes in the morning &#x2026; &#x201C;is this what awaits me for the rest of my life?&#x201D; she wonders. &#x201C;Who am I if it&#x2019;s not a work colleague, the manager, or the boss?&#x201D;</p>\n\n<p>A lot of women I have spoken to admit having gone through a period during which they felt lost and alone. They feel empty and sense a loss of their identity, especially if motherhood is not their sole mission in life.</p>\n\n<p>Suddenly the prospect1&#xA0;of returning to work doesn&#x2019;t look so attractive any more. Your confidence has plummeted and your negative self-talk is ruling the way you perceive yourself. Staying at home with your baby where you know you&#x2019;re needed and valued feels like the safe option.</p>\n\n<p>Sound familiar?</p>\n\n<p>This is completely NORMAL. When you have dedicated the majority of your adult life to a successful career and suddenly don&#x2019;t have that anymore, it leaves a big void. So what do you replace it with? A lot of the time, we choose self-doubt.</p>\n\n<p><strong>Here are some tips to stop you from embarking on that negative downward spiral by planning ahead and answering the key questions about what you want:</strong></p>\n\n<p>&#xA0;</p>\n\n<p><strong>Before you go on mat leave:</strong></p>\n\n<ul>\n\t<li>\n\t<p>Review your employer&#x2019;s flexibility policies&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Find out how your manager intends to stay in touch</p>\n\t</li>\n\t<li>\n\t<p>Enquire if you can occasionally join in on key team meetings</p>\n\t</li>\n\t<li>\n\t<p>Ask for flexible working arrangements- it is an employer&#x2019;s obligation to consider your request</p>\n\t</li>\n\t<li>\n\t<p>Look into programs such as&#xA0;<a href=\"https://www.diversecitycareers.com/page/partner-network/professional-development-services/grace-papers\">Grace Papers</a>, who can help you manage pregnancy and career&#xA0;</p>\n\t</li>\n</ul>\n\n<p><strong>Rebuilding your confidence:</strong></p>\n\n<ul>\n\t<li>\n\t<p>Get yourself a journal and make a list of your top 10 key strengths&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Write down your top four core values and why they&#x2019;re important to you</p>\n\t</li>\n\t<li>\n\t<p>Write about a situation in which you expressed that value and why it was important</p>\n\t</li>\n\t<li>\n\t<p>Remind yourself to do ONE thing for yourself every day, have some &#x201C;ME&#x201D; time no matter how impossible that seems</p>\n\t</li>\n\t<li>\n\t<p>Stay up to date with market and company news. Subscribe to relevant industry newsletters</p>\n\t</li>\n\t<li>\n\t<p>Going through this exercise helps you to be clear on who YOU are and detach from who you think others want you to be.&#xA0;</p>\n\t</li>\n</ul>\n\n<p><strong>Reviewing your career:</strong></p>\n\n<ul>\n\t<li>\n\t<p>Review your career aspirations and ask yourself what you want to do</p>\n\t</li>\n\t<li>\n\t<p>List all your life achievements and circle the ones you&#x2019;re truly passionate about and describe why.</p>\n\t</li>\n\t<li>\n\t<p>Write down what going back to work will give you</p>\n\t</li>\n\t<li>\n\t<p>Review your CV to remind yourself of all your skills and past professional achievements</p>\n\t</li>\n\t<li>\n\t<p>Is the job you were in still the one you&#x2019;d like to return to? If it is not, start searching websites like&#xA0;<a href=\"/job-search\">DCC Jobs</a> for alternative options working for employers that promote flexible working options</p>\n\t</li>\n\t<li>\n\t<p>Consider assistance from a life or career coach to guide you through your career options</p>\n\t</li>\n\t<li>\n\t<p>Volunteering is a great way to feel &#x201C;useful&#x201D; and be exposed to a completely different industry.&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Continue to network and keep in touch with your work colleagues</p>\n\t</li>\n</ul>\n\n<p>A woman is at her most vulnerable when she&#x2019;s on maternity leave which is why conserving her self-esteem is vital.</p>\n\n<p>Opting out of work for the foreseeable future is not an option for a lot of mothers. The sooner you get back into the workforce or rebuild your career, the easier it will be to get back into the rhythm of work and pick up where you left off. A lot of&#xA0;<a href=\"https://www.diversecitycareers.com/flagshipgroup\">employers</a>&#xA0;value diversity and offer flexible working arrangements to assist with caring responsibilities.</p>\n\n<p>Just remember, a happy working mum who has a sense of accomplishment will serve as a good role model to her children and instil a good work ethic from an early age.</p>\n\n<p>Once you know what you want, know what to do to get there and understand your rights as a parent, being a working mum is a very rewarding and enjoyable experience.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development","Celebrating Women"],"upload_date":"2016/09","associated_company":"work180"}