{"url":"https://www.work180.com.au/blog/2017/09/whats-your-current-salary-how-to-respond-to-an-outdated-and-inappropriate-question","title":"What’s Your Current Salary? How to Respond to an Outdated and Inappropriate Question","author":"WORK180","body":"\n\t\t\t\t\t<p>In August, the <a data-cke-saved-href=\"http://malechampionsofchange.com/about-us/\" href=\"http://malechampionsofchange.com/about-us/\" target=\"_blank\">Male Champions of Change</a> released their <a data-cke-saved-href=\"http://malechampionsofchange.com/wp-content/uploads/2017/08/MCC-Closing-The-Pay-Gap_Report_2017_FINAL-1.pdf\" href=\"http://malechampionsofchange.com/wp-content/uploads/2017/08/MCC-Closing-The-Pay-Gap_Report_2017_FINAL-1.pdf\" target=\"_blank\">report on the gender pay gap</a>. This report not only evidenced the extent of the divide but also included practical and direct advice on how to eradicate the gender pay gap. One of these recommendations was to stop asking candidates about their current salary.</p><blockquote><p>And yet, this question &#x2013; <em>what is your current salary</em> - remains stubbornly ingrained in many recruitment processes. Just a fortnight ago I was asked this same question.</p></blockquote><p>More concerning is that no fewer than five(!) women I know have also been asked this in the past month. Most of these women work in either the financial services industry or in tech. These happen to be the two worst performing industries with a current pay gap of <a data-cke-saved-href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\" href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\">29.6%</a> and <a data-cke-saved-href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\" href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\">24.3%</a> &#xA0;respectively compared to the national average pay gap of <a data-cke-saved-href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\" href=\"https://www.wgea.gov.au/sites/default/files/gender-pay-gap-statistics.pdf\">15.3%</a>.</p><blockquote><p>So how should we respond to such a question if it is asked? Calling out the sheer inappropriateness of this question can be uncomfortable. Candidates seeking employment are often vulnerable and seeking to impress, making them reticent to challenge such questioning.</p></blockquote><p>Rather than answer, reframe. Consistent with the <a data-cke-saved-href=\"http://malechampionsofchange.com/about-us/\" href=\"http://malechampionsofchange.com/about-us/\">MCC&#x2019;s</a> recommendation to price the <em>role</em> and not the <em>person</em>, my suggestion is to try one of the following responses:</p><p><em>&#x2018;For this type of role, I would expect the salary to in the range of&#x2026;&#x2019;</em></p><p><em>&#x2018;Industry comparable/average salary for this type of role is x, therefore I would expect this&#x2019;</em></p><p><em>&#x2018;I would need to more fully assess the role requirements/job description to better determine what the role is worth&#x2019;</em></p><p>Rather than being evasive, using such language allows you to respond in a conciliatory way, whilst also asserting your viewpoint. Most recruiters will not probe further, but if they do, more direct language about a suitable salary for the role can be warranted.</p><blockquote><p>Feeling particularly bold? You could even use the opportunity to ask if the employer is a pay equity ambassador. This information, along with a wealth of other data about employers&#x2019; initiatives can be accessed via the WORK180 website. Complementing a company on their flexibility or other initiatives can be a great way to stimulate further discussion.</p></blockquote><p>WORK180 not only shares this valuable information, but continues to encourage companies to be more inclusive. In the words of Elizabeth Broderick, we need a<em> &#x2018;joint and concerted effort to make unjustifiable pay differences a matter of history in Australia&#x2019;. </em>&#xA0;Next time you are asked this question, think about your community of women. Change starts with you. Be empowered and emboldened to make change happen!<br><br></p><h5><strong>About WORK180</strong></h5><p>WORK180 is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with <a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a> now.&#xA0;</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/09","associated_company":"work180"}