{"url":"https://www.work180.com.au/blog/2018/12/what-i-love-about-being-a-firefighter","title":"What I love about being a firefighter","author":"Kerry Slater","body":"\n\t\t\t\t\t<p>I am a volunteer firefighter in the Rural Fire Service.&#xA0; Our weekly training involves scenarios such as car fires, property protection, bush navigation, first aid and maintenance, where we sharpen tools and fix stuff.&#xA0;<br></p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2a1f902f-f9bd-482d-9a7b-c57a65a2e896.png\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2a1f902f-f9bd-482d-9a7b-c57a65a2e896.png\" style=\"font-size: 16px; float: right; width: 200px; height: 267px;\"><div><span style=\"font-size: 16px;\"><br></span><p>We get called out to a variety of incidents such as bushfires, car accidents, search and rescue and hazard reductions. Sometimes my pager goes off at work &#x2013; that&#x2019;s what the siren is all about if you hear it. But I&#x2019;ve taken part in Community events such as Guides, school fetes, street meetings, talking to the locals about preparing for the bushfire season.</p><p><br></p><p>What I love about being a firefighter is the camaraderie that it brings.&#xA0; A crew on an incident really has to work together and &#xA0;everyone looks out for each other. They jump in when someone looks a little exhausted and there a willingness to teach people new skills.&#xA0; I get to do things an office environment just doesn&#x2019;t offer. I can start and man a truck pump, and I can get water out of a fire hydrant in 60 seconds!&#xA0;<br></p><p>There are many things I love about working for Arq too, especially the flexibility. The Arq culture encourages us to try new things and if they work, that is great.&#xA0;</p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1ff328d5-e162-424b-822a-ac4470f29325.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1ff328d5-e162-424b-822a-ac4470f29325.jpeg\" style=\"font-size: 16px; float: right; margin: 10px; width: 300px; height: 300px;\"></div><div><span style=\"font-size: 16px;\"><br></span><p>But if they fail, that is ok too.&#xA0; I&#x2019;m surrounded by really smart people that continually change it up.&#xA0; It&#x2019;s very fast paced and never boring.&#xA0; I love that we are making a difference to our customers lives.&#xA0;</p><p><a data-cke-saved-href=\"https://work180.com.au/clients/arq-group\" href=\"https://work180.com.au/clients/arq-group\">Learn more about Arq Group here</a><a data-cke-saved-href=\"https://work180.com.au/clients/arq-group\" href=\"https://work180.com.au/clients/arq-group\">.</a></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p></div>\n\t\t\t\t","tags":["inspirational women"],"upload_date":"2018/12"}