{"url":"https://www.work180.com.au/blog/2018/06/what-is-the-new-child-care-subsidy-and-how-will-it-affect-you","title":"What is the new Child Care Subsidy and how will it affect you?","author":"Lisa Levison, Your Family Budget ","body":"\n\t\t\t\t\t<p>If you currently have children in long day care, family day care or any before or after school care then the changes to Child Care payments will affect you.</p><p>The Child Care Benefit and Child Care Rebate will disappear and be replaced with one Child Care Subsidy. The amount that you receive back from Centrelink will depend on 3 things - how much you earn, how much you work and what type of care you use.&#xA0;</p><h3><strong>Family Income</strong></h3><p>The amount of Subsidy that you receive each fortnight (everything is measured per fortnight) depends on how much you earn as a household.&#xA0; The higher your family income, the less Child Care Subsidy you will receive. A family with a combined taxable income above $351,248 will not receive any Subsidy at all.</p><p>For families earning more than $186,958, an annual subsidy cap of $10,190 per child will apply, similar to the cap of $7,613 we have now.</p><p>All of these rates will be adjusted for CPI so when 1 July rolls around, so each year they will be slightly higher.</p><p><br></p><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" style=\"width:682px;\" width=\"682\"><tbody><tr><td style=\"width:356px;\"><p>Combined family income</p></td><td style=\"width:326px;\"><p>Subsidy rate*</p></td></tr><tr><td style=\"width:356px;\"><p>Up to $66,958</p></td><td style=\"width:326px;\"><p>85%</p></td></tr><tr><td style=\"width:356px;\"><p>Over $66,958 &#xA0;to under $171,958</p></td><td style=\"width:326px;\"><p>Gradually reducing to 50%</p></td></tr><tr><td style=\"width:356px;\"><p>$171,958 &#xA0;to under $251,248</p></td><td style=\"width:326px;\"><p>50%</p></td></tr><tr><td style=\"width:356px;\"><p>$251,248 &#xA0;to under $341,248</p></td><td style=\"width:326px;\"><p>Gradually reducing to 20%</p></td></tr><tr><td style=\"width:356px;\"><p>$341,248 &#xA0;to under $351,248</p></td><td style=\"width:326px;\"><p>20%</p></td></tr><tr><td style=\"width:356px;\"><p>$351,248 &#xA0;or more</p></td><td style=\"width:326px;\"><p>0%</p></td></tr></tbody></table><p>*Subsidy tapers down by 1 per cent for each $3000 of family income</p><p><br></p><h3><strong>Type of Care</strong></h3><p>The Subsidy rates mentioned are not a percentage of your daily fee but a percentage of an <u>hourly fee cap.</u>&#xA0;This is the same system as the current Child Care Benefit standard hourly rate that is $4.30 an hour.</p><p>As this is an hourly fee cap, you need to multiply is by the number of hours a day that your centre is open to get the daily fee cap. Then multiply this by the Subsidy Rate that applies to your income to determine the actual amount per day you are entitled to. If your centre charges above the daily fee cap then that portion of you daily fee that is above the fee cap will be entirely funded by you.</p><p>The hourly fee caps for each type of service are:</p><p><br></p><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" style=\"width:679px;\" width=\"679\"><tbody><tr><td style=\"width:50.0%;\"><p><strong>Service type </strong></p></td><td style=\"width:50.0%;\"><p><strong>Maximum hourly fee cap </strong></p></td></tr><tr><td style=\"width:50.0%;\"><p>Centre Based Long Day Care</p></td><td style=\"width:50.0%;\"><p>$11.77</p></td></tr><tr><td style=\"width:50.0%;\"><p>Family Day Care</p></td><td style=\"width:50.0%;\"><p>$10.90</p></td></tr><tr><td style=\"width:50.0%;\"><p>Outside School Hours Care</p></td><td style=\"width:50.0%;\"><p>$10.29</p></td></tr></tbody></table><p><br></p><p>For example, the hourly fee cap for long day care is $11.77. If your centre is open for 10 hours a day then the daily fee cap will be $117.70. If your family income gives you a Subsidy rate of 60% then you will get back 60% of $117.70 = $70.62.</p><p>However if your centre actually charges $125 you will still only get $70.62 back a day as the centre charges above the hourly fee cap. The government has suggested that the use of an hourly funding cap gives centres an option to change the model of how they charge families &#x2013; should they choose to do so. In the future they may have half days available which could allow for them to accept more families. Or even a charge by the hour model. The flexibility is there.</p><h3><strong>How much you work</strong></h3><p>You need to be performing an &#x2018;<u>activity</u>&#x2019; to be eligible for the Child Care Subsidy. An activity can include paid work, self-employed work, maternity leave, unpaid work in a family business, looking for work, volunteering or studying. It even includes travel to work, but try not to make that amount too excessive.</p><p>It is the number of hours of that &#x2018;<u>activity</u>&#x2019; you perform, per fortnight, that gives you a corresponding number of hours of Child Care Subsidy you can apply to your fees.</p><p>You may have calculated above the amount per hour of Subsidy that you receive based on your income and the hourly fee cap that applies to you, but the hours of activity per fortnight then decide how many hours you can apply your Subsidy to.</p><p><br></p><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" style=\"width:108.5%;\" width=\"108%\"><tbody><tr><td style=\"width:40.58%;\"><p><strong>Hours of activity (per fortnight) </strong></p></td><td style=\"width:59.42%;\"><p><strong>Maximum number of hours of subsidy (per fortnight) </strong></p></td></tr><tr><td style=\"width:40.58%;\"><p>8 hours to 16 hours</p></td><td style=\"width:59.42%;\"><p>36 hours</p></td></tr><tr><td style=\"width:40.58%;\"><p>More than 16 hours to 48 hours</p></td><td style=\"width:59.42%;\"><p>72 hours</p></td></tr><tr><td style=\"width:40.58%;\"><p>More than 48 hours</p></td><td style=\"width:59.42%;\"><p>100 hours</p></td></tr></tbody></table><p><br></p><p>The Hours of Activity will relate to the parent with the lower number of hours. So if your family has a stay at home parent that works less than 8 hours a fortnight, your family won&#x2019;t be able to access the new Child Care Subsidy. The exception is if your Combined Family Income is less than $66,958. Then you will be able to access 24 hours a fortnight.</p><p>Eg. If you work for 2 days a week from 9am-5pm. That&#x2019;s 8 hours a day &#x2013; or 32 hours a fortnight. That gives you 72 hours a fortnight of Subsidy. If your centre is open for 10 hours a day then you can apply your Subsidy that you calculated earlier to just over 7 days a fortnight.</p><h3><strong>Additional Child Care Subsidy</strong></h3><p>In addition to the Subsidy already described, there is also additional help for those children and families that are at risk. The Additional Child Care Subsidy increases the amount of Subsidy to those families in need, sometime to an amount that covers the entire time that care is used. The Additional Subsidy is available to assist children that have been identified to be at serious threat of abuse or neglect, grandparents that are also principal carers of their grandchildren, families that suffer temporary financial hardship and also to help families transitioning back to work from Newstart or other pensions.</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/95b6ddf6-83fb-4c3c-a65d-1cb6aadf8bd6.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/95b6ddf6-83fb-4c3c-a65d-1cb6aadf8bd6.jpeg\" style=\"float: right; margin: 10px; width: 300px; height: 300px;\"></strong></h4><h4><strong>About the author&#xA0;</strong></h4><p>I&#x2019;m Lisa, an accountant and a mum of two. When my son was born I remember how stressed I was trying to submit my application for Paid Parental Leave. I couldn&#x2019;t understand why it was so difficult. I&#x2019;m an accountant &#x2013; surely I should find it simple! I&#x2019;ve discovered I&#x2019;m not alone.</p><p>By the time I went through the process with my second child I was a lot more on top of it. I had figured out what most things meant, and how to make it work for me &#x2013; especially the childcare payments.</p><p>I wrote <a data-cke-saved-href=\"https://yourfamilybudget.com.au/\" href=\"https://yourfamilybudget.com.au/\">Your Family Budget</a> to give everyone the use of my experiences and the benefit of the hours of research I have done. Either through the reading of legislation or all the detailed &#xA0;information provided by Centrelink. I&#x2019;ve put everything you need in one place.</p><hr><h4><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects employers with the very best female talent. We engage with everyone from small independent companies to large multinationals, growing and future-proofing businesses through smart policy and process improvements.&#xA0;</p><p>But we don&apos;t stop there. We drive engagement between organisations and the people who share their values by combining traditional job advertisement techniques with proactive employer branding initiatives.</p><p>Then we talk about it. Developing gender diverse workplaces is both fair and good for business, so we make sure everyone knows when a business is actively improving the way it supports women in the workplace.</p><p>Our mission (hopefully yours too)</p><p>To finally put an end to workplace discrimination, so that women are valued equally and businesses can enjoy the benefits of a gender diverse workforce.</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2018/06"}