{"url":"https://www.work180.com.au/blog/2018/12/what-i-look-for-in-a-role-as-a-30-something-female-in-tech","title":"What I look for in a role as a 30 something female in tech","author":"Amy Miller","body":"\n\t\t\t\t\t<p>One of the consistent barriers I hear when it comes to gender diversity is what is known as the &#x2018;pipeline problem&#x2019;. You know, &#x2018;we really want to hire more women, but they just don&#x2019;t apply.&#x2019;</p>\n\n<p>While there are fewer women graduating in certain industries, and I&apos;ve personally dedicated time to promoting STEM with students, the &#x2018;pipeline problem&#x2019; often acts as a barrier to looking at the reasons why women aren&#x2019;t applying or sticking around. Because we do exist!&#xA0;</p>\n\n<p>I&apos;m a 30 something female in tech, and over the course of my career, my personal experiences have led me to jot down the top things I would look for from prospective or current employers. As well as my own experience, I run a women&apos;s network in my organisation and the themes below are often are reflective of what I hear when seeking feedback.</p>\n\n<p>On applying</p>\n\n<p>1. Flexibility &#x2013; and not because I&#x2019;m a primary carer, but because I value my development, health and passion projects outside of work, and they&#x2019;ll inevitably intersect. Seeing things like &#x2018;all roles flex&#x2019; or &#x2018;flexible work can be accommodated&#x2019; would attract me to apply.</p>\n\n<p>2. Inviting job descriptions &#x2013; this is a thing. If I read I need to be expert level for all criteria with highly specific quals I&#x2019;m probably going to have some kind of confidence demon meltdown and skip along. Try to think about what is really mandatory versus what can be learnt on the job and put emphasis on the values and qualities you are looking for. Phrases focused on relationship building, good communication skills and collaborative leadership resonate with me.</p>\n\n<p>3. A good company brand &#x2013; I probably know someone who knows someone who worked there once. What will they tell me it&#x2019;s like for a female in there? Ask the females in your business for real, honest feedback regularly so you can jump on the front foot to address it.&#xA0;</p>\n\n<p>Once I&#x2019;m there</p>\n\n<p>1. Opportunities to make positive change &#x2013; not everyone has a defined purpose or passion outside of work, but it can be a great motivator to bring one to the workplace. I recently read &apos;Eleven fearless female founders to watch in 2018&apos; and eight of those have founded companies in the health, wellbeing or community development space. No matter what your organisation does at its core, take the time to learn what else your employees are passionate about and how you could incorporate it (e.g. volunteering or knowledge sharing). For me in my current role, it&apos;s the women&apos;s network because I love helping others excel. When I take the time out to share some content or host an event it gives me extra motivation. Win-win!</p>\n\n<p>2. Sponsorship &#x2013; women, in particular, need sponsors to help navigate the unconscious bias and get put forward for opportunities. If you are in any kind of leadership role, look for the female talent that might not be highly visible and get to know their skills and career aspirations. Sponsoring or mentoring someone completely different to you (gender, culture, personality type) also helps mitigate our similarity bias.</p>\n\n<p>In summary, while the &#x2018;pipeline problem&#x2019; has some merit in certain industries, skilled women are out there and are willing to be engaged. If they aren&#x2019;t applying or sticking around, it&#x2019;s time to find out the reasons why. Making relevant adjustments according to the feedback you gather will go a long way to attracting and retaining diverse talent.</p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["positive change","pipeline problem","skilled women","flexibility"],"upload_date":"2018/12"}