{"url":"https://www.work180.com.au/blog/2015/04/why-are-there-so-few-women-in-it","title":"Why are there so few women in IT?","author":"WORK180","body":"\n\t\t\t\t\t<p>By Yolanda Beattie</p>\n\n<p>&#xA0;</p>\n\n<p><em>The following speech was given at the Females In IT International Women&apos;s Day Sydney Luncheon on 25 March 2015.</em></p>\n\n<p>&#xA0;</p>\n\n<p>It&#x2019;s a great pleasure to be welcoming you all to the Females In IT International Women&#x2019;s Day Sydney Lunch on transforming the future for women in ICT.</p>\n\n<p>Before we get stuck into the panel discussion and hear from industry leaders about their views on achieving gender equality in your industry, I&#x2019;d like to share with you some top level findings from the Workplace Gender Equality Agency&#x2019;s data set, provide some brief perspectives on why this is so, and what we can do to change the status quo.</p>\n\n<p>WGEA collects data from private sector companies that employ 100 or more people. That data tells us that in the ICT sector, women make up just 1 in 5 of the top three layers of management and around 30% of the total workforce. Perhaps unsurprisingly &#x2013; given that IT is a male dominated industry and only 10% of computer science grads are women - that result is below the average across our dataset of 11,000 employers where women comprise around 1 in 4 of those top management layers and around half of the total workforce.</p>\n\n<p>But it&#x2019;s not just the small proportion of female grads that explains this outcome. After all, you don&#x2019;t have to be a computer science grad to be a leader in the ICT industry.</p>\n\n<p>The fact is workplaces are still male dominated because they are structured in a way that favours men and people who are not primary carers. And this structure creates a culture that rewards and recognises masculine characteristics. Importantly, it&#x2019;s not just men who create this outcome &#x2013; anyone in a workplace &#x2013; men and women &#x2013; are part of the ecosystem that creates this reality. But of course it&#x2019;s the people in the positions of power that have the most impact on either maintaining or changing the status quo. And that is largely white, middle-aged, heterosexual men.</p>\n\n<p>Let me just unpack that statement by giving you two examples of these structural and cultural barriers that explain workplace gender inequality. The biggest structural barrier is the lack of quality flexible work in all its forms &#x2013; part-time, job share, teleworking, compressed working weeks etc. By and large flexible work is still seen as the token gesture to working mums and rarely taken up by men, and if men do work flexibly they do it quietly for fear of how it will make them look. This is despite the fact that research shows people who work flexibly are more engaged and productive.</p>\n\n<p>The stigma around flexibility in turn contributes to and reflects the view of the ideal worker &#x2013; full time, in the office, arrives before the boss does and leaves after, doesn&#x2019;t get distracted by pesky life realities like families and kids, or aging parents, or post-graduate studies. And then this view of the ideal worker creates a culture where working mums and &#x2018;women of a certain age&#x2019; are viewed as less committed to their career while working dads are views as more committed. All of this often happens unconsciously, making it hard to recognise and therefore address, and ultimately leads to lower starting salaries, promotion rates, and performance ratings, and fewer development opportunities for the most educated gender &#x2013; women.</p>\n\n<p>It&#x2019;s important to note that women are also making choices that inhibit their ability to ascend corporate hierarchies. Some are consciously choosing to focus on having families and no amount of flexible work or a positive workplace culture would alter that decision. Feminism is about choice and this is a perfectly wonderful choice to make. Many women are looking at their options in the corporate world and are deciding a better future lies in working for themselves. And all power to them!</p>\n\n<p>Some women are also not putting their hands up as loudly and as confidently as their male peers for the next hot project or job promotion &#x2013; often because we&#x2019;re programmed from such a young age to be compliant and wait our turn. And while this may be true research shows even when we do put ourselves forward, we&#x2019;re less likely than our equivalent male peers to be considered for the role.</p>\n\n<p>For employers and people mangers, all of this means you won&#x2019;t be operating in a meritocracy &#x2013; unless you apply strategic and systematic interventions to dismantle these structural and cultural barriers. Unfortunately, our data suggests this is not happening with only 28.7% of employers in the IT industry having a gender equality strategy.</p>\n\n<p>&#xA0;</p>\n\n<h5><strong>So what can we do about it?</strong></h5>\n\n<p>The first step is to recognise the issue &#x2013; at a head and heart level. Then conduct a root and branch review of your organisation&#x2019;s decision making systems and process and culture, before developing a long term strategy that is designed to ensure every person in the workplace, regardless of gender and caring responsibilities - or sexual orientation or cultural background for that matter - can reach their full potential. But this endgame can only be achieved if we fully appreciate what&#x2019;s inhibiting the outcome in the first place.</p>\n\n<p>I&#x2019;ve barely scratched the surface of the causes of and solutions to gender inequality in workplaces. This issue is like Mary Poppins&#x2019; bag &#x2013; just when you think you&#x2019;ve got to the bottom of it, you realise there&#x2019;s more to it. So I look forward to a deeper discussion on the panel and hopefully, for all of us, an ongoing inquiry into each of our role in fixing the issue.</p>\n\n<p>&#xA0;</p>\n\n<p>Yolanda is the Executive Manager Public Affairs at the Workplace Gender Equality Agency.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/04","associated_company":"work180"}