{"url":"https://www.work180.com.au/blog/2016/08/why-diversity-is-not-a-dirty-word-for-women-in-tech-or-trades","title":"Why Diversity Is Not A Dirty Word For Women In Tech Or Trades","author":"WORK180","body":"\n\t\t\t\t\t<p>Hillary Clinton&#xA0;pushed through the ultimate glass ceiling to become the first female presidential nominee, and in Australia women are smashing away at similar barriers in their workplace.</p>\n\n<p>Women are still dramatically underrepresented in many traditionally male-dominated industries, notably the tech sector and construction and trades.</p>\n\n<p>Only 28 percent of employees in information and communications technology are women, according to figures released last year from the Australian Computer Society and Deloitte&apos;s digital pulse report.</p>\n\n<p>And women make up only 16.1 percent of the construction industry according to the Government&apos;s Workplace Gender Equality Agency, only slightly ahead of mining at 15.96 percent.</p>\n\n<p style=\"text-align:center\">&#xA0;</p>\n\n<p><b>WORK180</b></p>\n\n<p>Valeria Ignatieva and Gemma Lloyd, co-founders of WORK180, worked in the tech industry and saw first-hand the barriers women face. They say women haven&apos;t ventured into these industries much because of stigma around &apos;male&apos; and &apos;female&apos; roles, a lack of information and support at school level and, in some cases, intimidation.</p>\n\n<p>&quot;I was in a workplace in the tech industry with men who were in their mid 40s and I was the same level as them in my mid 20s and they would ask me to go and get them coffee, get stationery, take their notes for them,&quot; Lloyd told The Huffington Post Australia.</p>\n\n<blockquote>\n<p><em>&quot;They were treating me like their assistant and that really had an effect on me because I went into that job really excited and enthusiastic and those little subliminal things keep happening and knocking you down.&quot;</em></p>\n</blockquote>\n\n<p>The pair say&#xA0;part of the problem for women in these types of industries is self-confidence -- and the unfortunate attitudes some have about life after childbirth.</p>\n\n<p>&quot;We have had women say, &apos;I&apos;ve had kids so my career is over&apos; and senior women totally drop down several levels,&quot; said Ignatieva. &quot;This is why we are so passionate about putting forward the employers that are not discriminating.&quot;</p>\n\n<p>Ignatieva and Lloyd established WORK180 to both help women to enter and thrive in male-dominated industries and also to educate companies and assist them to become employers of choice for women.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/2dd04e14-587a-4fba-b44a-dded6a5fa2f2.png\">&#x200B;</p>\n\n<p>They work with larger corporations but also many startups to encourage flexible working arrangements for all staff, support for career progression and policies for non-gender-specific parental leave and gender-neutral language when advertising roles.</p>\n\n<p>Each company is investigated by the team and verified as an employer of choice for women before their positions can be advertised on WORK180 site. If the company is certified by WGEA they can automatically join -- otherwise they screen their policies and interview leaders and staff to be satisfied.</p>\n\n<p>They already have companies such as<a href=\"https://www.work180.com.au/clients\"> Caltex, Bank of Queensland, BHP, HSBC</a> on board which have adjusted existing policies to be more diversity-friendly as well as startups who want to get their policies right from the get-go.</p>\n\n<p>Ignatieva says bigger firms are now recognising that to draw and retain the best talent, they need to be attractive to women candidates.</p>\n\n<p>The pair thought their clients would come mainly from the tech sector, but their customer base has expanded to include finance, legal, baking, oil and gas and trades companies.</p>\n\n<p>&quot;We started off thinking we were going to have more of an IT focus purely because that&apos;s our background but as we got going we realised that diversity is an issue across all different industries,&quot; Lloyd said.</p>\n\n<p>&#xA0;</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/7b32ebfd-85c3-49e6-b420-23ef5c281cb0.jpeg\"></p>\n\n<p><strong>WOMEN IN POWER</strong></p>\n\n<h4>Encouraging women to take up the tools</h4>\n\n<p>Queensland small businesswoman Tammi Stanton, who co-owns Platinum Electricians Morningside with her husband, is also being proactive about turning her trades industry into one that&apos;s an attractive career option for women.</p>\n\n<p>She and three other small business owners have started Women in Power, a not-for-profit group designed to lead by example and encourage more women into the industry.</p>\n\n<p>Stanton, who worked in male-dominated IT before joining her husband in the business, was inspired to create it after becoming the first woman elected to the board of industry association, Master Electricians.</p>\n\n<p>&quot;When I became the first female board member on Master Electricians I thought wow, this is scary that this hadn&apos;t happened before,&quot; she told HuffPost Australia. And that&apos;s when I became very involved in the industry -- I realised that it wasn&apos;t just IT, it&apos;s so many industries out there.&quot;</p>\n\n<p>Women in Power&apos;s first initiative is to encourage young women at school level to flip the stigma about working in trades and are initiating a program with a local high school.</p>\n\n<p>&quot;We felt to help get more females into the industry we needed to get into schools,&quot; she said.</p>\n\n<p>&quot;My boys are going through a school where they can pretty much start their apprenticeships there but for girls there&apos;s a stereotype of doing drama and music and dance.</p>\n\n<p>&quot;We think we need to start to remove those stereotypes to make this industry a better place for women in this industry.&quot;</p>\n\n<p style=\"font-family: Lato, sans-serif;\"><em><small>Originally published on&#xA0;<a href=\"http://www.huffingtonpost.com.au/2016/07/28/why-diversity-is-not-a-dirty-word-for-women-in-tech-or-trades/\">Huffington Post</a>.</small></em></p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects employers with the very best female talent. We engage with everyone from small independent companies to large multinationals, growing and future-proofing businesses through smart policy and process improvements.&#xA0;</p>\n\n<p>But we don&apos;t stop there. We drive engagement between organisations and the people who share their values by combining traditional job advertisement techniques with proactive employer branding initiatives.</p>\n\n<p>Then we talk about it. Developing gender diverse workplaces is both fair and good for business, so we make sure everyone knows when a business is actively improving the way it supports women in the workplace.</p>\n\n<p>Our mission (hopefully yours too)</p>\n\n<p>To finally put an end to workplace discrimination, so that women are valued equally and businesses can enjoy the benefits of a gender diverse workforce.</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p><a href=\"http://www.work180.co/\">Visit the UK WORK180 website</a><span style=\"font-size: 1.6rem;\"> </span></p>\n\n\t\t\t\t","tags":["gender equality","Career Development","Originally published on Huffington Post."],"upload_date":"2016/08","associated_company":"work180"}