{"url":"https://www.work180.com.au/blog/2019/01/why-diversity-cant-be-just-a-target","title":"Why diversity can't be just a target","author":"WORK180","body":"\n\t\t\t\t\t<p>When it comes to diversity and inclusion, Incitec Pivot Limited&#x2019;s Davina Shearer is a pragmatist. But she&#x2019;s also inspired. We sat down with her to find out why.</p>\n\n<p>As interviewees go, Davina Shearer is a dream come true. She&#x2019;s clear, to the point and not afraid to say what she really thinks&#x2026; which is probably why she&#x2019;s at the heart of some powerful D&amp;I change at Incitec Pivot Limited (IPL), a global leader in the resources and agricultural sectors.</p>\n\n<p>It&#x2019;s clear from the start of our conversation that Davina is multi-tasking. As Diversity &amp; Inclusion Adviser, she&#x2019;s involved in longer-term strategic projects and ongoing stakeholder engagement but also gets stuck into daily improvement work. She says that just before jumping on our call, she was rewriting job ads to better engage a more diverse range of talent. She&#x2019;s also helped drive the company&#x2019;s use of a gender decoder (&#x201C;it&#x2019;s now standard practice for us&#x201D;), better job ad imagery, and a more sophisticated advertising strategy to find talented women.</p>\n\n<p>&#x201C;We&#x2019;ve become more proactive in terms of channels. As well as partnering with WORK180, we promote roles through a range of associations which are driving female participation in our space. We&#x2019;re also much better at leveraging our employees&#x2019; networks. And it&#x2019;s great that increasingly, they are out there, saying &#x2018;I&#x2019;m proud to work here&#x2019;. It&#x2019;s about attraction, retention, development and positive engagement, in equal measure.&#x201D;</p>\n\n<p>Employee advocacy is a key theme and it clearly keeps Davina motivated. She tells a powerful story about a campaign she coordinated for International Women&#x2019;s Day, whereby employees were asked to write a statement on a board and take a selfie to share across IPL&#x2019;s social channels:&#xA0;&#xA0;&#xA0;</p>\n\n<p>&#x201C;Our people got really involved, sometimes even sending pics taken with their children. Men were realising &#x2018;If I don&#x2019;t change things and contribute here in the business, my daughter, wife or sister won&#x2019;t fit in here&#x2019;. There was a real change; it&#x2019;s not always quantifiable but you feel it. This year we ran it globally. We got pics from men in the US, Indonesia, Turkey and beyond &#x2013; all holding up their signs.&#x201D;</p>\n\n<p>Davina explains that these &#x2018;adaptive initiatives&#x2019; (that target both behaviour and mindset changes) are vital if you&#x2019;re truly committed to shaping a culture that &#x201C;allows our employees to reach their full potential, whoever they are.&#x201D; This extends to educating and influencing stakeholders around the benefits of an inclusive and diverse workforce.&#xA0; &#xA0;&#xA0;</p>\n\n<p>&#x201C;We need to talk about the benefits the individual can bring, as opposed to an unnecessarily strong focus on technical qualifications. We manufacture chemicals, fertilisers and explosives. Everything about that screams men. How do we show women the diverse range of jobs we have? And how do we ensure we prioritise the attributes and capabilities of each candidate, as opposed to where they&#x2019;ve worked and who they know?&#x201D;</p>\n\n<p>It&#x2019;s admirable to see Davina so focused on the work still to be done. But she also takes a moment to recognise what has already been achieved. IPL has increased female workforce participation globally from 13.6% in 2012, to 15.9% today (and 22% in Australia). They&#x2019;ve also moved the dial on applications from women. In the last 12 months 33% of all external hires at IPL have been women, thus extending the range of perspectives, experiences and skills that can strengthen the Company.</p>\n\n<p>For Davina, this starts with understanding what matters to talent today:</p>\n\n<p>&#x201C;Workforce demographics are changing and we know that, more than ever before,&#xA0; potential employees care about much more than just remuneration. A positive workplace culture, flexible work options, reward programs and sustainable environmental practices are not just &#x2018;nice to haves&#x2019;; they&#x2019;re essential if we want to attract talent that can contribute to employee engagement, safety, productivity and innovation.&#x201D;</p>\n\n<p>Davina continues to fight to &#x201C;get in front of more women from inside and outside of our industry&#x201D;. She says the partnership with WORK180 has helped build important brand awareness among those target audiences and hire a diverse range of talent to deliver better business outcomes.</p>\n\n<p>&#x201C;The WORK180 team understands the true challenges surrounding attracting talented women to your business. They&#x2019;ve actually experienced some of those challenges of bias themselves, and so are doing something about it. A great example is the criteria employers have to meet in order to be selected and advertise with them.&#x201D;</p>\n\n<p>When asked what advice she can offer other employers who are starting out on their D&amp;I journey, she&#x2019;s unequivocal.&#xA0;</p>\n\n<p>&#x201C;You need people to participate &#x2013; that&#x2019;s the only way to change culture. Diversity and inclusion is everyone&#x2019;s responsibility, so build relationships. Educate and inspire people. You&#x2019;re asking them to change how they do things. They need to see the benefits to them and how you can support them to implement, embed and integrate inclusive practices into the everyday norm.&#x201D;</p>\n\n<p>She offers three final pieces of advice for people in similar roles and industries to hers.</p>\n\n<p>Set your targets realistically and work out what&#x2019;s right for your business. What&#x2019;s achievable in your context?&#xA0; It is essential to adapt KPI&#x2019;s for each area / level of the business to ensure individuals can influence and contribute to change.</p>\n\n<p>Don&#x2019;t assume you always need to do something brand new &#x2013; look at best practice and apply it. Work with your external stakeholders; they will often want to partner with companies who leverage diversity and inclusion as a strategic business driver.</p>\n\n<p>Without a formal strategy (and a lot of resilience) this won&#x2019;t come easy! If you want to see transformational change, you need a multi-pronged strategy and should include a broad suite of technical and adaptive initiatives. If something&#x2019;s working well, roll it out across all areas of the business. Be prepared for the fact that some things you try will fail but remember to celebrate and promote your wins, big or small.&#xA0;</p>\n\n<p>We couldn&#x2019;t have said it better ourselves.</p>\n\n<hr>\n<h4><strong>About Incitec Pivot Limited</strong></h4>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/85f90134-bb39-410c-8c7a-fa6bfac3e975.png\" style=\"font-size: 16px; float: right; margin: 10px 0px; width: 300px;\"></p>\n\n<div>&#xA0;</div>\n\n<div>\n<p>Incitec Pivot Limited isn&#x2019;t just talking about gender diversity, they&#x2019;re actively introducing initiatives to attract and support women in the workplace. These include mentoring and leadership programs, flexible working arrangements and partnerships with associations that inspire women to focus on their career paths.</p>\n\n<p><a href=\"https://www.work180.com.au/clients/incitec-pivot-limited\" style=\"font-size: 1.6rem; background-color: rgb(255, 255, 255);\">Learn more about why Incitec Pivot Limited became an&#xA0;endorsed employer for women here</a>.</p>\n\n<div>\n<div>\n<h4>&#xA0;</h4>\n\n<h4><strong>About WORK180<br>\n&#x200B;</strong></h4>\n\n<p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p>\n\n<p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0; &#xA0;&#xA0;</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a>&#xA0;</p>\n</div>\n</div>\n</div>\n\n\t\t\t\t","tags":["Incitec pivot","WORK180","employee advocasy","diversity"],"upload_date":"2019/01","associated_companies":["work180"]}