{"url":"https://www.work180.com.au/blog/2018/08/why-aussie-dads-should-take-more-parental-leave","title":"Why Aussie Dads should take more parental leave","author":"WORK180","body":"\n\t\t\t\t\t<p>Pictured above:&#xA0; Daniele&#xA0;Cavini&#xA0;and his daughters feature in the Aussie Dads exhibition<em> (photo credit: Johan B&#xE4;vman and Parents At Work)</em></p><p>Daniele Cavini, Senior Commodity Manager at <a data-cke-saved-href=\"https://www.work180.com.au/clients/hsbc\" href=\"https://www.work180.com.au/clients/hsbc\">HSBC Australia</a>, shares his experiences taking parental leave, and explains why he is supporting a new campaign to encourage more Australian fathers to do the same.</p><p>For Daniele Cavini, Senior Commodity Manager at HSBC Australia, taking parental leave was an easy but important decision after the birth of both his daughters.</p><p>Daniele took parental leave to look after Sophia (now 3.5 years old) and Arianna (13 months) when his wife went back to work after six months. Daniele says this decision gave his wife the confidence and comfort to return to the workforce at the time of her choosing, while he got invaluable bonding time and experience as a dad.</p><p>&#x201C;The stereotype of mothers taking sole care of children and fathers as the breadwinner is outdated. For me, the ability to detach from work and spend that quality time with my daughters will stay with me forever,&#x201D; he said.</p><p>&#x201C;I also really grew as a person during that time. I had never had someone completely dependent on me before, and it opened up a completely different part of me,&#x201D; he said.</p><p>Daniele at first felt a bit intimidated&#x2026; &#x201C;like I was carrying a crystal ball around the house!&#x201D;, but he soon grew more confident that he could interpret his daughters&#x2019; expressions and provide what they needed.</p><p>But Daniele is a rarity in Australia, where only 27% of people taking primary or secondary carer&#x2019;s leave are men, according to the Workplace Gender Equality Agency.</p><p>To help change this, social enterprise Parents At Work, along with a wide number of Australian and international organisations including <a data-cke-saved-href=\"https://www.work180.com.au/clients/hsbc\" href=\"https://www.work180.com.au/clients/hsbc\">HSBC Australia</a>, have launched&#xA0;<a data-cke-saved-href=\"http://aussiedads.parentsatwork.com.au/\" href=\"http://aussiedads.parentsatwork.com.au/\" target=\"_blank\">Aussie Dads</a>, to kick start a national conversation on shared parental leave.</p><p>Parents At Work have also commissioned acclaimed Swedish photographer, Johan B&#xE4;vman, to take a series of photographs of Australian fathers who have taken parental leave.</p><p>The resulting Aussie Dads exhibition, which will also feature his original iconic Swedish Dads photographs, will be open to the public in Sydney and Melbourne over the coming weeks.</p><p>HSBC Australia CEO, Martin Tricaud, explains why the bank is supporting this initiative.</p><blockquote><p><em>&#x201C;Part of our commitment to greater gender equity is to challenge preconceptions about the traditional roles of men and women and encourage more men to take an active role as carers,&#x201D; Martin, who is also a Workplace Gender Equality Agency (WGEA) Pay Equity Ambassador, said.</em></p></blockquote><blockquote><p><em>&#x201C;By addressing unconscious biases we might hold, we can create a fairer and more inclusive workplace,&#x201D; he said.</em></p></blockquote><table style=\"width:880px;line-height:inherit;width:880px;\" class=\" cke_show_border\"><tbody><tr><td><h3>Key facts</h3><ul style=\"list-style-type:square;\"><li>Australian women typically earn 14.6% less than their male counterparts doing the same job (WGEA)</li><li>Only 4.7% of Australian employees who take primary carer&#x2019;s leave are men while 94.8% of employees who take secondary carer&#x2019;s leave are men (WGEA)</li><li>Just one in three eligible fathers take advantage of the Government&#x2019;s Dad and Partner Pay (secondary carer) scheme</li></ul></td></tr></tbody></table><div style=\"clear:both;\"><br></div><p>For more information on the Aussie Dads campaign, visit&#xA0;<a data-cke-saved-href=\"http://aussiedads.parentsatwork.com.au/\" href=\"http://aussiedads.parentsatwork.com.au/\" target=\"_blank\">http://aussiedads.parentsatwork.com.au</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About HSBC&#xA0;<img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4ed57bde-9aa0-4480-9d28-f75d89987395.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/4ed57bde-9aa0-4480-9d28-f75d89987395.png\" style=\"float: right; margin: 10px; width: 300px; height: 158px;\"></strong></h4><p>HSBC is an Endorsed Employer for Women. Their workplace policies are certainly setting a standard beyond the average! CEO Martin Tricaud is a Workplace Gender Equality Agency Pay Equity Ambassador and 100% committed to creating a fair workplace.&#xA0; What&#x2019;s on offer:</p><p>Flex Able Certified Employer</p><p>Paid parental leave &#x2192; 15 weeks (primary carer) &amp; 2 weeks (secondary carer)</p><p>Domestic Family Violence policy</p><p>Breastfeeding rooms Training &amp; Development Paid volunteer days</p><p>Plus lots more on their&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/hsbc\" href=\"https://www.work180.com.au/clients/hsbc\">Best Employer page.&#xA0;</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=hsbc\" href=\"https://www.work180.com.au/job-search?client=hsbc\">Browse their jobs and apply here</a>.</p><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\"></a></p>\n\t\t\t\t","tags":["gender equality","parental leave"],"upload_date":"2018/08","associated_companies":["work180"]}