{"url":"https://www.work180.com.au/blog/2018/08/why-keeping-in-touch-is-good-for-your-brand","title":"Why keeping in touch is good for your brand","author":"Dr Raymond Trau","body":"\n\t\t\t\t\t<p>In 2018, everyone is a brand.</p><p>People spend hours curating their personal and professional image on social media platforms and in real life.</p><p>But, what happens to that professional brand when a woman goes on maternity leave?</p><p>This dilemma is particularly interesting amid the growing global trend of legislated, longer maternity leave periods.</p><p>I worked with Canadian colleagues Ivona Hideg, Anja Krstic and Tanya Zarina on a first of its kind study to investigate why women often experienced penalties after taking longer maternity leaves, and strategies to overcome this.</p><p>One of the most interesting findings, published in&#xA0;<em>Journal of Applied Psychology</em>, was that new mums who kept in touch with their workplaces while on longer maternity leaves were more hireable and less likely to experience unconscious bias from others.</p><p>Canadian and Australian workplaces are using keeping in touch programs and they&#x2019;re effective to some degree.&#xA0;&#xA0;Our research suggests that participating in the keep in touch program sends a strong signal to others that these mums are committed to their career. These programs can be used as a personal brand management strategy to minimise bias from colleagues, managers and employers.</p><p>The good news is Australian mothers can access programs or information about them relatively easily.&#xA0;</p><p>For example, online parental leave platform Grace Papers&#xA0;makes it easy for new mums to stay in touch with step-by-step support.&#xA0;</p><p>And perhaps some of the best tips come from founder and CEO Prue Gilbert, who is also a working mother of three.&#xA0;</p><p>Here are some of her suggestions:</p><ul><li>Work with your people leader to create a keeping in touch plan that shares the responsibility for addressing biases in the system and includes a calendar of activities you may like to attend.</li><li>Ask to be consulted about a project, deal, or opportunity that&#x2019;s likely to come up while you&#x2019;re on paternity leave.</li><li>Share your handover notes with your people leader. Many women going on parental leave have been replaced with not one, but two people once they list everything they do and were responsible for.</li><li>Know your rights. You can access to up to 10 days of paid leave while on unpaid parental leave to keep in touch. They can be used creatively &#x2013; 20 half days, conferences, training, team meetings.</li></ul><p>But the key take away in our research was that&#xA0;it&#x2019;s not simply enough for keeping in touch programs to exist. Women must actively use them to realise the benefits and manage their personal brand.</p><hr><p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d54c22bb-fcba-4ca5-be65-dafd89f3b9cf.jpeg\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d54c22bb-fcba-4ca5-be65-dafd89f3b9cf.jpeg\" style=\"font-size: 16px; float: right; margin: 10px; width: 150px; height: 150px;\"></p><p><a data-cke-saved-href=\"https://www.rmit.edu.au/contact/staff-contacts/academic-staff/t/trau-dr-raymond\" href=\"https://www.rmit.edu.au/contact/staff-contacts/academic-staff/t/trau-dr-raymond\" target=\"_blank\">Dr Raymond Trau</a>&#xA0;is a lecturer at&#xA0;RMIT&#x2019;s School of Management in Melbourne. He is an expert in workplace diversity.</p><p>The tips are an edited extract from the Grace Papers blog post&#xA0;<a data-cke-saved-href=\"https://www.gracepapers.com.au/grace-papers/2018/7/31/why-keeping-in-touch-is-good-for-your-brand\" href=\"https://www.gracepapers.com.au/grace-papers/2018/7/31/why-keeping-in-touch-is-good-for-your-brand\" target=\"_blank\">&#x201C;why keeping in touch is good for your brand&#x201D;</a>&#xA0;and are republished with permission.</p><p>Read the story of a&#xA0;Melbourne mum talking about why she used a keeping in touch program and more detail about the research,&#xA0;<a data-cke-saved-href=\"https://www.rmit.edu.au/news/all-news/2018/jul/baby-lets-keep-in-touch\" href=\"https://www.rmit.edu.au/news/all-news/2018/jul/baby-lets-keep-in-touch\" target=\"_blank\">here</a>.&#xA0;</p><p><br></p><p>Hear from <a data-cke-saved-href=\"https://www.work180.com.au/blog/2017/01/four-ways-to-connect-and-support-team-members-on-parental-leave\" href=\"https://www.work180.com.au/blog/2017/01/four-ways-to-connect-and-support-team-members-on-parental-leave\">Lauren&#xA0;who helped set up BHP&apos;s&#xA0;parents</a>&#xA0;group for employees who are either on parental leave or have recently returned from parental leave.</p><p><br></p><p><br></p><p></p><hr><p><br></p><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with talented women. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\"></a></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/08"}