{"url":"https://www.work180.com.au/blog/2018/08/why-we-need-to-think-twice-before-we-speak","title":"Why we need to think twice before we speak ","author":"Matt Lee","body":"\n\t\t\t\t\t<p>I received an email the other day, as I do every day from the Herald-Sun newspaper. The email summarises the main stories of the day and allows me to click on a link and read a story if I choose. Quite normal for any newspaper in these digital days.</p><blockquote><p><em>However, one story caught my attention today for reasons other than its content. The heading was innocuous enough &quot;Can you pass the money quiz men and women fail?&quot;. </em></p></blockquote><p>Now, I love a quiz and so was immediately drawn to the story, thinking &quot;I wonder if I&apos;ll be any good at this?&quot;. But then I read the teaser text under the heading and was surprised that women seemed to be worse at this quiz than men. This didn&apos;t make sense as there seems to be no reason why gender should affect a quiz like this.</p><p>But then I re-read the text and was even more surprised that the author had seemed to deliberately (or sub-consciously) used language that was gender-biased. Women, in fact, were better at this quiz than men!</p><p>Why would the words &quot;Only half&quot; and &quot;passed&quot; be used in relation to men and &quot;less than half&quot; and &quot;failed&quot; be used for women? Why? &quot;Less than half of the women failed&quot; or in other words&#xA0;more than half of the women passed! As compared to &quot;Only half of men passed&quot;.</p><p>Maybe the language was &quot;unintentional&quot; but even so this demonstrates and reinforces the unconscious biases that we all have. This is a great reminder for us all to remember to test what we say, write and think to ensure it&apos;s balanced.</p><hr><h4><strong>About</strong><strong> the author&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/consultants/matt-lee?\" href=\"https://www.work180.com.au/consultants/matt-lee?\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/0a988a96-d263-46a2-a5a7-da7ec79bf8a8.jpeg\" style=\"float: right; width: 150px; height: 150px; margin-left: 10px; margin-right: 10px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/0a988a96-d263-46a2-a5a7-da7ec79bf8a8.jpeg\"></a></strong></h4><p>As a passionate advocate of diversity and inclusion, Matt is involved in various pro bono activities that seek to increase the opportunities for under-represented groups. As a father of three girls and two&#xA0;boys&#xA0;Matt&apos;s strong beliefs around diversity and inclusion are also founded on hopes for a future where all of his children have equal opportunities and earning potential.&#xA0; Find all his&#xA0;blogs <a data-cke-saved-href=\"https://www.work180.com.au/consultants/matt-lee?\" href=\"https://www.work180.com.au/consultants/matt-lee?\">here.</a></p><p><br></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2018/08"}