{"url":"https://www.work180.com.au/blog/2018/08/why-health-and-wellbeing-matters","title":"Why Health and Wellbeing Matters in the Workplace","author":"WORK180","body":"\n\t\t\t\t\t<div style=\"clear:both;\"><div id=\"par_responsive_container_sd_component_article_sd_component_text_op-578030320\"><div><div><div><div id=\"r-113\"><div style=\"margin-left:auto;\"><div><div><div><p>Hi, I&#x2019;m Megan! I look after our Health &amp; Wellbeing program&#xA0; at Optus and have been with the organisation since 2012. I originally started out my career as a nurse, but after 10 years, I realised I was more passionate about workplace wellbeing. In 2005, I set up the first national corporate wellbeing program in Australia and haven&#x2019;t looked back since. To summarise why I do what I do; I love helping people stay well.</p><p><br></p><h4><strong>Health &amp; Wellbeing&#xA0;</strong></h4><p>So, what does Health &amp; Wellbeing look like at Optus? Well, Health &amp; Wellbeing is part of broader HR, and together we roll out a wide range on initiatives and programs aimed to support our people to live a healthy lifestyle &#x2013; both in and outside of work. Our services vary per office location, but here is an example of some of the services our Sydney campus offers:</p><ul style=\"list-style-type:disc;\"><li>Onsite gym</li><li>GP services</li><li>Dentist</li><li>Psychologist</li><li>Physiotherapist and massage</li><li>Childcare</li></ul><p>&#x2026;and much more. We&#x2019;re happy to report that our services are used. For example, in 2017 our GP had over 3,000 consultations, and our psychologists provided over 50 sessions a month to our people either face-to-face, by phone or webchat.</p><p>In another example, one of our employees had a history of chronic and debilitating health issues following birth of her second child, which affected her physical fitness and mental health. She knew she needed help but was terrified of going to the gym. However, she got out of her comfort zone and got on track with her health with the help of a tailored strength plan and ongoing support via email and telephone. In her feedback, she stated that:</p><blockquote><p><em>&#x201C;The program provided me with the direction and instruction I needed to confidently expand my gym sessions from cardio to strength based training. This has made all the difference to my feeling of health and wellbeing. After such a long, undesirable health journey, it&#x2019;s great to feel supported and to finally feel normal&#x201D;.</em></p></blockquote></div></div></div></div></div></div></div></div></div></div><div style=\"clear:both;\"><div style=\"margin-left:auto;\"><div><div><div><p>We see our provided services as a&#xA0;partnership&#xA0;between Optus and its people. Some services are covered, some aren&#x2019;t. Together, with&#xA0;effort&#xA0;from both parties, we aim for our people are as healthy as can be with the tools they have at hand.</p><p>One important takeaway is that we don&#x2019;t expect everyone to have the same needs at the same time. We&#xA0;recognise&#xA0;that our support must be available when people need it as opposed to when we offer it.</p><p>We also have 40 Wellbeing Champions located all over Australia. They play an important role in bringing the Wellbeing program to life, by helping us roll out initiatives, getting feedback from employees on what&#x2019;s working (and what&#x2019;s not), and to help us tailor for individual needs.</p><h4><strong>One piece of advice</strong></h4><p>If I could pass on some advice to those looking to either improve their health or maintain their health, it would be to start by choosing one thing to work on and take it from there. Succeeding at one change has a flow on effect. Also, find a good health coach, they are great in helping help you stay on track.</p></div></div></div></div></div><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About Optus&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/14235214-b0c9-43ad-bd3a-e3f0069f2291.png\" style=\"float: right; margin: 10px; width: 300px; height: 60px;\"></a></strong></h4><p>Optus&#x2019; focus is to create a gender balance, increasing female representation in leadership and key technical roles and continue to foster a culture where LGBTIQ+ employees are confident expressing themselves. Jacinta Brogan, HR grad at Optus says the engaging culture is one of the best parts plus, the company allows for flexible work which is something she truly values.</p><p>Interested in learning more about Optus?&#xA0; Check out their Best Employer page&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients/optus\" href=\"https://www.work180.com.au/clients/optus\">here.&#xA0;</a></p><p>Browse jobs with Optus and apply&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=optus\" href=\"https://www.work180.com.au/job-search?client=optus\">here.&#xA0;</a></p><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2018/08","associated_companies":["work180"]}