{"url":"https://www.work180.com.au/blog/2016/07/why-its-essential-to-attend-conferences-and-how-to-win-the-go-ahead-from-your-boss","title":"Why it’s essential to attend conferences and how to win the go-ahead from your boss.","author":"WORK180","body":"\n\t\t\t\t\t<p>Written by&#xA0; Michelle Tucker</p>\n\n<p>&#xA0;</p>\n\n<p>Those fortunate enough to attend TedX or even SXSW this year would have walked away feeling rejuvenated and inspired. Not only because those sharing their knowledge and experience were engaging and cutting edge, but because creativity begets creativity.</p>\n\n<p>Sticking to the office like an oyster to a rock is not ideal for the employee or the employer. Even if it seems near on impossible to leave the barrage of emails, meetings and demands behind, attending a brain-stretching conference is always a good idea.</p>\n\n<p>While there are undoubtedly certain levels of inspiration and learning that can be gained from within the office, there is something unique about being in room filled with like-minded thinkers and professionals keen to listen to each other&#x2019;s professional and human experiences.</p>\n\n<p>Attending a conference isn&#x2019;t something that can happen every month, but when the office feels like groundhog day, creativity is stilted or simply when perspective is lost, it&#x2019;s probably time to find a conference. A change in atmosphere can stimulate the senses and provide the opportunity to think more freely and deliver solutions.</p>\n\n<p>According to Janine Popick of Dasheroo, there are four key reasons to attend an event :&#x201C;to learn, network, generate content for social media and to share&#x201D;1.</p>\n\n<p>Additionally, Shanna E. Smith and Caroline T. Rankin from the University of Texas suggest that attendees at conferences often feel like they are part of a &#x201C;larger community and listening to others talk about their approaches to strategy, creativity and life in general provides perspective to determine where and how we fit in the professional spectrum,&#x201D;2.</p>\n\n<p>Not only does time out of the office help find clarity, improve creative thinking and problem solving, it also provides an opportunity to meet new people that can help with resources and connections &#x2013; not just for new roles, but new approaches.</p>\n\n<p>Emad Rahim of Colorado Tech said conferences can also help expand resources.</p>\n\n<p>&#x201C;The greatest benefits of attending an academic or professional conference are the opportunities to build your network and increase your awareness of new trends happening in your area of interest&#x201D;3.</p>\n\n<p>However, not all people see conferences as a benefit to learning and creativity. Some managers are (strangely) reluctant to provide support in terms of time off and budget for tickets and flights to ensure their team grow. As such, some employees might find themselves coming up against managers who either don&#x2019;t see the benefit of conferences or believe their team should be in the office at all times &#x2013; to work.</p>\n\n<p>Like everything in business, it&#x2019;s about negotiation for both funds and time. &#xA0;AJ Agrawal, CEO and co- founder of Alumnity said, &#x201C;A pitch to attend a conference is like any sales conversation. You want to see your company become greater as a result of the attendance&#x201D;4.</p>\n\n<p>So with that in mind, AJ Agrawal suggests that future conference attendees think about the benefits a conference will bring to the company.</p>\n\n<p>&#xA0;</p>\n\n<p>Here are some good answers that you may want to give your boss:</p>\n\n<ul>\n\t<li>&#x201C;It will help me support you in X, Y, and Z.&#x201D;</li>\n\t<li>&#x201C;I will be able to cover for A if B is sick.&#x201D;</li>\n\t<li>&#x201C;I believe this conference will provide the company with lots of new ideas to push forward and the marketing potential is large&#x201D;4.</li>\n</ul>\n\n<p>If you find there is still reluctance to attend a conference, try a small local one &#x2013; perhaps a half day to show the benefits. At times the proof is often in the pudding.</p>\n\n<p>When it comes to your role, AJ suggests that &#x201C;It&#x2019;s your job to make the conference seem as undisruptive as possible&#x201D;4. While this may mean some long nights on email, hopefully the inspiration and new perspectives gained by attending the conference will pay off.</p>\n\n<p>&#xA0;</p>\n\n<p>So&#xA0;some takeout tips to ensure conference attendance is a go:</p>\n\n<ol>\n\t<li>Find the one conference/event you are truly passionate about. You want to ensure that you are happy to take on the extra work from attending a conference and be able to sell the dream.</li>\n\t<li>Speak with the HR team to find out if there is indeed a learning and development budget available. If there is, the pitch for funds will be easier.</li>\n\t<li>Ensure your work is under control. Again, making it near impossible for your manager to say &#x201C;no&#x201D;.</li>\n\t<li>Think about the benefits to your professional development and what that means for your role, the team and the business. Tell your manager your thoughts.</li>\n\t<li>Remember learning is essential, and trying to better your abilities and stretch your thinking is only ever a really good, and commendable, thing.</li>\n</ol>\n\n<p>&#xA0;</p>\n\n<p>References:</p>\n\n<ol>\n\t<li><a href=\"http://www.inc.com/janine-popick/4-reasons-your-employees-should-attend-conferences.html\">http://www.inc.com/janine-popick/4-reasons-your-employees-should-attend-conferences.html</a></li>\n\t<li><a href=\"http://static1.1.sqspcdn.com/static/f/1470315/18715672/1339527342470/conferences.pdf.html\">http://static1.1.sqspcdn.com/static/f/1470315/18715672/1339527342470/conferences.pdf.html</a></li>\n\t<li><a href=\"http://www.coloradotech.edu/resources/blogs/june-2013/professional-conference?dheader=new\">http://www.coloradotech.edu/resources/blogs/june-2013/professional-conference?dheader=new</a></li>\n\t<li><a href=\"http://www.huffingtonpost.com/aj-agrawal/how-to-get-your-boss-to-s_b_9298850.html\">http://www.huffingtonpost.com/aj-agrawal/how-to-get-your-boss-to-s_b_9298850.html</a></li>\n</ol>\n\n<p>&#xA0;</p>\n\n<p>Originally posted on&#xA0;<a href=\"http://womenindigital.org/\" target=\"_blank\">Women in Digital</a>, the article can be viewed&#xA0;<a href=\"http://womenindigital.org/essential-attend-conferences-win-go-ahead-boss/\" target=\"_blank\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/07","associated_company":"work180"}