{"url":"https://www.work180.com.au/blog/2017/04/why-hackathons-are-the-secret-ingredient-to-creating-change-in-the-workplace","title":"Why Hackathons are the Secret Ingredient to Creating Change in the Workplace","author":"WORK180","body":"\n\t\t\t\t\t<p>There&#x2019;s a common misconception that hackathons are merely opportunities for geeky blokes to consume truckloads of pizza and beer and spend a few days furiously programming. Not so, says Angela Bee Chan, Channel Marketing Specialist at APC by Schneider Electric. She says hackathons offer the chance for people of all ages, skills, interests &#x2013; and most importantly, gender &#x2013; to learn incredible networking and problem-solving skills and become what she calls &#x2018;agents of change&#x2019;.</p><p>Hackathons are competitions that challenge a group of people to create something over a set time period &#x2013; sometimes as short as a day or 48 hours &#x2013; using technology.</p><p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/05cad2a1-7f57-4d44-9518-7f5025077112.png\">&#x200B;</p><p>Angela isn&#x2019;t your typical &#x2018;hacker&#x2019;. She earned her degree in public relations and is now forging a career in marketing, but caught the &#x2018;hackathon bug&#x2019; when a friend suggested she attend one to help her to develop an idea for a social business. She was blown away by the mentorship, education, opportunities and skills that the hackathon offered her.</p><p>&#x201C;For me it was like a second form of education. I was taught start-up principles: to fail fast and learn quickly; using design thinking to solve problems; and how to pitch to stakeholders such as investors,&#x201D; she said. &#x201C;Not only was I getting a scope of the start-up ecosystem but I met a range of people who were inspiring, willing to teach me, and wanting to hustle and get [shit] done.&#x201D;</p><p>Angela started to attend hackathons at least twice a month and says it has shaped her life experience and her career.</p><p>&#x201C;Back then I was working in a PR firm that involved administrative responsibilities during the week. I felt like a robot. But when it came to the weekend, I would participate in hackathons which allowed me to be creative- the sky was the limit,&#x201D; she says. &#x201C;I got to explore and experiment with ideas, business models and technologies which I would never be able to in my 9 to 5 job. To this day I apply hackathon methodologies in how I work. Every day I challenge myself on how I can do things better. That&#x2019;s what I do now with Schneider Electric.&#x201D;</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d31bd050-46f8-46be-bff3-9df4a26769b7.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/d31bd050-46f8-46be-bff3-9df4a26769b7.jpeg\"></p><p><strong>Hacking into organisational change</strong></p><p>As a Channel Marketing Specialist, Angela is responsible for extending Schneider Electric&#x2019;s market share by delivering effective marketing programs for Partners. Among other things, she&#x2019;s instigated APC Amplify, a rewards program for the company&#x2019;s Partners. Last year they offered an international trip to visit the HQ of luxury car manufacturer Ferrari in Maranello, Italy.</p><p>Leadership is a core element of Angela&#x2019;s work and personal life, and she attributes this confidence to her hackathon experience.</p><p>&#x201C;At hackathons, I tell people- you&#x2019;re not simply building solutions but you become a change agent,&#x201D; she said. &#x201C;You go back to your workforce, your workplace, your life and you think and act differently. We&#x2019;re creating a tribe of people who have an innovative, growth mindset. We want people to keep learning and to embrace change. One of the quickest ways to do this is participating at a couple of hackathons.&#x201D;</p><p>Angela has managed to successfully use her personal experience to kick some serious goals in her workplace.</p><p>At Schneider Electric she has orchestrated a hackathon for the company&#x2019;s annual Innovation Summit in May and said she deliberately drove the agenda.</p><p>&#x201C;Working for a big corporate organisation has its challenges. There is a lot of hierarchy, processes and approval stages. What I have learnt from hackathons is the ability to hustle. You have two days to create something out of nothing so by applying this mindset in the corporate environment is key,&#x201D;&#xA0;she said.</p><p>&#x201C;Once you get buy-in from the Executives, it&#x2019;s up to you to create the snowball effect. Talk to your peers, get their thoughts, make it compelling and make it contagious.&#x201D;</p><p>She not only instigated the event but also determined the theme of Smart Cities to help drive innovation within the company and position Schneider Electric as a leader in that space.</p><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c187f2b4-7c83-4445-89c1-c895f44f24ca.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/c187f2b4-7c83-4445-89c1-c895f44f24ca.jpeg\"></p><p><br><strong>Schneider Electric &#x2018;LifeIsOn&#x2019; Award</strong></p><p>&#x201C;You need to be passionate and assertive, and as a female in an IT company, it can be quite hard. Luckily enough, Schneider Electric recognises the need for females which is why we&#x2019;re part of the #HeforShe Campaign.&#xA0;We celebrate our diversity and I believe this is part of the wider message: to be inclusive of everyone,&#x201D;&#xA0;she said.&#xA0;</p><p>Her innovation and drive have been acknowledged with the Life On 2016 Award which recognises efforts made by changemakers within the organisation.</p><p>It was important for Angela to work for a company which valued innovation and had a culture which is not afraid to embrace change. &#x201C;When I was looking for my next role I knew exactly what I wanted from my next employer &#x2013; Firstly I wanted a place with purpose. Secondly, I wanted a company with an innovative culture with continual change because that&#x2019;s how businesses survive.&#x201D;</p><p>An award-winning career move</p><p>Hackathons have become a valuable component of Angela&#x2019;s resume with a string of awards and high-level competition results including:</p><ul><li>State winner of the Adappt 2013 competition, an app development program;</li><li>Third place in the 2014 Create-a-thon 2.5-day event for non-tech women to create a mobile app;</li><li>First place in the GovHack ABC Regional Data competition, an open government data hackathon;</li><li>Second place in the GovHack NSW Data Second Place in 2015;</li><li>Winner of the prestigious ARN Community Award Winner 2016 which recognises exemplary service to the ICT sector and helping to foster a positive working environment for women in IT.<br><br></li></ul><p style=\"text-align:center\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/49bc3f8f-0167-4ec8-bd65-b0dc07a3c1e6.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/49bc3f8f-0167-4ec8-bd65-b0dc07a3c1e6.jpeg\"></p><p><strong>Organising a Hackathon</strong></p><p>Hackathon events have become such a passion for Angela that she has created a side hustle of her own &#x2013; forming a national group called Hackathon Australia to gather hackathon organisers, participants, partners and government across Australia.</p><p>&#x201C;To me, hackathons are more than creating solutions. Networking, learning and working with different people in an intensive environment means you get to know each other pretty well,&#x201D; she said. &#x201C;If you don&#x2019;t get out there and be out of your comfort zone then you&#x2019;re missing out! &#xA0;Each individual has had different experiences. Whether you know it or not, this forms different opinions and expertise. These events bring people together. If you want to do things quickly you can do it yourself; however, if you want to go far, collaborate with others.&#x201D;</p><p>Hackathon Australia started as a Facebook group with her friends but the community became so active that Angela had to expand. She now consults, runs events and workshops in Sydney and hopes to help other corporate organisations with their innovation strategies.</p><p><br></p><p><strong>Helping other women in tech</strong></p><p>Angela says there is still a huge gender gap between women and men working in the tech space and in the hackathon community but she is doing her bit to help bridge it. She actively encourages women&#x2019;s involvement in hackathons and supports grassroots groups involved in education including Girl Geek Academy, which encourage women to learn technology; Node Girls Sydney, Girl Programming Network and Django Girls which teaches women to code.</p><p>&#x201C;For me, there is a massive gap for women in STEM and it will take time,&#x201D; she said. &#x201C;An advantage of the acceleration of technology is our ability to be revealed to more stories &#x2013; like the film Hidden Figures &#x2013; after watching this inspiring film of how coloured women were integral in the development of Nasa, it has truly inspired me to make my mark and leave a footprint on this world. I&#x2019;d like to challenge the audience to do so too.&#x201D;</p><p>Schneider Electric place innovation at the forefront of &#x2018;business as usual&#x2019;.</p><p><br></p><p>Angela&#xA0;is one of our contributors, read about them all <a data-cke-saved-href=\"/contributors\" href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a data-cke-saved-href=\"https://www.diversecitycareers.com/becomeacontributor\" href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p><p><br></p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/04","associated_company":"work180"}