{"url":"https://www.work180.com.au/blog/2017/07/why-we-need-to-change-more-than-just-the-workplace-to-encourage-women-in-leadership","title":"Why We Need To Change More Than Just The Workplace To Encourage Women In Leadership","author":"WORK180","body":"\n\t\t\t\t\t<p><strong>Matthew Salisbury is a&#xA0;Regional Director for&#xA0;<a href=\"http://www.wsp-pb.com/en/WSP-au-nz/\" target=\"_blank\">WSP</a>.&#xA0;</strong>He is also a member of&#xA0;<a href=\"http://www.eoc.sa.gov.au/node/865\" target=\"_blank\">Chiefs for Gender Equity</a>, a group of CEOs and C-Suite&#xA0;leaders convened by the South Australian Equal&#xA0;Opportunity Commission, who have committed to provide leadership in driving gender equity.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Matthew Shares&#xA0;His Views On What It Will Take To Achieve Gender Equity In Australia.</strong></p>\n\n<p>Four years ago, US businesswoman and author Sheryl Sandberg had discussion boards buzzing with her book&#xA0;<em>Lean In: Women, Work and the Will to Lead</em>. In it she told women to empower themselves, step up the challenge and embrace all opportunities for leadership in the workforce. But despite the enthusiasm of women around the world, establishment of &#x2018;lean-in&#x2019; groups and countless media articles about the book, Ms Sandberg recently told an interviewer on&#xA0;<em>USA Today</em>&#xA0;that the dial hasn&#x2019;t moved one bit. Less than 6 per cent of Fortune 500 companies have female CEOs. So, why would an Australian C-suite male executive be concerned about all this? Simple: better gender equity makes for a better bottom line, and a more equal society.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Change Needs To Come From The Top</strong></p>\n\n<p>In Australia, the number of female CEOs is also shockingly low, coming in at around 4 per cent of those heading up ASX 200 companies. And yet there&#x2019;s very compelling research that shows positive links between female leadership and better organisational performance.</p>\n\n<p>While traditionally STEM industries haven&#x2019;t had a strong track record in gender equity, things are changing. Senior leaders now understand the business imperatives, as well greater societal benefits, of putting a plan in place to level the playing field. My vision is to see more young women choosing engineering as a career, and female professionals in the industry empowered to step up to the most senior leadership roles. We&#x2019;re working on it, but I&#x2019;m prepared for the fact that it may be long road. ABS statistics show women make up only around 11.8 per cent of the total engineering workforce in Australia.</p>\n\n<p>Here at&#xA0;<a href=\"http://www.wsp.com/\" target=\"_blank\">WSP&#xA0;</a>we&#x2019;re trying to highlight how our female engineers at all levels make such a valuable contribution to the profession. We&#x2019;ve launched an internal program called EngineeredHERWay that both celebrates our female talent and encourages those women to stay with us for the journey all the way to the top, as well as encouraging women to join our business. We&#x2019;re also looking at how we can be more flexible to meet the needs of our workforce so women will stay and thrive. We&#x2019;re keen to be part of groups like the South Australian Chiefs for Gender Equity so we can access research and proven strategies for driving this change.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Unconscious Bias Holds Us Back</strong></p>\n\n<p>But it&#x2019;s more than just the important changes we make in the workplace. What&#x2019;s also important is changing attitudes in the community. Research shows women drop out of engineering careers at around the 10-year mark. Just when many could be at the cusp of stepping up to senior leadership roles.</p>\n\n<p>Part of the reason is that work isn&#x2019;t structured to enable flexibility to balance their responsibilities in the way they wish. But the other major issue is that society still sees women as holding the primary responsibility for caring and nurturing families.</p>\n\n<p>We need to change our thinking so that it is equally okay for a male to take part-time work, or paternity leave, or to take sick days to look after children who are ill without downgrading their careers, or sidelining them as &#x2018;slack workers&#x2019;. And why do we view men who choose to be &#x2018;stay at home&#x2019; dads with disdain, while for women it&#x2019;s accepted as quite normal?</p>\n\n<p>Unfortunately, in Australia, we have been conditioning our children to think and act in accordance with a gender stereotype. We need to learn from the Nordics. We might be looking to the 21st&#xA0;century, but our attitudes in many ways are still engrained in the 1950s without us even noticing. When that changes, so will the prospects for aspiring female leaders across all industries.</p>\n\n<p>This article was originally published by&#xA0;<a href=\"https://femeconomy.com/need-change-just-workplace-encourage-women-leadership/\" target=\"_blank\">Femeconomy</a>.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p><strong>About Femeconomy</strong></p>\n\n<p>Women make over 85% of purchase decisions. You&#x2019;re&#xA0;<a href=\"https://femeconomy.com/about/\" target=\"_blank\">Femeconomy</a>. We want to help you&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">shop brands</a>&#xA0;with&#xA0;<a href=\"https://femeconomy.com/category/female-leaders/\" target=\"_blank\">female leaders</a>&#xA0;to create gender equality. The&#xA0;power is in your purse.</p>\n\n<p>Femeconomy approved brands have at least&#xA0;30% of women on the Board of Directors&#xA0;or are&#xA0;50% female owned. So far over&#xA0;<a href=\"https://femeconomy.com/brand/?fwp_is_femeconomy=1\" target=\"_blank\">700 brands meet our criteria</a>.&#xA0;Look for our badge&#xA0;to shop&#xA0;Femeconomy approved brands.</p>\n\n<p>Female leaders will&#xA0;<a href=\"https://femeconomy.com/the-femeconomy-effect/\" target=\"_blank\">create gender equality.</a>&#xA0;#femeconomy #shop4equality</p>\n\n<p><a href=\"http://eepurl.com/ccpbuD\" target=\"_blank\"><img alt=\"\" src=\"https://diversecitycareers.com/media/diversecitycareers/Articles/Femeconomy%20Sign%20up%20to%20our%20enews%20buttonv4%20(002).jpg\" style=\"border-style:initial; border-width:0px; margin-bottom:10px; margin-top:10px; width:840px\"></a></p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h5>\n\n<p>DCC Jobs is a&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/job-search\"><span style=\"color:rgb(66, 139, 202)\">jobs board&#xA0;</span></a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a href=\"http://dcc.staging.volcanic.net.au/clients\"><span style=\"color:rgb(66, 139, 202)\">essential tool</span></a>&#xA0;in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/07","associated_companies":["work180"]}