{"url":"https://www.work180.com.au/blog/2017/10/why-its-important-for-women-to-be-at-the-table","title":"Why it's Important for Women to be at the Table  ","author":"WORK180","body":"\n\t\t\t\t\t<p>We each strive to bring the best to our job each day, but sometimes factors beyond our control can test our resolve. NAB General Manager of Performance and Operations for Broker Partnerships, Nicole Devine, shares how she persisted through challenging work environments, and believes that by embracing diversity Australian businesses are changing for the better:</p><p><b>Women at the table matter</b></p><p>Twenty years ago, I started my career as a graduate at a large consulting firm.&#xA0; When I arrived on the first day I was shocked and a bit taken-a-back to discover that I was the only female in the entire graduate intake. I had just finished studying law, where there was a 50/50 split of men and women, so it wasn&#x2019;t what I was expecting. Having moved from Queensland to Melbourne for the opportunity, I found myself in a place where I didn&#x2019;t know anyone, and I was about to spend the next eight very intense weeks (including three weeks overseas) with an all-male group.&#xA0; Don&#x2019;t get me wrong, they were lovely men, and very inclusive of me, but it was more difficult than I was expecting and, to be honest, a bit lonely and definitely a challenging start to my career. When we went overseas for training for three weeks, we had a stopover in LA during which time the group decided that we would save money on accommodation by sharing rooms (after all we were a bunch of university grads, heavily in debt, with no money to our names). This left me with a really awkward decision; go along with the group, which meant sharing a twin room with a man I had just met or be a kill joy? I did share the room, but it was a choice I wish I didn&#x2019;t have to make.</p><p>However this experience, and the resilience that it built, stood me in good stead. As my career progressed, I still often found myself the only female at the table. It has only been in the last few years that I have enjoyed seeing this change. There are four women in the leadership team I sit on and there is no doubt that this creates a different dynamic and that our voices are amplified through sheer number.</p><blockquote><p><em>To other women I say keep ferociously supporting your female colleagues and bring other women with you. Every action no matter how big or small makes a difference.</em></p></blockquote><p><b>Diversity is a leadership issue</b></p><p>What I have learned through experience is that it is important to lead with authenticity. To lead in a way that is true to you. Embrace feminine leadership traits as well as male.&#xA0; It is not an &#x2018;us versus them&#x2019; discussion. The beauty is in the diversity and the different thinking, solutions and culture that that it brings.</p><p>Events like the Women in Finance Awards are so important for celebrating the growing diversity in our industry and for keeping it front of mind. Each of us is a role model.&#xA0;</p><blockquote><p><em>My ask is that we each step into that role and own it and continue to work as hard as ever to increase diversity in our industry. This includes men. You generally hold the majority of the senior positions in corporate Australia and therefore the role that you play is pivotal and cannot be underestimated.</em></p></blockquote><p><b>Inclusion is good for business</b></p><p>The other thing that I have learned is that diversity in and of itself is not enough. Once we have diversity we must work to include that diversity or we reap none of the benefits. I say that we must &#x2018;work&#x2019; to include diversity &#x2013; as it can be hard and it can be challenging.&#xA0; Our biases (conscious and unconscious) and our own approach and thinking will be challenged and we need to be open to that.&#xA0; By doing so, we are opening ourselves to an increased chance for outperformance and innovation.</p><p>Research shows that companies that create an inclusive environment experience:</p><ul><li>an 81% increase in productivity,</li><li>an 84% increase in motivation,</li><li>an 86% increase in innovation and creativity,</li><li>81% greater engagement and loyalty, and</li><li>out-perform their peers by 80%.</li></ul><p>Diversity is not just about gender. It is also about age, cultural and racial backgrounds, sexual orientation, physical differences, religious views and ways of thinking. Harnessing these differences is very powerful. It means that you build a workforce or a business that better reflects the society in which we live, and one which enhances the way you service your customers.</p><p><b>Financial services has room to grow</b></p><p>Tapping into our diverse customer base is also essential for business. Women make the majority of household purchasing decisions in Australia &#x2013; from small household purchases, to cars to financial products. In a Harvard Business Review report on The Female Economy, women make the decision in the purchase of the home 91% of the time. I am one of those women.&#xA0; When my husband and I bought our house 12 years ago, I arranged the mortgage.&#xA0; When we&#xA0;<span style=\"font-size: 1.6rem;\">renovated six years ago, I arranged the finance and managed the project.</span></p><p><em style=\"font-size: 16px;\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/64ba26dc-c31f-411e-ae0e-82092e7ff703.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/64ba26dc-c31f-411e-ae0e-82092e7ff703.jpeg\" style=\"float: right; margin: 10px; width: 160px; height: 200px;\"></em></p><div><p>Research also shows is that women buy differently to men and that the financial services industry is, as a whole, least sympathetic to this. Women cite: lack of respect, poor advice, a one-size fits all approach, and onerous red tape as the key reasons. Let&#x2019;s turn this around. What a great opportunity our industry has to provide an alternate experience.</p><p><br></p><p><em>Nicole Devine (pictured right) was a finalist for Thought Leader of the Year, and one of six finalists from the NAB Group, in the Women in Finance Awards held on Thursday 21 September 2017.</em></p><p>This blog post was originally published by NAB&#xA0;<a data-cke-saved-href=\"http://news.nab.com.au/news_room_posts/why-its-important-for-women-to-be-at-the-table/\" href=\"http://news.nab.com.au/news_room_posts/why-its-important-for-women-to-be-at-the-table/\" target=\"_blank\">here</a>.&#x200B;<br></p><p><br></p><hr><h4><strong>About NAB<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1f953365-c0d1-4b0c-9eef-75324f178686.jpeg\" style=\"float: right; margin: 10px; width: 103px; height: 150px;\" data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/1f953365-c0d1-4b0c-9eef-75324f178686.jpeg\"></strong></h4><p><span id=\"ember12378\">One of the ways </span><a target=\"_self\" data-cke-saved-href=\"https://www.linkedin.com/company/2357/\" href=\"https://www.linkedin.com/company/2357/\" id=\"ember12382\"><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:2357\"></span></a><a data-cke-saved-href=\"https://www.work180.com.au/clients/NAB\" href=\"https://www.work180.com.au/clients/NAB\"><span data-entity-hovercard-id=\"urn:li:fs_miniCompany:2357\">National Australia Bank</span></a><span id=\"ember12386\"><a data-cke-saved-href=\"https://www.work180.com.au/clients/NAB\" href=\"https://www.work180.com.au/clients/NAB\"> </a>are working on achieving gender equality is by making flexibility a reality for all employees. At NAB, more than 85% of people work flexibly, including 84% of women &amp; 88% of men. Learn more about NAB&#x2019;s supportive culture on their Best Employer page <a data-cke-saved-href=\"https://www.work180.com.au/clients/NAB\" href=\"https://www.work180.com.au/clients/NAB\">here.</a></span><br></p><p><span>Browse jobs with NAB <a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=nab\" href=\"https://www.work180.com.au/job-search?client=nab\">here.</a></span><br></p><p><span></span><br></p><hr><p><span><a data-cke-saved-href=\"https://www.work180.com.au/job-search?client=nab\" href=\"https://www.work180.com.au/job-search?client=nab\"></a></span></p><h3><strong>About WORK180</strong></h3><p>WORK180 (previously DCC Jobs) is a jobs board with a difference. We pre-screen employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/clients\" href=\"https://www.work180.com.au/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/dashboard/candidate\" href=\"https://www.work180.com.au/dashboard/candidate\">one click</a>&#xA0;now.&#xA0;</p><p><br></p></div>\n\t\t\t\t","tags":["gender equality"],"upload_date":"2017/10","associated_company":"work180"}