{"url":"https://www.work180.com.au/blog/2018/06/without-supportive-employers-i-could-never-have-cared-for-my-disabled-son","title":"Without supportive employers I could never have cared for my disabled son ","author":"WORK180","body":"\n\t\t\t\t\t<p>When I first attended an event for carers a few years ago, I was filled with feelings of gratitude. Even though I was a carer for a child with a disability, I felt lucky as I was surrounded by people whose caring responsibilities were far greater than mine.&#xA0;</p>\n\n<p>My son was diagnosed with cerebral palsy (CP) at 12 months and developed epilepsy when he was a teenager.&#xA0;</p>\n\n<p>The day the neurologist rang me at work to tell me about my son&apos;s diagnosis was the worst day of my life- I still recall my heart dropping and the feeling of not being present- this must be a bad dream. Back then,&#xA0;Dr&#xA0;Google was not as mainstream and I had no idea of what CP was so I listened intently to what the doctor had to say.&#xA0;</p>\n\n<blockquote>\n<p><em>I was told to prepare for the worst- my son was never expected to walk, talk or be independent. At the time, I was house hunting and was advised to get a wheelchair friendly house.&#xA0;</em></p>\n</blockquote>\n\n<p>I was just at the beginning of my career and my performance at work dipped dramatically, as I tried to deal with my new situation.&#xA0;<strong>These were the days of no paid parental leave, flexible working and a strict culture of being chained to the desk, 9-5pm.</strong>&#xA0;I struggled to take enough time off to attend the never-ending specialist appointments as my son developed other numerous issues.</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/192b6e75-ad8f-4842-b602-6e20e44bb180.jpeg\" style=\"font-size: 16px; float: right; margin: 10px;\"></p>\n\n<p>So, it was a blessing in disguise when the company restructured and my role was made redundant. I made it my mission to seek out all the help I could get for my son from the Royal Children&#x2019;s Hospital to occupational therapists, special equipment providers, special schools and programs to do at home.&#xA0;</p>\n\n<blockquote>\n<p><em>All the hard work paid off, and at four years old, my son took his first, unassisted step. That was by far the best day of my life.</em></p>\n</blockquote>\n\n<p>While the visits to the specialists did not cease, we celebrated every milestone, no matter how big or small. Any parent whose child had to go through the pain of wearing Ankle-Foot Orthoses (AFOs) would know the joy experienced when we were told that aged 12, it was time to stop wearing them. Amidst all the therapy sessions both at home and through external providers, I also tried to maintain some sort of &#x2018;normal&#x2019; lifestyle for my son. We did martial arts classes together, he joined a basketball team, tried his hand at archery and cricket. It sounds like a full-time job and it seemed like one too, however, after he&#x2019;d started school and I became a single parent, I was back working full time on top of my caring commitments.&#xA0;</p>\n\n<blockquote>\n<p><em>There is absolutely no way I would have been able to continue to look after my son if it wasn&#x2019;t for the support of my employers.</em></p>\n</blockquote>\n\n<p>With one company, I could come to the office after school drop off, and leave to pick him up at&#xA0;3pm&#xA0;as there&#xA0;was&#xA0;no after-school care facilities for children with special needs. I would then continue working in the evening, and&#xA0;because&#xA0;my role involved collaborating with our London office, it worked very well for everyone.</p>\n\n<p>Another employer allowed me to work from home as much as I needed to. My role was suited to working autonomously and my boss valued the productivity I demonstrated. A third employer was based in another state, and over the two years I was with the company, I&#x2019;d met the team in person only a handful of times. Again, the company was focused on results and it did not matter where or when I completed my work.&#xA0;</p>\n\n<p>The examples I am sharing go back over 10 years ago when flexible working was nowhere near as common as it is now. I couldn&#x2019;t be more grateful to these companies who enabled me to thrive while caring for my son. I simply do not know where I&#x2019;d be if it hadn&#x2019;t been for their trust and support.&#xA0;&#xA0;</p>\n\n<p>This is why I feel so rewarded working at WORK180, a jobs platform I co-founded with Gemma Lloyd in 2015, first in Australia, and most recently <a href=\"https://www.work180.co/\">in the UK</a>. At WORK180, we pre-screen companies before they advertise jobs on areas such as flexible working, pay equity, paid parental leave, professional development opportunities, targets for women in leadership and much more.</p>\n\n<p>Despite flexible working becoming more common, only 48% of companies with over 100 staff have a flexible working policy in place. The number of companies with paid parental leave for both primary and secondary carers isn&#x2019;t impressive either (Australian statistics).</p>\n\n<blockquote>\n<p><em>WORK180 was created to help women like me, and for other carers to easily identify employers who will value their work and support their careers.</em></p>\n</blockquote>\n\n<p>Otherwise, we are missing out on a huge talent pool and during <a href=\"http://www.carersweek.org/\">Carers Week</a>&#xA0;this week, I&#x2019;d like to thank all <a href=\"https://www.work180.com.au/clients/\">WORK180&apos;s&#xA0;Endorsed Employers</a>&#xA0;from the bottom of my heart for giving carers a chance to continue their careers. Over the past few years, it&#x2019;s been a pleasure to meet and get to know many women who work with our Endorsed Employers and are supported as carers, whether they are caring for children, spouses, elderly relatives or others.</p>\n\n<p>And of course, a huge thank you to UK&apos;s millions of carers- what you do for your loved ones is one of the hardest and underappreciated jobs in the world!<br>\n&#xA0;</p>\n\n<hr>\n<p><b>About <a href=\"https://www.carersweek.org/\">Carers Week 2018&#xA0;</a></b></p>\n\n<p>Carers Week is an annual campaign to raise awareness of caring, highlight the challenges carers face and recognise the contribution they make to families and communities throughout the UK.</p>\n\n<p>The campaign is brought to life by thousands of individuals and organisations who come together to organise activities and events throughout the UK, drawing attention to just how important caring is.</p>\n\n<p>This Carers Week, we&#x2019;re coming together to build communities that support the health and wellbeing of carers. Around 6.5 million people in the UK are carers, looking after a parent, partner, child or friend. A carer is someone who provides unpaid care and support to a family member or friend who has a disability, illness, mental health problem or who needs extra help as they grow older. Caring can be a hugely rewarding experience but sometimes carers find it challenging to take care of their own well-being whilst caring. The impact of caring on health and well-being should not be underestimated this Carers week we will be looking to share examples of good practice from supporters of which have helped carers to stay&#xA0;Healthy and Connected.</p>\n\n<p><b>Get involved</b></p>\n\n<p>Find out how you can&#xA0;<a href=\"https://www.carersweek.org/get-involved\">get involved</a>&#xA0;in Carers Week to help carers&#xA0;stay Healthy and Connected.</p>\n\n<p><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/38c6455e-0139-4d57-b4bd-2df844d84189.jpeg\" style=\"margin: 10px;\"></p>\n\n<hr>\n<h4><strong>About WORK180</strong></h4>\n\n<p>WORK180 is an international jobs network that connects employers with the very best female talent. We engage with everyone from small independent companies to large multinationals, growing and future-proofing businesses through smart policy and process improvements.&#xA0;</p>\n\n<p>But we don&apos;t stop there. We drive engagement between organisations and the people who share their values by combining traditional job advertisement techniques with proactive employer branding initiatives.</p>\n\n<p>Then we talk about it. Developing gender diverse workplaces is both fair and good for business, so we make sure everyone knows when a business is actively improving the way it supports women in the workplace.</p>\n\n<p>Our mission (hopefully yours too)</p>\n\n<p>To finally put an end to workplace discrimination, so that women are valued equally and businesses can enjoy the benefits of a gender diverse workforce.</p>\n\n<p><a href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\n<p><a href=\"http://www.work180.co\">Visit the UK WORK180 website</a></p>\n\n\t\t\t\t","tags":["WORK180 News"],"upload_date":"2018/06","associated_companies":["work180"]}