{"url":"https://www.work180.com.au/blog/2017/10/celebrating-national-carers-week","title":"Without supportive employers I could never have cared for my disabled son","author":"WORK180","body":"\n\t\t\t\t\t<p>When I first attended an event for carers a few years ago, I was filled with feelings of gratitude. Even though I was a carer for a child with a disability, I felt lucky as I was surrounded by people whose caring responsibilities were far greater than mine.&#xA0;</p><p><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b71a3b66-5323-47e0-bfea-222340ca760b.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/b71a3b66-5323-47e0-bfea-222340ca760b.jpeg\" style=\"font-size: 16px; float: right; margin: 10px;\"></p><p>My son was diagnosed with cerebral palsy (CP) at 12 months and developed epilepsy when he was a teenager.&#xA0;</p><p>The day the neurologist rang me at work to tell me about my son&apos;s diagnosis was the worst day of my life- I still recall my heart dropping and the feeling of not being present- this must be a bad dream. Back then, Dr Google was not as mainstream and I had no idea of what CP was so I listened intently to what the doctor had to say.&#xA0;</p><blockquote><p>I was told to prepare for the worst- my son was never expected to walk, talk or be independent. At the time, I was house hunting and was advised to get a wheelchair friendly house.&#xA0;</p></blockquote><p>I was just at the beginning of my career and my performance at work dipped dramatically, as I tried to deal with my new situation. <strong>These were the days of no paid parental leave, flexible working and a strict culture of being chained to the desk, 9-5pm.</strong> I struggled to take enough time off to attend the never-ending specialist appointments as my son developed other numerous issues.</p><p>So, it was a blessing in disguise when the company restructured and my role was made redundant. I made it my mission to seek out all the help I could get for my son from the Royal Children&#x2019;s Hospital to occupational therapists, special equipment providers, special schools and programs to do at home.&#xA0;</p><blockquote><p>All the hard work paid off, and at four years old, my son took his first, unassisted step. That was by far the best day of my life.</p></blockquote><p>While the visits to the specialists did not cease, we celebrated every milestone, no matter how big or small. Any parent whose child had to go through the pain of wearing Ankle-Foot Orthoses (AFOs) would know the joy experienced when we were told that aged 12, it was time to stop wearing them. Amidst all the therapy sessions both at home and through external providers, I also tried to maintain some sort of &#x2018;normal&#x2019; lifestyle for my son. We did martial arts classes together, he joined a basketball team, tried his hand at archery and cricket. It sounds like a full-time job and it seemed like one too, however, after he&#x2019;d started school and I became a single parent, I was back working full time on top of my caring commitments.&#xA0;</p><blockquote><p>There is absolutely no way I would have been able to continue to look after my son if it wasn&#x2019;t for the support of my employers.</p></blockquote><p>With one company, I could come to the office after school drop off, and leave to pick him up at 3pm as there was no after-school care facilities for children with special needs. I would then continue working in the evening, and because my role involved collaborating with our London office, it worked very well for everyone.</p><p>Another employer allowed me to work from home as much as I needed to. My role was suited to working autonomously and my boss valued the productivity I demonstrated. A third employer was based in another state, and over the two years I was with the company, I&#x2019;d met the team in person only a handful of times. Again, the company was focused on results and it did not matter where or when I completed my work.&#xA0;</p><p>The examples I am sharing go back over 10 years ago when flexible working was nowhere near as common as it is now. I couldn&#x2019;t be more grateful to these companies who enabled me to thrive while caring for my son. I simply do not know where I&#x2019;d be if it hadn&#x2019;t been for their trust and support.&#xA0;</p><p>This is why I feel so rewarded working at&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/\" href=\"https://www.dccjobs.com/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">DCC Jobs</a>, a jobs platform I co-founded with Gemma Lloyd almost three years ago. At DCC, we pre-screen companies before they advertise jobs on areas such as flexible working, pay equity, paid parental leave, professional development opportunities, targets for women in leadership and much more.</p><p>Despite flexible working becoming more common, only 48% of companies with over 100 staff have a flexible working policy in place. The number of companies with paid parental leave for both primary and secondary carers isn&#x2019;t impressive either.</p><blockquote><p>DCC was created to help women like me, and for other carers to easily identify employers who will value their work and support their careers.</p></blockquote><p>Otherwise, we are missing out on a huge talent pool and during<a data-cke-saved-href=\"http://www.carersweek.com.au/\" href=\"http://www.carersweek.com.au/\" target=\"_blank\"> National Carers Week </a>this week, I&#x2019;d like to thank all DCC&apos;s&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/clients\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">Endorsed Employers</a>&#xA0;from the bottom of my heart for giving carers a chance to continue their careers. Over the past few years, it&#x2019;s been a pleasure to meet and get to know many women who work with our Endorsed Employers and are supported as carers, whether they are caring for children, spouses, elderly relatives or others.</p><p>And of course, a huge thank you to Australia&#x2019;s millions of carers- what you do for your loved ones is one of the hardest and underappreciated jobs in the world!<br><br></p><p><b>About <a data-cke-saved-href=\"http://www.carersweek.com.au/\" href=\"http://www.carersweek.com.au/\" target=\"_blank\">National Carers Week</a> (October 15-21)</b></p><p>National Carers Week is about recognising and celebrating the outstanding contribution Australia&#x2019;s 2.7 million unpaid carers make to our nation. Carers are those who help severely ill, disabled or those of old and frail age. Often these are family members or part of extended family.</p><p>At any time in our life might we become a carer or find ourselves in a situation where we&#x2019;ll need a full time carer. Unpaid carers take on an important role in society and it is estimated that if all carers would decide to stop performing their caring role,&#xA0;<a data-cke-saved-href=\"http://www.carersweek.com.au/about/\" href=\"http://www.carersweek.com.au/about/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">it would cost the country $60.3 billion per year to replace those supports</a>&#xA0;&#x2013; that&#x2019;s over $1 billion per week.</p><p><b>Get involved</b></p><p>Say Thank You to Australia&#x2019;s 2.7 million unpaid carers. Send your thank you and show your support&#xA0;<a data-cke-saved-href=\"http://www.carersweek.com.au/make-a-pledge/\" href=\"http://www.carersweek.com.au/make-a-pledge/\" rel=\"nofollow noopener\" saprocessedanchor=\"true\" target=\"_blank\">here</a>.</p><p><a data-cke-saved-href=\"http://www.carersweek.com.au/\" href=\"http://www.carersweek.com.au/\" target=\"_blank\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/35f81856-45c3-4862-bcf4-851882139d2c.jpeg\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/35f81856-45c3-4862-bcf4-851882139d2c.jpeg\" style=\"margin: 10px;\"></a></p><p><br></p><h4 style=\"font-family: Lato, sans-serif;\"><strong>About DCC Jobs</strong></h4><p>DCC Jobs is a&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/job-search\" href=\"https://www.dccjobs.com/job-search\">jobs board&#xA0;</a>with a difference! We pre-screen&#xA0;employers&#xA0;on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\" href=\"https://www.dccjobs.com/blog/2017/10/www.dccjobs.com/clients\">essential tool</a>&#xA0;in your job search when assessing employers.&#xA0;Set up your job alert with&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/users/login\" href=\"https://www.dccjobs.com/users/login\">1 click</a>&#xA0;now.&#xA0;</p><p><br></p>\n\t\t\t\t","tags":["DCC News","gender equality"],"upload_date":"2017/10","associated_company":"work180"}