{"url":"https://www.work180.com.au/blog/2017/03/women-should-go-where-they-are-celebrated-not-tolerated","title":"Women Should Go Where They Are Celebrated, Not Tolerated","author":"WORK180","body":"\n\t\t\t\t\t<p>Last week I had the pleasure of joining the ACS Victoria team at their event, &#x201C;Diversity- How Far Have We Come?&#x201D; The message resonating with me the most was from panelist Rohini Kappadath, Senior Adviser - India Business Practice, KPMG and Chair at the Multicultural Ministerial Business Advisory Council. One of the guests asked the panel for advice on how to deal with unconcious bias in the workplace. While there is no easy way to answer this, Rohini pointed out that women shouldn&#x2019;t settle for second best when it comes to happiness in the workplace.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/0499086a-d759-45a4-88d4-be7b841b93dc.png\"></p>\n\n<p>Of course, I tweeted about it. Partly because I loved it, but also to be in the running for the best tweet comp. Alas, Fi Slaven &#xA0;(GM at William Buck and Vic ICT 4 Women Board member ) totally dominated the day, winning both the twitter comp AND the raffle prize!!&#xA0;</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/3b99b413-5986-4686-930d-55fc0994f773.png\"></p>\n\n<p>Afterwards, Clare Payne made a very good point in response to my tweet:</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/77a7e47e-4177-4359-a1a3-34c07888ca57.png\"></p>\n\n<p>I completely agree with Claire. As women, we should most definitely be able to go wherever we want. However, the sad fact remains; Australia is continuing to slip in the Global Gender Gap Index, down by 10 places since 2015, currently ranked 46th. To Fi&#x2019;s point, we must all take action if we want to accelerate gender equality.</p>\n\n<p>&#xA0;</p>\n\n<p>Through Diverse City Careers (DCC), a social enterprise I co-founded with Gemma Lloyd, I&#x2019;m lucky to have the privilege of working with organisations and individuals who are doing just that.</p>\n\n<p>In February, DCC turned two and to say things got a little sentimental would be an understatement. Gemma and I have worked very hard on building DCC and sometimes I still need to pinch myself, because the vision we had two years ago, has completely come to life. The vision was, and continues to be:</p>\n\n<ul>\n\t<li>Make great work environments for women visible.</li>\n\t<li>Influence Australia and the rest of the world to enable every woman who wants an opportunity access to it.</li>\n\t<li>Educate organisations on how to build great work environments for women.</li>\n</ul>\n\n<p>For those who are unfamiliar with DCC, we pride ourselves on being Australia&apos;s only jobs board, which selects companies based on their internal policies and initiatives around supporting women. Over the last two years, we&apos;ve consulted with industry experts, surveyed thousands of women, and reviewed hundreds of companies&apos; policies. This data and feedback forms the basis of the DCC criteria process, which comprises of 20 carefully selected questions. Each question is weighted to reflect the research findings.</p>\n\n<p>Approximately 10% of organisations which apply to advertise jobs with DCC don&#x2019;t pass the criteria. Almost 80% of the rejected organisations subsequently improve their internal policies to match the benchmark set by our clients.</p>\n\n<p>It was actually during a conversation with Fi, back in early 2016, that the idea of using data to influence positive change came up. We took the advice on board, and have recently released the findings from our community survey on the top priorities for women in the workplace. In addition, we have published the statistics around what policies and initiatives are on offer by Australia&#x2019;s leading employers for women. You can read the full results here.</p>\n\n<p>Below are my personal highlights of the results:</p>\n\n<h4><strong>Paid Parental Leave</strong></h4>\n\n<p>Only 48% of Australian organisations (with over 100 employees) offer paid parental leave for primary careers. At DCC, the minimum requirement for paid parental leave for primary careers is 6 weeks and 68% of our Endorsed Employers offer between 12-15 weeks&#x2019; paid parental leave for primary carers. 77% of the Endorsed Employers provide between 1.5-2 weeks&#x2019; paid parental leave for secondary carers. This is in addition to the government entitlements.</p>\n\n<p style=\"text-align:center\"><img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/96a8483a-c997-4c60-9913-f9e0f41febfe.png\"></p>\n\n<h4><strong>Pay Equity</strong></h4>\n\n<p>In Australia, there is currently a 17.7% pay gap between men and women, a 44.6% superannuation gap. Globally, things aren&#x2019;t much better, with the World Economic Forum predicting the gender gap won&apos;t close entirely until 2186.</p>\n\n<p>DCC partner with the Workplace Gender Equality Agency who administer the Pay Equity Ambassador Program, where organisations need to do the following before their CEO can become an ambassador:</p>\n\n<ul>\n\t<li>Undertake a pay gap analysis of its workforce in the last two years,&#xA0;</li>\n\t<li>Take action on the results, and</li>\n\t<li>Communicate their pay equity initiatives to their employees.</li>\n</ul>\n\n<p>There are currently only 106 Ambassadors signed up. We&#x2019;re proud to contribute to the growing list through our advocacy work, with 45% of DCC Endorsed Employers signed up as official Pay Equity Ambassadors.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Flexible Working Arrangements</strong></h4>\n\n<p>Yet again, less than 50% of the non-public sector offer flexible work. Flexible work is not exclusively for mothers and can be used by those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. All of the DCC Endorsed Employers consider flexibility for each role advertised on DCC, therefore women can feel comfortable to raise this at interview stage. In fact, we encourage candidates to ask how the organisation supports flexibility at interview stage, as flexibility can mean different things to different people. Asking about flexibility isn&#x2019;t the only taboo question during an interview. To help with answering some of these, such as how much paid parental leave is offered and do breastfeeding facilities exist, we&#x2019;ve introduced transparency around employers&#x2019; policies and initiatives.</p>\n\n<p>This information is not publicly listed elsewhere and forms a valuable tool for assessing employers.</p>\n\n<p>To sum up, while there is still a long way to go, there are plenty of remarkable organisations who are genuinely working towards fast tracking gender equality. They are achieving outstanding results in every area of the business; to their bottom line, productivity and staff morale.</p>\n\n<p>The truth couldn&#x2019;t be more obvious- unless an organisation strives to create an inclusive environment, both women and men will leave in droves, to join organisations that walk the talk.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Celebrating Women"],"upload_date":"2017/03","associated_company":"work180"}