{"url":"https://www.work180.com.au/blog/2016/11/women-speak-powerfully","title":"Women, Speak Powerfully","author":"WORK180","body":"\n\t\t\t\t\t<p>Women, Stop Talking Yourself Down.&#xA0;</p>\n\n<p>We are women, hear us roar.</p>\n\n<p>Some days.</p>\n\n<p>Other days, well, you might hear us apologizing, second-guessing ourselves, prefacing what we want to say so as not to cause offense, and going out of our way not to step on toes, ruffle feathers or rock anyone&#x2019;s boat.</p>\n\n<p>Okay, that was harsh, I know. Not all women tip-toe around others confrontation, lack assertiveness or talk themselves down. Yet too often, many women do. Smart women. Accomplished women. Fabulous women. &#xA0;Women like me and, perhaps, women like you too.</p>\n\n<p>Having worked with many clever, talented and big hearted women, I know how much women have to contribute the world. In business, we make excellent leaders &#x2013; we&#x2019;re good listeners, great bridge-builders and thoughtful decision makers.&#xA0;<a href=\"https://hbr.org/2011/06/defend-your-research-what-makes-a-team-smarter-more-women\" target=\"_blank\">&#xA0;The Harvard Business Review</a>&#xA0;study that found the collective IQ of a team went up when women part of it came as little surprise. As research by McKinsey found, when more women are involved in decision making, better decisions are made.&#xA0;</p>\n\n<p>Likewise, out of the work place, women are great community makers, highly attuned to people&#x2019;s unspoken concerns and deeply compassionate. &#xA0;What&#x2019;s not to love?!</p>\n\n<p>Yet all too often we do ourselves a profound disservice by talking down our value and second guessing our worth. We doubt our opinions, we doubt our competence, we doubt our decisions. In the process, we undermine our ability to influence change to the extent we want and others need. Everyone is worse off.</p>\n\n<p>In&#xA0;The Language of Female Leadership, Dr. Judith Baxter shared the findings of her study of the language used by senior executives. Focusing on the differences between how women and men use language, she identified a specific type of &#x2018;out-of-power&#x2019; language that women were more prone to use. This included what she called &#x2018;double-voice discourse,&#x2019; a language pattern used more often by women than men.</p>\n\n<p>Double-voice discourse occurs when the speaker pre-judges the audience&#x2019;s response (to be a negative one) and qualifies their initial statement accordingly. For instance, &#x2018;Correct me if I&#x2019;m wrong&#x2026;&#x2019; or &#x2018;I know I&#x2019;m not the ultimate expert on this&#x2026;&#x2019; &#xA0; Dr. Baxter found that women were four times more likely to use double-voice discourse than their male counterparts. Certainly from my own observations, I&#x2019;ve noticed that women are far more likely to apologize if their opinion happens to contradict or conflict with someone else&#x2019;s and are more likely to underestimate themselves versus the men in the room.</p>\n\n<p>The gender &#x2018;confidence gap&#x2019; also leads women to being more easily intimidated than men. While researching&#xA0;<a href=\"http://stopplayingsafe.com/\" target=\"_blank\">Stop Playing Safe</a>, I interviewed a dozens of women in senior leadership roles including Debbie Kissire, one of the most senior females at Ernst and Young. Debbie advised women not to &#x201C;allow themselves to be intimidated.&#x201D; She shared anecdotes of women holding back from speaking up in the presence of senior executives for fear of appearing foolish.</p>\n\n<p>For more women to hold power, we must first own our power and refuse to give anyone the power to intimidate us. Hand in hand with this we must own our right to hold an opinion and not apologize for it to minimize the chances of ruffling feathers. &#xA0;Our language holds power and the words we speak either build our personal brand or diminish it. Talking ourselves down, or apologizing for what we have to say before we share it only dilutes our presence and undermines our leadership influence.</p>\n\n<p>While unconscious bias, sexism and the many other hurdles women must face still exist for women, our biggest barrier to power is still our belief in our right to hold it. Creating greater gender equality is a complex issue but it begins by embracing the difference our difference makes, owning our worth and expressing our opinions with the conviction needed to ensure they&#x2019;re heard.&#xA0;</p>\n\n<p>If those of us women in the developed world who have the power to affect change don&#x2019;t step up to the leadership plate and wield it fully, how can we ever create the change needed for the millions of women whose lives are marked by oppression.</p>\n\n<p>All leadership begins with self leadership. &#xA0;And so creating change in the world around us begins by creating change in ourselves. There&#x2019;s no better place to start than with the what you say to yourself and to others on a daily basis. Speak as a woman to be listened to and reckoned with. &#xA0;Speak from a place that you are &#x2018;enough&#x2019; already and need permission from no one to sit at the table.&#xA0;</p>\n\n<p>As more women start owning their power, our communities, organizations and societies will benefit in ways that will serve everyone&#x2026; including the men &#x2013; the brothers, fathers and sons&#x2013; we share our lives with.</p>\n\n<p>If this article offends anyone, so be it. Enough with the apologies!</p>\n\n<p>&#xA0;</p>\n\n<p>Margie&#xA0;is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/11","associated_company":"work180"}