{"url":"https://www.work180.com.au/blog/2016/04/women-get-to-earn-less-and-pay-more-introducing-the-sales-gender-gap","title":"Women get to earn less and pay more: Introducing the 'Sales Gender Gap'","author":"WORK180","body":"\n\t\t\t\t\t<p>&#x200B;Most of us are aware of the <a href=\"https://www.wgea.gov.au/sites/default/files/Gender_Pay_Gap_Factsheet.pdf\">17.3% gender pay gap</a> but did you know that male to female disparity is also prevalent in areas we never would have thought of? This week, I uncovered a gap that was new to me, and that&#x2019;s the &#x201C;sales gender gap&#x201D;.&#xA0;&#xA0;&#xA0;&#xA0;</p>\n\n<p>To start at the beginning; on the last day of the Melbourne Comedy Festival, I was walking down Collins St and although the shops were shut, a gorgeous, pale pink coat in a window caught my eye. I was even more excited to see a 20% off sign and made a mental note to elevate the task of getting the coat to the top of my do-to list.</p>\n\n<p>During the week, I actually forgot about it and when I remembered, I rushed to look up the coat online, hoping the sale was still on. This is what came up:</p>\n\n<p style=\"text-align:center\">&#xA0;<img alt=\"\" src=\"http://diversecitycareers.com/media/diversecitycareers/images/sabs.jpg\" style=\"height:786px; width:443px\"></p>\n\n<p>&#xA0;</p>\n\n<p>My concern about missing out on the sale quickly turned into something else, I actually couldn&#x2019;t believe the screen and looked at the separate women&#x2019;s and men&#x2019;s items to confirm but it was true. SABA had 20% off women&#x2019;s clothing and accessories and at the same time, 30% off men&#x2019;s. Whoa, this couldn&#x2019;t be right! The next day I mentioned it to a friend who is a serious online shopper and she said &#x201C;What, you haven&#x2019;t seen that before? I see it at different stores online all the time!&#x201D; I was very surprised and decided to call SABA and discuss this #salesinequality.</p>\n\n<p>When Stuart, the Marketing Manager at SABA returned my call he explained that the company runs the two departments separately, with their own promotions but after receiving my message, the team agreed that it was completely wrong. Stuart explained the strong focus on supporting women at SABA and that the team acknowledged this was not acceptable. Stuart told me that such disparities in sales would not happen again, and men&#x2019;s clothing and accessories will be marked down individually for slower moving lines, which seems fair to me.</p>\n\n<p>I guess the moral behind this story is that we see things like this happening every day, but dismiss a lot. I almost dismissed this one at first, because I started going down my own, conscious bias path. One of my thoughts were- &#x201C;Maybe the sale does make sense, because men hate shopping.&#x201D; But I had to check my thoughts, because not all men hate shopping, some love it and in fact, lots of women hate shopping. In addition, many women would shop for their partners, so that argument is no good.</p>\n\n<p>That led me to consider the clients we have at DCC from industries that are underrepresented by women. Lots of people assume that women don&#x2019;t want to work in those industries, or can&#x2019;t. This is due to some industries only innovating their practices in the last decade or two. Some examples that come to mind is a Paramedic who shared a story with me how 30 years ago, when she was going for a job, there was <a href=\"http://www.ambulance.nsw.gov.au/Media/docs/131103LeeClout-8ce548fe-316c-415b-8c7e-41aa50821683-0.pdf\">no point for females to apply</a>, and not many did, because they could not fulfil the physical component of the job. Then equipment to assist with the heavy lifting was put in place to enable anyone to join, eliminating that barrier. The utilities and mining sector is another great example, where a number of companies are modifying equipment to open up opportunities for females.</p>\n\n<p>It&#x2019;s often assumed that women are not interested in those industries, but what most people forget is that for the women who are interested, multiple blockers do still exist. Another favourite story of mine is the recent interview with did with <a href=\"/removing-blockers-for-women-wanting-to-excel-in-a-non-traditional-industry\">Brisbane Screening,</a> where there is a conscious effort to remove these blockers and build a more diverse team.</p>\n\n<p>The next time you see some kind of in inequality, regardless of whom it affects, I encourage you to call it out because sometimes, it can be an honest mistake or the person/company will be willing to admit they were wrong and fix it. With the SABA example, I spoke to the store manager at Collins St and she was genuinely shocked, as the almost all-female team working in the store didn&#x2019;t even notice the disparity themselves.</p>\n\n<p>Originally posted on Women Agenda. &#xA0;The article can be viewed <a href=\"http://www.womensagenda.com.au/talking-about/opinions/item/6964-women-get-to-earn-less-and-pay-more-introducing-the-sales-gender-gap\">here</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/04","associated_company":"work180"}