{"url":"https://www.work180.com.au/blog/2017/03/women-time-to-back-yourself-more-and-doubt-yourself-less","title":"Women: Time To Back Yourself More & Doubt Yourself Less","author":"WORK180","body":"\n\t\t\t\t\t<p>I must tell you - I love being a woman! &#xA0;And I have long felt blessed to have been born in a time when women have so many opportunities and choices that even my own mother never had. &#xA0;Yet of all the barriers women still face, one of the biggest is a lack of self-confidence and belief in our own worth.</p>\n\n<p>Yes, we are women. Hear us roar. Some days. But there&#x2019;s are plenty of others we women spend second guessing our decisions, questioning our value, beating ourselves up, talking ourselves down and apologising for our opinion.</p>\n\n<p>We work hard to do a great job, to keep all the plates spinning and scale the high bars we often set for ourselves. Yet still, we continually feel like we&#x2019;re falling short on some measure; that we&#x2019;re just not &#x2018;enough&#x2019; in some way. Not...</p>\n\n<p>Accomplished enough.</p>\n\n<p>Organised enough.</p>\n\n<p>Strong enough.</p>\n\n<p>Disciplined enough.</p>\n\n<p>Assertive enough.</p>\n\n<p>Strategic enough.</p>\n\n<p>Smart enough.</p>\n\n<p>That little voice in our heads just doesn&apos;t let up, continually critiquing what we haven&#x2019;t yet done or didn&#x2019;t do&#x2026; not &#x2018;well enough&#x2019; anyway. Do your own survey and you&#x2019;ll find that women tend to&#xA0;doubt themselves too much and back themselves too little. &#xA0;It&apos;s why courage is so imperative. We simply can&apos;t wait until we feel brave to put our hand up for a bigger role, to ask for a promotion or voice an opinion other may disagree with. We have to take action amid our fears that doing so may result in disapproval, rejection or outright failure.</p>\n\n<p>Of course not only women struggle with doubt but it&apos;s my experience that we tend to doubt ourselves ore and back ourselves less than the men we live and work with.</p>\n\n<p>It&apos;s why we must decide to #BeBoldForChange not just on International Women&#x2019;s Day, but every day. Why? Because changing the world around us begins with changing the world within us. Daring to do more and be more even though we fear we&apos;ll fall short in the process.</p>\n\n<p>Closing the gender gap will require stepping up, leaning into discomfort and acting with the confidence we women often wish we had (or had more of!) &#xA0;So if you&apos;re wondering what you can do to make the world a better place for everyone, look first within and then do whatever is the first thing that comes to mind when you ask yourself this question:</p>\n\n<p>What would I do today if I were being really brave?</p>\n\n<p>Below are ten to get you started!</p>\n\n<ol>\n\t<li>\n\t<p>Ask for what you want.&#xA0;That&#x2019;s right, it&#x2019;s simple enough but let&#x2019;s face it, too often we dilute what we ask for or don&#x2019;t ask at all for fear of seeming needy or being rejected. But as I&#x2019;ve written before, how can you expect to get what you want if you&#x2019;re not willing to ask for it.&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Say no. It&#x2019;s a short little word but it&#x2019;s one may women struggle to say because we know the person who&#x2019;s extended the invitation or offer doesn&#x2019;t want to hear it. But if you&#x2019;re ever going to do what you really want to do you&#x2019;ll often have to say no to good things to create space for great ones. Here&#x2019;s a&#xA0;<a href=\"https://margiewarrell.com/how-to-say-no-guilt-free/\" target=\"_blank\">free video course</a>&#xA0;I made for you to help you along.</p>\n\t</li>\n\t<li>\n\t<p>Push back. Yes, you&#x2019;re a nice person and you loathe to appear difficult but the truth is that if all you ever do is agree and go along to get along&#x2019; then sometimes you&#x2019;re selling yourself short. Way short. Pushing back isn&#x2019;t about being pushy. It&#x2019;s just owning your right to see things differently to others. Sure women can get called bossy or bitchy for simply speaking their truth but that doesn&#x2019;t mean you shouldn&#x2019;t! Being bold for change is all about risking a little push back for a cause that&#x2019;s bigger than your own comfort.&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Own your worth.&#xA0;Next time you&#x2019;re talking about what you do, talk about it in a powerful way that lets people know you see the value in what you do (even if they have yet to realize it). Too often our fear of seeming like we are bragging keeps us from talking about what we&#x2019;re up to. Time to own it!&#xA0;</p>\n\t</li>\n\t<li>\n\t<p>Risk rejection.&#xA0;It&#x2019;s not rejection you&#x2019;re afraid of, it&#x2019;s how you will feel because of what you make it mean&#x2026; a personal inadequacy on your part; evidence that you are &#x2018;less than worthy&#x2019; in some way. It doesn&#x2019;t mean that at all. The truth is you need to risk a lot of rejections if you want to get ahead in your business, career and life. If you&#x2019;re still licking a wound from a previous rejection,&#xA0;<a href=\"http://rawcourage.tv/been-rejected-how-to-handle-it-better/\" target=\"_blank\">watch this</a>.</p>\n\t</li>\n\t<li>\n\t<p>Own your difference.&#xA0;We all like to belong to a group but too often we let our fear of disapproval keep us from expressing who we really are and owning what makes us different. So don&#x2019;t dial yourself down for fear of standing out. Just be 100% of whoever it is you truly are. As I wrote in&#xA0;<a href=\"http://www.forbes.com/sites/margiewarrell/2017/02/18/is-your-professional-mask-limiting-the-quality-of-your-relationships/#870e2a75b835\" target=\"_blank\">this recent Forbes column</a>, &#x201C;When all you do is try to fit in and conform, all you offer is conformity. It&#x2019;s what sets you apart from others that makes you interesting.&#x201D;</p>\n\t</li>\n\t<li>\n\t<p>Take a risk.&#xA0;Women are naturally more cautious than men. It&#x2019;s why women are far less likely to engage in high risks sports or suffer spinal injuries. We don&#x2019;t get the same buzz from going fast as men. Yet we can often be more reticent to take the very risks that would enable us to get ahead. As I wrote in&#xA0;<a href=\"https://margiewarrell.com/books\" target=\"_blank\">Brave</a>, if there&#x2019;s something you&#x2019;d really love to do or change, embrace the discomfort of risk taking and just do it.</p>\n\t</li>\n\t<li>\n\t<p>Ditch all guilt.&#xA0;Some guilt is healthy. Like if you haven&#x2019;t paid your taxes or you&#x2019;ve done something that&#x2019;s violated a core value and leaves you out of integrity with yourself. More often though our guilt is driven by social norms and rules that we&#x2019;ve unwittingly bought into. If you&#x2019;re a working mother, you&#x2019;ll know all about that. But here&#x2019;s the deal, how can you teach your kids to go out and pursue their dreams if you aren&#x2019;t pursuing yours? You can&#x2019;t! Or not with any credibility anyway.</p>\n\t</li>\n</ol>\n\n<p>&#xA0;</p>\n\n<p>So lay all the &#x2018;shoulds&#x2019; to the side and ask yourself, what is it that you would love to do so much that you know even if it pulls you away from your kids more often than you&#x2019;d like, you know that they (as well as you) will ultimately be better off because you&#x2019;ve done it? If you&#x2019;re still struggling.</p>\n\n<ol>\n\t<li>\n\t<p>Expand your tribe.&#xA0;The more people who know who you are, what you can do and what you&#x2019;d love to do more of, the more people who can help you get there. So think about who it is that you&#x2019;d love to build a relationship with and find a way to connect with them.</p>\n\t</li>\n\t<li>\n\t<p>Challenge your story.&#xA0;You live in an intricate web of stories about who you are, about what you can do and, just as importantly, what you can&#x2019;t. Your stories are the truth but they have the power to shape your life. So if you&#x2019;ve been telling yourself a story that you&#x2019;re too old, too young or that you&#x2019;re not &#x2018;enough of something&#x2019; try telling yourself another one and see what possibilities open up for you.&#xA0;</p>\n\t</li>\n</ol>\n\n<p style=\"text-align:center\"><iframe allowfullscreen frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/thsHOSy0ua4?ecver=1\" width=\"560\"></iframe></p>\n\n<p>If you&#x2019;d love support in being bolder and living braver, join Margie at one of her upcoming&#xA0;<a href=\"http://www.livebraveday.com/\" target=\"_blank\">Live Brave Days</a>&#xA0;in Brisbane, Sydney and Melbourne.&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<p>Margie &#xA0;is one of our contributors, read about them all <a href=\"/contributors\">here</a>. &#xA0;Interested in becoming a contributor? Click&#xA0;<a href=\"https://www.diversecitycareers.com/becomeacontributor\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/03","associated_company":"work180"}