{"url":"https://www.work180.com.au/blog/2018/01/women-in-tech-dot-dot-dot-its-not-about-being-a-woman-or-a-man-its-about-being-human","title":"Women in tech… It’s not about being a woman or a man. It’s about being human.","author":"WORK180","body":"\n\t\t\t\t\t<p>Looking back on where I was a year ago, I never would have imagined where I&#x2019;d be today: working for a&#xA0;tech company&#xA0;(let alone one of Australia&#x2019;s largest tech companies, <a data-cke-saved-href=\"https://www.dccjobs.com/clients/optus\" href=\"https://www.dccjobs.com/clients/optus\">Optus</a>).</p><p>As a trained lawyer with a master&#x2019;s degree in Commerce &amp; Marketing, it&#x2019;s not that I completely disregarded working in tech, it&#x2019;s that I&#x2019;ve never been a &#x2018;numbers person&#x2019; and therefore I assumed I wasn&#x2019;t the right fit to work in the industry.</p><p>Fast forward a year, not only am I working for a technology company but I&#x2019;m also working directly with engineers and solution architects to create the products that enable businesses to function.</p><blockquote><p><em>Important lesson:&#xA0;assumptions are dangerous.</em></p></blockquote><p>Yet here I am, a female in the tech industry who is climbing the corporate ladder. And it&#x2019;s&#xA0;<em>so. much. fun.</em></p><p>I&#x2019;m currently part of the Optus graduate program, which has been a great experience for my personal and professional development. I am learning&#xA0;<em>a lot</em>.&#xA0;In fact, as an ambitious woman who always wants more, I won&#x2019;t ever stop learning. I love a good recap hence, here are a few pieces of advice that have been shared with me that might inspire fellow women pursuing a career in tech.&#xA0;</p><h3><strong>1. It&#x2019;s ok to be terrified.</strong></h3><p>The thought of me being in a meeting and uttering the words &#x2018;I don&#x2019;t know,&#x2019; terrified me. It still does. Human nature is to have every answer. However, the truth is even experts don&#x2019;t know everything. You will never learn in your safe zone. Questions are powerful, keep asking them.</p><h3><strong>2. It&#x2019;s not about being a woman or a man. It&#x2019;s about being human.</strong></h3><p>Don&#x2019;t be put off by the fact that there are a lot of males in the tech industry. What I&#x2019;ve learned is that it&#x2019;s not about being a male or female. If you&#x2019;re passionate about what you do, are eager to learn and want to kick some serious goals, your gender shouldn&#x2019;t come into the equation. As soon as it does, speak up. So far, I have worked with some incredible men&#xA0;<em>and</em>&#xA0;women who are extremely knowledgeable in their field and have taken me under their wing to teach me what they know. Be hungry to learn. Be open for knowledge sharing.</p><h3><strong>3. It&#x2019;s not all about numbers</strong></h3><p>When I first started in the area I&#x2019;m in, I warned my manager, &#x2018;I&#x2019;m not a numbers nor a technical person.&#x2019; Her response was &#x2018;neither am I.&#x2019; In fact, a lot of senior management are not necessarily &#x2018;numbers&#x2019; people, and instead they&#x2019;re really good at identifying the&#xA0;<em>story</em>&#xA0;numbers can tell. If you can identify problems and, more importantly, solutions that you can use the numbers to back, then you don&#x2019;t need to be a &#x2018;numbers&#x2019; person. Plus, what I&#x2019;ve realised is that I&#x2019;m not a numbers person because that&#x2019;s what I&#x2019;ve told myself. Mindset is&#xA0;<em>everything.&#xA0;</em>&#xA0;</p><h3><strong>4. Emotional Intelligence is important</strong></h3><p>Now ladies and gents, I am the last person to stereotype&#x2026; but&#x2026;in general women do have a higher level of emotional intelligence (EI). Increasingly, EI is more important than technical ability and can be the differentiator between a good leader and a great leader. Don&#x2019;t underestimate the importance of Emotional Intelligence especially in the tech industry.&#xA0;</p><h3><strong>5. Tech moves fast, make sure you can keep up</strong></h3><p>Think about how different technology was five years ago. Two years ago. Six months ago. Technology is rapidly evolving so you must evolve with it. Being able to be flexible and adapt to change is essential. After I completed my master&#x2019;s degree I told myself that I would never go back to research. The truth is, I haven&#x2019;t stopped researching since I got out of uni. Whether it&#x2019;s books, blogs or following up on statements made in meetings, make sure you keep on top of trends. Become a visionary.</p><h3><strong>6. Put your hand up</strong></h3><p>Don&#x2019;t shy away from asking for what you want.&#xA0;The tech industry&#xA0;needs more females&#x2013; especially in leadership positions. Don&#x2019;t shy away from voicing your dream career journey to those around you.</p><p>If you&#x2019;re a female in tech or want to work in tech, I&#x2019;d love to<a data-cke-saved-href=\"https://www.linkedin.com/in/hannahudina/\" href=\"https://www.linkedin.com/in/hannahudina/\"> connect with you on </a><a data-cke-saved-href=\"https://www.linkedin.com/in/hannahudina/\" href=\"https://www.linkedin.com/in/hannahudina/\">linkedin</a> and hear your thoughts.&#xA0;</p><hr><h4><strong>About Optus<a data-cke-saved-href=\"https://www.dccjobs.com/clients/optus\" href=\"https://www.dccjobs.com/clients/optus\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/df5157bb-4cd3-42e5-b3ff-ea2643ac0f85.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/df5157bb-4cd3-42e5-b3ff-ea2643ac0f85.png\" style=\"float: right; margin: 10px;\"></a></strong></h4><p>Optus is an Endorsed Employer for Women.</p><p>Read more about Optus <a data-cke-saved-href=\"https://www.dccjobs.com/clients/optus\" href=\"https://www.dccjobs.com/clients/optus\">here.</a></p><p>Apply to join Optus and <a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=optus\" href=\"https://www.dccjobs.com/job-search?client=optus\">view all their&#xA0;jobs </a><a data-cke-saved-href=\"https://www.dccjobs.com/clients/optus\" href=\"https://www.dccjobs.com/clients/optus\">here</a><a data-cke-saved-href=\"https://www.dccjobs.com/job-search?client=optus\" href=\"https://www.dccjobs.com/job-search?client=optus\">.&#xA0;</a></p><hr><strong></strong><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["gender equality","Celebrating Women","Career Development"],"upload_date":"2018/01","associated_companies":["work180"]}