{"url":"https://www.work180.com.au/blog/2016/04/women-in-technology-qld-and-diverse-city-careers-partner-to-drive-gender-equality-across-information-technology-and-life-sciences","title":"Women in Technology QLD and Diverse City Careers partner to drive gender equality across Information Technology and Life Sciences","author":"WORK180","body":"\n\t\t\t\t\t<p>Today, Women in Technology QLD(WiT) and Diverse City Careers (DCC) are thrilled to announce the partnership of two organisations aligned in their passion for equality.</p>\n\n<p>&#x201C;Addressing the diversity agenda takes the combined efforts of many,&#x201D; said Fiona Hayes, WiT President. &#x201C;Our vision is to advance, connect and empower women in technology and life sciences and we&#x2019;re excited about collaborating with DCC to achieve greater outcomes for both our communities.&#x201D;</p>\n\n<p>Founded in 1997 with the support of just 10 women, WiT has grown to over 3700 members and affiliates with sponsorship from organisations such as University of Queensland, Origin Energy, Queensland Government, QUT and others.</p>\n\n<p>WiT programs are aimed at of all career levels and include mentoring, networking events, coaching, along with a Board Readiness program and an annual Awards gala dinner. In 2015 WiT reached over 11,500 people through their network and social media and had more than 1600 people attend WiT events.</p>\n\n<p>WiT builds mutually beneficial partnerships and relationships with industry, academia and government. They advocate for their members on relevant issues to advance the presence and status of women in technology and life sciences. In doing this WiT also recognises the important role that men play in improving diversity.</p>\n\n<p>WiT is the first technology industry association to bring together members from diverse technology disciplines, with the introduction of a Life Sciences Chapter in 2005 highlighting the common ground shared by women in all areas of emerging technology.</p>\n\n<p>DCC co-founders, Gemma Lloyd and Valeria Ignatieva, started the company after working in IT for over 9 years and served on the board of Females in IT &amp; Telecommunications (FITT), another not-for-profit industry association.</p>\n\n<p>&#x201C;We experienced many challenges faced by women working in industries under-represented by females,&#x201D; said Gemma Lloyd. &#x201C;Through volunteering with FITT, we also came across many organisations with a strong focus on diversity and inclusion and decided to create an exclusive platform to promote such organisations.&#x201D;</p>\n\n<p>The DCC jobs board is Australia&#x2019;s only jobs board requiring employers to be pre-qualified before advertising to ensure they support women&#x2019;s careers.&#xA0;Since launching in 2015, the company has received tremendous support from the industry and is regarded as one of Australia&#x2019;s leading authorities on gender diversity. Clients include the likes of Accenture, Dropbox, Minter Ellison, Aurizon, Clayton Utz, Origin, PwC, EMC, ThoughtWorks and Curtin University.</p>\n\n<p>DCC also produces a number of resources on topics such as personal branding, negotiation skills and other areas of professional development. DCC cofounders regularly participate in advocacy events on gender diversity and run community meet-ups and corporate panel sessions along with in-company training.</p>\n\n<p>&#x201C;It is though our partnerships that we can amplify our efforts to help organisations build more inclusive workplaces and for women to pursue rewarding careers across any industry,&#x201D; said Valeria Ignatieva.&#xA0;</p>\n\n<p>DCC support a number of industry organisations including FITT, Women in Energy, Women in Mining, Women in Digital and Women Lawyers Association of Queensland along with working with a number of consulting partners to assist corporate clients and female job seekers. In addition, DCC has relationships with sister charities such as Tech Girls are Superheroes, UN Women and the One Woman Project &#x2013; donating all proceeds from DCC events.&#xA0;</p>\n\n<p>Together, the two organisations will be building awareness around gender equality through a number of campaigns, with the next exciting event hosted by WiT in Brisbane on the 29th May 2016. STEMed is a one day festival of education for the future, bringing together experts, advocates, industry, educators, parents and youth.</p>\n\n<p>The day will feature fully interactive workshops for parents and children and sessions on 3D Printing, Startups, Gaming, Coding, Drones, Robotics and much more. For more information, please visit <a href=\"http://www.stemedfest.com/\" target=\"_blank\">http://www.stemedfest.com/</a> .</p>\n\n<p>More information on WiT can be found on <a href=\"http://www.wit.org.au/\" target=\"_blank\">www.wit.org.au</a></p>\n\n<p>&#xA0;</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n<p>&#xA0;</p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/04","associated_company":"work180"}