{"url":"https://www.work180.com.au/blog/2016/06/women-want-more-than-flexibility-alone","title":"Women Want More Than Flexibility Alone","author":"WORK180","body":"\n\t\t\t\t\t<p>Having recently surveyed the Diverse City Careers&#xA0;(DCC)&#xA0;community of women on what they look for in a new employer, it&#x2019;s fair to say we were not very surprised with the results.</p><p>The tweet below mirrors the more extensive survey results, which point to exciting projects being almost as important to women as flexible working.</p><p><br></p><p>However, many companies we speak to are not promoting either aspects to prospective female candidates. If they do, they tend to lead with flexible working and as a mother myself, I&#x2019;ve often felt that there&#x2019;s an assumption that mothers are happy enough with flex alone, and don&#x2019;t mind doing work that doesn&#x2019;t exactly excite them. These assumptions extend to women who don&#x2019;t have children, making it difficult for them to negotiate flexible working because of a weak &#x2018;business case&#x2019;.</p><p>We need to shatter both stereotypes, and I&#x2019;m pleased to be able to meet companies through DCC who are doing just that. One of my favourite examples is AECOM, where we&#x2019;re currently profiling a number of women who have been able to pursue both exciting careers and care for families, and access flexible working to pursue personal hobbies, travel and enjoy life.</p><p>When we asked these women why they enjoyed working with AECOM, even though flexibility was mentioned, the common thread between each woman was the fact they absolutely loved the exciting projects, the teams they got to work with, the opportunities to give back to the community and grow both personally and professionally.</p><p>I was not familiar with AECOM and its culture, however after getting to know the women at AECOM, I&#x2019;m inspired and impressed by the fact that the company has created an environment where women don&#x2019;t need to feel like they are missing out on neither exciting work, nor flexibility.</p><p><br></p><p>DCC is also running meetups for women around negotiating flexible working arrangements in June and July,&#xA0;book Brisbane&#xA0;(23 June)&#xA0;Sydney&#xA0;(28 June) and&#xA0;Melbourne&#xA0;(6 July).</p><p><br></p><h5><strong><span style=\"color:#A97FB1\">About DCC Jobs</span> </strong></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\t\t\t\t","tags":["DCC News"],"upload_date":"2016/06","associated_company":"work180"}