{"url":"https://www.work180.com.au/blog/2018/04/jobs-platform-WORK180-expands-globally","title":"WORK180 raises $1m","author":"WORK180","body":"\n\t\t\t\t\t<p align=\"center\"><strong>WORK180 jobs board focused on workplace gender equality raises $1m </strong></p>\n\n<p align=\"center\"><strong><em>Previously known as DCC Jobs, WORK180 uses funding to expand globally</em></strong></p>\n\n<p>WORK180 formerly&#xA0;DCC Jobs, known for being the only jobs platform which pre-screens employers to ensure they support women&#x2019;s careers has raised $1 million in their seed round and will change its name to WORK180. The successful seed round was led by Skip Capital, (co-CEO of Atlassian, Scott Farquhar&#x2019;s private investment fund), with other investors including the co-founders of Lux Group, Thomas Rice, Lead Tech Analyst at Perpetual, and Startmate, an Australian startup accelerator.</p>\n\n<p>The capital raised will be invested in the company&#x2019;s expansion into international markets, launching WORK180 in the UK on 19 April 2018, followed by a US launch in 2019.<img src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/34c96714-6fc4-4ca2-b02c-2e1fa113facc.jpeg\" style=\"float: right; margin: 10px;\"></p>\n\n<p>&#x201C;We are excited to back these phenomenal entrepreneurs who have created a great business and are setting the standard in gender equality,&#x201D; says Kim Jackson, Principal of Skip Capital.</p>\n\n<p>&#x201C;Over the last three years we have flipped the traditional jobs board model on its head whereby the employers are the ones that are being screened,&#x201D; says Gemma Lloyd pictured far right, Co-CEO and Founder, WORK180. &#xA0;&#x201C;The investment will help us accelerate the growth of the team and extend our focus on ensuring women globally are able to get the work conditions that enables them to thrive, and employers to prosper with the best possible employees.&#x201D;</p>\n\n<p>&#x201C;We established WORK180 by bootstrapping in 2015 and just three years later we are employing 11 full time staff and six part time. In the last three months alone, the number of jobs we have listed have grown 400 percent,&#x201D; Gemma continues.</p>\n\n<p>WORK180 only lists jobs from businesses that are pre-screened against a set of 20 criteria, including pay equity, flexible working, women in leadership and paid parental leave, with clients across all industries including clients such as Atlassian, Microsoft, CommBank, BHP, Caltex, Mercy Health, AustralianSuper, Qantas, NSW Government and Telstra. It is also the only job site to make this information publicly available to job seekers.</p>\n\n<blockquote>\n<p><big><em>&#x201C;WORK180 will continue to be the go-to job platform for female job seekers to find work with pre-screened employers with a proven commitment to creating inclusive workplaces,&#x201D; </em>says Gemma.</big></p>\n</blockquote>\n\n<p>&#x201C;It&#x2019;s been great to see the progress in workplace conditions we have helped to achieve. Of those companies we pre-screen that do not meet our criteria, 80 per cent will re-apply after they have improved workplace conditions to pass WORK180&#x2019;s standard. WORK180 raises the benchmark for workplace conditions to the benefit of all staff, as the policies we screen for are required to be gender neutral.</p>\n\n<p>&#x201C;Australian companies are making steps towards gender equality in the workplace and this latest investment ensures WORK180 can continue to flip the traditional jobs model around, expand globally and champion these efforts on an entirely new scale,&#x201D; says Gemma.</p>\n\n<h3><a href=\"http://www.work180.com.au\">About WORK180</a></h3>\n\n<p>Launched in 2015 in Melbourne, Australia by Gemma Lloyd and Valeria Ignatieva, WORK180 is a&#xA0;<a href=\"https://www.dccjobs.com/job-search\">jobs board</a>&#xA0;with a difference. Every company on the Australian and New Zealand website is pre-screened against a set of 20 criteria, including pay equity, flexible working, women in leadership and paid parental leave. WORK180 is the only website to make this information publicly available. WORK180 caters to a wide variety of occupations and includes a strong presence in traditionally male-dominated industries, championing and effecting change in the workplace. Please reach out to&#xA0;<a href=\"mailto:hello@work180.co ?subject=Enquiry\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">hello@work180.co&#xA0;</a>&#xA0;if you have any questions.<br>\n<br>\n<span style=\"font-size: 16px;\">We are also currently hiring software developers in Australia and a Community Engagement Manager in&#xA0;UK-<a href=\"https://www.dccjobs.com/job-search?client=dcc-jobs\">&#xA0;</a></span><a href=\"https://www.work180.com.au/job-search?client=work180\" style=\"background-color: rgb(255, 255, 255); font-size: 16px;\">click here</a><span style=\"font-size: 16px;\">- if you are interested in joining us.</span></p>\n\n<p><span style=\"font-size: 16px;\">Learn more about the WORK180 rebrand&#xA0;<a href=\"https://www.dccjobs.com/blog/2018/04/dcc-jobs-rebrands-to-work180\">here.&#xA0;</a></span></p>\n\n\t\t\t\t","tags":["DCC News"],"upload_date":"2018/04","associated_companies":["work180"]}