{"url":"https://www.work180.com.au/blog/2016/12/workplace-gender-equality-agency-raises-the-bar-for-flexible-work-practices","title":"Workplace Gender Equality Agency Raises the Bar for Flexible Work Practices","author":"WORK180","body":"\n\t\t\t\t\t<p>Think about how your own profession has changed from the industrial revolution to now in the information or technology revolution.&#xA0;</p>\n\n<p>For example, just 50 years ago accountants sat with big calculators and massive ledgers crunching numbers all day long, engineers hand drew their designs and manually calculated everything. &#xA0;Today, computers have replaced the calculators, ledgers and drawing boards. Computers so small they fit in a laptop and can be used from anywhere on the planet.</p>\n\n<p>The world has changed. &#xA0;The work has changed. &#xA0;So how we work must also change.</p>\n\n<p>Flexible working is just work, done differently.</p>\n\n<p>The standard work week of Monday to Friday, 9-5 works very well for some people. For everyone else, flexible work is the new normal.</p>\n\n<p>But let&#x2019;s be clear here, flexible work is not about the casualization of the workforce, nor is it about removing entitlements. On the contrary, it is being embraced and implemented by organisations who see the payoff in terms of productivity, employee retention and employee engagement, followed by a bottom line increase.</p>\n\n<p>Happy employees stay. Re-recruitment is a costly exercise for organisations with high staff turnover in terms of both the actual recruitment cost as well as the experience lost and the time taken to on-board a new employee. &#xA0;People leave organisations when their needs are not met, or they cannot balance their work and life successfully.&#xA0;</p>\n\n<p>37% of young fathers and 29% of men without caring responsibilities under 35 had seriously considered leaving their organisation due to a lack of flexibility*.</p>\n\n<p>A staggering 57.5 days per person, per year is lost to presenteeism** &#xA0;in Australia &#x2013; substantially more than days lost to sick leave or caring leave*** .&#xA0;</p>\n\n<p>Forward thinking organisations have been able to reduce their inner city floor space when they reviewed the number of people working in the office vs working at other locations.&#xA0;</p>\n\n<p>As well as the financial payoff from flexible work arrangements, the Workplace Gender Equality Agency views flexible work arrangements as a lever in closing the gender pay gap. Consequently, to become an Employer of Choice for Gender Equality (EOCGE) citation holder in 2017 will require flexible working to be actively promoted and role modelled throughout the organisation. In addition, leaders will be held accountable for improving workplace flexibility.</p>\n\n<p>There is an untapped talent pool of both men and women, young and old, able and less able bodied both willing and eager to work at the level of their qualification, skills and experience in a way that may vary either slightly or completely from the standard work week.</p>\n\n<p>Flexible working is about changing the work paradigm from hours to&#xA0;output.</p>\n\n<p>Flexible working is about changing&#xA0;when, where and how&#xA0;work is completed.</p>\n\n<p>Flexible working is about&#xA0;trusting&#xA0;the people your organisation has hired to do what they say they are going to do, and to&#xA0;deliver the outcomes&#xA0;whether you are watching over them&#x2026; or not.</p>\n\n<p>Some organisations have put fair and equal access to flexible work arrangements on the strategic plan, but have not yet actioned it. Others have invested the time and resources in making it a reality for all of their staff resulting in great payoffs to the organisation.&#xA0;</p>\n\n<p>Cbus and Aurecon are two forward thinking organisations that were the first in Australia to achieve the Flex Able Certification and at Diverse City Careers, we&#x2019;re seeing more and more organisations wishing to stand out in this space.</p>\n\n<p>Would you like to be known as an employer that truly walks the talk on flexible working arrangements? Find out if you qualify as a&#xA0;<a href=\"/flex-able-certification\">Flex Able Certified Employer</a>&#xA0;today by <a href=\"/contact-us\">getting in touch with us</a>.<a href=\"mailto:dcc@diversecitycareers.com?subject=Flex%20Able%20Certification%20enquiry\"> </a></p>\n\n<p>&#xA0;</p>\n\n<p>[*]https://www.dca.org.au/News/News/Employers-take-note:-men-want-flexible-working-too!/293&#xA0;</p>\n\n<p>[**]Presenteeism is when people come to work but are not productive either because they are unwell, stressed or disenchanted with their leader or organisation.</p>\n\n<p>[***]https://www.gettheworldmoving.com/blog/category/employeehealth</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2016/12","associated_company":"work180"}