{"url":"https://www.work180.com.au/blog/2015/11/workplace-flexibility-why-policies-alone-are-not-enough","title":"Workplace flexibility- why policies alone are not enough","author":"WORK180","body":"\n\t\t\t\t\t<p>Those who know me well, know I&#x2019;m a fan of analogies and fitness. So it will be no surprise the idea behind this post came to me during a workout.</p>\n\n<p>I&#x2019;m a member of two gyms- a large, commercial gym with locations all over Australia and also a smaller, privately owned gym that I visit when my son trains there. Each time I go to either gym, I notice a big difference; at the large gym, the weights and equipment are always strewn all over the place, and you can never tell if someone is using a barbell in the middle of the floor or if it&#x2019;s free to use.</p>\n\n<p>There&#x2019;s also several trainers walking around, berating members (including myself) to put the weights away. Each wall is plastered with stern warning notices about keeping the gym tidy.</p>\n\n<p>The smaller gym, on any given day, is immaculate and there&#x2019;s only ever one person present at the desk. I&#x2019;ve never seen them tell anyone off, but instead walk around and help/chat to the members. The equipment is always in its right place, even when the gym is packed.</p>\n\n<p>You may be thinking, where on earth is she going with this&#x2026; Well, my analogy is related to workplace culture, in particular around flexibility.</p>\n\n<p>Two organisations, where people go to perform the same tasks can be identical on the outside, however how do you cultivate a culture where people act a certain way, and are self-driven to do so?</p>\n\n<p>Back to the gym analogy- it feels like at the commercial gym, no one puts anything away because the person before them and everyone around them don&#x2019;t.</p>\n\n<p>So it&#x2019;s a case of <em>&#x201C;why should I if nobody else does?&#x201D;</em></p>\n\n<p>At the family owned gym, there is trust and mutual respect in the air almost to the point where you feel terrible on the inside if you put a 7kg dumbbell in the 10kg spot- <em>how does that work??</em></p>\n\n<p>The answer is multi-faceted, and in this post I&apos;d like to explore a few aspects that create a culture that cultivates an environment where flexibility is embraced and encouraged.</p>\n\n<p>This is outside of the expected formal policies, because we all know that having a policy alone does not automatically result in the desired behaviour.</p>\n\n<h4>&#xA0;</h4>\n\n<p><strong>Practice what you preach.</strong></p>\n\n<p>The attitude to flexibility needs to stem from the top- I&#x2019;ve worked with companies where the CEO&#xA0; regularly left work during the day to attend his daughter&#x2019;s school activities. That role modelled the fact that not only was this behaviour acceptable, but that family was valued.</p>\n\n<p>In addition, it demonstrated flexibility was&#xA0; appropriate not just for female staff who left work &#x201C;early&#x201D; to pick up the kids.</p>\n\n<p>I&#x2019;ve also worked with senior managers who actively called out staff who worked on weekends, telling them &#x201C;I&#x2019;m recharging, and you should be as well.&#x201D;</p>\n\n<h4>&#xA0;</h4>\n\n<p><strong>Empower your staff.</strong></p>\n\n<p>Does that fact that you&apos;ve travelled an hour each way to be physically present at your desk mean you will be more productive for those 8 hours?</p>\n\n<p>What if you were able to design your day based on your lifestyle?</p>\n\n<p>Which scenario calls for more engagement, more productivity and overall happiness?</p>\n\n<p>We need to start looking at outcomes, and managing your remote workforce to empower staff to achieve the desired results on their terms.</p>\n\n<p>Thanks to technology, gone are the days where being chained to the desk was the only option to complete many tasks. While there are plenty of roles which cannot be performed remotely, the fact remains- we could be doing so much better in the flexibility stakes.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Understand that one size does not fit all.</strong></p>\n\n<p>For some people, flexibility may mean working from 7am-3pm. Others prefer to come into the office three times per week and work remotely the rest. For people who prefer to be in the office every day, it&#x2019;s important to know that if something arises, flexibility is on the table.</p>\n\n<p>It&#x2019;s also important to avoid overworking- a common threat to remote workers who never seem to switch off.</p>\n\n<p>Sometimes I feel like a broken record, thinking &#x201C;surely everyone has realised the benefits, this is no longer an issue&#x201D; simply because I&#x2019;ve been lucky enough to work flexibility myself for the past 8 years.</p>\n\n<p>Sadly this is not the case, with <a href=\"http://www.theaustralian.com.au/business/technology/australia-is-failing-to-embrace-flexible-working/story-e6frgakx-1227582883702\" target=\"_blank\">The Australian</a> recently reporting that the country is failing to embrace flexible working.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>What are we doing about it?</strong></p>\n\n<p>The Workplace Gender Equality Agency has launched a great awareness campaign on the issue, called <a href=\"http://equilibriumchallenge.com.au/site/\" target=\"_blank\">Equilibrium Man Challenge</a>. It&#x2019;s a perfect example of companies taking a step in the right direction and shattering the common perception of &#x201C;flexibility is just for mums.&#x201D;</p>\n\n<p>Because everyone knows all we do when &#x201C;working&#x201D; from home is alternate between baking cookies and Netflix ;)</p>\n\n<p>DCC Jobs has also partnered with the WGEA to create an event, <a href=\"http://www.diversecitycareers.com/page/events/driving-a-strategic-approach-to-flexibility/\">&apos;Driving a Strategic Approach to Flexibility&apos; </a>which will be a panel discussion with industry leaders sharing their experiences and practical advice. The event will be held in Sydney on the 10th November.</p>\n\n<p>As with most things, inspiration can always be found through diversity of thought, and I welcome comments from people across different industries- what have you seen work well to cultivate a culture of flexibility?</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/11","associated_company":"work180"}