{"url":"https://www.work180.com.au/blog/2017/01/workplace-stress-mental-illness-and-flexible-work-arrangements","title":"Workplace Stress, Mental Illness and Flexible Work Arrangements","author":"WORK180","body":"\n\t\t\t\t\t<p>At some point in our careers, we&#x2019;ve all experienced a level of workplace induced stress, or had our work negatively affected by stress in our personal lives. In addition to this, mental illness is common, with 20% of Australians aged between 16-85 experiencing a mental illness in any given year.</p>\n\n<p>The importance of discussing this topic is paramount not only to support individuals, but also organisations in creating work environments conducive to helping employees. Healthy and happy employees are more productive and proven through countless studies to increase an organisations profitability.</p>\n\n<p>On the 8th December, Anti-Discrimination Commission Queensland (ADCQ) closed Human Rights Month with a panel discussion on how flexible work practices and a focus on mental health impacts an organisations bottom line.</p>\n\n<h3><strong>$11 BILLION</strong></h3>\n\n<p>This is the cost of mental illness for workplaces in Australia says Tony Stevenson, CEO Mental Illness Fellowship Queensland. He is all about creating mentally healthy workplaces and says that mental illness is a continuum of normal human experience where people need more support. &#xA0;All people have the capacity to work well and be productive employees.&#xA0;</p>\n\n<p>There are significant benefits to employers that adjust and allow people to recover and then return to work.</p>\n\n<p>His four key strategies to do this are:</p>\n\n<ol>\n\t<li>\n\t<p>Understanding mental illness</p>\n\t</li>\n\t<li>\n\t<p>Dispel the myths around mental illness</p>\n\t</li>\n\t<li>\n\t<p>Have a conversation</p>\n\t</li>\n\t<li>\n\t<p>Develop reasonable adjustments. &#xA0;</p>\n\t</li>\n</ol>\n\n<p>I&#x2019;ve chosen to focus on the latter two of these strategies, however, if you would like to understand more about mental illness please visit the&#xA0;<a href=\"https://www.adcq.qld.gov.au/resources/fair-and-inclusive-workplaces/mentally-healthy-workplaces/myths-about-mental-health\" target=\"_blank\">ADCQ website</a>.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Have a conversation:</strong></h4>\n\n<p>&#x201C;Look out for each other&#x2019;s well-being&#x201D; was the simple message from Kevin Cocks, Anti-Discrimination Commissioner, ADCQ.</p>\n\n<p>This is not limited to employers looking out for the well-being of their employees. We need to look out for the well-being of our customers (internal and external), look out for the well-being of the people who serve us &#x2013; especially in high stress roles, and look out for the well-being of our leaders.&#xA0;</p>\n\n<p>Too often, ADCQ hears the complaints when a person&#x2019;s dignity and humanity have been taken away and this wouldn&#x2019;t happen if we had conversations that valued other people.</p>\n\n<p>Do you know the expectations and aspirations of the people around you?</p>\n\n<p>Have you ever had a conversation about this and asked them?</p>\n\n<p>Have you allowed them to deliver their service in a way that is mutually beneficial?</p>\n\n<p>&#xA0;</p>\n\n<h4><strong>Develop reasonable adjustments. </strong>&#xA0;</h4>\n\n<p>Tony Stevenson promotes two reasonable adjustments to allow people to recover and get back work.</p>\n\n<ol>\n\t<li>\n\t<p>Flexible work arrangements</p>\n\t</li>\n\t<li>\n\t<p>Time off to recover</p>\n\t</li>\n</ol>\n\n<p>Research conducted by Professor Paula Brough, Professor of Organisational Psychology and her team at Griffith University shows that over the last few years, there have been improvements in effective flexible work arrangements. &#xA0;Many organisations have put a financial value on these practices and have seen a return on their investment.&#xA0;</p>\n\n<p>Moreover, the research demonstrates an increased scope in both access to, and types of flexible work arrangements on offer.&#xA0;</p>\n\n<p>Flexible work arrangements are no longer reserved just for women with young children. &#xA0;Both male and female employees who desire a healthy work - life balance, want flexible work arrangements. &#xA0;Many people without children say they work flexibly to improve their mental health.</p>\n\n<p>Flexible work arrangements are no longer defined by merely part time work. &#xA0;They include compressed work weeks, changed start and finish times and working somewhere other than the office. &#xA0;Improvements in technology have facilitated many of these changes, however Paula warns people to implement some boundaries when it comes to responding to work emails out of hours.</p>\n\n<p>&#x201C;Flexible work arrangements are not a competition between law firms and other organisations, but a genuine way for employees to have access to great workplaces,&#x201D; said Dominic McGann, Chairman of Partners, McCullough Robertson.</p>\n\n<p>Before you can make a change for the better in your life, you need to know which organisations truly walk the talk on flexible work arrangements. &#xA0;At Diverse City Careers, we&#x2019;ve created an easy way to identify those organisations, through our&#xA0;<a href=\"/flex-able-certification\">Flex Able</a><a href=\"/flex-able-certification\">&#xA0;Certification</a>- an audit process to ensure there is a genuine commitment to creating a flexible workplace.</p>\n\n<p>&#xA0;</p>\n\n<p><a href=\"mailto:dcc@diversecitycareers.com?subject=Flex%20Able%20Certification%20enquiry\">Contact us</a>&#xA0;to find out if your organisation meets our criteria for Flex Able Certification.</p>\n\n<p>This Human Rights Month discussion group was hosted by the Anti-Discrimination Commission Queensland. &#xA0;Has your organisation taken the&#xA0;<a href=\"https://www.adcq.qld.gov.au/resources/fair-and-inclusive-workplaces/pledge-support\" target=\"_blank\">Human Rights Pledge</a>?</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["Career Development"],"upload_date":"2017/01","associated_company":"work180"}