{"url":"https://www.work180.com.au/blog/2018/12/you-only-have-one-life","title":"You only have one life","author":"WORK180","body":"\n\t\t\t\t\t<p>How Nation Partners became Flex Able Certified</p><p>Nation Partners has always believed in having one &#x2018;life&#x2018; &#x2013; a life that blends both personal and work aspirations to make it the life people want to lead.</p><p>The business specialises in helping clients solve complex problems for projects. But they also help their own team manage the complex problems that can arise when work, life, family, passion, projects and personal development cross over.</p><p>It&#x2019;s philosophy was there from day one and Nation Partners was proud to become a certified B Corporation - a certification that assesses a company&#x2019;s social, environmental and worker performance.</p><p><br></p><p>Nation Partners is growing and nurturing a strong culture to create an environment that supports and promotes flexibility in the workplace. It&#x2019;s this culture that has been key in attracting new recruits, who often hear good things from colleagues or clients. While technical skills and experience are usually assessed based on documented work history during recruitment processes, conversations generally focus on workplace culture and what the business stands for.</p><p>Here&#x2019;s how Yen Yuen, director of infrastructure and business advisory, explains the approach to flexible working:</p><p>&#x201C;Flexibility means more than the ratio of people who work part-time or alternative times. It&#x2019;s how we respect each other&#x2019;s time and logistics that is also an important part of the practice.&#x201D;</p><p>Flexible working is also a regular part of the conversation with clients, with Nation Partners staff regularly requested to work from client offices as part of broader project teams. &#xA0;</p><p>Having these high-level discussions is part of Nation Partners&#x2019; ongoing commitment to create better working practices in the consulting industry, evidenced by one of the company&#x2019;s core values which states:</p><p>&#x2018;You only have one life. The integration of life, family and work underpins our success&#x2019;</p><p>The best advocates for Nation Partners are the employees themselves.</p><p>Communications and stakeholder consultant Erin Coldham says &#x201C;I feel empowered to make the choices that suit my lifestyle, knowing that I am genuinely supported in those choices....Nation Partners gives me the flexibility I need to make my life work. It&#x2019;s refreshing and should be celebrated&#x201D;</p><p>Dr Mahima Kalla is a senior environmental consultant who used flexible working to complete her PhD via Monash University. She dropped down to four days per week, did some work from home and says it has all been underpinned by &#x201C;an inclusive culture where flexible working arrangements are considered &#x2018;normal&#x2019; and supported by the leadership team.&#x201D;</p><p>Congratulations to Nation Partners on becoming a Flex Able Certified Employer.</p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About the Flex Able Certification</strong></h4><p><a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\"><img data-cke-saved-src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" src=\"https://oliver-uploads-aus.s3.amazonaws.com/thumbs/500x500/23b6dc58-1265-4f6f-bed4-35cb84280f9c.png\" style=\"float: right;\"></a></p><p>Flexible working is not just for mothers returning to work but for those with other caring commitments, health reasons, sporting interests, people looking for an alternative to retirement and those pursuing side projects. Companies with the most engaged workforces offer flexibility and are focused on creating an inclusive culture where the reason for needing flexibility does not matter.&#xA0;</p><p>But how can you tell which employer is truly walking the talk when it comes to offering flexible work? WORK180&#x2019;s&#xA0;<a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\">Flex Able</a><a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\">&#xA0;Certification&#xA0;</a>helps job seekers know what companies place a strong focus on flexibility in addition to being an employer of choice for women.</p><p>Learn more about the&#xA0;Flex Able&#xA0;Certification&#xA0;<a data-cke-saved-href=\"https://www.dccjobs.com/advertisers/flex-able-certification\" href=\"https://www.dccjobs.com/advertisers/flex-able-certification\">here</a><a data-cke-saved-href=\"https://www.work180.com.au/advertisers/flex-able-certification\" href=\"https://www.work180.com.au/advertisers/flex-able-certification\">.</a></p><hr><h4 style=\"font-family: Lato, sans-serif;\"><strong>About WORK180</strong></h4><p>WORK180 is an international jobs network that connects smart businesses with the very best female talent. We pre-screen every employer on our jobs board to see where they stand on pay equity, flexible working, paid parental leave, equal opportunities and a range of other criteria. We also take into account diversity initiatives focusing on age, ability, ethnicity and sexual orientation.</p><p>The information we uncover is made public on our&#xA0;website,&#xA0;so that everyone knows what to expect from each employer before applying for a job. We continually review and evolve our pre-screening criteria to ensure workplaces are fair and equal for everyone.&#xA0;&#xA0;&#xA0;</p><p><a data-cke-saved-href=\"https://www.work180.com.au/about-us\" href=\"https://www.work180.com.au/about-us\">Read our story.</a></p>\n\t\t\t\t","tags":["flex able certification"],"upload_date":"2018/12","associated_company":"work180"}