{"url":"https://www.work180.com.au/blog/2016/10/your-science-career-making-a-strategic-plan","title":"Your Science Career: Making a Strategic Plan","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published on&#xA0;<a data-cke-saved-href=\"http://womeninscienceaust.org/\" href=\"http://womeninscienceaust.org/\" target=\"_blank\">Women in Science AUSTRALIA</a>.</p><p>By&#xA0;Dr Marguerite Evans-Galea</p><p><br></p><p>Our working lives can seem simpler when we have a career plan &#x2013; a timeline with goals and outcomes. In reality, the path can be far from clear.</p><p>Science is undergoing a significant transformation, moving away from the traditional silo-style research laboratories to larger consortia-style &#x2018;conglomerates&#x2019; that operate more like small companies than small businesses. Group leaders have evolved into group coordinators who pull in the funding, sell the product at international meetings, liaise with multiple collaborators and manage several teams led by postdoctoral fellows. Postdocs too have greater responsibilities &#x2013; supervising students, managing lab administration, balancing budgets, serving on committees, writing papers and leading their own projects &#x2013; akin to group leaders of small laboratories 20 years ago.</p><p>Convergence, collaboration and communication are the latest buzz words. Today&#x2019;s scientists are urged to develop interdisciplinary cross-sector collaborations, attract industry partners, patent and translate their basic discoveries, diversify their funding portfolios, contribute to policy development and effectively communicate their research to politicians and the public.</p><p>With all of this change, it can be challenging to plan ahead and know your next move.</p><p>There are certain milestones every scientific researcher is expected to achieve &#x2013; and the bar gets higher every year. There will always be a small percentage of &#x2018;high flyers&#x2019; who go far and above such expectations to dizzying heights, where Nature and Science papers abound, and funding and awards are plenty.</p><p>Failing to make strategic moves, however, can leave you stranded in a holding pattern or &#x2018;pushed out&#x2019; &#x2013; at any stage. Exciting opportunities can arrive at any time, so how can you best prepare yourself to recognise them?</p><p><br></p><h4><strong>1. STAY FOCUSED</strong></h4><p>But don&#x2019;t lose sight of the big picture. Defining your mission will help you to work harder and stay focused on your goal(s). As a graduate student, your goal was to get a PhD. Goals are less black-and-white as we progress, especially in science where the career structure is undefined for most of the research workforce. Our goals can blur to &#x2018;doing good science&#x2019; or &#x2018;contributing to the greater good&#x2019; &#x2013; still excellent goals, but much less defined. Only a small percentage of researchers will experience the linear academic career path to professor. If that is your primary goal, however, it is important that you keep this in mind during the day-to-day grind of negative data, failed funding applications and rejected manuscripts.</p><p><br></p><h4><strong>2. TICK BOXES</strong></h4><p>Consistently. Like your research, develop an &#x2018;operational mode&#x2019; that is</p><p>reproducible and consistent. Tick the boxes routinely on your list. If you agree to meet with someone, be there. Follow up with emails and stick to deadlines. Know your stuff &#x2013; and get known for it. Instead of brushing over the abstracts, actually read the literature. Try not to spread yourself too thin. Become a productive recognised expert in your research area. While &#x2018;publish or perish&#x2019; is the academic&#x2019;s mantra, publish quality over quantity. A highly cited paper of significance carries more weight than one that gets lost in the noise. Make first- or senior-author papers your priority, but demonstrate collaborations with &#x2018;other author&#x2019; papers as well. Speak whenever possible &#x2013; this is great experience and also gets you and your research known. Importantly, be financially responsible. Be strict with your budget and a good steward of funds &#x2013; public and private. If you perform consistently and develop good habits, you will be reliable &#x2013; and people will be more forgiving when you need to divert your efforts for unexpected reasons.</p><p><br></p><h4><strong>3. SEEK SUPPORT</strong></h4><p>Personal and professional. No one is an island. As much as we think we are invincible and can do it all ourselves, this is an unrealistic view. A research career is rewarding, but it is also highly demanding. Do not be afraid to ask for help and guidance. Our family and friends celebrate our successes, commiserate our failures and cheer us on. A team of mentors, including senior investigators and/or peer mentors, can share their experiences and provide advice on different aspects of your research and career. A strong support network, at home and at work, will make the tough times less challenging and enhance your ability to perform at your best.</p><p><br></p><h4><strong>4. GET CONNECTED</strong></h4><p>&#x2018;It&#x2019;s not what you know, it&#x2019;s who you know&#x2019;. In science, this is a false statement because if you do not know your stuff (see point 2), you will not be respected. This does not mean who you know is unimportant. It is critical to extend your professional network by getting out and meeting people. This can include attending social events in your organisation, sitting next to someone new at the next seminar, speaking with presenters at a poster session or or working the room at an international meeting. Social media has added another layer to networking since it is an excellent tool for connecting with people anywhere in the world. Networking enhances our skills, exposes us to new people and professions, and ensures we are always thinking &#x2018;outside the box&#x2019; and ready for opportunities.</p><p><br></p><h4><strong>5. BUILD A WINNING TEAM</strong></h4><p>Even a team of one.&#xA0;Develop your leadership style by being the change you want to see2. While you do not need to become Gandhi, visionary leaders with a strong ethical compass attract followers in droves. Be consistent in your approach. Praise in public and critique in private &#x2013; with one critical exception. Disrespectful behaviour or commentary should be called out diplomatically and promptly. Fully acknowledge those who did the work. It is common to see a group leader&#x2019;s presentation consistently use the royal &#x2018;we&#x2019;. Particularly in smaller group meetings or in media release, be inclusive and take the time to say &#x2018;well done&#x2019;. Respect and reward your team with simple acts: check-in with them occasionally, ask how you can help move their work forward, spend time with them and say goodbye at the end of the day. Support their professional development &#x2013; be a leader of leaders.</p><p><br></p><h4><strong>6. SYNERGISE</strong></h4><p>Collaboration is at the heart of research. So is healthy competition. With dwindling funds, research has become hypercompetitive. Funding bodies and the public are keen to see researchers collaborating more &#x2013; young researchers want to work this way too. Collaborating is also a plus in a tight fiscal environment since sharing resources and talent reduces cost. We can encourage collaboration within our own team, but importantly within our own organisation. Do a quick assessment of the research teams on your floor. How many do you know? How many do you collaborate with? Does your team know the other teams &#x2013; do they know what techniques and equipment they have? Consider co-supervising a student or fellow on a novel project. Cross-fertilise ideas by hosting joint group meetings. These are simple ways to extend your research capacity and network in-house. Beyond your institute, reach out to colleagues with similar overarching research goals even if they are in a different discipline or field. Find common ground and work towards a shared goal by complementing and utilising each other&#x2019;s expertise.</p><p><br></p><h4><strong>7. PLAN AHEAD</strong></h4><p>But be prepared for anything. Develop a strategy to achieve your goals. This will involve breaking things down into smaller bite-size triumphs. When we aim high, we are setting ourselves aspirational goals &#x2013; and these can seem far off, and on a bad day, unattainable. By mapping things out and setting achievable goals, much like planning a long-distance trip, these goals become more realistic.</p><p>Imagine that you want to build your international profile. Sounds big, but a good way to move towards this goal is to speak at an international meeting. Plan backwards and set realistic achievable goals that lead up to abstract submission and the meeting itself. This could include presenting your research within your institute and seeking feedback on both the quality of your work and your presentation. Promote your work through a blog, attend a national meeting and do a &#x2018;speaking tour&#x2019; in different institutes. Speak with your colleagues, collaborators and mentors often &#x2013; and consider their counsel. Importantly, revise your research plan as you go to increase the quality of your work. Once your paper is ready, it is time to submit your abstract, and click &#x2018;oral presentation preferred&#x2019;. This obviously takes time, but before you know it you will be the invited speaker.</p><p>This strategy can be applied to almost any goal. If you want a &#xA0;promotion, then research the requirements for the next level and work at or above this level. If you want to increase your public profile, write a blog every time you publish and share it via social media. Work with your organisation&#x2019;s public relations team to engage positively with the media.</p><p>Looking five years ahead is constructive and motivating. Have an individual development plan, revisit what is important to you both personally and professionally, then map it out &#x2013; while expecting the unexpected.</p><p><br></p><h4><strong>8. BUILD RESILIENCE</strong></h4><p>Let&#x2019;s face it, scientific research can be a roller-coaster ride. You need to have confidence, be persistent and know you can do it. Researchers are typically self-motivated individuals with a hunger for success. Eureka moments are few and far between, and high-achieving researchers can sometimes struggle with these long periods. Find a way to ride the wave. This is different for everybody: keep a &#x2018;good moments&#x2019; folder on your desktop (filled with acceptance letters, awards and friendly emails), practise mindfulness, do kick-boxing or go for a walk. Ensure your inner voice speaks kindly. Imposter syndrome and negative self-talk are both common, especially in women, but both are unhelpful. Work on strengthening the skills you need to develop, but have confidence in what you do well.</p><p><br></p><h4><strong>9. CREATE OPTIONS</strong></h4><p>We now tell students that a PhD provides excellent training and skills for any career, and the UK Royal Society recently developed guidelines for doctoral student career expectations. So we must inherently believe and practise this ourselves. Attend workshops to nurture, update and polish these skills, which include critical thinking, problem-solving, trouble-shooting, project management, finance, writing and debating skills. Develop a teaching philosophy, write a teaching statement and teach or tutor whenever possible. Stay current with your techniques and expertise, and accept opportunities to contribute beyond the research sector. This will develop new skills and networks that may be needed and useful when you least expect.</p><p><br></p><h4><strong>10. HAVE AN EXIT PLAN</strong></h4><p>Today&#x2019;s scientific research environment requires an element of entrepreneurial savvy. So as with any good business plan, there must be an exit strategy. Have a back-up plan. This is where all of the elements of the previous nine points come together to provide you the skills and know-how of transitioning to a different organisation or another professional career (in or out of science) if required, or if desired. We all have limits and over time we get firmer on where those limits lie &#x2013; on our time, expertise, finances, heart, body and mind. You will know when you are close to reaching your limits. It is up to you what your exit plan looks like and when it needs to engage, but at least look beyond the bench to what else is out there. You don&#x2019;t want to miss any exciting opportunities.</p><p><br></p><p>So can you really &#x2018;strategically plan&#x2019; a career in science?</p><p>For success in any career, it is perhaps less about having a plan and more about &#x2018;being strategic&#x2019;. Of course timing and luck also play role. Developing skills and applying strategies outlined here will strengthen your ability to never run low on fuel, avoid holding patterns and take flight to succeed in science!</p><p><a data-cke-saved-href=\"/jobs/science/\" href=\"/jobs/science/\">Explore jobs in science on DCC Jobs.</a><br></p><p>&#x200B;</p><h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs</strong></span></h5><p>DCC Jobs is a <a data-cke-saved-href=\"/job-search\" href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a data-cke-saved-href=\"/clients\" href=\"/clients\">essential tool</a> in your job search when assessing employers.</p><p><br></p>\n\t\t\t\t","tags":["Career Development"],"upload_date":"2016/10","associated_company":"work180"}