{"url":"https://www.work180.com.au/blog/2015/07/your-toughest-career-questions-answered","title":"Your Toughest Career Questions Answered","author":"WORK180","body":"\n\t\t\t\t\t<p>This article was originally published on <a href=\"http://www.huffingtonpost.com/danielle-prager/your-toughest-career-questions-answered_b_7548324.html\">Huffington Post</a>.</p>\n\n<p>&#xA0;</p>\n\n<p>Google and I have developed a love/hate relationship as of late. When it comes to the latest marketing trends or figuring out which designer decided flared pants should make a come back, Google always delivers. When it comes to solving my most frustrating career challenges, not so much. This is why I decided to take a more &quot;old school&quot; approach -- I asked a real life person, whose career and personal choices I admire and value for their advice.</p>\n\n<p>Today I will be sharing excerpts from my interview with Julie Sandler. Julie is a Principal at Madrona Venture Group, a venture capital firm that invests in early stage companies, where she leads new investments in technology startups. She is also an adjunct faculty member at the University of Washington, where she teaches an MBA course on Entrepreneurship.</p>\n\n<p>Julie is young, successful, smart, kind, and most importantly (in our case) generous enough to share her thoughts and recommendations on some of the very issues that even Google can&apos;t answer. The questions in the interview are geared towards women early on in their careers, but as you&apos;ll see from Julie&apos;s answers below, her words of wisdom can apply to women seeking career advice or making changes at any point along their career journey.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>What characteristics should we look for in a mentor?</strong></p>\n\n<p>When I was in business school, I was once advised to consider putting together my own personal board of directors -- a group of people that would help me grow. In my mind, there are three types of mentors that should sit on this &quot;board.&quot;</p>\n\n<p><strong>The first is a senior mentor</strong>. Think Dumbledore to Harry Potter. This person has been down a similar path to the one you are embarking on and can help guide you to the right decisions, and help you avoid learning lessons &quot;the hard way&quot;.</p>\n\n<p><strong>The second is a peer mentor</strong>. This person is currently on your path or perhaps on a very similar path. They can shed new light or a different point of view to the challenges you&apos;re tackling and enable you to have a more holistic approach to how you deal with opportunities and challenges.</p>\n\n<p><strong>Lastly, and maybe the least intuitive, is the more junior mentor</strong>. This person may be younger and earlier on in their career. There is an old notion that the older you are and the more experiences you have, the more you perceive and fear obstacles. Having a younger mentor who has yet to be jaded by their experiences can keep you sharp and motivated to tackle things that your experiences might have otherwise led you to believe were too difficult. This voice can be extremely valuable as you pursue your loftiest goals.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>Imposter Syndrome is a burden that weighs heavy on the minds of many young women. How do you advise we tackle it?</strong></p>\n\n<p>I&apos;ll start off by saying that over the past several years, thanks to the kind of work that I get to do, I&apos;ve had the opportunity to talk to executives, CEOs, and entrepreneurs very frankly about the kinds of challenges they face as leaders. You would be blown away by how many of these talented people experience some level of imposter syndrome, and it&apos;s not just women. Every age group, gender, and demographic profile is affected when it comes to concerns regarding self-confidence in leadership roles.</p>\n\n<p>The fact is, if you have even a modest level of self-awareness, you should be totally cognizant of the fact that the amount of knowledge you have is going to always be perpetually dwarfed by the knowledge and experiences out there that you have never had. This should be a humbling thought, which can work for you in many positive ways. It can be a source of humility and motivation to grow more, learn more, drive harder, and get more experiences.</p>\n\n<p>However, it can also be a debilitating thought, especially if it undermines your self-efficacy or self-esteem. In my mind, the best way to counter that is to recognize a few things. One, no matter who you are, you know very little. Two, no matter who you talk to, they know very little. Part of the excitement associated with this is the fact that there are infinite opportunities for you to learn, grow, and have new experiences. Allowing what hasn&apos;t existed in your life yet to be a motivator to learn and grow should be what you channel that discomfort into. This can be a very a confidence-driving psychology if you can master it.</p>\n\n<p>&#xA0;</p>\n\n<p><strong>How would you advise women who are struggling to find their &quot;career calling&quot;?</strong></p>\n\n<p>One of the most overhyped concepts that plagues younger generations right now is this idea of a professional calling. This magical passion that is somehow beckoning to you and once you find it, there will be instant satisfaction and fulfillment. The fact is, the vast majority of people have the ability to find tremendous amount of contentment, fulfillment, satisfaction, and joy in many different types of roles that are out there. The question is how can you optimize for your own happiness?</p>\n\n<p>For me personally, it&apos;s always been my rule of thumb that I need to fulfill three requirements in any role I hold - and if those three requirements are met, I have very good reason to be ecstatic.</p>\n\n<ol>\n\t<li>Am I learning? Am I growing? Am I able to challenge myself? Is there enough diversity in that challenge to keep me engaged and interested?</li>\n\t<li>Do I love being around the people that I get to go on that learning journey with?</li>\n\t<li>Is there some kind of impact that I am having by virtue of the work I do, the service I provide, or the product that I am building that strikes me as positive to the world and additive to the lives of people?</li>\n</ol>\n\n<p>Identify your own job &quot;non-negotiables,&quot; and use them as guidance on your career journey. If they really reflect your values and you can adhere to them, the results can create a certain kind of magic too.</p>\n\n<p>Chatting with Julie confirmed what the older generations are so famously known for harping on about: sometimes it&apos;s good to step away from your computer and step in front of people. Julie, who not so long ago was confronting career decisions similar to the ones I am facing, was the perfect person to turn to for guidance. I hope that Julie&apos;s insights, which have been so helpful to me, will act as a guiding light as you search for the next place to turn on your own unique career journey.</p>\n\n<p>&#xA0;</p>\n\n<h4><strong><span style=\"color:#A97FB1\">About DCC Jobs</span></strong></h4>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["job seeking tips"],"upload_date":"2015/07","associated_company":"work180"}