{"url":"https://www.work180.com.au/blog/2015/10/zero-gender-divide-how-to-achieve-balance-in-the-workplace","title":"Zero Gender Divide- How to Achieve Balance in the Workplace","author":"WORK180","body":"\n\t\t\t\t\t<p>It was a great honour for Diverse City Careers (DCC) to recently co-host the <a href=\"http://www.diversecitycareers.com/nitrodccevent\">Zero Gender Divide panel</a> with Nitro, one of Australia&#x2019;s own Tech start-up success stories. The theme of the event was around &#x201C;Complementary Collaboration&#x201D; and discussed how to nurture an inclusive culture and new ways of approaching gender equality in the workplace.</p>\n\n<p>Dr Leslie Cannold, passionate advocate for gender equality, award winning columnist and regular guest on ABC TV&#x2019;s Moral Compass was the moderator for the evening. The high calibre panel included:</p>\n\n<ul>\n\t<li>Renee McGowan- Partner and Chief Customer Officer, Mercer</li>\n\t<li>Tim Fawcett- Executive General Manager Corporate Affairs, Cisco and Board Member of Diversity Council Australia</li>\n\t<li>Sarah Grace Worboys- Co-lead Startup Victoria Female Founders and Commercial Manager, Allens</li>\n\t<li>Sam Chandler- CEO and Founder of Nitro</li>\n</ul>\n\n<p>The enlightening and sometimes provocative panel discussion focused on not just emotive and social reasons why gender equality is important, but also the cold hard facts around proven business and economic benefits.</p>\n\n<p><em>&#x201C;In every country and every age band, women are underrepresented in the workplace and the impact is profound. If you can equal this in the US, GDP will lift 9% and in countries such as Egypt, 36%</em>,&#x201D; stated Renee McGowan.</p>\n\n<p>&#x201C;<em>The long term sustainability of our business depends on gender equality. Competition for talent is only </em>g<em>oing to get hotter and hotter. If you limit your ability to recruit an entire pool of talent, that&#x2019;s a risk.&#x201D; </em>Tim Fawcett explained.<em> &#x201C;It&#x2019;s not just the right or nice thing to do, it&#x2019;s the smart business thing to do</em>.&#x201D;</p>\n\n<p>Sam Chandler, CEO Nitro having spent the majority of his time in Silicon Valley, demonstrated his passion for supporting gender diversity in start-ups, particularly within tech. <em>&#x201C;In Silicon Valley, although it&#x2019;s very progressive, it has some of the worst stats in gender diversity, particularly in Computer Science. In Australia, although there are some positive signs, we still have a long way to go</em>.&#x201D;</p>\n\n<p>Sam also provide a practical solution that has worked well for Nitro- having a female role model in a leadership role has inspired other females to join the company and aspire to leadership roles too.</p>\n\n<p>After some discussion around female led start-ups, Dr Leslie Cannold raised a statistic that the DCC Co-founders of female led start-up) found confronting.</p>\n\n<p><em>&#x201C;Only 3-5% of female owned businesses receive capital, but venture backed companies operated by women are 12% more profitable.&#x201D;</em></p>\n\n<p>Sarah Grace Worboys focused on female confidence within the workplace and the importance of having female role models.</p>\n\n<p><em>&#x201C;The rock stars of the start-up world are men. Women don&#x2019;t see themselves as up there because they don&#x2019;t have the same loud voices. Women need to be supporting other women and providing an example for others- we don&#x2019;t tend to call ourselves out as much.&#x201D;</em></p>\n\n<p><em>&#x201C;Men get promoted on potential, women get promoted on the proven,&#x201D; stated Renee. &#x201C;There is a lot of data and studies on this topic.&#x201D;</em></p>\n\n<p>Some of the other key takeaways from the panel were:</p>\n\n<ul>\n\t<li>To change the imbalance, we need to start looking at the next 5-10 years by going to primary schools. For instance in IT, make it cool for girls to code (check out the Tech Girls are Superheroes Initiative). This will then have a flow on effect through high school and onto tertiary education.</li>\n\t<li>Men and women bring different, yet both very important characteristics to a work place. For example, women typically have higher emotional intelligence and more empathy- both are key leadership traits, as rated by both males and females.</li>\n\t<li>Ensuring that everyone has equality, will bring enormous benefits and opportunities to our businesses and economy.</li>\n</ul>\n\n<p>DCC would like to say a huge thank you to Nitro, Dr Leslie Cannold and the panellists for an extremely thought-provoking and educational discussion. It was also a great pleasure to have donated the ticket sales to Camp Quality.</p>\n\n<p>The next DCC event will be held with the Workplace Gender Equality Agency in Sydney on November 10th. The topic will be: Driving a Strategic Approach to Flexibility with another outstanding panel of industry leaders and moderated by Susan Searle, President and Publisher of ARN and Reseller News.</p>\n\n<p>To read more about the event and reserve your ticket, please click <a href=\"http://www.diversecitycareers.com/page/events/driving-a-strategic-approach-to-flexibility/\">here</a>.</p>\n\n<p>&#xA0;</p>\n\n<h5><span style=\"color:#A97FB1\"><strong>About DCC Jobs </strong></span></h5>\n\n<p>DCC Jobs is a <a href=\"/job-search\">jobs board </a>with a difference! We pre-screen employers on paid parental leave, pay equity, flexible working arrangements and much more. This information is not publicly listed elsewhere and is an <a href=\"/clients\">essential tool</a> in your job search when assessing employers.</p>\n\n\t\t\t\t","tags":["gender equality"],"upload_date":"2015/10","associated_company":"work180"}